{"4498839/4385872/4511437": {"title": "Sir Charles", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0792, Page 319", "Page 319"], "url": "https://www.duchas.ie/en/cbes/4498839/4385872/4511437", "text": "\nSir CharlesOne day Sir Charles was going to the city in his carriage. He gave orders to the gate keeper not to allow any carriage  in but his own. When he arrived at his destination he changed his mind and came home in a cab. As soon as he came to the gate the driver knocked, but was not admitted. The woman said that she was told not to let in any carriage but Sir Charles's. The driver said \"I have Sir Charles in the cab.\" However she would not let him in, and he had to go around to another gate to get in.Next day Sir Charles gave the gate lodge keeper some money for being obedient.(This story was told by my mother, Annie Lawless, Santry,  Co\n(continues on next page)\n", "school_info": "School: St Pappan's, Ballymun", "metadata": [{"Location:": "Ballymun, Co. Dublin", "Teacher:": "\nM. O' Riordan\n"}, {"Informant": "Annie Lawless", "Relation": "parent", "Gender": "female", "Address": "Santry Demesne, Co. Dublin"}, {"Language": "English"}]}, "4493651/4408106/4518794": {"title": "Blind Man's Buff", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1081, Page 46", "Page 46"], "url": "https://www.duchas.ie/en/cbes/4493651/4408106/4518794", "text": "\n(continued from previous page)\ngoes on like that till the end of the game.\n\n\n\nThere was once a tyrant called Lord Leitrim who lived near Carrigart in the Co. Donegal.This man was an Officer in the English army and I think bravery was the only decent quality he possessed. So for some deed of bravery he was given a large estate in Donegal. This man did not understand nor didn’t try to understand anything about the mentality of the people that lived on his estate.He looked upon his tenants and their families as some kind of inferior\n(continues on next page)\n", "school_info": "School: Scoil Naomh Colmcille, Kilmacrennan", "metadata": [{"Location:": "Kilmacrenan, Co. Donegal", "Teacher:": "\nMícheál Ó Gallchobhair\n"}, {"Collector": "Maitiú Mac Éiteagain", "Gender": "male", "Address": "Kilconnell or Glebe, Co. Donegal"}, {"Informant": "Eamonn Mc Gettigan", "Relation": "parent", "Gender": "male", "Age": "52", "Address": "Kilconnell or Glebe, Co. Donegal"}, {"Language": "English"}]}, "4493672/4409640/4519141": {"title": "The Murder of Lord Leitrim", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1087, Page 015", "Page 015"], "url": "https://www.duchas.ie/en/cbes/4493672/4409640/4519141", "text": "\nOn the 2nd 1878 at the age of 73 the third Earl of Leitrim was murdered in Cratlagh wood about four miles from Milford on the Milford Carrigart road Co. Donegal just at entrance to the wood from the Carrigart side. He was a man of absolute courage and a unconquerable will. He built a great house at Manorvaughan. Care of his property and and litigation were his hobbies. He allowed\n(continues on next page)\n", "school_info": "School: Baile na nGalloglach (Milford)", "metadata": [{"Location:": "Millford, Co. Donegal", "Teacher:": "\nTadhg Ó Súilleabháin\n"}, {"Informant": "Robert Hazlett", "Gender": "male", "Age": "85", "Occupation": "carpenter", "Address": "Millford, Co. Donegal"}, {"Language": "English"}]}, "4493673/4409693/4519737": {"title": "The Murder of the Earl of Leitrim", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1087, Page 068", "Page 068"], "url": "https://www.duchas.ie/en/cbes/4493673/4409693/4519737", "text": "\nOne time the people were trying to do away with land-lords because they were evicting them from their lands.  The Earl of Leitrim who was the land lord of this district was coming up to Milford on business.  He was coming up to put a new clerk in his office because the old one was drowned.A crowd of people from Fannet who knew he was coming came over from Fannet in a boat and waited for him at the wood now known as the Sounding Drum.  A man named Charlie Buchanan was driving his side-car and he had his new clerk with him.  As they were coming through the wood the people of Fannet waited on him and they shot at Lord Leitrim but missed him and shot Charlie Buchanan dead.  The horse ran on about 100 yards and Lord Leitrim could have escaped only that he was so angry that he got out and\n(continues on next page)\n", "school_info": "School: Milford", "metadata": [{"Location:": "Millford, Co. Donegal", "Teacher:": "\nJames Mc Veigh\n"}, {"Collector": "Meta Mc Connell", "Gender": "female", "Address": "Millford, Co. Donegal"}, {"Informant": "Mr Robert Hazlett", "Gender": "male", "Age": "86", "Address": "Millford, Co. Donegal"}, {"Language": "English"}]}, "4493673/4409698/4519754": {"title": "The Murder of the Earl of Leitrim", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1087, Page 073", "Page 073"], "url": "https://www.duchas.ie/en/cbes/4493673/4409698/4519754", "text": "\nAbout the year 1877 the people all around were trying to do away with land lords.There was a landlord in Mulroy at this time and the people wanted to kill him.  His name was Lord Leitrim.  One day his horse lost a shoe and he had to come to Milford on business.His business was to appoint a clerk because his other clerk had drowned himself.  Before he left he had to get his horse shod in a little village near Mulroy called Carrigart.When he went to the forge a lot of people were there so he had to wait a long time.  When the black-smith shod the horse he drove a nail crooked and made the horse lameAfter this Lord Leitrm left for Milford.  The horse was getting lamer and lamer so that it could hardly walk.  When he was coming along the road he saw a boat coming in a distance towards where he was going.  When Lord Leitrim came to Cratlagh wood a boat load of men from Fanat were waiting on him so as he came near the Sounding Drum the men had guns and\n(continues on next page)\n", "school_info": "School: Milford", "metadata": [{"Location:": "Millford, Co. Donegal", "Teacher:": "\nJames Mc Veigh\n"}, {"Collector": "Iris Diver", "Gender": "female", "Address": "Millford, Co. Donegal"}, {"Informant": "James Diver", "Gender": "male", "Age": "45", "Address": "Millford, Co. Donegal"}, {"Language": "English"}]}, "4493663/4409029/4521887": {"title": "Lord Leitrim", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1085, Page 161", "Page 161"], "url": "https://www.duchas.ie/en/cbes/4493663/4409029/4521887", "text": "\nLord Letrim was the third lord of the name who was landlord of the people of Fanad. His estate was situated below Cranford on the shores of Mulroy Bay. The people used to call him “Old Letrim and he was one of the worst landlords in Ireland at the time. He did whatever he liked himself and law seemed to have no power to stop him, he was a law unto himself.All his tenants feared and hated him and whenever they saw him coming they used to leave his way. This did not please him. He used to evict the tenants whenever he liked and there was no limit to the amount of rent he would levy on a holding.If a dwelling or a farm was improved, Letrim often evicted the tenants in order to give it to some favorite servant of his. He prohibited the tenants for using the hills for grazing in order to stock them himself. He also cut off for himself the bogs and the shores so as to make money on turf or wrack. If he thought your turf stack was too big or if you cut green scraws from a field or if you lifted bog fir from a moss he would not leave you long a householder\n(continues on next page)\n", "school_info": "School: Coillidh Críon (Killycreen)", "metadata": [{"Location:": "Kilcreen, Co. Donegal", "Teacher:": "\nSéamus Ó Domhnaill\n"}, {"Language": "English"}]}, "4493663/4409031/4521888": {"title": "The Murder of Leitrim", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1085, Page 163", "Page 163"], "url": "https://www.duchas.ie/en/cbes/4493663/4409031/4521888", "text": "\nIn the year 1866 a dozen men lay waiting before him to kill him. It was a Sunday morning and because there was a lot of people on the road they got disheartened and they made for the hills without accomplishing anything.Twelve years went round before the attempt came that ended his life. In the year 1878 there was a big list of people to be evicted and they understood that there was little redress to be had from the law. Those who killed him did not look upon it as a murder. It was their only was to end tyranny they could no longer suffer.Some people say that the night before they met at a forge and cast lots as to whom would kill him. Lord Letrim left barrigart early in the morning on his way to Lifford. He travelled by side car and the drivers name was Lougue the father of the late Cardinal. It is said that Lougue knew what was going to happen, and purposely put his horse lame so as to leave a good distance between Letrim and his bodyguard. When they reached Cratlagh wood below Cranford the shots rang out. Letrim though directly hit was not killed with the first shot\n(continues on next page)\n", "school_info": "School: Coillidh Críon (Killycreen)", "metadata": [{"Location:": "Kilcreen, Co. Donegal", "Teacher:": "\nSéamus Ó Domhnaill\n"}, {"Collector": "Margaret Durnion", "Gender": "female", "Address": "Newmill, Co. Donegal"}, {"Language": "English"}]}, "4493680/4410037/4521969": {"title": "Song", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1089, Page 205", "Page 205"], "url": "https://www.duchas.ie/en/cbes/4493680/4410037/4521969", "text": "\nSong about the shooting of the Earl of Leitrim.Local song sung by Hugh McAlteer. Drumfad, Ballynashanig.Enteres:- 11th Nov. '38You patriots from shore to shore, In every known land, I hope you'll pay attention To a simple country man;It is my sole design to attract the mindIf you heroes one and all,What happened to the earl of LeitrimIn the Co. Donegal.11It was on the 2nd Day Apr. 1878From Manor Vaughan CastleLord Leitrimm took his flightFor the eviction courts in Dublin.\n(continues on next page)\n", "school_info": "School: Fanaid", "metadata": [{"Location:": "Fanad, Co. Donegal", "Teacher:": "\nCáitlín Bean Uí Dhochartaigh\n"}, {"Collector": "Cáitlín Bean Uí Dhochartaigh", "Gender": "female", "Occupation": "múinteoir"}, {"Informant": "Hugh Mc Ateer", "Gender": "male", "Age": "76", "Occupation": "farmer", "Address": "Drumfad, Co. Donegal"}, {"Language": "English"}]}, "4493682/4410327/4523753": {"title": "Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1090, Page 184", "Page 184"], "url": "https://www.duchas.ie/en/cbes/4493682/4410327/4523753", "text": "\n(continued from previous page)\nThe next day a cow belonging to the house was dead. An animal died every day until at last there was not a four footed animal left. This mysterious man was a fairy.\n\n\n\nThe family name of the Leitrim’s was Clements. Their ancestor came over with King William in sixteen ninety and was granted an estate in Donegal for his services to that King. His residence was in Mulroy where the castle is still to be seen though unoccupied. There is a beautiful wood around it for which many evictions took place to make room.He was shot on the 1st of April in eighteen seventy eight. He was the most cruel landlord of his time and he carried out wholesale evictions. At last the people became heartbroken and many attempts were made to shoot him. Plans were made at various times but the people concerned always failed to carry them out. A couple of years before his death two men went to the castle to shoot him. It was a Sunday morning and the landlord was in his office with his agent. He observed two men among the trees. He became suspicious of them as he lived in daily dread. His agent was for going to investigate but Leitrim went himself whereupon his intended slayers lost their nerve and fled. This incident shows us that at any rate Leitrim was no coward.Three Fanad men did the deed. How they were\n(continues on next page)\n", "school_info": "School: Ballyheerin", "metadata": [{"Location:": "Ballyheerin, Co. Donegal", "Teacher:": "\nAodh Ó Frighil\n"}, {"Collector": "Aodh Ó Frighil", "Gender": "male", "Occupation": "múinteoir"}, {"Language": "English"}]}, "4493690/4411325/4524532": {"title": "Seán Leathdruimh", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1092, Page 246", "Page 246"], "url": "https://www.duchas.ie/en/cbes/4493690/4411325/4524532", "text": "", "school_info": "School: Caiseal (2)", "metadata": [{"Location:": "Cashel Glebe, Co. Donegal", "Teacher:": "\nSeán Ó Domhnaill\n"}, {"Collector": "Sighle Ní Duibhne", "Gender": "female", "Address": "Ballyhiernan, Co. Donegal"}, {"Informant": "Domhnall O Dhuibhne", "Gender": "male", "Age": "76", "Address": "Ballyhiernan, Co. Donegal"}, {"Language": "Irish"}]}, "4493690/4411330/4524534": {"title": "Sean Leitrim", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1092, Page 250", "Page 250"], "url": "https://www.duchas.ie/en/cbes/4493690/4411330/4524534", "text": "\nBhí sean Leitrim i na thighearna talaimh ar Fhaid, ar an Tearmann, ar Chille Mhic nÉanain agus ar Rossguill. Bhí sé i na fhear chruaidh agus rinne sé cuid mhór droch rudaí. Aamannaí chuireadh sé na daoine amach as seilbh a gcuid talaimh, nó bheireadh sé ortha cíos mhór a dhíol, agus amannaí nuair a bhéadh siad abalta an chíos a dhíol fiú chá ghlacadh sé é agus cuireadh sé amach iad agus chaitheadh siad an ceanntar a fhágail agus dhul áit an teacht eile.Tá sé marbh anois le trí fichid blian. Sgaoil trí fhear as Fánaid Leitrim. Mac Giolla Bhrighe agus Ó Siadhail agus fear eile. Ar maidin chuaidh siad go Cratlach. Chuaidh duine aca isteach ins an choillidh agus d'fhan an fear eile ar taobh amuigh de. Sgaoil an fear a chuaidh isteachLeitrim, agus bhí an méid\n(continues on next page)\n", "school_info": "School: Caiseal (2)", "metadata": [{"Location:": "Cashel Glebe, Co. Donegal", "Teacher:": "\nSeán Ó Domhnaill\n"}, {"Collector": "Úna Nic Ghiolla Cheara", "Gender": "female", "Address": "Umrycam, Co. Donegal"}, {"Informant": "Gráinne Bean Mhic Ghiolla Cheara", "Gender": "female", "Age": "54", "Address": "Umrycam, Co. Donegal"}, {"Language": "Irish"}]}, "4493684/4410475/4524568": {"title": "Murder of Lord Leitrim 1878", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1090, Page 328", "Page 328"], "url": "https://www.duchas.ie/en/cbes/4493684/4410475/4524568", "text": "\nWilliam, Earl of Leitrim was said to be a very bad landlord and local stories are told around firesides at night about his bad acts.One of the stories is that he used to go around with his bailiffs through his tenants and anywhere he  saw any improvements made, he raised the rents, and if the tenants refused to pay the new rent, he and his family were thrown on the roadside.Another story goes that he had a great hobby for planting trees and grazing bullocks, and he evicted a great number of his tenants in order to make room for his cattle.In order to keep the people in ignorance he demolished all the schools a soon as they were built, and bought small neigbouring estates for the sole purpose of closing the schools.These are only a few of the cruel deeds attributed to him by the old storytellers. At last the people could not stand his cruelty any longer and he was waylaid and killed one lovely morning in early Spring near Milford at a place called Cratlagh Wood.\n(continues on next page)\n", "school_info": "School: Tamney (Robertson)", "metadata": [{"Location:": "Tawny, Co. Donegal", "Teacher:": "\nMrs Kyle\n"}, {"Collector": "Sarah Jane Thompson", "Gender": "female"}, {"Informant": "P. Kerr", "Gender": "unknown", "Occupation": "peace commissioner", "Address": "Moross, Co. Donegal"}, {"Language": "English"}]}, "4493685/4410592/4524697": {"title": "The Murder of Lord Leitrim", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1090, Page 481", "Page 481"], "url": "https://www.duchas.ie/en/cbes/4493685/4410592/4524697", "text": "\nOn the 4th of April 1878 Lord Leitrim left Manorvaughan Castle going to Lifford to law with a priest from Carrigart. When he was entering into Cratlagh wood his horse was shot. Then three men ran out of the bushed and shot the driver. Then the pulled Lord Leitrim down off his car and tried to shoot him but the couldnt because he has a steel coat and helmet on him. They men then hammered his head with the stock of their guns. One of the men fired two shots down his throat. They took him then and smothered him in the water-table. Leitrim caught the man by the mustache a tore it off his face. They men then made their escape, one of them going out through Drumfin. The other two men crossed Mulroy in a boat and landed in below Ranny hill. The forgot to throw out one of the guns into the water and the police found the gun. There was a plugging of paper in the gun and Herity's\n(continues on next page)\n", "school_info": "School: St Davaddog's, Tamney", "metadata": [{"Location:": "Tawny, Co. Donegal", "Teacher:": "\n-\n"}, {"Collector": "Francis Mc Bride", "Gender": "male"}, {"Language": "English"}]}, "4493685/4410593/4524703": {"title": "The Murder of Lord Leitrim", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1090, Page 482", "Page 482"], "url": "https://www.duchas.ie/en/cbes/4493685/4410593/4524703", "text": "\n(continued from previous page)\ndaughters name written on it. Herity was tried before the court and was found guilty. He was sent to jail but he was later let free. Mc Elwee was the third man and he went to America. Shiels lived in Ballywhoriskey until he died and was never caught. The three men were from Ballywhoriskey.\n\n\n\nIn olden times Lord Letrim would go around Araheria to the botom of Fanad he would go into every house. And every nice girl he would see he would take them with him. And if he wouldent get them he would put the Fathers and Mothers out of there homes. So he would take the girls to his own house, and keep them as servants. he would have about ten nice girls in the house. And he had no need for them. He evicted many people from there homes especially the Catholics before he was shot he said he would leave the Catholics as scarse as the Eagles on the hills. So that’s the way he punished the people in those days.\n", "school_info": "School: St Davaddog's, Tamney", "metadata": [{"Location:": "Tawny, Co. Donegal", "Teacher:": "\n-\n"}, {"Collector": "Grace Clinton", "Gender": "female"}, {"Language": "English"}]}, "4493685/4410594/4524704": {"title": "The Murder of Lord Leitrim", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1090, Page 483", "Page 483"], "url": "https://www.duchas.ie/en/cbes/4493685/4410594/4524704", "text": "\nThere was a school built over in Ballyhurk another in Tullyconnal there was a master Dougherty from Ballyherin teaching in them from time to time they schools were built on Lord leitrims land. when he heard of them he and his men came and burned them down to the ground.\n\n\n\nThere was a man the name of Heraghty who shot Lord Leitrim. he was taken to Lifford jail and was kept there. A friend of his who was a priest he passed a bill in Parliament to get him out of jail. The got him out and send him on a ship to America. he stayed there and a few weeks after he went away. The said he died in Lifford jail with faiver. the took him down in a coffin to massmount and buiried it. the were up to ten hundred people boys & girls at the funeral. he was not in the coffin atall. He died some time after.Stories of Lord Leitrim himself.Lord Leitrim was a very cruel man he would put people out of their own houses and kept\n(continues on next page)\n", "school_info": "School: St Davaddog's, Tamney", "metadata": [{"Location:": "Tawny, Co. Donegal", "Teacher:": "\n-\n"}, {"Collector": "Mary Ann Gibbons", "Gender": "female"}, {"Language": "English"}]}, "4493685/4410594/4524705": {"title": "The Murder of Lord Leitrim", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1090, Page 483", "Page 483"], "url": "https://www.duchas.ie/en/cbes/4493685/4410594/4524705", "text": "\nThere was a school built over in Ballyhurk another in Tullyconnal there was a master Dougherty from Ballyherin teaching in them from time to time they schools were built on Lord leitrims land. when he heard of them he and his men came and burned them down to the ground.\n\n\n\nThere was a man the name of Heraghty who shot Lord Leitrim. he was taken to Lifford jail and was kept there. A friend of his who was a priest he passed a bill in Parliament to get him out of jail. The got him out and send him on a ship to America. he stayed there and a few weeks after he went away. The said he died in Lifford jail with faiver. the took him down in a coffin to massmount and buiried it. the were up to ten hundred people boys & girls at the funeral. he was not in the coffin atall. He died some time after.Stories of Lord Leitrim himself.Lord Leitrim was a very cruel man he would put people out of their own houses and kept\n(continues on next page)\n", "school_info": "School: St Davaddog's, Tamney", "metadata": [{"Location:": "Tawny, Co. Donegal", "Teacher:": "\n-\n"}, {"Collector": "Kitty Mc Bride", "Gender": "female"}, {"Language": "English"}]}, "5235093/5234958/5235348": {"title": "Local Landlords", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1128, Page 053", "Page 053"], "url": "https://www.duchas.ie/en/cbes/5235093/5234958/5235348", "text": "\nThe first landlord of Gubbeen who lived about one hundred years ago, was Mr Hickson, a native of Kerry. He was a very wicked man. He made his tenants pay extremely high rents. A farm containing only fifteen acres of poor land had a rent of ten pounds yearly, in Hickson's time, and its present rent is only twenty-six shillings.No tenant would be allowed admittance to his office in Bantry, when they came to pay the rent, for he was afraid of being shot. The rent had to be put into the letterbox. He then sold the land to Colonel Longfield Gubbeen and Crewe, which contains about six hundred acres, cost fourteen thousand pounds.Mr Longfield was a native of Queenstown. His agent was Savage French, a native of Kusskenny, a place near Queenstown. His first rent warner was Henry Daly, a native of Toormore, who lived in Schull, in a house occupied at present by a family called Scullys. Several times when Savage French, the agent was sick or absent, he gathered the rent. He kept\n(continues on next page)\n", "school_info": "School: Gleann", "metadata": [{"Location:": "Glan, Co. Cork", "Teacher:": "\nname not given\n"}, {"Collector": "Joseph Lannin", "Gender": "male", "Address": "Gubbeen, Co. Cork"}, {"Language": "English"}]}}