{"4428266/4389959/4478514": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1031, Page 157", "Page 157"], "url": "https://www.duchas.ie/en/cbes/4428266/4389959/4478514", "text": "\nOnce upon a time there was an old altar built up in Clogher. The remains of it is there yet. They had holes cut in rocks for the wine in the shape of a horseshoe. It is said that if there are warts on any one and them to get these rocks with searching for them and to rub the water on the warts, it will cure them.\n\n\n\nOnce upon a time there was a house built in Tullynaha. It was built and roofed three hours before day. It was the Molly's men that built it. When the people got up in the morning, they saw the smoke. There was a lot of men back-loading sods as there no carts in those day. It is said that there were over two hundred men in it altogether. (I got this from my father, Brian McGroary, Age 90 years, nearly 70 years ago.)Collector Jim McGroary, 12 years, Tullynaha, Letterbarrow.\n", "school_info": "School: Árd Bán", "metadata": [{"Location:": "Ardbane, Co. Donegal", "Teacher:": "\nBriain Ó hEarchaigh\n"}, {"Collector": "Jim Mc Groary", "Gender": "male", "Age": "12", "Address": "Tullynaha, Co. Donegal"}, {"Informant": "James Mc Groary", "Relation": "unknown", "Gender": "male", "Age": "78", "Occupation": "farmer", "Address": "Tullynaha, Co. Donegal"}, {"Language": "English"}]}, "4428266/4389959/4478518": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1031, Page 157", "Page 157"], "url": "https://www.duchas.ie/en/cbes/4428266/4389959/4478518", "text": "\nOnce upon a time there was an old altar built up in Clogher. The remains of it is there yet. They had holes cut in rocks for the wine in the shape of a horseshoe. It is said that if there are warts on any one and them to get these rocks with searching for them and to rub the water on the warts, it will cure them.\n\n\n\nOnce upon a time there was a house built in Tullynaha. It was built and roofed three hours before day. It was the Molly's men that built it. When the people got up in the morning, they saw the smoke. There was a lot of men back-loading sods as there no carts in those day. It is said that there were over two hundred men in it altogether. (I got this from my father, Brian McGroary, Age 90 years, nearly 70 years ago.)Collector Jim McGroary, 12 years, Tullynaha, Letterbarrow.\n", "school_info": "School: Árd Bán", "metadata": [{"Location:": "Ardbane, Co. Donegal", "Teacher:": "\nBriain Ó hEarchaigh\n"}, {"Collector": "Jim Mc Groary", "Gender": "male", "Age": "12", "Address": "Tullynaha, Co. Donegal"}, {"Informant": "James Mc Groary", "Relation": "unknown", "Gender": "male", "Age": "78", "Occupation": "farmer", "Address": "Tullynaha, Co. Donegal"}, {"Language": "English"}]}, "4428354/4398837/4487695": {"title": "The Mollies' Men", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1054, Page 467", "Page 467"], "url": "https://www.duchas.ie/en/cbes/4428354/4398837/4487695", "text": "\nThere was a band of Mollies' Men in this district. Nearly every townland was represented.A man named Séamuisín Coll was leader. There was then another band in the Doochary district. Ballinacarrick Bridge was the Boundary between these two sets of Mollies' Men. A man named Paddy Bonner was the leader of the Doochary Mollies' Men. The two bands were always quarrelling. Paddy Bonner didn't like Séamuisín Coll.One day Paddy challenged Séamuisín to meet him with his men in Doochany. Matthew Morrow's grandfather lived the County Cess. He used to carry a wee blackthorn stick with a whank tied at one end to twist around his wrist. When the old man died his son hung up the wee blackthorn in the kitchen corner. As day was clearing one morning Séamuisín Coll arrives in to Matthew's father (the old man's son) for a drink. They had a Public House. While he was drinking he asked for the wee blackthorn. Matthew's father enquired where he was going etc. and then he tried to persuade him to turn but all was in vain. He got the sick and went on. Both parties met on Doochany street. Paddy wanted to come to friendly terms with Séamuisín & his men. He wanted them all to have a drink. Séamuisín wanted fight. The fight began.\n(continues on next page)\n", "school_info": "School: Leitir Mhic an Bhaird (Robertson)", "metadata": [{"Location:": "Lettermacaward, Co. Donegal", "Teacher:": "\nNábla Nic Amhlaidhe\n"}, {"Collector": "Nábla Nic Amhlaidhé", "Gender": "female", "Occupation": "múinteoir"}, {"Informant": "Matthew Morrow", "Gender": "male", "Age": "over 60", "Address": "Meenagowan, Co. Donegal"}, {"Language": "English"}]}, "4644827/4612965/4650073": {"title": "The Moonlighters", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0408, Page 104", "Page 104"], "url": "https://www.duchas.ie/en/cbes/4644827/4612965/4650073", "text": "\nShaun Foran was a farmer who lived in Shrownoun. He was boycotted because he grabbed his neighbour's farm of land. The neighbour was evicted for some silly cause. Foran was threatened several times by the moonlighters to give up the land. He was shot because he refused.This is a song that was composed at the time:Ye all know Shaun Foranwho lived in Shrownoun.He got a sad death coming from Tralee town. When down from Castleislandtwo Moonlighter strolled.And laid him in a corps in the groves of Mountcoal.He fell from the car and his head met the road.An Micheal the Perjurerbegan to roarOh Father, Oh  Father for\n(continues on next page)\n", "school_info": "School: An Drom Clochach (B.)", "metadata": [{"Location:": "Dromclogh, Co. Kerry", "Teacher:": "\nPártholán Ó Ruadhacháin\n"}, {"Informant": "Mrs Foley", "Gender": "female", "Age": "74", "Address": "Mountcoal, Co. Kerry"}, {"Language": "English"}]}, "4658426/4654179/4661549": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0219, Page 414", "Page 414"], "url": "https://www.duchas.ie/en/cbes/4658426/4654179/4661549", "text": "\nNot far from my home in the townland of Tulrusk there is a dale tree situated in the centre of a bog. It is said that it was planted there in memory of a man named Mahon. He did some deed that was not pleasing to the Molly Mcguires and they were on his track. One evening as he was going through this bog. The Molly Mcguires were in ambush and they shot him on the spot. They buried him there for some time until they heard that the police were on their track and also looking for the place where Mahon was shot. The Molly Mcguires went by night and took his corpse to Drumgowna where they buried him for some time. Then for the last time he was brought through Mohill in a cart load of straw unoticed he was buried outside Mohill and no one ever knew where he was buried exept the Molly Mcguires. Many searches were made but all in vain and his corpse was never found so the Molly Mcguires got away without any punishment. Signed: Hellien Reynolds. Crossdrumman. Gorvagh.\n", "school_info": "School: Stracarne", "metadata": [{"Location:": "Sragarn, Co. Leitrim", "Teacher:": "\nP. Mac Aonghusa\n"}, {"Collector": "Hellien Reynolds", "Gender": "female", "Address": "Crossdrumman, Co. Leitrim"}, {"Language": "English"}]}, "4678374/4673223/4678945": {"title": "Song - Sandhills of Kilmore", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0416, Page 060", "Page 060"], "url": "https://www.duchas.ie/en/cbes/4678374/4673223/4678945", "text": "\nLast night as we assembledin Kilmore romantic glenWe assembled for to drilling boysWe had but nine or tenBut as the moon shone brightlyWe made up some 44We were drilled by Captain NolanIn the sand-hills of Kilmor.We had some men from Milford GlenSome more from AddergownWe had men from the Cashen ShoreAnd the sea coasts all aroundWe had one ONeill from Boher. barWho is now in an Australia ShoreHe drilled the ranks of our Fenian ladsIn the sand hills of KilmoreWe had Ballyduff and Causeway boysAround by the Castle Green\n(continues on next page)\n", "school_info": "School: Sliabh an Mhadra (B.)", "metadata": [{"Location:": "Slievawaddra, Co. Kerry", "Teacher:": "\nLiam Mac Énrí\n"}, {"Collector": "Peter Spillane", "Gender": "male", "Address": "Clashmelcon, Co. Kerry"}, {"Language": "English"}]}, "4666609/4666441/4682430": {"title": "A Story of the Moonlighters", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0415, Page 172", "Page 172"], "url": "https://www.duchas.ie/en/cbes/4666609/4666441/4682430", "text": "\nThe moonlighters were men who were trying to put down the landlords and to prevent men from taking other people's holdings. There was a man living in the locality by the name of Daniel Hayes, and another man by the name of John Moriarty, who was a native of Lixnaw. They were well known in the moonlight movement. They were arrested for the shooting of Jim Fitzmaurice, Ahabeg, Lixnaw, who was shot on the 30th of January 1888. They were sentenced to death at Nenagh, Co. Tipperary and they were brought back to Tralee jail and hanged there on the 9th of March 1888. It only took John Moriarty two minutes to die, and it took Daniel Hayes five minutes to die.\n", "school_info": "School: Ballyduff B. N. School", "metadata": [{"Location:": "Ballyduff, Co. Kerry", "Teacher:": "\nTadhg Ó Leathlobhair\n"}, {"Informant": "John Moran", "Gender": "male", "Address": "Rahealy, Co. Kerry"}, {"Language": "English"}]}, "4713236/4710144/4744288": {"title": "The Old Police Barrack at Banard", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0451, Page 414", "Page 414"], "url": "https://www.duchas.ie/en/cbes/4713236/4710144/4744288", "text": "\n\"The old Police Barrack at Banard.\"It was in the year eighteen fifty that the police first came to reside in Banard. The owner of the house was Michael Moynihan of King - Williamstown and he was erested for non - payment of rent. Then Timothy Moynihan purchased it. He let it to the government as a barrack for the annual rent of twelve pounds. From five to seven men usually occupied the barrack and they were all armed with revolvers. They had a hard time on account of the moonlighters, for they had to protect bailiffs and emergency men, when there was a seizure of cattle. They had a jolly house in Christmas, card - playing, danoring and drinking. The pubbicans gave them presents such as a keg of stout or bottles of whiskey at Xmas. Maurice Murphy. Coom - SueeveguillaFrom:Patrick D Murphy Coonaged 18 years\n", "school_info": "School: Gníomh go Leith (B.)", "metadata": [{"Location:": "Gneevgullia, Co. Kerry", "Teacher:": "\nCormac Ó Laoghaire\n"}, {"Collector": "Maurice Murphy", "Gender": "male", "Address": "Coom, Co. Kerry"}, {"Informant": "Patrick D. Murphy", "Gender": "male", "Age": "78", "Address": "Coom, Co. Kerry"}, {"Language": "English"}]}, "4706343/4704324/4770537": {"title": "A Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0444, Page 092", "Page 092"], "url": "https://www.duchas.ie/en/cbes/4706343/4704324/4770537", "text": "\nThere lived a man in this district by the name of Michael Mahony. He was coming home one night after being out with the\n(continues on next page)\n", "school_info": "School: An Mhaing", "metadata": [{"Location:": "Muingatlaunlush, Co. Kerry", "Teacher:": "\nChristine Nic Gearaild\n"}, {"Language": "English"}]}, "4713239/4710477/4785093": {"title": "The Moonlighters", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0452, Page 318", "Page 318"], "url": "https://www.duchas.ie/en/cbes/4713239/4710477/4785093", "text": "\nDuring the land agitation which was on from 1830 to 1890 there was a batch of volunteers called the moonlighters. Their aim was to put down landlordism, and assist the tenants. They went around in the night-time, and told the tenants not to pay their rent, and if they did they were severely punished. Then any of the tenants who were put to any cost, for not paying their rent. had their losses made good, as the moonlighters had a fund to pay their expenses. They had to do all this work at night, for in those days the country was full of landlord spies, who would soon inform on the moonlighters and the government was always ready to put down, any movement that was for the good of the Irish people. That is why they were called\n(continues on next page)\n", "school_info": "School: Tuairín Chathail (B.)", "metadata": [{"Location:": "Tooreencahill, Co. Kerry", "Teacher:": "\nDiarmuid Ó Cróinín\n"}, {"Collector": "Patrick Cronin", "Gender": "male", "Address": "Reaboy, Co. Kerry"}, {"Informant": "Michael Cronin", "Gender": "male", "Age": "48", "Address": "Reaboy, Co. Kerry"}, {"Language": "English"}]}, "4713239/4710479/4785094": {"title": "The Moonlighters", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0452, Page 320", "Page 320"], "url": "https://www.duchas.ie/en/cbes/4713239/4710479/4785094", "text": "\n320The Moonlighters.Long ago, there was an army in Ireland which was formed specially to prevent people from paying the Rent, and to put down landlordism. It was formed by the farmers who were not able to pay their own rent.They were called the moonlighters, and they carried out raids by night and shot and wounded people who paid their rent.They drilled and armed themselves like any soldiers. They wore masks, so theat the people of the house who paid their Rent would not know them.Because, if the people knew them; they would report them to the police and the police would put them into gaol.\n(continues on next page)\n", "school_info": "School: Tuairín Chathail (B.)", "metadata": [{"Location:": "Tooreencahill, Co. Kerry", "Teacher:": "\nDiarmuid Ó Cróinín\n"}, {"Collector": "Batt Cronin", "Gender": "male", "Address": "Tooreencahill, Co. Kerry"}, {"Informant": "John T. Cronin", "Gender": "male", "Age": "67", "Address": "Reaboy, Co. Kerry"}, {"Language": "English"}]}, "4713239/4710481/4785095": {"title": "The Land League", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0452, Page 322", "Page 322"], "url": "https://www.duchas.ie/en/cbes/4713239/4710481/4785095", "text": "\n322The Land League.In the year 1879 the Land-League movement was started by Michael Davitt, and he started the first land-league meeting the County Mayo. In the farm from which the whole family had been evicted. He went to America, and lost one of his arms there. He came back to Ireland again, and continued his old organisation there. The tenant-farmers of Ireland were hard hit at that time, and famine theatened, but Michael Davitt soon relieved their distress.He organised a moonlighting brigade which struck terror into landlordism, and prevented land-grabbing and the seizure of cattle. He was arrested and was cast into Dartmoon prison. Although having but one hand-it was tied behind his back-and he had to eat his food\n(continues on next page)\n", "school_info": "School: Tuairín Chathail (B.)", "metadata": [{"Location:": "Tooreencahill, Co. Kerry", "Teacher:": "\nDiarmuid Ó Cróinín\n"}, {"Collector": "Denis Cronin", "Gender": "male", "Address": "Reaboy, Co. Kerry"}, {"Informant": "Michael Cronin", "Gender": "male", "Age": "48", "Address": "Reaboy, Co. Kerry"}, {"Language": "English"}]}, "4921982/4915278/4943232": {"title": "Baile Beag and Moonlighter's", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0493, Page 380", "Page 380"], "url": "https://www.duchas.ie/en/cbes/4921982/4915278/4943232", "text": "\nBaile Beag:  in parish of Mt Collins. The people  there were once very wild. They knew very little English and I think it was on account of this that they used mix up with anybody but themselves.One O'Connor there married a Wolfe girl from Athea and she was the first stranger or outsider that came there.O'Connor died leaving the wife (Wolfe) and two children. She was left the grass of a cow wet and dry. The people who were to give this were Jack and Peig (man and wife). They set something in every field (a ridge of cabbage or something) and they herded  their cows and 'tis was when her (Wolfe) cow was over in Rona (Róna is a hillock where nothing grows    but moss and heath)Her people heard of this. Moonlighters came (it seems they were from Kerry) and went into Jack and Peig. I believe they were not  to do any harm but to caution them. When they went into the house however Jack and Peig thought they were the locals and attacked them. In the fight (chairs were used and much pasting (péisting) Jack and Peig were so injured that they could not stir for three weeks. The magistrate came\n(continues on next page)\n", "school_info": "School: Mount Collins, Mainistir na Féile", "metadata": [{"Location:": "Mountcollins, Co. Limerick", "Teacher:": "\nPádraig Ó Coileáin\n"}, {"Language": "English"}]}, "4921985/4915476/4943637": {"title": "Moonlighters", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0494, Page 176", "Page 176"], "url": "https://www.duchas.ie/en/cbes/4921985/4915476/4943637", "text": "", "school_info": "School: Mín na Cille, Mainistir na Féile", "metadata": [{"Location:": "Meenkilly, Co. Limerick", "Teacher:": "\nAindrias Ó Dúnadhuighe\n"}, {"Collector": "Sean Ó Conaill", "Gender": "male", "Address": "Meenkilly, Co. Limerick"}, {"Informant": "Margaret Reidy", "Gender": "female"}, {"Language": "English"}]}, "4921976/4914757/4945163": {"title": "The Meelin Grabbers", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0492, Page 083", "Page 083"], "url": "https://www.duchas.ie/en/cbes/4921976/4914757/4945163", "text": "\nICome all you Irish FeniansYour guns and sabres gleamingCome draw your swords for freedomAt captain moonlights call.IIThere valiant and there daringThere non but of the bravestNo one should prove a tratiorBut proudly hold the field.IIIWith air and admirationWith joy and exultationI'll sing for you a verse or twoOf what Irish men can do.IVIt been on Sunday eveningConvenient to policemenWhen a raid was madeon Meelin\n(continues on next page)\n", "school_info": "School: Templeglantine (B.)", "metadata": [{"Location:": "Templeglentan, Co. Limerick", "Teacher:": "\nMaitiú Ó Duilleáin\n"}, {"Collector": "Michael Riordan", "Gender": "male", "Address": "Templeglentan, Co. Limerick"}, {"Informant": "Richard Hartnett", "Gender": "male"}, {"Language": "English"}]}, "4922122/4854171/4956476": {"title": "The Terries", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0530, Page 423", "Page 423"], "url": "https://www.duchas.ie/en/cbes/4922122/4854171/4956476", "text": "\n(continued from previous page)\nthe long tresses of their mother's flowing hair.  The yoemen had been there and committed the wicked deed.Terry becomes a bitter opponent of the English law and order.  He traverses the country as a United Irishman, and when the fight of '98 has failed he enrolled men in the Terries.\n\n\n\nDuring the time of the Terries there lived in Finnoe, Borrisokane, a landlord named Waller, who was notorious as an evictor and hunter of the Catholics from the land.His cruel actions aroused the Terries to action.  Waller's house was full with gay company enjoying themselves on a certain Xmas night.  The armed Terries entered the hall; Waller stood up trembling and inquired if they wanted money or arms.  They replied that they required nothing, but that the hour when he should fight for his life had come.The fighting began, Waller was slain and a stop was put to further evictions.\n", "school_info": "School: Tír-Dhá-Ghlas (Terryglass)", "metadata": [{"Location:": "Terryglass, Co. Tipperary", "Teacher:": "\nSeán Ó Gliasáin\n"}, {"Language": "English"}]}, "4758525/4751683/5009422": {"title": "The Whiteboys", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0852, Page 200", "Page 200"], "url": "https://www.duchas.ie/en/cbes/4758525/4751683/5009422", "text": "\n(continued from previous page)\n\"white boys\" said \"go maith mo lannah\" L. Waterford heard this expression. Now in the neighbourhood there live a boy nicknamed \"Mo Lannah\". He lived with his mother in one of the houses in L. Waterford estate. Waterford sent for him next morning and hung him in the centre of the courtyard although the boy protested his innocence. In the evening as the boy was not returning his mother called on Waterford to see what was keeping her boy. On arrival in the courtyard the grim tragedy unfolded itself. She went on her knees in front of the corpse and cursed the Waterfords to the seventh generation. \"the curse was that none of them would die a natural death.\" As I'm writing this old tradition I hear the seventh lord shot himself this morning Sept '34. The local people now say the curse is broken.\n\n\n\nLittle is mentioned of it in this area. A man Quinlan was hung at Scough. He is believed to have been innocent of the Society He was going to Sir Robt. Cor's for seed wheat on his way he met a woman and as there was a raid for arms by the U. Irishmen in practically\n(continues on next page)\n", "school_info": "School: Kilmacoliver, Piltown", "metadata": [{"Location:": "Kilmacoliver, Co. Kilkenny", "Teacher:": "\nRistéard Ó Faoláin\n"}, {"Language": "English"}]}, "5162149/5158869/5197794": {"title": "Carraig Fhenóch", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0655, Page 020", "Page 020"], "url": "https://www.duchas.ie/en/cbes/5162149/5158869/5197794", "text": "\nCarraig FhenóchCarraig Fhenóch is hill situated about half a mile east of the school. It is a high peak and from its summit a view can be had of the river Suir as it winds its way a long between along between the counties of Waterford and Tipperary and Kilkenny. One can see the New Bridge and  the Old Bridge and the town of Carrick. The reason it is called Carraig Fhenóch is that a saint named Fenóch once lived in a place not very far from this hill called Teampall Fhenóch meaning “ the temple of Fenóch”. It is said that this saint used to walk up to the summit of the hill almost every day to pray. There is a flat rock on this hill on which can be seen some writing but it is hard to read it as it is very worn. The most peculiar object on this hill is a very big rock called the “Weavers Rock” it is about twenty tons weight which lies on the side of the hill. It is impossible to move this rock as it is wedged by many smaller stones. In eighteen hundred and forty eight the time of the young Irelanders there\n(continues on next page)\n", "school_info": "School: An Charraig Bheag, Carraig na Siúire", "metadata": [{"Location:": "Carrickbeg, Co. Waterford", "Teacher:": "\nSeán Ó Comhraidhe\n"}, {"Informant": "Mr Michael Boland", "Gender": "male", "Address": "Portnaboe, Co. Waterford"}, {"Language": "mixed"}, {"Location": "Portnaboe"}]}}