{"4428144/4381625/4458441": {"title": "An Old Tale", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0649, Page 43", "Page 43"], "url": "https://www.duchas.ie/en/cbes/4428144/4381625/4458441", "text": "\nAn Old TaleConnor Mac Nessa was a King of Eire and he reigned about the time our Savour was Crucified.And when the sun darkened and the Earth trembled he called his seers or wise men about him and he asked them what it was all about and they explained to him how an innocent man was put to death. Some time previous to this King Connor was badly wounded in battle and he warned by his Royal Physician (Great Finegan) that if ever he got exited it would be likely to cause his death. Ans he got so exited when he heard the treatment Our Savour got that the brain ball flew out of his head and\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire, An tSráidbhaile", "metadata": [{"Location:": "Stradbally, Co. Waterford", "Teacher:": "\nAn tSr. Ióseph\n"}, {"Collector": "Maureen Corbett", "Gender": "female", "Address": "Stradbally, Co. Waterford"}, {"Informant": "Mr Stephens", "Relation": "unknown", "Gender": "male", "Address": "Stradbally, Co. Waterford"}, {"Language": "English"}]}, "4428390/4403287/4511402": {"title": "Conchubhar Mac Neasa", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1068, Page 250", "Page 250"], "url": "https://www.duchas.ie/en/cbes/4428390/4403287/4511402", "text": "\nBhí Rí igCúige Uladh fad ó shoin darbh minm Conchubhar Mac Neasa.  Bhí na h-Ultaigh agus na Connachtaigh igcogadh le chéile.  Cuireadh piléar igclár éadain an rí agus dubhairt na laoigheanna go gcaithfheadh sé saoghual suaimhneadh a chaitheadh ó rin amach nó dá sgaoilfheadh an pilé as rin go raibh sé marbh.'Na d'laidh sin thug na h-Ultaigh aire mhaith dó.  Nuair a d'fanóchadh Conchubhar ra bhaile go h-uaigneach.  Chuaidh na bliadhanta thart.  Bhí an rí ag eirghe cuirreach lag-brightheach.Lá amhaín bhí ré 'na shuidhe leis féin i nalach trom as a chroidhe.Mhas bhuailsheá do dhá bhoir as a cheile d'éirigh an spéir dubh dorcha.  Choirigh an coirthneach i an roilreach, agus bhí an domhan uilig ar crith.  I gcionn tamaill d'éirigh an spéir geal arís.  Tháinig an draoi isteach agus chuir Conchubhar ceist air caidé ba chiall leir na h-uathbhair séo nó caidé an choir a rinne un\n(continues on next page)\n", "school_info": "School: Mín an Chladaigh", "metadata": [{"Location:": "Meenaclady, Co. Donegal", "Teacher:": "\nSeán Mac Fhionnaile\n"}, {"Collector": "Liam Ó Píopalaigh", "Gender": "male", "Age": "14"}, {"Language": "Irish"}]}, "5044792/5038655/5084179": {"title": "Old Irish Tales - King Conor Mac Nessa", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0965, Page 100", "Page 100"], "url": "https://www.duchas.ie/en/cbes/5044792/5038655/5084179", "text": "\nOnce King Conor was walking along a river and he walks a few miles away from home. He came to a place where there was a great wood and he climbed up through the wood. When he was above on the top of the wood he sat down to rest himself. He fell asleep and when he awoke the sun was almost setting and he got up and he was very thirsty and he could see no water near him. He travelled for a long time and at last he met a pool of water humping up out of the ground and he said there must be a spring well rising there. Then he dug for the spring well and at last he got it opened and ever since it is called \"Conor's spring well.\"\n", "school_info": "School: Derrynananta", "metadata": [{"Location:": "Derrynananta Lower, Co. Cavan", "Teacher:": "\nMrs O' Regan\n"}, {"Collector": "Susan Dolan", "Gender": "female", "Address": "Corracleigh, Co. Cavan"}, {"Informant": "Peter Mc Hugh", "Gender": "male", "Age": "45", "Address": "Moneensauran, Co. Cavan"}, {"Language": "English"}]}}