{"4428330/4395873/4465034": {"title": "Deilín na mBacach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1047, Page 356", "Page 356"], "url": "https://www.duchas.ie/en/cbes/4428330/4395873/4465034", "text": "\nDeilín na mBacachGo mbeannaigh an Rí agus mise annseoColumcille, Eoghan Baiste, go mbeannaigh an teach seo.Is liomsa atá na trí gártha is fearrA chualaidh tú i mbaile na in áit ariamhMar tá na gárta guidhe, na paidreacha, agus na gártha beannachtaíLe mar dtubaiste go léir do chur ar bhórd na mbochtAr an leic sin Mhic Dhonnachaidh, ag Tobar BhrighideAn áit a mbíonn an crannCríonn ar maidin agus úrghlas trathnónaAg tigh Philip Uí FhloinnAg tigh Philip an chaibín chaimAg tigh mór Uí Mhóirne aníos ó charraic an MhunomoirLeis an athchuinge agus an imridhe.Smaoitigh ar an té nar chur anuraidhAgus nar bhain i mbliadna.Atá gan sliocht foghmhair gan buidheann earraighGan comhnuidh gheimhridh.Gan athair gan mathair gan deirbhshiúir gan dearthair.Mo bheannachtsa go rabh agaibh-se.Amuigh agus istigh, i gcloch agus i gcaonachI sráid nó i gceárdtheach, i bportach agus i léana.Char mhothuigh sibh an cailín a dtug mise gradh dithe?Creidim nach n-aithneochadh sibh íAch oiread le cailín ar bith eile den chomhursan.B’fhurust díbh í aithne :-Cailín íseal, árd, gearr scoth leagantach, fada buidhe\n(continues on next page)\n", "school_info": "School: Leac Chonaill", "metadata": [{"Location:": "Laconnell, Co. Donegal", "Teacher:": "\nSéamus Mac Grianna\n"}, {"Collector": "Máirín Nic Grianna", "Gender": "female"}, {"Informant": "Tarlach Mac Aoidh", "Relation": "grandparent", "Gender": "male", "Age": "83", "Address": "Laconnell, Co. Donegal"}, {"Language": "Irish"}]}, "4428347/4397769/4482570": {"title": "Máire Ní Chnaipleisg", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1052, Page 15", "Page 15"], "url": "https://www.duchas.ie/en/cbes/4428347/4397769/4482570", "text": "\nTá sin agamsa sgéal beag neaf - neafach fá cháis na caillighe a báitheadh maidín Dia Domhnaigh, uair roimhe éirigh gréine, dhá uair stéis an mheadhon lae, ag sráid bhaile comhraic ag comhraic no gcúig gcasán an áita rabh ocht dtroighthe déag de dhroicead cloiche, teampall cliteach an áit ar báitheadh an chailleach. Is fíor gur gheall ar ghaol is gineadh damhsa a bhí an chailleach. Da bhfuighinnse bás, chuireadh sise mó thuairisg-sa, ach tharla gur b’ise a fuair bás, cuirfidh mise a tuairisgsa. Shiubhal mé liom an bealach mór. Ní theachaidh me i bhfad, gur casadh duibhlach gear, gasta damh, agus lód ubhlaí leis, cloch bhróin ann na mullach le na sábhail ar a mbrúdh. Le bualadh na mbos agus tionntach na súl, di’th mé féin lód na n-ubhall. Diafruigh mé fhéin dó an bhfuighinn tuairise na caillig a\n(continues on next page)\n", "school_info": "School: An Sealgán", "metadata": [{"Location:": "Shallogan Beg, Co. Donegal", "Teacher:": "\nRóis Ní Bhraonáin\n"}, {"Informant": "Padraig Ó Baoghail", "Gender": "male", "Address": "Classy, Co. Donegal"}, {"Language": "Irish"}]}, "4428342/4397064/4485683": {"title": "Deilín na mBacach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1050, Page 254", "Page 254"], "url": "https://www.duchas.ie/en/cbes/4428342/4397064/4485683", "text": "\nGo mbeannuighthear doibhse a bhunadh an toigh seo. Tá mise ag teacht leis na trí gartha. 's mó a bhí mé moran ins an ait seo ariamh. Gurbh na gartha, gartha mollta agus gartha beannuighthe ag tobair beannuighthe Bríghde, i n-ait a mbéidh crann dubh ar maidin agus é úr glas tráthnóna. Chuir tóirstú túbáiste ar bord na mbocht, ar lúp an choipín coim, ar cailleach a géarr léim aníos as charraic a mhunamar. Leis an impigh sin agus an aithne sin eirigh do shuid a bhean a' toigh agus nar cailleas a fhear a' toigh agus nar arduigh an díomán na an daibhail leis thú, nar darnuigheann an preacan géan ceann fada ancurce baoí. Tabhair domhsa beagan den bheagán, moran de'n mhoran léim gearrfiadh de im, toirt na muice firinne de gnuc, neart bídh agus míne agus meadar leanna, lámh doirne tobaca agus mé géarrfidh mise dadaí bheir fhéin leat é.Dubhairt an chailleach nach rabh aicí acht \"seanteach lóbhtha sibineach, suithche\" nach rabh aicí acht trí sean bhó agus trí gamhna fírinne da dual, nach mblighthe iad sin acht i gcionn achan naoi lá, can é sin indiú no indé no i mbárach acht ma\n(continues on next page)\n", "school_info": "School: Mullanmore", "metadata": [{"Location:": "Mullanmore, Co. Donegal", "Teacher:": "\nSeosamh Ó Coilín\n"}, {"Informant": "Seán Mac Fhloinn", "Gender": "male", "Age": "85", "Address": "Glenties, Co. Donegal"}, {"Language": "Irish"}]}, "4428345/4397426/4485828": {"title": "Dilín na mBacach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1051, Page 196", "Page 196"], "url": "https://www.duchas.ie/en/cbes/4428345/4397426/4485828", "text": "\nGo mbeannuighthear daoibhshe a chrúada bheannuigh an toighe seo. Tá mise ag teacht leis na trí gárta is mo a bhí i mbaile no in áit ariamh, mar tá na gárta guibhe, na gárta maithe, agus na gártaPaidreacha. Le bheith ag guidhe oraib-se ag an leac sin Dhonncha an áit a mbíonn an crann [crío]? ar maidin, agus an t-ubhall glas tráthnóna. Seineann sé ar sheanachain agus meadhonachain ar luthna ghlas, ar slabhrach an [luirc]? fear a shín a thaobh ar léigh alaimh a d’fuiling naoi neóin roime agus naoi neoin ‘na dhiaidh agus mharbh stiúrsa na láimhe le gac aoinne aca, le sibhse bhur dtubaiste [cur]? ar bhórd na mbocht, ar bhórd na n-ucht, ar Philib Ui Ghlais ar Pilibh Ui Ghloinn   agus ar Philib an chupain dhuinn, agus ó sin siar go Carraig a mhunamair le sibhse bheit seacht ‘s fhearr bliadhain ó indiu, na mar tá sibh [ind]? amuigh agus istigh i gcuid agus\n(continues on next page)\n", "school_info": "School: Doobin", "metadata": [{"Location:": "Doobin, Co. Donegal", "Teacher:": "\nMáire Nic Fhloinn\n"}, {"Informant": "Seamus Ó Tuathlann", "Gender": "male", "Age": "62", "Address": "Doobin, Co. Donegal"}, {"Language": "Irish"}]}, "4428351/4398307/4486156": {"title": "Deilín na mBacach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1053, Page 317", "Page 317"], "url": "https://www.duchas.ie/en/cbes/4428351/4398307/4486156", "text": "\nGo mbeannuigh an rí agus mise annseo.Colum Cille, Eoin Caiste, cruadail beanbeannuighthe an tighe seo.Is liomsa tá na trí gártha is fearr a chuala túI mbaile nó in áit ariamh mar atá na gártha guidhe, na gártha paidreacha agus na gártha beannuighthe, le murdtubaiste go léir a chur ar bhórdna mbocht.Ar an leic sin Dhonncaidh ag tobar Bhríghde - an ait a mbíonn an crann crí ag tóige Philipín Ui Floinn ag t-ghe Pilipín caibairt chaim, ag tíge mór dorsach aníos ó Carraig an Muilinn. Leis an athcuinge agus an impidhe - eirigh suas a bhean an toighe agus n'ár chraidhig an Rígh do cróide nár\n(continues on next page)\n", "school_info": "School: An Ceann Garbh", "metadata": [{"Location:": "Kingarrow, Co. Donegal", "Teacher:": "\nMaighréad Nic an Bhriathartaighe\n"}, {"Collector": "Pádraig Ó Scannláin", "Gender": "male"}, {"Informant": "Máire Inghean Níc Dáibhid", "Gender": "female", "Age": "55"}, {"Language": "Irish"}]}, "4428376/4401519/4491921": {"title": "Deilín na mBacach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1062, Page 89", "Page 89"], "url": "https://www.duchas.ie/en/cbes/4428376/4401519/4491921", "text": "", "school_info": "School: An Clochán Liath (Dungloe)", "metadata": [{"Location:": "Dunglow, Co. Donegal", "Teacher:": "\nDoiminic Ó Ceallaigh\n"}, {"Collector": "Doiminic Ó Ceallaigh", "Gender": "male", "Occupation": "múinteoir"}, {"Informant": "Pádraig Mac Gaoithín", "Gender": "male", "Age": "72", "Occupation": "feirmeoir", "Address": "Barnanageeha, Co. Donegal"}, {"Language": "Irish"}]}, "4428369/4400336/4492005": {"title": "An Fáth ar Chóir \"Cuidiú Dé\" a Rá", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1059, Page 176", "Page 176"], "url": "https://www.duchas.ie/en/cbes/4428369/4400336/4492005", "text": "", "school_info": "School: Tráigh Éanna", "metadata": [{"Location:": "Trawenagh Bay, Co. Donegal", "Teacher:": "\nP. Mac Giolla Bhríghde\n"}, {"Informant": "Michaeil Chórdáin", "Gender": "male"}, {"Language": "Irish"}]}, "4428370/4400411/4492036": {"title": "Amhrán Grá", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1059, Page 241", "Page 241"], "url": "https://www.duchas.ie/en/cbes/4428370/4400411/4492036", "text": "", "school_info": "School: Dubhchoradh", "metadata": [{"Location:": "Doochary, Co. Donegal", "Teacher:": "\nMáighréad, Bean Mhic Amhlaoidh\n"}, {"Informant": "Conall Ó Duibheannaigh", "Gender": "male", "Age": "circa 60", "Occupation": "feirmeoir", "Address": "Doochary, Co. Donegal"}, {"Language": "Irish"}]}, "4461441/4395078/4499189": {"title": "Deilíní - Mícheal Ó Caradain leis an Chailleach Ghallda", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1046, Page 173", "Page 173"], "url": "https://www.duchas.ie/en/cbes/4461441/4395078/4499189", "text": "\n(1) Mícheal Ó’Caradain leis an Cailleach GhálldaÉirigh do shuidhe a bhean a’ toighe‘Scaith an diabhal as do chroidheTug aníos giota de’n im buidheAtá sa’ chofra i gcionn an toigheSul mar dtugaidh an Riamhas? leis thúMar thug sé leis an cearc mhór bhuidheDa bfaghtha? buille dé’n criotaigh, buille dé’n bhriotaigh, buille dé’n bhoimsach mór, buille dé’n staifeach coróin, chuirfeadh sé cainnt agus coisidheacht ‘na chósra leat.Ma mhasluigh mé an cailleachNí maith liom go deárn mé’n chainntNa creid briathra fear-buileNí chanann sé ach glór gan suim.\n\n\n\n(2). Antoine h-Alfeartaigh leis an t-sagairt.Bhal! cé gur mhilis do bhriathnaIs fritheamhal? druidthe do dhórn‘Na bhFlaitheas ma - théid fialAr ndóighe níl tú dréim a bheith ceo‘Na bhFlaitheas ma théid tú‘S gan chiall atá Peadar ‘s Pól.\n", "school_info": "School: Mín na Croise", "metadata": [{"Location:": "Meenacross, Co. Donegal", "Teacher:": "\nMáire C. Ní Choileáin\n"}, {"Language": "Irish"}]}, "4461441/4395078/4499191": {"title": "Deilíní - Mícheal Ó Caradain leis an Chailleach Ghallda", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1046, Page 173", "Page 173"], "url": "https://www.duchas.ie/en/cbes/4461441/4395078/4499191", "text": "\n(1) Mícheal Ó’Caradain leis an Cailleach GhálldaÉirigh do shuidhe a bhean a’ toighe‘Scaith an diabhal as do chroidheTug aníos giota de’n im buidheAtá sa’ chofra i gcionn an toigheSul mar dtugaidh an Riamhas? leis thúMar thug sé leis an cearc mhór bhuidheDa bfaghtha? buille dé’n criotaigh, buille dé’n bhriotaigh, buille dé’n bhoimsach mór, buille dé’n staifeach coróin, chuirfeadh sé cainnt agus coisidheacht ‘na chósra leat.Ma mhasluigh mé an cailleachNí maith liom go deárn mé’n chainntNa creid briathra fear-buileNí chanann sé ach glór gan suim.\n\n\n\n(2). Antoine h-Alfeartaigh leis an t-sagairt.Bhal! cé gur mhilis do bhriathnaIs fritheamhal? druidthe do dhórn‘Na bhFlaitheas ma - théid fialAr ndóighe níl tú dréim a bheith ceo‘Na bhFlaitheas ma théid tú‘S gan chiall atá Peadar ‘s Pól.\n", "school_info": "School: Mín na Croise", "metadata": [{"Location:": "Meenacross, Co. Donegal", "Teacher:": "\nMáire C. Ní Choileáin\n"}, {"Language": "Irish"}]}, "4428395/4404304/4512116": {"title": "Deilín na mBacach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1070, Page 50", "Page 50"], "url": "https://www.duchas.ie/en/cbes/4428395/4404304/4512116", "text": "\nDeilín na nBacachAn bacach a'teacht go dtí an doras:- Go mbeannuighidh an Rí agus Pádraic annseo. Colmcille agus Eóin baiste, Peadar agus Pól do chomhluadar a bhean a'tighe. Ta mise  a'teacht leis na trí gara is fearr a thainic i dtír in aon áit ariamh- na gara guidhe, na gara paidreacha agus na gara beannachtacha Dean an deirc mar ndúil gurab é cuideachas leat ar mhuir agus ar thír, in domasach agus i gcréafóig, ar sráid agus in gárraidh mar ndúil go mbéidh do thobaiste ar an  bhothar cham, ar an leic sin thios Mhic Donnchaidh mar bíos an crann a bíos críon ar maidín agus úr'ghlas tráthnóna.Deirc ar an fhear ná'r chuir anuraidh agus ná'r bhain i mbliadhna, gan cur earraidh gan baint fóghmhair, gan bean, gan clann, gan luth, gan luthghair, gan láthair gan mháthair.arsa bean a tíghe:-Níl annseo acht trí sramaidí gamhacha, trí sramadaigh cait a diúl ortha. Ní indé, indiu no amárach a blíghtear iad acht ag an uair tráth agus ma fhanann tú le braon de gcuid bainne gheobhaidh tú é.An Bacach:- In áit a geasfaidhe caileach\n(continues on next page)\n", "school_info": "School: Gort an Choirce", "metadata": [{"Location:": "Gortahork, Co. Donegal", "Teacher:": "\nSéamus Mac Giolla Easboic\n"}, {"Informant": "Aodh Ó Dubhthaigh", "Gender": "male", "Address": "Beltany Lower, Co. Donegal"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "female"}, {"Language": "Irish"}]}, "4428395/4404307/4512117": {"title": "An Rógaire Bacach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1070, Page 53", "Page 53"], "url": "https://www.duchas.ie/en/cbes/4428395/4404307/4512117", "text": "\nAn Rógaire bacachBean a' tighe nach dtug áird air. Thainic fear siubhal isteach go bean feirmeóra agus mar seo a labhair sé nuair a bhí sé istigh ag an táirseach:-\" Bal Dé agus Bhrígde ort, rath mhúinte mhánla gan smút ná gruam. Dar mo choinseas féin a bhean deagh-mhóideach. Tá fhios agam le breathnadh ar do éadan geal-gháireach go bhfuil croidhe mór agat istigh i do lár gheal\".\" le bliadhain is fiche anuas atá mé ag cruinniú mó dhéirce ó thír go tír ar fud na réagúin. is dar mo bhriathar ar feadh an achar sin ní fhaca mé bean chomh geanamhaill nó chomh flaitheamhail, no comh siubhuilceach leat féin. Sílim nach bhfuilir crosta canntalach nó gruamdha, na nach mbíonn tú ag troid le muintir na comharsan ná ag loscadh mionna móra ó mhaidín go tráthnóna\".\" Tá mise anois ag iarraidh ort beatha an lae seo, in onóir Pádraic, Colmcille, Bríghid agus Eanda, Tabhair  síneadh láimhe damh-sa go déirceamhail. Ach na maoidh orm é, ar mó ághaidh ná taobh thiar díom, mar ní maith ó maoidhtear ná oinseach ó hiarrtar\".\"teara siar go fial agus teara aníar go farsaing agus tabhair síneadh láimhe go groideamhail dó'n bhochtan atá i ngéar chall.\"\n(continues on next page)\n", "school_info": "School: Gort an Choirce", "metadata": [{"Location:": "Gortahork, Co. Donegal", "Teacher:": "\nSéamus Mac Giolla Easboic\n"}, {"Collector": "Peadar Ó Domhnaill", "Gender": "male"}, {"Language": "Irish"}]}, "4428395/4404310/4512118": {"title": "An Rógaire Bacach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1070, Page 56", "Page 56"], "url": "https://www.duchas.ie/en/cbes/4428395/4404310/4512118", "text": "\n(continued from previous page)\nann, agus d'imthigh leis agus a mhála folamh.\" Mo chuid do thubaiste is d'annacháin na bliadhna in do bhealach leat\" a deir bean a tighe.Fuaras \" An Rógaire bacach\" ar pháipéar nuaidheachta. Peadar Ó Domhnaill-Connachtach-a sgriobh é.\n\n\n\nSgeul Grinn.\"Brachan ó aréir éIs mairg nár théighidhe éAn seo mar d'ól sibh féin é\"Bhí triúr fear ag ól brachain-réidh oidhche amháin.Shuidh an chead fhear síos agus d'ól sé spanóg dé'n bhrachan. Bhí an brachan comh té sin agus gur sgal sé e, acht níor leig sé dadaidh air féin.\"Bráchan ó aréir é\" ar seisean.Shuidh an dara fear síos agus d'ól sé spanóg de'n bhrachan. Sgaladh eisean fosta acht níor leig sé dadaidh air. \" Is mairg nár théidh é\" ar seisean.Shuidh an tríomhadh fear síos. D'ól se spanóg agus sgaladh é. Níor leig sé dadaidh air ach eiread. \"An seo mar d'ól sibh féin é\". ar seisean.\n", "school_info": "School: Gort an Choirce", "metadata": [{"Location:": "Gortahork, Co. Donegal", "Teacher:": "\nSéamus Mac Giolla Easboic\n"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "male"}, {"Language": "Irish"}]}, "4428395/4404313/4512120": {"title": "Giota de Dheilín na mBacach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1070, Page 59", "Page 59"], "url": "https://www.duchas.ie/en/cbes/4428395/4404313/4512120", "text": "\nGiota de Dheilín na mbacachDá gcastaí bean lom leisgeamail orm idir eadradh agus am breicfeasta, a deirfeadh liom a bó blighte, preátaí bainte, bainne ag an tseasga, ná bliocht ar na cearca, bhuailfinn buille uirthí de'n chlitear, de'n bhlightear, de'n chliach mhór, de'n bhata críon cam, a bhainfeadh cainnt agus coightheacht na hóir aistí.Éirigh a bhean a tighe is ná craithfidh Dia do chroidhe, Tabhair damh léim gurrfhiadh dín im bheag súilineach bhuidhe atá i gcionn a tighe le seacht mbliadhna a'gabhail de'shúile ag iarraidh ithe. Eirigh a bhean a'tighe ó ná habair liom mar dubhairt an droch bhean indé- ná hith an  t-arán briste agus ná bris an tarán slan, ná codlaigh dhá oidhche i na dteach amháin, ar eagla's go dtógfadh droch rud ar bith leis thú, mar thóg an tiolar fad ó an t-éan ó'n chirc bháin.\n", "school_info": "School: Gort an Choirce", "metadata": [{"Location:": "Gortahork, Co. Donegal", "Teacher:": "\nSéamus Mac Giolla Easboic\n"}, {"Informant": "Anna Ní Fhioruisge", "Gender": "female"}, {"Informant": "Méadhbh Nic Fhionnlaoich", "Relation": "relative (other than parent or grandparent)", "Gender": "female", "Address": "Keeldrum Upper, Co. Donegal"}, {"Language": "Irish"}]}, "4428394/4403849/4514198": {"title": "Oíche Nollag", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1069, Page 298", "Page 298"], "url": "https://www.duchas.ie/en/cbes/4428394/4403849/4514198", "text": "\n(continued from previous page)\na lastar na coinnle.Chreid na daoine ins an t-sean aimsir go dteigheadh na h-ainmhidhthe i ngach boitheach ar an nglúine trí h-uaire ag an meadhon oidhche le onoir agus adhradh a thabhairt dó Íosa Críost. Ins an cheanntar seo níl iomrádh ar ainmhidhe ar bith seo a dheánamh ach an asal.As m'eolas féin a sgríobh mé na cunntais seo ar féilí na bliana. Thug mé faideara cuid aca da gcur i ngíomh. Chualaidh mé féin chuid eile de na gnásaí ó am go h-am o bhí mé i mo ghasúr.\n\n\n\n\"Go mbeannuighidh 'n Rí agus Pádraig annseo Colmcille agus Eoin Baiste Peadar agus Pól agus do chomhluadar a bhean an toighe annseo. Tá mise teacht leis na trí gara is ferr a tháinig i dtír no i n-áit ariamh; na gara guidhe, na gara paidreacha agus na gara beannachta. Deán a déirc mar\n(continues on next page)\n", "school_info": "School: Gort an Choirce", "metadata": [{"Location:": "Gortahork, Co. Donegal", "Teacher:": "\nSéamus Mac Giolla Easbuic\n"}, {"Collector": "(name not given)", "Gender": "unknown"}, {"Informant": "Aodh Buinbheal Ó Dubhthaigh", "Gender": "male"}, {"Language": "Irish"}]}, "4428394/4403853/4514200": {"title": "Deilín na mBacach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1069, Page 302", "Page 302"], "url": "https://www.duchas.ie/en/cbes/4428394/4403853/4514200", "text": "\n(continued from previous page)\nagus ligean amach lughnasa. Bídh cailleachai tinn le seaimlidh ann.\"\"Is iomda mála sgairtí orm-sa díogbháil nár léar díbse íad. Mála na h-iosgaide mála na h-asgaile. Penny come quick sa chrúiscín. Slán agus beannach ag muinntir an toighe seo, béidh mise ag imeacht.\n\n\n\n\"Go dtugaidh an t-Athair Síorruidhe bhur gcuid de'n ghlóir shíorruidhe díbh agus an t-sláinte de'n mhuinntir atá saothrughadh, agus gábhadh ar bith da dtiocfaidh oraibh, go saoraidh Dia gan díoghbhail díbh.\"\n", "school_info": "School: Gort an Choirce", "metadata": [{"Location:": "Gortahork, Co. Donegal", "Teacher:": "\nSéamus Mac Giolla Easbuic\n"}, {"Language": "Irish"}]}, "4428394/4403854/4514201": {"title": "Deilín", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1069, Page 303", "Page 303"], "url": "https://www.duchas.ie/en/cbes/4428394/4403854/4514201", "text": "\n\"Da gcasfaidhe bean lom leisgeamhlach orm idir eadarshudh agus am bricfeásta a deárfadh liom nach rabh bó blighte, préata bainte, bainne ag an  t-seascach no bliot ar na cearca, bhuailfinn buille de'n bhleithtín de'n chleithtín, de'n chliabh mhór, de'n bhata crón cham, a bhainfeadh cainnt n-a tórtaidh aistí. Éirigh a bhean a toighe nar chrádaigh Día do chroidhe, nar chaillidh tú fear a'toighe. Tabhair damh léim ghiorrfhiadh de'n im bheag shiúlmeach bhuidhe 'tá seacht mbliadna 'deánamh a shuile 'g iarraidh  é ithe, i n-a phionntai, i n-a chártai, i n-a chnagairí mar tcí an rí agat é. Ó na h-abair liom mar dubhairt an droch bean nidé, \"Na h-ith an t-arán briste a's na bris an t-arán slán, a's na codlaidh ach oidhche i n-a dteach amháin ar eagla go dtabhairfeadh droch rud ar bith leis thú, mar tóg an t-iolar an t-éan uad'n chirc bháin.\"\n(continues on next page)\n", "school_info": "School: Gort an Choirce", "metadata": [{"Location:": "Gortahork, Co. Donegal", "Teacher:": "\nSéamus Mac Giolla Easbuic\n"}, {"Informant": "Máire Ní Fhuaruicse", "Gender": "female"}, {"Language": "Irish"}]}, "4493628/4405078/4514540": {"title": "Deilín na dTincléirí", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1073, Page 133", "Page 133"], "url": "https://www.duchas.ie/en/cbes/4493628/4405078/4514540", "text": "\nNuair a tháing an stróinse ‘un a bhaile tráthnóna,Bhuail seisean stróic ar an mhadadh.D’amharc sé síos ar an eiteán bheag caol“an é sin ar shníomh tú ó mhaidin”?Mur’ ndeanhaidh tú gníomha thara mar’ tehím-sé,Aidihim do’n tsaoghal é go mbainseadDamhsa gan píoba le caol – bhata díreachAmach as do thaobhanna, a chaile!”II“Cuirim síos teine a’s deargam an píopa,Is iomdha ceann sgríbe a bhíos ar m’aire.Rómhar mé an díogaidh ‘s chart mé an carn aoiligh‘S sheol mé na caoirigh óin gheamhar.Bím seal ag cur dídin i ndoras na gaoithe,A’s seal ag tabhairt cích do- do leanbh,Moch óch! A Rí dhílis, nach mór m’ádhbhar caointeNar chreid mise an fhírinne ó m’athair!” III“A chailíní óga atá réidh ‘un bhur bpóstaBhéarfainn díbh comhairle bhur leasa.Gan a bheith ag ól leis na stócaigh sin ThomáisNó síneadh go deó leóbhtha ar leabaidh!Nar fhaghaidh mé fhéin atrughadh ó mhalairt na trócaire!\n(continues on next page)\n", "school_info": "School: Baile na Bó", "metadata": [{"Location:": "Ballyboe, Co. Donegal", "Teacher:": "\nAilbhe Ó Conáin\n"}, {"Collector": "Ailbhe Ó Conáin", "Gender": "male", "Occupation": "múinteoir"}, {"Informant": "Brighid Nic a' t Seachlainn", "Gender": "female", "Age": "68", "Address": "Ballyconnell, Co. Donegal"}, {"Language": "Irish"}]}, "4493628/4405090/4514549": {"title": "Dilín na mBacach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1073, Page 144", "Page 144"], "url": "https://www.duchas.ie/en/cbes/4493628/4405090/4514549", "text": "", "school_info": "School: Baile na Bó", "metadata": [{"Location:": "Ballyboe, Co. Donegal", "Teacher:": "\nAilbhe Ó Conáin\n"}, {"Collector": "Ailbhe Ó Conáin", "Gender": "male", "Occupation": "múinteoir"}, {"Informant": "Brighid Nic a' Seachlainn", "Gender": "female", "Age": "68", "Address": "Ballyconnell, Co. Donegal"}, {"Language": "Irish"}]}, "4428339/4397037/4552283": {"title": "Carraig an Mhonamair", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1050, Page 23", "Page 23"], "url": "https://www.duchas.ie/en/cbes/4428339/4397037/4552283", "text": "\nRann a bhíodh ag fear-siubhail is dóiche. Fuair mé ó Bhean Bheárnaí Longáin i Sráith an Arbhair é agus chuala sí ag Paidí Maolúin as Mín an Dubháin é nuair a bhí sí óg. Tá sí 60 bliadhain nó mar sin anois.Go mbeannuighidh Dia, Muire, Pádruig, Eoghan Báiste agus Colm Cille faoi chlúdhaire bheannuighthe an toighe seo. Tá mise ag teacht leis an trí gártha a b'fhearr a bhí i mbaile na in aon áit ariamh - mar atá - na gártha guidhe, na gártha beannachta agus na gártha paidreacha le bheith ag guidhe orainn ag an lic sin Donnchaidh, an áit a mbíonn na crainn críonna ar maidin agus an t-ubhall glas tráthnóna; le mbur dtubaiste a chur ar Bhórd Tighe na mBocht. Reilipe an dá chois, reilipe am chaibín chaim, ar mhór-ní thé, a shean-luibear agus Carraig a' Mhonamair.Ach 'sé chuir mise ag iarraidh na déirce seo ó thús, cailín a dtug mé grádh íseal árd, sgolaganta fada dubh buidhe, minircín ar a dá chois, béim-leathraigh ar a ladhaire agus milleadh bróige ar a gcoróin. Sgoith ruball uirthe mar bhéadh ar ghréasuidhe, ar fhigheadóir, nó ar (fhear) chóiste. Dúil mhór i dteinidh, i dtochas, agus i ngearr-glalúmhnaigh tobaco.Lean mo chúis í go tabharthú ar na Mhaimirigh,\n(continues on next page)\n", "school_info": "School: Lochmuice", "metadata": [{"Location:": "Loughmuck, Co. Donegal", "Teacher:": "\nÁine M. Ní Fhuathaigh\n"}, {"Collector": "Áine M. Ní Fhuathaigh", "Gender": "female"}, {"Informant": "Bean Bheárnaí Longáin", "Gender": "female", "Age": "circa 60"}, {"Language": "Irish"}]}, "4742100/4735897/4925663": {"title": "Paidir an Bhacaigh", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0468, Page 362", "Page 362"], "url": "https://www.duchas.ie/en/cbes/4742100/4735897/4925663", "text": "", "school_info": "School: Fearann Iarthach", "metadata": [{"Location:": "Farraniaragh, Co. Kerry", "Teacher:": "\nSeán Ó Murchadha\n"}, {"Informant": "P. Mac Giolla Coda", "Gender": "male", "Address": "Loher, Co. Kerry"}, {"Language": "Irish"}]}, "4921983/4915395/4943519": {"title": "Deilíní - Bacaigh an Bhóthair", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0494, Page 095", "Page 095"], "url": "https://www.duchas.ie/en/cbes/4921983/4915395/4943519", "text": "\n\"Go mbeannuighidh Rí na Naomh duit,Mac Muire, a h-aon Mhac,Mar is mise an domhan aosta,Táim im' aonair ag siubhal,Nár tháinig riamh bhúr  n-éileamhAgus anois tá a' lorg a dhéirceO! bean a' tighe, bí éasgaidhIs leig mé chun siubhail\"\n", "school_info": "School: Cnoc Uí Choileáin, Mainistir na Féile", "metadata": [{"Location:": "Mountcollins, Co. Limerick", "Teacher:": "\nPádraig Ó Coileáin\n"}, {"Language": "Irish"}]}, "4428337/4396626/5079576": {"title": "Dilín na mBacach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1049, Page 289", "Page 289"], "url": "https://www.duchas.ie/en/cbes/4428337/4396626/5079576", "text": "\nDillín-na-mBacach         21.11.37Go mbeannuighthear daoibh-se a cruadail beannuigh an toigh seo, tá mise ag teacht leis na trí gartha is mó a bhí i mbaile na in áit ariamh mar tá na gártha guibhe, na gártha maithe agus na gártha páidreacha- le bheith ag guidhe oraibh-se ag an teach sin dhonnchaidh an áit a mbíonn an crann críon ar maidín agus an t-ubhall glas tráthnóna.Éirigh do shuidhe a bhean -a-toighe agus nar cradhaidh an riogh do chroidhe agus nar luighfidh mé ar leabaidh chruaidh gan tuighe aus nar caillfidh mé fear-a-toighe, agus nar tugaidh an diabhal na an deamhan uaidh é mar thug an preachan fada an t-éan o'n chirc buidhe. tabhair damh-sa beagan de'n bheagan agus morán den mhorán, léim  ghirrfiadh de ime, lán mála uibheacha cearc, tachtadh na muice fireannach gruth cuid doirne tobac,mias\n(continues on next page)\n", "school_info": "School: Na Cruacha", "metadata": [{"Location:": "Croaghgorm or Blue Stack Mountains, Co. Donegal", "Teacher:": "\nMáire C. Ní Chinnéide\n"}, {"Collector": "Máire C. Ní Chinnéide", "Gender": "female", "Address": "Kilrean, Co. Donegal"}, {"Language": "Irish"}]}}