{"4428250/4388316/4456160": {"title": "The Cure of Elf-Shot (in Cattle)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1026, Page 129", "Page 129"], "url": "https://www.duchas.ie/en/cbes/4428250/4388316/4456160", "text": "\n1. Cattle are sometimes supposed to be Elf Shot. They get swollen and refuse to eat anything and finally die if a cure is not made. The cure is made with a long briar which has rooted itself twice. The briar is measured three times round the body of the animal. During the measuring some rhyme- known only to the curer- is said. This is done each day until the measurement gets smaller and stops when the animal reaches its normal size. This cure is not handed down from one person to another. Anyone who knows the rhyme and gets the proper briar can make this cure.\n\n\n\nThe cow is supposed to be “touched by the wee people”. She gets dull and sleepy and gives no milk. To cure her get a red hot coal in the tongs and bring it to the byre. Pass it over the cow from head to\n(continues on next page)\n", "school_info": "School: Loughill", "metadata": [{"Location:": "Ballymunterhiggin, Co. Donegal", "Teacher:": "\nEibhlis Ní Mhathghamhna\n"}, {"Language": "English"}]}, "4428251/4388440/4465607": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1027, Page 015", "Page 015"], "url": "https://www.duchas.ie/en/cbes/4428251/4388440/4465607", "text": "\nThere is a disease amongst cattle known as elf-shot. The symptoms are loss of milk, and feeling very cold. In olden times it was believed the fairies did it.  There are numerous cures, such as a blessed candle. The cow is measured from the end of her tail to her nose, and the sign of the Cross, with the candle is made over her and under her for three days. Another cure is a briar with the ends growing into the ground, and the cure is made the same way. It is always successful.\n\n\n\nThere was a disease known as mumps. It was a swelling in the throat and jaws and was very painful. The old people had a very peculiar cure for it.  They put a donkey’s halter round the head of the patient and led him to a spring well where they said some prayers. This was done once a day for\n(continues on next page)\n", "school_info": "School: St Joseph's, Béal Átha Seanaigh", "metadata": [{"Location:": "Ballyshannon, Co. Donegal", "Teacher:": "\nAn Br. S. Ó Murchadha\n"}, {"Collector": "Michael Gavigan", "Gender": "male", "Address": "Ballyshannon, Co. Donegal"}, {"Informant": "Mr James Gavigan", "Gender": "male", "Address": "Ballyshannon, Co. Donegal"}, {"Language": "English"}]}, "4427989/4364543/4468242": {"title": "Seanleigheasanna Aisteacha - Bualadh Saighead", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0130, Page 513", "Page 513"], "url": "https://www.duchas.ie/en/cbes/4427989/4364543/4468242", "text": "\nSeo é an t-ainm a tugtar ar ghalar a tigeann ar bhuaibh uaireannta. An bhó a bhíonn bualadh saighead uirri cailleann sí an bainne bíonn sí ar crith agus ní bhíonn fonn uirrí dada d'ithe.Creideann na daoine gurbh amhlaidh a thigeann na daoine maithe ar an mbuin amuigh sa bpáirc, nó sa stabla. Agus go mbuaileann siad í le cloich áithrid a bhíonn aca féin.Amanta má bhíonn an rath ar dhuine gheibheann siad cloch mar seo caithte in ait éigin. Nuair a bhíonn cuig cinn ag duine bíonn an leigheas aige.Dar leis na daoinibh, seo é an leigheas braon uisce coisreactha a chur le braon maith fíor uisce i gcrúisgín, cúig cinn de na saighdeanna nó na clochaibh seo fhághail; píosa dhá scilling le cros air agus trí leith-phinghneacha agus iad\n(continues on next page)\n", "school_info": "School: Poll an tSómais", "metadata": [{"Location:": "Pollatomish, Co. Mayo", "Teacher:": "\nProinnsias Mac Gearailt\n"}, {"Language": "Irish"}]}, "4428045/4371845/4473546": {"title": "Local Cures - Whooping-Cough", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0145, Page 10", "Page 10"], "url": "https://www.duchas.ie/en/cbes/4428045/4371845/4473546", "text": "\n(continued from previous page)\nsuffering from whooping cough will cure. (c) Look out for a man passing by on a grey horse, ask him to tell you a cure for the whooping cough. Whatever he says use it.\n\n\n\nIt is commonly believed in this parish of Ballysokeery that on occasions animals become elf shot, that is in some way stricken by the fairies.A man in this district named Foster Gardiner has in his possession a set of five smooth round stones called elfstones. These stones are supposed to be dropped by elves or fairies and are rarely found on the land.The man who possesses these stones places them in a can with some salt water and three coins, one a silver piece and two different copper pieces. He first measures the animal starting from the tail to the head and using as a measure the length from his elbow to the tip of middle finger. This is done three times and each time they get\n(continues on next page)\n", "school_info": "School: Baile Nua an Fhaoitigh", "metadata": [{"Location:": "Newtownwhite, Co. Mayo", "Teacher:": "\nÉilís Ní Mharascáil\n"}, {"Collector": "Robert Fair", "Gender": "male", "Address": "Derreen, Co. Mayo"}, {"Informant": "Patrick Walsh", "Gender": "male", "Age": "60", "Occupation": "farm-labourer", "Address": "Derreen, Co. Mayo"}, {"Language": "English"}]}, "4428301/4392817/4476742": {"title": "Elf-Shooting", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1038, Page 359", "Page 359"], "url": "https://www.duchas.ie/en/cbes/4428301/4392817/4476742", "text": "\nElf-shooting is a disease from which cows suffer. They are supposed to have been hit by a piece of flint thrown by a fairy.The cow lies down moaning. Her eyes get swollen and water runs from her mouth.A person who has the cure for \"Elf shooting\" is sent for. He proceeds to make the cure. He first measure her from the tail to between the horns using his arm from the elbow to tips of his fingers as a measure. He then cuts the tops of her horns and pieces from her cleats. He takes a sod from the roof of the byre, he lights it and when burning well it is passed three times round the cow's body. Then the pieces of horns and cleats with some hair from the cow are burned under her head the smoke going round her head. Soon she begins to get lively and in a short time is able to take a drink. Then she is all-right.\n", "school_info": "School: Urbal", "metadata": [{"Location:": "Urbal, Co. Donegal", "Teacher:": "\nEamonn de Faoite\n"}, {"Language": "English"}]}, "4481744/4408503/4481502": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1083, Page 243", "Page 243"], "url": "https://www.duchas.ie/en/cbes/4481744/4408503/4481502", "text": "\nLong ago the Irish people used wicker-work coops for potatoes. Now they use wicker-work creels for carrying turf on donkeys, one on each side.\n\n\n\nThere was an old woman in Tullyhullion out herding cows one day, and a little hare came and ran in under a cow and looked up at her udder. The woman happened to say, \"God protect the cow.\" The hare ran away and did the cow no harm.\n\n\n\nWhen a cow is \"elfshot\" it is said that the \"fairies\" have shot her with flint. That is the way the fairies have of shooting\n(continues on next page)\n", "school_info": "School: Teampull Dubhglaise", "metadata": [{"Location:": "Drumbologe, Co. Donegal", "Teacher:": "\nSeán C. Ó Dómhnaill\n"}, {"Collector": "Jane Mc Daid", "Gender": "female", "Age": "14"}, {"Informant": "Mrs Mc Daid", "Gender": "female", "Address": "Tullychullion, Co. Donegal"}, {"Language": "English"}]}, "4497723/4344685/4505814": {"title": "A Cure for a Cow in the Fairies", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0086, Page 91", "Page 91"], "url": "https://www.duchas.ie/en/cbes/4497723/4344685/4505814", "text": "\n91A Cure for a cow in the FairiesWhen a cow gets sick it often happens that the fairies are taking her. If such is the case the owner must get 9 elve stones. These stones are to be found in the ground but is pretty hard to get them. They are small and round like marbles with the tracks of fairy fingers on them. These elves stones should be put into a jug, with three half-pence and some chicken weed and the just should be then filled with soft water. It should be left aside for a few hours and the liquid should be given to the cow. It has been known to cure many cows. The old people say that the fairies fire these little stones at each other in the night time when they are out playing and if they desire to bring any animal with them they hit it with one of the elve stones.One day a man was out mowing his hay and there was another man along with him. They sat down to rest and suddenly the man heard a dart or an elve stone buzzing by him. They searched round everywhere but they could not find the stone. Suddenly another one whizzed by them but they could not find it either. In times gone by there was a bag of these elves stones in every house to use as necessary.\n(continues on next page)\n", "school_info": "School: Skerdagh, Newport", "metadata": [{"Location:": "Skerdagh Lower, Co. Mayo", "Teacher:": "\nJames Deffely\n"}, {"Language": "English"}]}, "4493672/4409630/4519093": {"title": "Cure for a Cow 'Shot' by the Fairies", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1087, Page 005", "Page 005"], "url": "https://www.duchas.ie/en/cbes/4493672/4409630/4519093", "text": "\nWhen a cow stands with drooped head and refuses to eat, chew the cud and give milk she is supposed to be \"shot\" or \"blinked\" by the fairies.To find out if she is \"shot\" a man measnures her from the point of the trail to the point of the nose. The measure he uses is his forearm, from the point of his middle finger to the point of his elbow. He does this three times.  If the measurements do not agree the cow is supposed to be \"shot\" by the\n(continues on next page)\n", "school_info": "School: Baile na nGalloglach (Milford)", "metadata": [{"Location:": "Millford, Co. Donegal", "Teacher:": "\nTadhg Ó Súilleabháin\n"}, {"Informant": "Aenus Mac Bride", "Gender": "male", "Age": "63", "Occupation": "farmer", "Address": "Aghanursan, Co. Donegal"}, {"Language": "English"}]}, "4493676/4409854/4522007": {"title": "Monastic Ruins in Rathmullen", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1088, Page 016", "Page 016"], "url": "https://www.duchas.ie/en/cbes/4493676/4409854/4522007", "text": "\n(continued from previous page)\n16exception of the chancel and a little strip of ground to the South-East which was excluded from the sale, passed into the hands of Mr Matthew Corry Ramelton\n\n\n\nA Cow “Shot”— in this district and in my own native district Inver in South Donegal the belief  is still held that cows are sometimes shot by the Fairies and the cure is as follows:- The Sign of the Cross is made on the point of the cow’s tail, on her back and between her two horns. A live coal is carried round the cow’s body and put under her nose until she smells it. Oaten meal is then burned under her nose and the Sign of the Cross is again made under the cow.  She is also measured three times and the Sign of the Cross is made after each measurement.\n\n\n\nTradition says that long ago many people churned for several hours but no butter formed. Witches were than [sic] supposed to have taken the butter. These witches were often their immediate neighbours who through the assistance of the Devil took away the butter. It is said that the witch used to go to the house of the intended victim and ask for the loan of some butter which she would then take home and place inside the roof of her kitchen until it turned green. After that the witch was able to have all the neighbour's butter.\n(continues on next page)\n", "school_info": "School: Lurganboyce", "metadata": [{"Location:": "Lurganboy, Co. Donegal", "Teacher:": "\nAntoine Ó Cairbre\n"}, {"Collector": "Anthony Carbery", "Gender": "male", "Occupation": "múinteoir"}, {"Language": "English"}]}, "4493688/4410916/4525759": {"title": "Leigheas Caite", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1091, Page 293", "Page 293"], "url": "https://www.duchas.ie/en/cbes/4493688/4410916/4525759", "text": "\nBhí fear ina chomhnuidhe ar an Bhaile Úr arbh ainm dó Eamónn Ó Ceallaigh agus ba ghnáth leis leigheasanna a dhéanamh do buaibh. I bhfad ó shoin ba ghnáth le cuid mhór eallaigh an galair caithte a ghlacaint. Síleadh na daoine gur na siogannaí a ba chionntach le seo agus bhí leigheas ag Eamónn dobhtha. Sé an dóigh a leigheasughadh sé iad na: thomhaiseadh sé an bhó ó dheireadh an rubaill go dtí an srón trí n-uaire agus annsin ghnídheadh sé deoch dí. Chuireadh sé meirg naoi n-iarrann agus trí leith-phighinn ins an digh agus leigheasughadh sin í.\n\n\n\nBíonn leigheas i dtólamh i láimh an seachtughadh mhic agus sin an evil ? a leigheasughadh. Bhí fear ina chomhnaidhe 'san áit seo darbh ainm do Paidí Mac an t-Saoir agus bé an seachtamhadh mac é. Chuimleochadh sé a lámh naoi n-uaire roimh éirghe na gréine ar an duine tinn agus geobhadh sé biseach.\n(continues on next page)\n", "school_info": "School: Baile Mhichíl", "metadata": [{"Location:": "Ballymichael, Co. Donegal", "Teacher:": "\nBrian Ua Gafacháin\n"}, {"Collector": "Seán Mac an t Saoir", "Gender": "male", "Address": "Balloor, Co. Donegal"}, {"Informant": "Proinnsias Mac an t Saoir", "Gender": "male", "Address": "Balloor, Co. Donegal"}, {"Language": "Irish"}]}, "4701663/4690738/4706422": {"title": "An Elf-Shot Cow", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0156, Page 016", "Page 016"], "url": "https://www.duchas.ie/en/cbes/4701663/4690738/4706422", "text": "\nA cow may be out grazing in a field when suddenly she may become ill. It may be one of the finest days in the year, yet this may happen for absolutely no reason at all. The disease is like spine disease, she becomes weak in the back and may not be able to rise when she lies down. The belief is that the \"Good people\" as fairies may be playing and firing stones. If one of these hits the cow she becomes elf shot. It may occur also if the (owner) man does any harm to the fairies dwellings - forts or lios. She becomes sick in a very short time.\n(continues on next page)\n", "school_info": "School: Caisleán Gael", "metadata": [{"Location:": "Castlegal, Co. Sligo", "Teacher:": "\nM. Ó Tiománaidhe\n"}, {"Language": "English"}]}, "4701745/4698535/4724517": {"title": "Old Cures", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0183, Page 261", "Page 261"], "url": "https://www.duchas.ie/en/cbes/4701745/4698535/4724517", "text": "\n(continued from previous page)\nriver where the three mearing water is found.\n\n\n\nThis is an old cure which is supposed to cure cows or horses that are sick. The person that owns the sick beast gets an elf stone and puts it into a bucket or basin full of water. An elf stone is a short smooth and fairly thick stone. It is supposed to hav something to do with faries. When it is about five or ten minutes in the water, the water is given to the sick beast to drink. It is given to her three times in sucession. There are not many elf stones in the country. My grandfather had one long long ago, and it is still in our house.\n", "school_info": "School: Kilmorgan", "metadata": [{"Location:": "Kilmorgan, Co. Sligo", "Teacher:": "\nKathleen M. Doyle\n"}, {"Collector": "Mary Brady", "Gender": "female", "Address": "Cloonlurg, Co. Sligo"}, {"Language": "English"}]}, "4701657/4690221/4725247": {"title": "Elf-Shot Cattle", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0155, Page 0530", "Page 0530"], "url": "https://www.duchas.ie/en/cbes/4701657/4690221/4725247", "text": "\nWhen a cow or a calf sudden gets sick people say it is \"elf shot\".Then a messenger is sent to a man in the district who has a set of \"elf stones.\"\"Elf stones\" are stones of a white colour varying in size from a taw to a match box. They are to be found in fields where bushes are plentiful.The tradition of \"elf stones\" is that \"the good people\" or fairies play by firing these stones at each other. If one of them hits a beast that animal is said to be \"elf shot\".The cure for an \"elf shot\" animal is as follows - A set of \"elf stones\" (it consists of 9 stones) a gold ring, 6d or 3d in silver, 1d or 1/2d and a pair of beads are\n(continues on next page)\n", "school_info": "School: Cliffoney (B.)", "metadata": [{"Location:": "Cliffony, Co. Sligo", "Teacher:": "\nPatrick Mc Hugh\n"}, {"Collector": "Patrick Mc Hugh", "Gender": "male", "Occupation": "múinteoir", "Address": "Cliffony, Co. Sligo"}, {"Informant": "James O' Connor", "Gender": "male", "Age": "61", "Address": "Carns, Co. Sligo"}, {"Language": "English"}]}, "4701657/4690233/4725296": {"title": "Elf-Shot Cattle", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0155, Page 0541", "Page 0541"], "url": "https://www.duchas.ie/en/cbes/4701657/4690233/4725296", "text": "\nElf Shot Cattle (second version).It occasionally happens that a cow becomes \"elf shot\". The limbs become stiff and she does not give any milk.The following is the cure - The owner gets a blessed candle and lights it. He takes the candle and rubs it down the cows back - from the head to her tail, three times, saying whilst doing so \"In the name of the Father and of the Son and of the Holy Ghost. Amen.\"Then he rubs the blessed candle round the body three times, repeating the above words. Finally he burns the hairs around her mouth, and holds the candle at her nose until she quenches it. A few minutes time she is quite better.\n", "school_info": "School: Cliffoney (B.)", "metadata": [{"Location:": "Cliffony, Co. Sligo", "Teacher:": "\nPatrick Mc Hugh\n"}, {"Collector": "Patrick Mc Hugh", "Gender": "male", "Occupation": "múinteoir", "Address": "Cliffony, Co. Sligo"}, {"Informant": "John Costello", "Gender": "male", "Age": "60", "Address": "Cliffony, Co. Sligo"}, {"Language": "English"}]}, "4728060/4696284/4728139": {"title": "The Cattle Hoven or as It Was Called Anciently Elf-Shot", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0179, Page 051", "Page 051"], "url": "https://www.duchas.ie/en/cbes/4728060/4696284/4728139", "text": "\nIn far off days when a cow became swollen or distended from over eating, the old people formed the opinion she was elf shot which means struck with the fairies. As it is usually the case with cows hoven they lose the milk temporary. In most districts there was a particular man having the cure of the elfs. The people having their beasts unwell would go to this man and ask him to cure them. This man had a reel flannel purse or bag and in it was a certain number of peculiar shaped small stones called elf stones. He would come to the house where the beast was and would rub the stones over her back and measure her with a tape. He would then order the owner of the beast to go and get the three mearing water for her which means the water of three mearing thrences or rivers of three townlands meet. The beast would get a certain amount of this water every day to drink. The handy man would come and\n(continues on next page)\n", "school_info": "School: Cill Ruis", "metadata": [{"Location:": "Kilross, Co. Sligo", "Teacher:": "\nAntoine Ó Fuadaigh\n"}, {"Language": "English"}]}, "4723815/4715987/4760335": {"title": "Cure of the Elf-Shot", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0934, Page 311", "Page 311"], "url": "https://www.duchas.ie/en/cbes/4723815/4715987/4760335", "text": "\nThis disease occurs in Cattle, caused, it is believed by the fairies. If they hit a cow with a flint stone she could not move out of the spot until the cure is made.It is made with a colter of a plough. First the sign of the cross is made on the ground with the colter, then the colter is brought round the animal's body back to the ground again.Next the sign of the cross is made on the animal's back, the colter being then brought out between the horns, then underneath her and back to the ground again.This had to be repeated nine times.\n", "school_info": "School: Cor Críochach", "metadata": [{"Location:": "Corcreeghagh, Co. Monaghan", "Teacher:": "\nSs. Ó Muireadhaigh\n"}, {"Language": "English"}]}, "4758603/4758098/4955982": {"title": "Curing a Cow which Was Elf-Shot", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0951, Page 320", "Page 320"], "url": "https://www.duchas.ie/en/cbes/4758603/4758098/4955982", "text": "\nAbout 80 years ago it was believed by many people that mischievous elves or fairies if offended by those whose lands they roamed over revenged themselves by shooting their cattle with 'elf bolts'. A case of this kind happened in the townland of Annaamartin 1 mile from Smithboro. The stricken beast belonged to Thomas McEniff and gradually became thinner and weaker. She gave no milk. The neighbours came to the conclusion that she was 'elf-shot' and decided that the services of Belle McCammock a witch that lived in Killadonnelly should be availed of. John McEniff son of the owner of the cow was sent to Belle Mc Cammock and set out for her cabin between sunset and sunrise.\n(continues on next page)\n", "school_info": "School: Na Mullaigh (Smithboro')", "metadata": [{"Location:": "Smithborough, Co. Monaghan", "Teacher:": "\nMrs Walsh\n"}, {"Informant": "John Thomas Rooney", "Gender": "male", "Age": "63", "Address": "Smithborough, Co. Monaghan"}, {"Language": "English"}]}, "5070793/5064465/5097516": {"title": "The Three Caves in Gortnabraher", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1001, Page 371", "Page 371"], "url": "https://www.duchas.ie/en/cbes/5070793/5064465/5097516", "text": "\n(continued from previous page)\nthat existed there some four hundred years ago.\n\n\n\nIn this district some hundred years ago or less the people were rather superstitious. I believe too they had reason to complain as it was supposed that milk and butter could be spirited or taken away by some charms from certain people. It was supposed that certain parties lived in the immediate vicinity who could use magic or some other means of taking away butter from their neighbors and on to forty years ago the people were in dread so much of these things occurring every May eve that they used to take the cautions and they'd make a withe of a Rowan Berry twig about the size of a bridal birth and tie it on the cows tail with a red tape and you could see hundreds of cows with this appliance as it was supposed to ward off and prevent any tampering with the milk or butter during the year. There was a superstition too that cattle or cows would be elfshot. It was supposed that the fairies playing at night in a field where cows were grazing that\n(continues on next page)\n", "school_info": "School: Lattoon", "metadata": [{"Location:": "Lattoon, Co. Cavan", "Teacher:": "\nP. Ó Hiorraí\n"}, {"Collector": "Rose Mc Gennis", "Gender": "female", "Address": "Coragh, Co. Cavan"}, {"Informant": "Mr P. Mc Gennis", "Gender": "male", "Address": "Coragh, Co. Cavan"}, {"Language": "English"}]}}