{"4427834/4348616/4435956": {"title": "The Oats Crop", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0095, Page 255", "Page 255"], "url": "https://www.duchas.ie/en/cbes/4427834/4348616/4435956", "text": "\n(continued from previous page)\nday done they make up stooks.\n\n\n\nThe Borrowed DaysLong long ago there was an old (an) old cow that was very lean and thin. She used to get sick very often and this Winter she got very sick. January and February passed on and all the people thought she would die. On went March and she lingered on so she did not die. March had to borrow three days from april and these three days killed the old cow. These days are called Riabhach days, or the three borrowed days, or Laetha na bó Riabhaiche.\n", "school_info": "School: Manulla", "metadata": [{"Location:": "Manulla, Co. Mayo", "Teacher:": "\nSeán Mac an Adhastair\n"}, {"Collector": "Patrick Masterson", "Gender": "male", "Address": "Manulla, Co. Mayo"}, {"Informant": "Patrick Masterson", "Gender": "male", "Age": "40", "Address": "Manulla, Co. Mayo"}, {"Language": "English"}]}, "4427906/4356593/4451352": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0112, Page 156", "Page 156"], "url": "https://www.duchas.ie/en/cbes/4427906/4356593/4451352", "text": "\nThe \"Riabach\" Days are the first three days in April. They are also \"the days that killed old Browne's cow.\"   They are borrowed from March.  It is usually very cold on the first three days of April. It was always the custom with the old people to go into a new house on Friday.  People who go into new houses on Friday have mass said on that day.  Old people say that Friday is a lucky day.  It is not right to drive nails on Good Friday. It is said that you should not put out any ashes on the 1st of May.If you went into a house where there is a churning being made it is not right to go out without churning for a while or you would bring the butter with you.\n", "school_info": "School: Achadh Mór", "metadata": [{"Location:": "Aghamore, Co. Mayo", "Teacher:": "\nSeán P. Mac Shiúrtáin\n"}, {"Language": "English"}]}, "4428065/4374376/4461722": {"title": "The Riabhach Days", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0150, Page 100", "Page 100"], "url": "https://www.duchas.ie/en/cbes/4428065/4374376/4461722", "text": "\nIn the past in this part of the country the holdings were very small and the winter feeding for stock was very limited and in most cases was consumed by the end of March. The people felt that if their stock survived that month the need for fodder was over.On one occasion an old cow was so delighted she had survived the cold bitter days of that month that when the first of April arrived she cocked her tail and started to abuse March and its cold biting winds.To have revenge on the old cow March then borrowed three days from April saying 'April, April stand to me now, And lend me three days to skin this old cow.'And since then the three first days of April are called the Riabhach Days.\n", "school_info": "School: Leath-árdán", "metadata": [{"Location:": "Lahardaun, Co. Mayo", "Teacher:": "\nMáirtín Ó Ceallaigh\n"}, {"Collector": "Mary Doyle", "Gender": "female", "Address": "Tobernaveen, Co. Mayo"}, {"Language": "English"}]}, "4428113/4379749/4463524": {"title": "An tSeanriabhach nó Laethanta na Bó Riabhaiche", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0642, Page 55", "Page 55"], "url": "https://www.duchas.ie/en/cbes/4428113/4379749/4463524", "text": "\nAn Sean Riabhach nó Laetheanta na Bó RiabhaicheFado is ar an t-aonadh lá deug de Aibreán a bhíodh deire le Mí na Márta. An Sean Mharta a thugadh air. Thug an Sean bó trí léim le h-áthas nuair a bhí Márta thart mar shíl sí go raibh deireadh leis an aimsir dona. D'iarr Márta trí lá ar Áibreán is thug Áibreán dhá lá deug dí. Bhí na trí lá an-chruadh is mharbhuigh an sean bhó. Tugtar an Sean Riabhach ar na laetha ó shoin i leith.Tugtar an Sean Riabhach ar an ceud trí lá tosaigh de mí Aibreáin. Is gnáthach leis an aimsear a bheith go dona le linn na laethe úd.Déirtear go raibh sean bhó ann fadó agus tháinigh an Mhárta an-chruaidh agus fluich ar fad uirthí. Thosnuigh sí féin agus Márta ag cur i gcoinnibh  a chéile ach dá olcas é Márta ní bhfuigheadh sé deire do cur leis an sean-bhó. Fé dheire bhí deire le Márta agus bhí an seam bhó ag maireachtar i gcomhnuidhe. Bhí fearg ar Mhárta annsan nuair a bhí buaidhte ag am t-sean bhó air. D'iarr sé iasacht de trí lá ar an Áibreán annsan agus thug Áibreán dó iad. Tháinigh na trí laethe san agus níor tháinig\n(continues on next page)\n", "school_info": "School: Baile Mhic Airt, An Rinn", "metadata": [{"Location:": "Ballymacart, Co. Waterford", "Teacher:": "\nTomás Ó Faoláin\n"}, {"Collector": "Tomás Ó Faoláin", "Gender": "male", "Occupation": "múinteoir", "Address": "Knockanpower Lower, Co. Waterford"}, {"Language": "Irish"}]}, "4427950/4360425/4463818": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0121, Page 445", "Page 445"], "url": "https://www.duchas.ie/en/cbes/4427950/4360425/4463818", "text": "\n(continued from previous page)\npeople in their day. If the people did not obey the landlords they would evict them. There were more bailiffs who resided at Cashlahanny  Kilmovee. These were the Dalton's. One of them got to be an agent for the protestant bishop of Ballina to collect his rents. He made it his business to evict nine families on a Christmas night in the townland of Rusheen's. There was another landlord but he was not a full landlord. He had control of Magheraboy. He sent the sheriff and the soldiers one morning to Magheraboy to evict all the people and three women beat them all and sent them away. They saved the evictions.\n\n\n\nThe meaning of the \"Trí Lá na Riabhaighe is the month of March trying to kill the old cow. The month of March being thirty one days with hunger and\n(continues on next page)\n", "school_info": "School: Breac-chluain (B.)", "metadata": [{"Location:": "Brackloon, Co. Mayo", "Teacher:": "\nSeán Ó Casaide\n"}, {"Informant": "Pat Rock", "Gender": "male", "Age": "40", "Address": "Killaclare, Co. Mayo"}, {"Language": "English"}]}, "4428064/4374291/4464532": {"title": "The Riabhóg Days", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0149, Page 352", "Page 352"], "url": "https://www.duchas.ie/en/cbes/4428064/4374291/4464532", "text": "\nLong ago there was a man that had a cow. It was during the month of March and he kept her in every day because the weather was very bad. One day in the of March he let out the cow because the day was fine. The cow began to jump with delight because March was gone so the month of March borrowed three days from April which are called the riabhóg days and they were so cold that they perished the cow.\n", "school_info": "School: Sruthán an Aifrinn", "metadata": [{"Location:": "Massbrook Lower, Co. Mayo", "Teacher:": "\nBríd Ní Mhóráin\n"}, {"Collector": "Charles Kelly", "Gender": "male", "Address": "Terryduff, Co. Mayo"}, {"Language": "English"}]}, "4428064/4374341/4464643": {"title": "The Riabhach Days", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0149, Page 402", "Page 402"], "url": "https://www.duchas.ie/en/cbes/4428064/4374341/4464643", "text": "\nThe three last days of March are called the reabach days. Those three days are the coldest days in the year. Once there was an old cow and when April came she thought she did not need to stay in at night so she stayed out at night. April borrowed three days from March and those days came very bad and at the end of the three days the cow was dead.\n", "school_info": "School: Sruthán an Aifrinn", "metadata": [{"Location:": "Massbrook Lower, Co. Mayo", "Teacher:": "\nBríd Ní Mhóráin\n"}, {"Collector": "Joseph Reilly", "Gender": "male", "Address": "Massbrook Lower, Co. Mayo"}, {"Language": "English"}]}, "4427983/4363812/4469095": {"title": "Leigheasanna ar Ghalair", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0129, Page 322", "Page 322"], "url": "https://www.duchas.ie/en/cbes/4427983/4363812/4469095", "text": "\n(continued from previous page)\n6) Deirtear gur leigheas ar easbhuigh ná súbh bláth ar a dtugtar baine bó bleachtáin a ól naoi maidne i ndiaidh a chéile.7) Deirtear gur leigheas ar garla buidhe dhul thart ar chró cearc trí huaire i ndiaidh a chéile.\n\n\n\nDeir na sean daoine go dtugtar Lá Crosta na Bliana ar Dómhnach Cincís. Deirtear nár chóir do dhuine ar bith bonn a chos a fághail ar an talamh an lá sin. Deirtear go mbéidh an duine a bhéarfhaidheas an lá sin an de-shásta ar feadh a shaoghal.\n\n\n\nTugtar Leitheanna na Riabhaigh ar an dá lá deiridh de Mhárta agus an céad lá d'Aibreán. Bíonn  na laetheannta sin an garbh agus deirtear gur bé an fáth a túgadh Laetheannta na Riabhaigh ortha ná go raibh bó riabhach ann fadó agus nach raibh aon bhiadh aice ón fiche naomhadh lá de Mhárta agus go bhfuair sí bás ar an chéad lá d'Aibreán.Tugtar Lá na h-Amadán ar am chéad lá d'Aibreán agus bíonn gach duine ag iarraidh amadán a dheanamh den duine eile.\n", "school_info": "School: Ros Dubh", "metadata": [{"Location:": "Rosdoagh, Co. Mayo", "Teacher:": "\nSeán Ó Gionnáin\n"}, {"Collector": "Caitlín Ní Graith", "Gender": "female", "Address": "Rosdoagh, Co. Mayo"}, {"Language": "Irish"}]}, "4427991/4364991/4469423": {"title": "Uisce na gCos", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0131, Page 192", "Page 192"], "url": "https://www.duchas.ie/en/cbes/4427991/4364991/4469423", "text": "\nSé is brigh le Laetheannta na Riabhaighe ná Laetheannta na Bó Riabhaighe.An lá deiridh dhe Mhárta dubhairt an riabhach go dtainic léithe a ruball a chrothadh, go raibh an Mhárta curtha aici. Bhí fearg ar an Mhárta nuair a chuala sí sin agus d'iarr sí lá ar Aibreán leis an riabhach a fheannadh. Thug an t-Aibreán an lá dí. Thainic an lá sin comh dona gur cailleadh an riabhach le fuacht agus ocras. O'n lá\n(continues on next page)\n", "school_info": "School: Ceathrú Thaidhg", "metadata": [{"Location:": "Carrowteige, Co. Mayo", "Teacher:": "\nPádraig Mag Shamhráin, Pádhraic Ó Gacháin\n"}, {"Collector": "Eibhlín Nic Craith", "Gender": "female", "Address": "Portacloy, Co. Mayo"}, {"Informant": "(name not given)", "Relation": "grandparent", "Gender": "female", "Age": "75", "Address": "Portacloy, Co. Mayo"}, {"Language": "Irish"}]}, "4428023/4368831/4471870": {"title": "Laethanta na Bó Riabhaí", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0139, Page 113", "Page 113"], "url": "https://www.duchas.ie/en/cbes/4428023/4368831/4471870", "text": "\nDeireann na sean-daoine go bhfuil Laetheannta Riabhaiche ann, agus tuiteann siad ar an dhá lá deiread do mhí Márta, agus ar an gcéád lá d'Aibreán.Tá sgéal ag baint leis na laetheannta sin. Bhí bó ann uair amháin agus chuaidh sí amach ins na páirce, agus bhí macruis uirthí. Thosuigh sí ag rith agus dubhairt sé\" Anois ta Márta bradach beagnach imthigh,mar ní raibh acht dá lá ann annsin. Bhí an dara lá eile go hana olc ar fad, le gaoith cruaidh agus sioc, agus sneachta agus an chéad lá d'Aibreán.Fuair Márta lá ar cháirde ó Aibreán, agus do bhain siad an croiceann den sean-bhó riabhach agus sin é an fáth atá 31 lá i mí Márta, mar níor thug Márta an lá ar ais ariamh do mhí Aibreán\n(continues on next page)\n", "school_info": "School: Gleann Calraighe", "metadata": [{"Location:": "Glencalry Lower, Co. Mayo", "Teacher:": "\nNóra Ní Riagáin\n"}, {"Language": "Irish"}]}, "4428042/4371764/4474996": {"title": "Laethanta na Bó Riabhaiche", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0144, Page 580", "Page 580"], "url": "https://www.duchas.ie/en/cbes/4428042/4371764/4474996", "text": "\nChuala mé daoine a rádh gurab iad sin an dhá lá deireadh de Mhárta agus an chéád lá d'Aibreán. Chuala mé daoine   eile a' rádh gurab iad an trí lá deireadh de Márta agus an trí lá i dtosach an Aibreáin.Seo é an sgéul a chuala mé futha.Bhí sean-bhó riabhach ann uair amháin agus bhí sí lag caitte. Bhí faitcíos  uirrí nach seasfaidh sí an Mhárta. Nuair a tháinig an lá deireadh de Márta, bhí áthas uirrthi agus dubhairt sí\" Buideachas le Dia tá an Márta imthighthe \"Fuair Aibreán lá ar iasacht ó Márta agus fuair an sean bhó bás. Bhí an lá go h-an dona agus\n(continues on next page)\n", "school_info": "School: Cnoc na Caillighe", "metadata": [{"Location:": "Crocknacally, Co. Mayo", "Teacher:": "\nBríd Ní Cheallaigh\n"}, {"Collector": "Bríd Ní Ceallaigh", "Gender": "female", "Address": "Moygawnagh, Co. Mayo"}, {"Informant": "Bean Uí Rodaigh", "Relation": "unknown", "Gender": "female", "Age": "62", "Address": "Croaghaun East, Co. Mayo"}, {"Language": "Irish"}]}, "4428027/4369659/4475709": {"title": "Lucky and Unlucky Days", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0140, Page 367", "Page 367"], "url": "https://www.duchas.ie/en/cbes/4428027/4369659/4475709", "text": "\nFriday is a very luckly day to begin any kind of work. People rarely start work on a Monday as they call it an unlucky day. People, who want to get any kind of cures always get them on a Monday or a Thursday. If people want to remove any furniture from an old house to a new one they always do it on a Friday. Those born on Whit Sunday are always supposed to be cross. Farmers like to start ploughing on a Friday.\n\n\n\nThe Riabach Days are the two last days of March and the first two days of April. Those days are so called because there was an old cow long ago and when the two last days of March had passed she thought the bad weather was gone.\n(continues on next page)\n", "school_info": "School: Baile an Chaisil C., Clochar na Trócaire", "metadata": [{"Location:": "Ballycastle, Co. Mayo", "Teacher:": "\nAn tSr. Aingeal\n"}, {"Collector": "May Timlin", "Gender": "female", "Address": "Ballinglen, Co. Mayo"}, {"Informant": "John Jackson", "Gender": "male", "Address": "Ballinglen, Co. Mayo"}, {"Language": "English"}]}, "4428034/4370551/4476169": {"title": "The Lawyer's Hound", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0142, Page 129", "Page 129"], "url": "https://www.duchas.ie/en/cbes/4428034/4370551/4476169", "text": "\nOne time a butcher had a piece of meat on the table and a hound came in and brought the piece of meat. The butcher followed the hound into a lawyer's office. The butcher said to the lawyer, \"what would you do to the man that that his hound would come in and bring a leg of beef?\". The lawyer said, \"I would make him pay for it\". The butcher said, \"your hound brought a leg of it from me\". \"How much is it?\" said the lawyer. \"Ten shillings\", said the butcher. The lawyer gave the butcher ten shillings and off he went well satisfied with how he got on. The butcher was scarcely out of his bed the next morning when he got the letter to pay for the advice and the prize of it was one pound. When the butcher went in the first thing he asked was an advice.\n\n\n\nOne time a poor old cow got the better of getting over the month of March and she rose her tail over her back with joy. With spite on the cow March borrowed three days from April and the cow died. That is one of the reasons three first days of April are called Riabhach days.\n\n\n\nOne day a ship was coming from America and a shark was following the ship. He was coming after the ship and they were afraid if they would\n(continues on next page)\n", "school_info": "School: Eanach Mór", "metadata": [{"Location:": "Annagh More, Co. Mayo", "Teacher:": "\nMártain Ó Braonáin\n"}, {"Collector": "Mártain Ó Braonáin", "Gender": "male"}, {"Language": "English"}]}, "4428387/4402913/4510993": {"title": "Laetha na Riabhaí", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1067, Page 161", "Page 161"], "url": "https://www.duchas.ie/en/cbes/4428387/4402913/4510993", "text": "\nShíol an bhó riabhach go rabh an lá leithe nuair a bhí an Márta críochnaighthe. Ach fuair an Márta dhá lá de iasacht uadh an Aibreán agus d'fhág sé feannta chois claidhe an bhó riabhach. Bheirtear laetha na riabhaigh mar sinar laetha deireannach de'n Mhárta, bíonn siad go minic fuar, garbh.\n", "school_info": "School: Doire Beag (B.)", "metadata": [{"Location:": "Derrybeg, Co. Donegal", "Teacher:": "\nLiam Mac Giolla Chomhghaill\n"}, {"Language": "Irish"}]}, "4427830/4348204/4511327": {"title": "Trí Lá na Riabhach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0094, Page 347", "Page 347"], "url": "https://www.duchas.ie/en/cbes/4427830/4348204/4511327", "text": "\nIn the olden times there was an old cow that was almost starved to death during the month of March. When March seen that it could not kill her, if borrowed two days from April to kill her. In-stead of dying, the third of April was fine and she got up and began to run and play. It is said that any old cow that gets over the Trí Lá na  Riabhach is safe for the year.Thomas TuffyGuesdian,Belcarra\n", "school_info": "School: Belcarra (Buachaillí)", "metadata": [{"Location:": "Ballycarra, Co. Mayo", "Teacher:": "\nSeosamh Ó Heireamhóin\n"}, {"Collector": "Thomas Tuffy", "Gender": "male", "Address": "Gweeshadan, Co. Mayo"}, {"Informant": "Thomas Tuffy", "Relation": "parent", "Gender": "male", "Age": "60"}, {"Language": "English"}]}, "4427830/4348205/4511328": {"title": "Trí Lá na Riabhach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0094, Page 348", "Page 348"], "url": "https://www.duchas.ie/en/cbes/4427830/4348205/4511328", "text": "\nThere was once an old cow. She was very much afraid of the cold and bad weather. She stayed in the stable all winter. She said if March was out she would cock up her tail. But March borrowed three days from April and on the third day the cow was skinned. They were three very cold and wet days and the killed they cow.\n", "school_info": "School: Belcarra (Buachaillí)", "metadata": [{"Location:": "Ballycarra, Co. Mayo", "Teacher:": "\nSeosamh Ó Heireamhóin\n"}, {"Collector": "John Joyce", "Gender": "male", "Address": "Carrowjames, Co. Mayo"}, {"Informant": "Mrs Joyce", "Relation": "parent", "Gender": "female", "Age": "45"}, {"Language": "English"}]}, "4566062/4563674/4570941": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0026, Page 0064", "Page 0064"], "url": "https://www.duchas.ie/en/cbes/4566062/4563674/4570941", "text": "\nFriday is a lucky day to start ploughing. Saturday is an unlucky day to start ploughing or sowing oats. If you started on Saturday it would take seven Saturdays to finish. Friday and (lucky) Monday are lucky days to start building a new house. If you began to build the Western side of it first you would never finish it because it would begin to fall.\n\n\n\nCures that could only be worked on certain Days.Patch Costello Ballinastack had a cure for a headache known as \"An After-noon Pain\". People used to get it in the evening or after dinner and that was the reason it was called an \"After-noon Pain\".He used to measure some kind of a tape around the invalids head. This cure would only work on Tuesdays and Thursdays.\n\n\n\nThe Ould Cows DaysOne year March came very cold and there was hardly anything to eat for animals. The last day of March came and this old cow said, \"March is over now and I will have plenty to eat.I will let you know said March. Then March borrowed three days from April. The first day of April was very cold and the old cow was very hungry. She was dead on the second day and\n(continues on next page)\n", "school_info": "School: Garrdha", "metadata": [{"Location:": "Garra, Co. Galway", "Teacher:": "\nLiam Ó hAnnracháin\n"}, {"Language": "English"}]}, "4569069/4568739/4583590": {"title": "Laethanta na Bó Riabhaí", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0042, Page 0153", "Page 0153"], "url": "https://www.duchas.ie/en/cbes/4569069/4568739/4583590", "text": "\nNa trí laetheannta í dtosach an Aibreán tugtar trí laetheannta na bó riabhaigh ortha. Seo é an fáth. Mí an-chruaidh ar na beithidhigh a bhíodh ins an Márta, fadó, mar bhíodh an fudair an-ghann an mhí sin. Ach bhí aon tsean-bhó amháin ann agus cheap sí go mbeadh sí í ndon cruadhtan an Mhárta a sheasamh. Cheap an Márta gurb é fhéin a ghnothóchadh. Annsin rinne siad geall lé chéile.\" Anois \" arsan sean-bó \" Cuirfidh mé geall leat go mbeidh mé í ndon rith agus léimnigh nuair a thiocfas an t-Aibréan \"   \" Fan ort a chailín \" ar san Márta   \" Beidh sgéal eile agat geallaim-se dhuit \"   \" Mháir an tsean-bó ar feadh an Mhárta agus annsin ceap sí go raibh an geall buaidhte aice, agus thoisigh sí ag tabhairt dhubhlán an Mhárta.Ach chuaidh an Márta\n(continues on next page)\n", "school_info": "School: Baile an Mhuillinn (B)", "metadata": [{"Location:": "Milltown, Co. Galway", "Teacher:": "\nPádhraic Ó Discín\n"}, {"Collector": "Pádhraic Ó Coisdealbha", "Gender": "male", "Address": "Clashaganny, Co. Galway"}, {"Informant": "Máire Ní Coisdealbha", "Relation": "relative (other than parent or grandparent)", "Gender": "female", "Address": "Clashaganny, Co. Galway"}, {"Language": "Irish"}]}, "4569061/4567750/4584016": {"title": "Seanscéal", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0037, Page 0301", "Page 0301"], "url": "https://www.duchas.ie/en/cbes/4569061/4567750/4584016", "text": "\nBhí fear fadó 'na chómhnaidhe in áit a dtugtar Buidhe-Abhnach air. Bhí sean bho riabhac aige. Fuair an bhó bás, agus chreid an fhear gur iad na sidheóga a thug leo í. Bhí brón mór air indiaidh na bó. Lá amháin bhí sé amuigh ag romhar talmhan inaice leasa\n(continues on next page)\n", "school_info": "School: Gort na Léime", "metadata": [{"Location:": "Gortaleam, Co. Galway", "Teacher:": "\nLiam Ó Ceallaigh\n"}, {"Collector": "Pádhraic Pléimeann", "Gender": "male", "Address": "Woodfield, Co. Galway"}, {"Informant": "Labhrais Ó Ciaráin", "Gender": "male", "Address": "Boyounagh, Co. Galway"}, {"Language": "Irish"}]}, "4613688/4608771/4624411": {"title": "Dán an Phíopa agus an Tae", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0063, Page 182", "Page 182"], "url": "https://www.duchas.ie/en/cbes/4613688/4608771/4624411", "text": "", "school_info": "School: Sgoil Mhuire (An Clochar)", "metadata": [{"Location:": "Spiddle, Co. Galway", "Teacher:": "\nAn tSr. Maelsheachlainn Seoighe\n"}, {"Informant": "Sochra Breathnach", "Gender": "female", "Address": "Spiddle, Co. Galway"}, {"Language": "Irish"}]}, "4602725/4598565/4627177": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0190, Page 131", "Page 131"], "url": "https://www.duchas.ie/en/cbes/4602725/4598565/4627177", "text": "\nThe borrowing days of the year are the last two days of March and the first day of April. The days that are lucky for changing to another house are Monday Tuesday Wednesday. For planting or setting anything the lucky day is Good Friday. The unlucky day is Saturday. Saturdays flitting is a short sitting. The last day of March the old cow threw up her heels and said that she would live another year. March borrowed one day from April and the old cow died. And ever since the two last days of March and the first day of April?\n", "school_info": "School: Tulchán", "metadata": [{"Location:": "Tullaghan, Co. Leitrim", "Teacher:": "\nSeosamh Mac Guidhir\n"}, {"Informant": "Patrick Cassidy", "Gender": "male", "Age": "72", "Address": "Tullaghan, Co. Leitrim"}, {"Language": "English"}]}, "4622968/4618224/4628642": {"title": "Féilí na Bliana - Lá Bealtaine", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0071, Page 051", "Page 051"], "url": "https://www.duchas.ie/en/cbes/4622968/4618224/4628642", "text": "\n(continued from previous page)\ndheargadh chaitfheadh sé nó sí é a a chur as sul dá dtéigheadh sé amach.Cuireann na daoine píosa chóta dearg i ruball na bó an lá sin. Dá nightheá  do lámha sa drúcht Lá Bealtaine bheadh réidhteach snátha agat.\n\n\n\nSíad na trí chéád lá d'Aibreán iad. Bíonn an Márta ag iarraidh sean-ndaoine agus sean-bheithidhigh a chur chun báis. Bhí sean-bhó ann uair. Bhí sí an dona ar feadh an Mhárta. Níor chuir an Márta 'un báis í. Nuair a bhí sé caithte chroch sí a drioball agus thosuigh sí ag rith. D'iarr an Márta trí lá ar iasacht ar an Aibreán, agus chuir sé an tsean-bhó 'un báis. Bhí sé lá ghá cur 'un báis, lá ghá feamadh agus lá ghá cur. Scéal eile:An chéad lá baineadh cuid den fionnaidh di, an dara lá bhí sí níos measa ná sin agus an tríomaidh  lá níor fágadh blas ar bith uirthi agus cailleadh í.\n", "school_info": "School: An Druim", "metadata": [{"Location:": "Drim, Co. Galway", "Teacher:": "\nMicheál Ó Concheanainn\n"}, {"Language": "Irish"}]}, "4622978/4619865/4629371": {"title": "Nósanna Lá Fhéile Pádraig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0074, Page 276", "Page 276"], "url": "https://www.duchas.ie/en/cbes/4622978/4619865/4629371", "text": "\nCaitheann an t-aos óg cláirseach nó ribín uaithne nó comhartha éicint eile Lá Fhéile Pádhraic. Glaoidhtear ar an gcomhartha sin Crosóg Pádhraic.Bronntanas ar bith fághtar Lá Fhéile Pádhraic glaoidhtear air Pota Phádhraic.\n\n\n\nBhí Márta ag iarraidh na sean Bó Riabhaigh a mharbhuigh acht chionn air. Agus deirtear go d’iarr sé trí lá ar iasacht ar Aibreán le h-aghaidh í a feannadh. Glaoidhtear ar an céad trí lá d’Aibreán laetheannta na Bó Riabhaigh.\n\n\n\nDeirtear gur chuir na Lochannaigh potaí ime i dtaisge i Log an Ime fadó. Agus fuair fear éicint dhá phota ann. Glaoidhtear Log an Ime ar an log ó shoin. In-aice leis an Log tá carraig mhór\n(continues on next page)\n", "school_info": "School: Coill Maolacáin", "metadata": [{"Location:": "Kilmeelickin, Co. Galway", "Teacher:": "\nAnna M. Ní Loingsigh\n"}, {"Language": "Irish"}]}, "4602712/4597783/4631878": {"title": "Laethanta an Seanbhó", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0083, Page 257", "Page 257"], "url": "https://www.duchas.ie/en/cbes/4602712/4597783/4631878", "text": "\nTá a lán seanchus ag na ndaoine faoi aimsear fuar, garbh cruaidh. Deirtear gurab í Mí na Márta an mí is cruaidh sa mblian. Aon rud, nó ainmhidhe, nó duine dá bhfuil lag deirtear go bhfuigheann sé bás uair eicínt i mí na Márta. Tá sean sgeál  amháin ag na ndaoine a thaisbeánas chómh dona  is a bhfuil an mí seo.Bhí sean-bhó ann fadó a bhí .......\n", "school_info": "School: Sean Bhaile Árd", "metadata": [{"Location:": "Shanballard, Co. Galway", "Teacher:": "\nTomás Ó Murchadha\n"}, {"Language": "Irish"}]}, "4687719/4687079/4708881": {"title": "Féilte na Bliana - Laethanta na Bó Riabhaí", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0435, Page 456", "Page 456"], "url": "https://www.duchas.ie/en/cbes/4687719/4687079/4708881", "text": "\nI mí na Márta tá triocadh is a h-aon lá, ach fadó do thóg mí na Márta trí lá ó mhí an Aibreán. Sé an fáth gur deineadh iad mar do bhí bó amháin ann nár marbhuigeadh an aimsear í. Bhí an aimsear, cómh h-olc san gur baineadh na h-adhairce de's na buaibh. Tháinig áthas ar an mbuir sin d'árduig sí a h-earball agus bhí sí ag rith agus ag léimrig. Sa deire fuair sí  bás mar fuair Mí na Márta an trí lá d'iarr sí, agus do shéid an gaoth agus thuit an báisteach go trom, bathadh an bhó\n(continues on next page)\n", "school_info": "School: Dubhghlas (C.)", "metadata": [{"Location:": "Douglas, Co. Kerry", "Teacher:": "\nEibhlín, Bean de Róiste\n"}, {"Collector": "Máirín Ní Corcardha", "Gender": "female", "Address": "Garrane West, Co. Kerry"}, {"Informant": "Padraig Ó Coistealbha", "Gender": "male", "Age": "60", "Address": "Garrane West, Co. Kerry"}, {"Language": "Irish"}]}, "4687719/4687082/4708904": {"title": "Féilte na Bliana - Laethanta na Rogáide", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0435, Page 459", "Page 459"], "url": "https://www.duchas.ie/en/cbes/4687719/4687082/4708904", "text": "\n(continued from previous page)\naca do thógaidís an t-uisce cóisruighthe amach go dtíú na h-áiteanna in a mbíodh na mbeidithig go léir agus na cearca, sicíní lacainn agus bheannuighidís a raibh aca gach lá de's na trí laetheannta seo.Coimeididís an t-uisce cóisruighthe ó Domhnach Cásga cun na rudaí sin do bheanú nuair a thagadh anlá gach bliadhan. Bíodh an nós seo ag na h-Éireannaig cómh fada siar is a chuimhnuigheadh na daoine.Eibhlín Ní ShúilleabháinTullachCill-Orglan\n\n\n\nGlaodhtar laetheantha na Riabhaice ar na trí laetheantha deiridh de'n Márta nú na céad trí laetheanta de'n Abrán.Ní limid deimhinigte ciaca na trí laeteanta san atá i gceist\n(continues on next page)\n", "school_info": "School: Dubhghlas (C.)", "metadata": [{"Location:": "Douglas, Co. Kerry", "Teacher:": "\nEibhlín, Bean de Róiste\n"}, {"Collector": "Gobnait Ní Chonnchubhair", "Gender": "female", "Address": "Reen, Co. Kerry"}, {"Informant": "Seamus Ó Conncubhair", "Gender": "male", "Age": "66", "Address": "Reen, Co. Kerry"}, {"Language": "Irish"}]}, "4701668/4691424/4713860": {"title": "The Riabhóg Days", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0157, Page 413", "Page 413"], "url": "https://www.duchas.ie/en/cbes/4701668/4691424/4713860", "text": "\nBhí  sean-bhó tráth agus ná raibh sí ar fóghnamh in ao'chor i gcaitheamh an Mhártha . Bhí casachtach árd agus múchadh uirthi agus gach laighe eile a bhaineann leis an aois, ach in dheireadh na míosa tháinigh feabhas uirthi.  Nuair a chonnaic sí an Márta ag bailiú leis abhaile dhein sí luigh fonmhaide fé.' Tá tú g'imtheacht  gan ropaire ' ar sise ' agus imteacht gan teacht ort '. Do chas an Mhárta. \" Cad tá ort-sa a chailín ? ar seisean. D'imhthigh sé annsin agus fuar sé trí lá ar iasacht  ó'n Aibreán; agus thosuigh an gaoth agus an fhearthainn agus sul a raibh an trí lá istigh bhí an t-sean-bhó- riabhac sínte marbh.Agus ná thug an Márta an trí lá úd thar n-ais do'n Aibreán riamh ó shoin. Agus bíonn an trí lá sin fuar , fiadhán i gcómnuidhe ar nós an Márta.\n", "school_info": "School: Baile an Mhuilinn", "metadata": [{"Location:": "Milltown, Co. Sligo", "Teacher:": "\nRós Nic Airchinnigh\n"}, {"Language": "Irish"}]}, "4701691/4693086/4744221": {"title": "The Riabhóg Days", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0163, Page 294", "Page 294"], "url": "https://www.duchas.ie/en/cbes/4701691/4693086/4744221", "text": "\nThe last three days in March are called the \"Ríabhóg\" Days. It is said that if they are not cold enough to skin the  \"Riabhóg\" Cow, they will  borrow the first three days of April to complete the work. Those three days are called the \"Borrowed Days\".\n", "school_info": "School: Stuacán", "metadata": [{"Location:": "Muingwore, Co. Sligo", "Teacher:": "\nBríd Ní Mhiadhaigh\n"}, {"Collector": "Delia Donegan", "Gender": "female", "Age": "12", "Address": "Tullylin or Ballyfeenaun, Co. Sligo"}, {"Informant": "Mrs P. Donegan", "Gender": "female", "Address": "Tullylin or Ballyfeenaun, Co. Sligo"}, {"Language": "English"}]}, "4758451/4745191/4770280": {"title": "The Riabhóg Days", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0230, Page 301", "Page 301"], "url": "https://www.duchas.ie/en/cbes/4758451/4745191/4770280", "text": "\nA showery April a flowery MayThe sun dances  on Easter morn            ----------------The people of this vicinity have strange sayings regarding every month of the year especially about March and April. The two last  days of March and the first day of April are called Riabhóg Days.              The old people had a peculiar saying March was unable to strip the old cow and therefore it had to  borrow one day from April to complete it. Ever since the first day of April is called \"All Fools Day\" owing to how March fooled the old cow.\n(continues on next page)\n", "school_info": "School: Cartrún", "metadata": [{"Location:": "Cartronavally, Co. Roscommon", "Teacher:": "\nCáit, Bean Uí Cheallaigh\n"}, {"Collector": "Rose A. Guihen", "Gender": "female", "Address": "Carrow Beg, Co. Roscommon"}, {"Informant": "John Mc Parthlon", "Gender": "male", "Age": "89", "Address": "Cornagee, Co. Roscommon"}, {"Language": "English"}]}, "4758498/4748891/4786128": {"title": "Tory Hill", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0845, Page 090", "Page 090"], "url": "https://www.duchas.ie/en/cbes/4758498/4748891/4786128", "text": "\nOn the top of Tory Hill is the Devil's Chair. People make a visit to Tory Hill on the second Sunday in July picking hurts.\n\n\n\nThe first twelve days of April are generally bad, wild and harsh like March.There was once a widow who had one cow. She was very old but managed to survive all through the harsh winter to give a little milk to the poor widow. When March set in she got sick. The widow felt that if March had gone and April set in her cow would live. On the 31st of March the cow was alive and the widow's hopes were high. But march borrowed twelve days from April. On the 12th day the cow died.This is another story:-A polly heifer was sent on her\n(continues on next page)\n", "school_info": "School: Ringville, Slieverue", "metadata": [{"Location:": "Ringville, Co. Kilkenny", "Teacher:": "\nSíle de Paor\n"}, {"Informant": "Ellen Barry", "Gender": "female", "Age": "86", "Address": "Rochestown, Co. Kilkenny"}, {"Language": "English"}]}, "4742167/4741593/4815008": {"title": "Churning", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0775, Page 073", "Page 073"], "url": "https://www.duchas.ie/en/cbes/4742167/4741593/4815008", "text": "\n(continued from previous page)\ncomes in to light his pipe or takes away a coal no butter will come on.If anyone comes in he must help with the churning. The old people say \"To put their weight in the butter\". The dash and chime are parts of the churn.\n\n\n\nThe first, second and third of April are called borrowed days. March borrows them from April to skin the old cow. The skin was so tight on the old cow that March was not able to skin her in thirty-one days so she had to borrow three from April.\n", "school_info": "School: Allenwood, Robertstown", "metadata": [{"Location:": "Allenwood, Co. Kildare", "Teacher:": "\nSeán Ó Clúmháin\n"}, {"Collector": "N. Connelly", "Gender": "unknown", "Address": "Grangeclare West, Co. Kildare"}, {"Informant": "Patrick Lyons", "Gender": "female", "Address": "Grangeclare West, Co. Kildare"}, {"Language": "English"}]}, "4742099/4735839/4924662": {"title": "Laethanta na Riabhaí", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0468, Page 304", "Page 304"], "url": "https://www.duchas.ie/en/cbes/4742099/4735839/4924662", "text": "\nLaeteannta na Riabaice iseadh na trí laeteantna deiridh de'n Márta nó an chéád trí lá de'n  Abrán. Níl aon deimhin ar ciaca mí de'n dá mhí go mbaineann na laeteannta so léis ach is deimhin go mbainid le mí éigin de'n dá mhí sin. Is minic a d'airigeas gur ó Márta a bhaineadar agus gur b'iad ná trí laeteannta deiridh de'n mhí iad, agus cuid eile aca a rád gur bhiadh an chéad trí lá den Aibrean iad.Seo mar a tugadh laeteannta Riaibce orta an chéad uair. Bhí bó riabhach ann tráth éigin fadó agus bhí Márta an fhuar agus an gharb. Fuair an bhó a dóithin de'n aimsir, agus d'réir deallraimh is ar éigin a rug sí a h-anam léi. Ach pé scéal é fuair sí an buadh ar an Márta san, agus nuair a rug an chéad lá de'n Abrán uirthi, cheap sí go raibh sí saor ó bhaoghal fearta.Do léim sí ar a corp agus do labhair go neamh-spleádhach agus a dúbairt , a Márta Fealltamhail, d'á déine a thugais fúm, níor fhéadair  deireadh a cur liom, agus anois ó tá an \" t-Abrán  bog braonach\" tagaighthe, is beag é mo beann ort \". Ní  dubairt an Márta focal, ach dul agus trí lá dhiarradh ar iasacht ar an Abrán. Fuair an Márta na trí laeteannta. Agus cad do dhein sé?  Séid sé gaoth agus feartainn chómh trean in Éirinn a's do b'feidir leis é. Lean sé de'n seidead sin ar fead na dtrí lá. A leithéid de ghaoith agus d'feartainn níor tháinig roimh  agus bhí tuilltheacha thar teóra ann. Fé ceann na dtrí lá\n(continues on next page)\n", "school_info": "School: Bunaneer", "metadata": [{"Location:": "Bunaneer, Co. Kerry", "Teacher:": "\nSiobhán Ní Choncubhair\n"}, {"Collector": "Siobhán Ní Concubair", "Gender": "female"}, {"Informant": "Máire Bean Uí Cártaig", "Gender": "female", "Address": "Nedanone, Co. Kerry"}, {"Language": "Irish"}]}, "4811582/4799094/4928205": {"title": "Na Laethanta Riabhacha", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0260, Page 302", "Page 302"], "url": "https://www.duchas.ie/en/cbes/4811582/4799094/4928205", "text": "\nThere are some days of the year which are remarkable for their coldness such as the first three days of April which are called \" Na Laetheanta Ríabhacha \". They are also called the \" days of the Old Cow \". There is a tradition that all the old cows died during the last three days of March. There was an old cow who was very much afraid of those days so she went into the wood so as to escape the cold. When March was over she though she was safe but March borrowed three days from April and those days were very cold and the old cow died on the first day. She was skinned on the second day and buired on the third day. Hence, those   were called \" Na Laethanta Riabacha \".Rita O'BrienClooneygrassonBallintubber\n\n\n\nMonday is a lucky day for children to start going to school.Monday is also a lucky day for public works of any kind to start.Tuesday or Wednesday are considered lucky days to get married.Saturday is noted as a lucky and\n(continues on next page)\n", "school_info": "School: Drumatemple (C.)", "metadata": [{"Location:": "Drumatemple, Co. Roscommon", "Teacher:": "\nTreasa, Bean Uí Chuinn\n"}, {"Collector": "Rita O' Brien", "Gender": "female", "Address": "Cloonagrassan, Co. Roscommon"}, {"Language": "mixed"}]}, "4742089/4734966/4928975": {"title": "Laethanta na Bó Riabhaiche", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0466, Page 193", "Page 193"], "url": "https://www.duchas.ie/en/cbes/4742089/4734966/4928975", "text": "\nLaetheannta  na  Bó  RiabhaicheBhí sean bhó riabhach ann agus bhí sí an bhocht lag i rith an Gheimhrigh agus do gheall Márta dí go mairbheochadh sí ar fad í. Tháinig an Márta an bhreágh ar fad agus nuair a tháinig an deireadh lá de Mhárta do chaith sí a h-eirbeall san aer agus thosnuig sí ag giabhall. Do labhair sí le Márta ag tabhairt dubhsláin dí agus ag rádh \"Anois a Mhárta cad is féidir leat  a dhéanamh domh?\"  Ach fuair Márta trí lá ar iasacht ó Aibreán agus bhí an diabhal ar an aimsir ar feadh na laethe sin agus fuair an bhó bás.An  Glas  Gaibhneach Bó iongantach a b'eadh an Glas Gaibhneach. Ní fhanadh sí i n-aonáit ar aon chor. Do luigheadh sí i mbán féleith gach aon oidhche agus\n(continues on next page)\n", "school_info": "School: Doirín Darach", "metadata": [{"Location:": "Derreendarragh, Co. Kerry", "Teacher:": "\nMáire, Bean Uí Chathbhuaidh\n"}, {"Collector": "Siobhán Ní Raidhilligh", "Gender": "female", "Address": "Derreennagreer, Co. Kerry"}, {"Informant": "Mícheál Ó Néill", "Gender": "male", "Address": "Loughbrin, Co. Kerry"}, {"Language": "Irish"}]}, "4742091/4735052/4929756": {"title": "Laethanta na Riabhaiche", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0466, Page 279", "Page 279"], "url": "https://www.duchas.ie/en/cbes/4742091/4735052/4929756", "text": "\nLaetheannta na RiabhaicheLaetheannta na Riabhaiche siad na trí laetheannta deiridh den Mhárta, nó an chéad trí lá den Abrán. Níl aon deimhin ar cioca mí de'n dá mhí go mbaineann na laetheannta so léi ach is deimhin go mbainid le mí éigin den dá mhí sin.Is minic a d'airigheas gur le Abrán a bhainid. Seo mar a tugadh \"laetheannta na Riabhaiche ortha an chéad lá; bhí bó riabhach ann uair fadó agus rug Márta an-fhuar agus an-gharbh uirthe. Fuair sí a dóithin de'n aimsir agus d'réir deallraimh is ar éigin a rug sí a h-anam léi ach pé scéal é fuair sí an buadh ar an Márta san agus nuair a rug an chéad lá de'n Abrán airthi cheap sí go raibh sí saor ó bhaoghal feasta.Do léim sí as a corp agus do labhair go neamhspleádhach agus a dúbhairt a Mhárta fhealltamhail, dá déine thugais fúm, níor fhéadair deireadh a chur liom agus anois ó tá an t-Abrán bog braonach tagaighthe, is beag é mo bheann ort\"\n(continues on next page)\n", "school_info": "School: Bun Inbhir (Bunaneer)", "metadata": [{"Location:": "Bunaneer, Co. Kerry", "Teacher:": "\nSiobhán Ní Chonchubhar\n"}, {"Language": "Irish"}]}, "4742093/4735138/4930247": {"title": "Laethanta na Bó Riabhaí", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0466, Page 362", "Page 362"], "url": "https://www.duchas.ie/en/cbes/4742093/4735138/4930247", "text": "\nLaethannta na bó ríabhaiche síad an dá lá deiridh de Mhárta agus an cead lá de Abhrán. Is amhlaigh a cuir an bó ríabhach an Mhárta dhí gan an bás dá bhreith agus annsan leis an teasbach do thug sí dubhslán fé Márta gan aon dá cuid do dheanamh da dhícheall as san amach. Annsan iseadh do bhailig an Márta na gaotha go léir cuige ach do theip air an bó marbhadh, ach do fuair sé lá ar íasacht ó Abhrán, agus do cailleadh an tsean bó ríabhach le fúacht is le hanfa an 3adh lae.\n\n\n\nBhíadh na daoiní ana críona fadó sara caithidís bróga. Tá trácht ar na daoini nár caith bróg ríamh agus bhí cuid mhaith aca mór thímcheall annseo. Is gnáthach le leabhaí an lae indiú dul gan aon bhróg tamall den bhliadain\n(continues on next page)\n", "school_info": "School: Lóthar", "metadata": [{"Location:": "Loher, Co. Kerry", "Teacher:": "\nB. Ní Mheidhre\n"}, {"Collector": "Siobhán Ní Chonaill", "Gender": "female"}, {"Informant": "Domhnaill Uí Chonaill", "Gender": "male", "Age": "50"}, {"Language": "Irish"}]}, "4811604/4800978/4938478": {"title": "An Bhó Riabhach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0274, Page 197", "Page 197"], "url": "https://www.duchas.ie/en/cbes/4811604/4800978/4938478", "text": "\nThe Bó Riabhach was an enchanted cow. She came ashore in an island off the Crow called Oileán Aolbhach. She used to feed in certain places in this parish. She took a bite in a field in Killaugh called Gort na nDearantaí and she took another bite in a field in Kilkinnihan called Cnáit. She came ashore in the end of March and she said in Irish.\" Mo grádh fé an Earraig tá an geimhreadh caithte \"March borrowed a day from April and the day came pouring rain and the Bó Riabhach got perished and she died.\n", "school_info": "School: An Chathair Mhór", "metadata": [{"Location:": "Knockroe Middle, Co. Cork", "Teacher:": "\nDonncha Ó Súilleabháin\n"}, {"Collector": "Dermot Harrington", "Gender": "male", "Age": "15"}, {"Informant": "Batt Murphy", "Gender": "male", "Age": "70", "Address": "Kilkinnikin West, Co. Cork"}, {"Language": "English"}]}, "4742124/4738107/4950563": {"title": "Scéal - Ar Laethanta na Riabhaiche", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0474, Page 269", "Page 269"], "url": "https://www.duchas.ie/en/cbes/4742124/4738107/4950563", "text": "\nScéalAr laetheannta na RiabhaicheTugtar laetheannta Riabhaiche ar an dá lá deiridh don Mhárta agus an cead lá don Abrán.  Seo mar a tugadh an ainm seo ar na laetheannta. Bhí bó riabhach ann fadó agus thánaig Márta cruaidh gaothmhar garbh uirthi.  Fuair an bhó seo buadh ar an Mhárta go h-airithe.  Bhí áthas uirthi nuair a thánaigh an “céad lá do Abrán agus do labhair sí go neamh-spleadhach agus adubhairt, “Táim bog ort anois tá an t-Abrán bog braonach tagaithe agus agus níl beann ar bith agam ort.”  Cad do dhein an Mhárta ach iompúghadh siar arís agus iasacht lae d’iarraidh ar an Abrán.  Fuair an Márta an lá.  Do shéid sé go cruaidh a leithéid d’aimsire ní fheacaidh aoinne riamh é ó shoin.  Chuir an lá sin deire leis an mbuin riabhaigh.  Sin é an fáth gur tugadh laetheannta na Riabhaiche ar na laetheannta ar na laetheannta sin.  Bhíodh aoidhre ag seasaimh leis na buaibh i gcaithimh laetheannta na Riabhaiche fadó ar eagla go raghaidís i bpoll.  Ní chuirtear puínn spéise i laetheannta na Riabhaiche anois.  Cheapadh na sean-daoine go dtárlóchadh i rith laetheannta na Raibhaiche.  Is minic a bhíonn laetheannta na Riabhaiche go fuar fliuch.Seán Ó Dálaigh   21/11/1934Seán Ó Morán d’aithris\n", "school_info": "School: Caisleach", "metadata": [{"Location:": "Cashlagh, Co. Kerry", "Teacher:": "\nPádruig Breathnach\n"}, {"Collector": "Seán Ó Dálaigh", "Gender": "male"}, {"Informant": "Seán Ó Moráin", "Gender": "male"}, {"Language": "Irish"}]}, "5008880/4963258/5083390": {"title": "The Riabhach Days", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0678, Page 125", "Page 125"], "url": "https://www.duchas.ie/en/cbes/5008880/4963258/5083390", "text": "\nThe Riabhach days are the last three days of March or the first three days of April. There was a speckled cow and a cold rough March caught her in the fields. She was very tired coming home. When March passed and when the first of April came she thought she was safe. She said \" Now bad March you could not kill me. March never said a word but borrowed three days from April and had a terrible storm. The cow was drowned. Great care was taken of the cows on the Riabhach days for fear of any harm from floods etc. Eibhlís Ní Cholmáin N.T. Paddy MurphyCross RoadsMellLived always in Mell\n", "school_info": "School: Mell, Mell N. School, Drogheda", "metadata": [{"Location:": "Mell, Co. Louth", "Teacher:": "\nE. Ní Cholmáin\n"}, {"Collector": "Eibhlís Ní Cholmáin", "Gender": "female", "Occupation": "teacher", "Address": "Mell, Co. Louth"}, {"Informant": "Paddy Murphy", "Gender": "male", "Address": "Mell, Co. Louth"}, {"Language": "mixed"}]}, "5070770/5061039/5093924": {"title": "The Borrowing Days", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0994, Page 087", "Page 087"], "url": "https://www.duchas.ie/en/cbes/5070770/5061039/5093924", "text": "\nThe \"Borrowing Days\" are the first three days of April. The weather during these three days is cold and often colder than March itself. On this account  it is said that March has borrowed these three days from April to kill the Old Cow.The old story says that when the Old Cow was let out to graze she kicked up her heels and ran through the field with joy because March was out.But March borrowed three days from April and killed the Old Cow.These three days are called thus, The \"Borrowing Days\".Sean McGeeKilnaleckCo CavanInformation obtained from:-Patrick McGee (60)\n", "school_info": "School: Kilnaleck (B.)", "metadata": [{"Location:": "Kilnaleck, Co. Cavan", "Teacher:": "\nP. Ó Máirtín\n"}, {"Collector": "Sean Mc Gee", "Gender": "male", "Address": "Kilnaleck, Co. Cavan"}, {"Informant": "Patrick Mc Gee", "Gender": "male", "Address": "Kilnaleck, Co. Cavan"}, {"Language": "English"}]}, "5070791/5064192/5096077": {"title": "The Red-Haired Woman", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1001, Page 099", "Page 099"], "url": "https://www.duchas.ie/en/cbes/5070791/5064192/5096077", "text": "\nIf you meet a red haired woman on the road on a Friday morning you will have a big pile of money before night. He went to the fair with three cattle. The minute he went to the fair he met a man ho gave him twice the price of the cattle. When he was coming home he found a \"fiver\" on the road. That was the luck that man had on the road that day.\n\n\n\nWhen people are setting a hatching of eggs they never set them on Saturday or Tuesday because the hen gets sick or the eggs are bad.\n\n\n\nThe three borrowed days are the first, second and third days of April. There was an old cow long ago and when March was out she let three leaps because she lived during the month of March. Then\n(continues on next page)\n", "school_info": "School: Virginia (B)", "metadata": [{"Location:": "Virginia, Co. Cavan", "Teacher:": "\nE. Ó Raghallaigh\n"}, {"Collector": "Francis Doyle", "Gender": "male", "Address": "Burrenrea, Co. Cavan"}, {"Informant": "Matthew Daly", "Gender": "male", "Address": "Burrenrea, Co. Cavan"}, {"Language": "English"}]}, "5070831/5068632/5099189": {"title": "The Borrowing Days", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1014, Page 271", "Page 271"], "url": "https://www.duchas.ie/en/cbes/5070831/5068632/5099189", "text": "\nThe last day of March and the first two days of April are said to be the borrowing days. One time an old cow got it very hard to live during the winter months. When March came it said it would skin the old cow. She lived during the month of March and when the last day of March came the cow began jumping and throwing her heels in the air. March borrowed three days from April and they were so cold that the old cow died.\n", "school_info": "School: Corlatty Carroll", "metadata": [{"Location:": "Corlattycarroll, Co. Cavan", "Teacher:": "\nJas. Maguire\n"}, {"Collector": "John Lynch", "Gender": "male", "Address": "Drumeague, Co. Cavan"}, {"Language": "English"}]}, "5009050/4981145/5117180": {"title": "The Lore of Certain Days", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0727, Page 202", "Page 202"], "url": "https://www.duchas.ie/en/cbes/5009050/4981145/5117180", "text": "\n(continued from previous page)\nLore connected with moving from one residence to another. Saturday's flitting is a short sitting.\n\n\n\nLong ago there was an old cow and she was afraid of her life that the month of March would sweep her. But March had pity for her and he did not go too hard on her.When the last day of March came. She began jumping and giving all sorts of insults to the month of March. And said \"Now I am over March and it never took a feather out of me.\" When March heard this he was very vexed. He went to the month of April and got three days from it. The first day there was snow and rain. The second day the old cow was lying on her back in a ditch. The third day the shin was taken off her\n(continues on next page)\n", "school_info": "School: Raharney (C.)", "metadata": [{"Location:": "Raharney, Co. Westmeath", "Teacher:": "\nMrs. Conway\n"}, {"Language": "English"}]}, "5044574/5023460/5138659": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0801, Page 294", "Page 294"], "url": "https://www.duchas.ie/en/cbes/5044574/5023460/5138659", "text": "\nIt is said that April borrows three says from March to bury the \"old cow\" It takes nine days in all :- three days to \"kill her\". three days to \"skin her\" and three days to \"bury her.\" But this is only a story. It is always remarked that the borrowing days are very cold - so cold that it would nearly \"skin a cow.\"The day thought lucky for planting potatoes and cabbage was Friday. Tuesday was counted lucky to sow wheat and oats.It is said if people have not their potatoes soon before the 14th of March they will have very bad crop. It was thought unlucky to change from one house to another on Friday. It was also thought unlucky to apply remedies to ailments on Wednesday.If Candlemas day be fair and brightWinter will have another flightbut if Candlemas day be dull andgrew, Winter is gone and Summer will stayIf a foal was born on Whit Sunday it was supposed to kill itself or kill\n(continues on next page)\n", "school_info": "School: Ród (B.)", "metadata": [{"Location:": "Rhode, Co. Offaly", "Teacher:": "\nP. Ó Maoldomhnaigh\n"}, {"Collector": "Sean Kelly", "Gender": "male"}, {"Informant": "Teresa Mooney", "Gender": "female", "Address": "Rhode, Co. Offaly"}, {"Language": "English"}]}, "5044615/5026051/5141149": {"title": "The Borrowed Days", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0811, Page 067", "Page 067"], "url": "https://www.duchas.ie/en/cbes/5044615/5026051/5141149", "text": "\nThere are a great deal of stories told about the borrowed days. There is one of them.The borrowed days occur on the first, second and third of April. It is said that there was an old cow and March was so hard that she thought she would not escape death. But she did and March had to borrow three days from April to kill her. On the first day she died and on the second day she was skinned and on the third day she was buried.\n", "school_info": "School: Ballycumber (B.), St Ciaran's", "metadata": [{"Location:": "Ballycumber, Co. Offaly", "Teacher:": "\nG. Ó Súilleabháin\n"}, {"Collector": "Joseph Geraghty", "Gender": "male", "Address": "Ballycumber, Co. Offaly"}, {"Informant": "Mr J. Geraghty", "Gender": "male", "Age": "42", "Address": "Ballycumber, Co. Offaly"}, {"Language": "English"}]}, "5162156/5159487/5181189": {"title": "An tSeanriabhach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0656, Page 256", "Page 256"], "url": "https://www.duchas.ie/en/cbes/5162156/5159487/5181189", "text": "\nAn t-Sean Riabhach:Fado riamh sa tsean aimsear bhí seana bhó ann go dtugaidís an tSean-Riabhach uirri. Nuair a bhí sí tar éis an Mhárta a chur dí agus  droch Mhárta ba eadh é, \"Anois a Mhárta\" arsa sí, \"mise neamh-spleádhach ledh dhicheall ar feadh bliadhna eile\". \"Fan go réidh\", ars an Mhárta. D'iarr an Mhárta trí lá ar an Abrán chun deire a chur leis an tSean- Riabhach agus fuair sí na trí lá ó'n Abrán. Tháinig an chéad lá fluich, fuar, gaothmhar, níor tháinig a leithéid de lá ó shoin agus ní bhfuair an tSean- Riabhach teacht amach ó'n claidhe. Tháinig an tarna lá go breágh, grianmhar mar a thiocfadh lá sa Meitheamh agus chaith an tSean- Riabhach an lá 'á iompódh féin ós chionn na gréine. Tháinig an tríomhadh lá arís fiadhain, fuar, fliuch agus bhí an tSean- Riabhach gairid do bheith cailte leis an ocras. Chonnaic sí féar glas ag fás go breágh sa tuinn a bhí gairid di agus rith sí amach ó'n claidhe leis an ocras 'ghá ithe agus bascadh í. B'in í deire an tSean- Riabhach, \"bíodh san agat anois a shean-Riabhach\", ars an Mhárta.\n\n\n\nDomhnall an Tuagha:Bhí fear ann fadó a dtugaidís Domhnall an Tuagha air. Do chuaidh sé isteach go dtí siopa búistéara lá agus bhí sé ag féachaint ar an mbúistéar ag gearradh suas beithidhigh a bhí marbh aige. Nuair a bhí an beithidheach gearrtha suas ag an mbúistéar d'fhiafruigh sé de Domhnall an bhfeaca sé a leithéid de iarracht de thuagh ag aoinne riamh. Dubhairt domhnall go bhfeaca sé. \"Cuirfidh mé púnt leath ná feaca tú,\" ars an mbuistéar.\n(continues on next page)\n", "school_info": "School: Baile Nua, Baile Mhic Cairbre", "metadata": [{"Location:": "Clonanav, Co. Waterford", "Teacher:": "\nPádraig Ó Cearbhaill\n"}, {"Informant": "R. Ó Riain"}, {"Language": "Irish"}]}, "4921775/4905996/5196303": {"title": "Laethanta na Bó Riabhaí", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0361, Page 429", "Page 429"], "url": "https://www.duchas.ie/en/cbes/4921775/4905996/5196303", "text": "\nBy Denis Bowler, CoolroemoreBíonn mór-chuid feirmeóirí leibideacha ann nach mbíonn dóthain an Earraig féin de'n bhféur tirm acu dos na buaibh, agus go mbíd ar tógáil sar a mbeireann an raidhse amuigh ortha.Bhí sean-bhó i n-áit éigin agus bhí droch-bhail uirthe le linn an Mhárta. Bhí eagla uirthi go marbhóchadh fuacht agus feannaid an Mhárta í, mar a marbhuigheann sé na sean-daoine. Seadh, dob'fhada léi go raibh an Márta imthighthe, agus nuair a tháinig an lá deirionnach de, bhí eirighe croidhe uirthe agus ars ise, \" Bíodh an diabhal agat anois, a Mhárta, táím annso it aimhdheoín \"Cad a dhein an Márta acht iasacht trí lá d'fhagháil  ó'n Aibreán. Thosnuig an chéad lá le gaoith adtuaidh - gaoth dubh nimhneach, agus sioc istoidhche. An tarna lá, do chaith flich-shneachta agus cloch-shneachta anuas, go ndeachaidh an fuacht go smior sa bhudóig bhoicht. Tháinig séideán sneachtaidh an oidhche sin a líon gach poll is póirse agus d'fhág  coinnle reódha  ar sileadh le díon is fál. Bhí carnáin sneachtaidh is leach-oidhre ins gach áit an tríomhadh lá agus fuacht ann a raghdh trí cláir déil. Bhí an bhó bhocht ar a tárr i n-áirde marbh roimh oidhche an tríomhadh lá. Tugtar laetheannta na bó riabhaiche ar thrí lá tosaigh an Aibreáin, ó shoin.\n", "school_info": "School: Ladhar (B.), Bán-Tír", "metadata": [{"Location:": "Lyre, Co. Cork", "Teacher:": "\nPádraig Ó Halladáin\n"}, {"Collector": "Pádraig Ó h- Áilleadáin", "Gender": "male"}, {"Informant": "Denis Bowler", "Gender": "male", "Address": "Coolroe More, Co. Cork"}, {"Language": "Irish"}]}, "5162125/5156167/5197143": {"title": "Story - The Seanriabhach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0569, Page 054", "Page 054"], "url": "https://www.duchas.ie/en/cbes/5162125/5156167/5197143", "text": "\nStory: THE SEAN RIABHACHThere was once an old speckled cow. The winter came cold and wet, but it did not kill the cow. Her owner thought she would live for another year, but March made a bet that it would kill the old cow. March came and went and still she was alive. So it had to borrow ten days from April to kill the cow. Before the end of the ten days the old cow died.Since then the first ten days of April are called , “The Sean Riabhach’\n", "school_info": "School: Baile an Ghaorthaidh, Cluain Meala", "metadata": [{"Location:": "Ballingeary East, Co. Tipperary", "Teacher:": "\nSeán Ó hAodha\n"}, {"Informant": "Mr Edmond O' Brien", "Gender": "male", "Address": "Husseystown, Co. Tipperary"}, {"Language": "English"}]}, "5215782/5209210/5219402": {"title": "An Chaoi a Fuair Trí Lá na Riabhach a Ainm", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0092H, Page 04_018", "Page 04_018"], "url": "https://www.duchas.ie/en/cbes/5215782/5209210/5219402", "text": "\nAn caoí a fúair Trí lá na Riamhuigh a anamTugtar Tír lá na Riamhuig ar an trí céad lá de mí na h-Abrán.Deirtear fadhó go raibh sean bó ann agus bhí sí ag dul in aois go mór.Bhí faithchios mór aiche roimh gaoth na Márta, acht nuair a chonnaic sí an céad lá de mhí na h-Aibrán do chaith sí suas\n(continues on next page)\n", "school_info": "School: Doire / Derrew", "metadata": [{"Location:": "Derrew, Co. Mayo", "Teacher:": "\nCaitlín Bean Uí Maolalaidh\n"}, {"Collector": "Maighréad Ní Ghiobúin", "Gender": "female"}, {"Language": "Irish"}]}, "5215614/5207172/5236115": {"title": "Fir Cáiliúla", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0090D, Page 12_061", "Page 12_061"], "url": "https://www.duchas.ie/en/cbes/5215614/5207172/5236115", "text": "\nSin é ana céád trí lá de mhí an Aíbreán agus deirtear go raibh sean bhó ann fadó agus ceap sí dá mhairbeócadh sí go dtí an céad lá d'Aíbreán go mbéadh sí sábáilte, acht fuair an Aibreán trí laethe o Aíbreán agus do marbhuigeadh an tsean bhó.\n", "school_info": "School: Doirín Dáimh Dheirg / Dereendafderg", "metadata": [{"Location:": "Derrindaffderg, Co. Mayo", "Teacher:": "\nLiam Seóighe\n"}, {"Collector": "Síghle Ní hAodha", "Gender": "female", "Address": "Derrindaffderg, Co. Mayo"}, {"Language": "Irish"}]}, "5215813/5214857/5237434": {"title": "Trí Lá na Riabhaiche", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138D, Page 06_004", "Page 06_004"], "url": "https://www.duchas.ie/en/cbes/5215813/5214857/5237434", "text": "\nOnce upon a time there lived an old cow and she got it very hard to live through the winter.  When the end of March was out she turned her back to March and said that she did not care that for it.  March heard her and he borrowed three days off April.  These three days came cold and rough and at the end of the third day the old cow was skinned.  these three days are called \"Trí Lá na Riabhaiche\",\n", "school_info": "School: St Bridget's", "metadata": [{"Location:": "Derrymore, Co. Mayo", "Teacher:": "\nMáire Uí hOistín\n"}, {"Collector": "Seán Máirtín Caoigín Ó hOistín", "Gender": "male"}, {"Informant": "Tadhg Ó hOistín", "Gender": "male", "Address": "Derrymore, Co. Mayo"}, {"Language": "English"}]}}