{"4428079/4375936/4450210": {"title": "Snaidhm na bPéist", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0153, Page 162", "Page 162"], "url": "https://www.duchas.ie/en/cbes/4428079/4375936/4450210", "text": "\nSnaidhm na bPéist.Obtain a length of twine. A short bit, (about 12\" or 14\") is preferable as, even if you make \"Snaidhm na bPéist\" correctly with a long bit, certain difficulties are experienced. Let us say the following illustictes a bit of twine-:L-------------R.We call the end at first held in left hand L and similarly the end held in right hand R. If instructions are not carefully read, \"Snaidhm na bPéist\" will not be the result of your efforts.  However to continue is. Make oretinary crossing of the ends and then you will hold L in right hand and R in left hand. Continue and make the loop and you will still have L in right hand and R in left hand. Also you will notice and this is important, that you made the loop from right to left (or maybe you did it from left to right) I cannot explain any clearer on paper than to say that the loop was made in one of two ways, which ways I hope, I have successfully endeavoured to describe above. Having made one loop, it is best to\n(continues on next page)\n", "school_info": "School: Eiscreach", "metadata": [{"Location:": "Eskeragh, Co. Mayo", "Teacher:": "\nSeán Ó Raghallaigh\n"}, {"Language": "English"}]}, "4427853/4350817/4453497": {"title": "Leigheasanna", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0099, Page 120", "Page 120"], "url": "https://www.duchas.ie/en/cbes/4427853/4350817/4453497", "text": "\nDá g-casfaidhe cloch le duine agus uisge i g-clais ann, agus dá g-cuimileach  an duine an t-uisge ar an n-gart do leigheaseadh sé é.\n\n\n\nDá marbhuigheadh duine sionnach , ba cheart dó an teanga a bhaint dhe agus í a choinneál . Dá g-cuimileadh an duine an teanga ar loit do leigheasóchadh sé é.\n\n\n\nThe old people believed that if a calf had a worm in his tail, there was a way of curing it with a rope. When a rope would be knotted\n(continues on next page)\n", "school_info": "School: Koilmore", "metadata": [{"Location:": "Cuilmore, Co. Mayo", "Teacher:": "\nSéamus Ó Murchadha\n"}, {"Language": "English"}]}, "4427930/4358792/4454972": {"title": "St Patrick's Cabbage", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0117, Page 56", "Page 56"], "url": "https://www.duchas.ie/en/cbes/4427930/4358792/4454972", "text": "\nAn herb, known as St. Patrick's Cabbage or in Irish as \"Cruag Phádraigh\" was supposed to be a great cure for all classes of cuts and burns.While rubbing the herb to the affected part it was customary to say Five 'Our Fathers', five 'Hail Marys' and five 'Glorias'. If the rubbing and prayers did not go together the cure failed.\n\n\n\nWhen curing a person of worms in ancient times the people made what was called the \"worm's knot\" and laid it on the stomach of the sufferes,saying while doing so\"O Lord banish the evils that beset this child In the name of the Father and of the son and of the Holy Ghost Amen\"\n\n\n\nWhen an individual got warts it was believed that he could be cured of them by applying water which would be lodged in the hollow of a stone to the warts saying while doing so: Pisg an cloch an aeramFan aca taoramTá mé geara One trí\n", "school_info": "School: Páirc Íseal (B.)", "metadata": [{"Location:": "Lowpark, Co. Mayo", "Teacher:": "\nSeán Ó Caiside\n"}, {"Language": "English"}]}, "4428325/4395096/4460559": {"title": "Leigheas na bPéisteog", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1046, Page 19", "Page 19"], "url": "https://www.duchas.ie/en/cbes/4428325/4395096/4460559", "text": "\nBhí fear ina chomhnuidhe i Málainnbheag ar bhainm do Seán Ó’Casaide. Bhí léigheas peisteóg ag Seán agus thigeadh daoine as gach uile áit le Seán as léigheas a dheánamh dobhtha. Léigheasadh sé beithidigh comh maith le daoine.Bhí fear gallda ina chomhnuidhe i Málainn-Mór ar bhainm Seosamh Blaine agus ní rabh aige acht bhó ámhain. Trathnóna amháin nuair a bhí an bhó ag ól deoch uisge as an t’sruthan ‘slug sí dairb, agus i gcionn tamaill d’ath sí suas. Tugadh isteach fear tuigseach agus dubhairt sé nach rabh sé abalta rud ar bith a dheánamh de’n bhó. “Tá eagla orm (arsa seisean) go mbeídh sé marbh ar maidin”.Smaointigh siad ar Séan Ó’Casaide agus h-iarradh ar Seosamh Blaine imtheacht leis agus Seán a Fhághail.Nuair a shroic sé Málainnbheag bhí sé an mheadón oidhche agus bhí Seán ina luighe. Sgairt sé air agus d’innis a ghnaithe dó “Deán an leigheas damh i n-ainm Dé”. (chaithfidh an léigheas a’ iarraidh in ainm Dé) arsa seisean.Chait Seán a stoca amach ar an fhuinneóig agus d’iarr ar Sheosamh Blaine é a cuimilt ar bholg na bó agus trí bhuille a bhuaileadh sa druim oirtí i n-ainm na Trionóide. Rinneadh seo agus ó’n bomaite a rinneadh an léigheas bhí an bhó ag biseadh, agus\n(continues on next page)\n", "school_info": "School: An Mhálainn Bheag", "metadata": [{"Location:": "Malin Beg, Co. Donegal", "Teacher:": "\nMáire Ní Bheirn, Seosamh Ó Baoighill\n"}, {"Informant": "Anna Morra", "Gender": "female", "Age": "75", "Address": "Malin More, Co. Donegal"}, {"Language": "Irish"}]}, "4427989/4364547/4468246": {"title": "Snaidhm na bPéist", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0130, Page 517", "Page 517"], "url": "https://www.duchas.ie/en/cbes/4427989/4364547/4468246", "text": "\nSeo leigheas ar ghalar a thigeann ar ghamhna óga. Cineál arraing a bhualann iad, agus bíonn siad ag éirigh, agus ag luighe; is cosamhail go mbíonn an-phían orrtha.Deir cuid de na daoine gur péistí a bhíonn ionta. Gamhain a bhíonn ag eagcaoint mar seo cuireann siad isteach sa stabla é. Gheibheann siad ribín sioda, agus déanann siad snaidhm leis (cosmhail le snaidhm an mhairnéalaigh) os cionn an ghamhna in ainm an Athar, an Mhic, agus an Spiorpaid Naoimh. Craitheann siad braon uisce coisreactha annsin air. Tugann siad deoch uisce agus salann measgtha nn dó agus tigeann biseach air.\n", "school_info": "School: Poll an tSómais", "metadata": [{"Location:": "Pollatomish, Co. Mayo", "Teacher:": "\nProinnsias Mac Gearailt\n"}, {"Language": "Irish"}]}, "4428326/4395304/4499776": {"title": "Snaidhm na Péiste", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1046, Page 400", "Page 400"], "url": "https://www.duchas.ie/en/cbes/4428326/4395304/4499776", "text": "\nSnaidhm a PéistAr deanadh an tSnaidhm os coinne an bó [sic] bfuil tinneas builg ortha abar seo: -Órtha do rinne Colmcille do aon bhó bhán nna na Caillighe Duibhe,cos ar mhuir, cos ar tírSgaoil snaidhm agus léigheas builg.Gnithear an tsnaidhm os cionn bá no gamhain ar a bhfuil an Buinneach.Gnithear mar seo é:Beir greim ar sreangan. Cuir an tsnaidhm bogha air ach na teann é. Ag an tus cuir ceann do lámhe deise os cionn cenn do láimhe cle. Conglenuig an lúb fosgailte le do da luideoig. Cuir an ceann sgaoite taobh do laime deise síos fríd an lubh ata idir do dá luideoig. Tabhair amach é agus cuir síos 7 ? lár an sniadhma. Tarraing da cheann an sreangain agus béid an snaidhm réidtighthe agat.\n(continues on next page)\n", "school_info": "School: Mín an Aodhaire", "metadata": [{"Location:": "Meenaneary, Co. Donegal", "Teacher:": "\nSeaghan Ó Coinnigeáin\n"}, {"Collector": "Seaghan Ó Coinnigeáin", "Gender": "male", "Address": "Gannew and Curreen, Co. Donegal"}, {"Language": "Irish"}]}, "4428087/4376914/4504410": {"title": "Snaidhm den bPiast", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0634, Page 513", "Page 513"], "url": "https://www.duchas.ie/en/cbes/4428087/4376914/4504410", "text": "\nThe following charm is very much used around the hill sides of Ballyduff to stop bleeding in human beings or in animals and also to cure colic.1. Get a thick piece of cord about 9 inches in length, hold palms of hands turned up and catch a grip of the cord in each hand. (2) Twist piece in left hand over and then under piece in right draw until a loop is formed (3) Now the lift hand piece is put over and then brought under the left hand piece - two rings of cord now appear. These will fasten into knots when the cord is tightened.4. Pass right hand piece under first ring and then under outer edge of 2nd loop.5. Now catch two ends of cord and pull, and all knots will open and piece of cord will be quite straight. When the person is making first loop \"In the name of the Father\" is said. When making second loop \"and of the Son\". When passing cord through two loops \"and of the Holy Ghost\". Then before pulling cord open, the breath is blown on the cord and when saying \"Amen\", pull open.This is done up to the present day and it is always successful. It has to be done three times, and a few weeks ago, it was done\n(continues on next page)\n", "school_info": "School: Baile Dubh, (C.)", "metadata": [{"Location:": "Ballyduff, Co. Waterford", "Teacher:": "\nBríd, Bean Uí Dhriaghail\n"}, {"Collector": "B. Prior", "Gender": "female", "Occupation": "principal", "Address": "Ballyduff, Co. Waterford"}, {"Informant": "Mr J. Walshe", "Gender": "male", "Age": "60", "Address": "Coolishal, Co. Waterford"}, {"Language": "mixed"}]}, "4569057/4567613/4574592": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0037, Page 0062", "Page 0062"], "url": "https://www.duchas.ie/en/cbes/4569057/4567613/4574592", "text": "\n1. Heard from my father M. Lyons2. Shrule Dunmore Tuam3. Farmer4. 5. Heard by him from his parents.Turpentine is put on loaf sugar and given to children who are suffering from worms.Snails are allowed to crawl on and suck boils in order to cure them. People dring lime water to cure boils and they also drink milk in which there is sulpher to cure them.People suffering from consumption from consumption drink asses' milk.\n(continues on next page)\n", "school_info": "School: Dún Mór (cailíní)", "metadata": [{"Location:": "Dunmore, Co. Galway", "Teacher:": "\nEibhlín Halliday\n"}, {"Collector": "(name not given)", "Gender": "female", "Address": "Shrule, Co. Galway"}, {"Informant": "M. Lyons", "Relation": "parent", "Gender": "male", "Occupation": "farmer", "Address": "Shrule, Co. Galway"}, {"Language": "English"}]}, "4569059/4567890/4583382": {"title": "Cure for Worms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0037, Page 181", "Page 181"], "url": "https://www.duchas.ie/en/cbes/4569059/4567890/4583382", "text": "\nCure for Worms in animals or children.Edward Burke of Carnaseer practised this cure for years. He got a piece of twine and holding it over the child or animal affected he would proceed to tie nine knots in such a way that when the knotting was completed the whole thing became unloosed simply by catching the string by both ends and pulling. He used no form of words during the operation. He claims that the cure was always successful. The cure was known as \"Nine Knots\". Another Cure for WormsA woman took her child who was suffering from worms to an old man in Claddagh. Several attempts had previously been made to cure this child but without success. The child was simply wasting away. The old man got the child to sit on a chair near a table. He then got a plate of oatmeal and placed it on the table and repeated a form of word over the plate. When the mother looked at the plate she saw a number of worms were\n(continues on next page)\n", "school_info": "School: Sean-Bhaile Mór", "metadata": [{"Location:": "Shanballymore, Co. Galway", "Teacher:": "\nPádraig Ó Donnabháin\n"}, {"Collector": "Patrick O' Donovan", "Gender": "male", "Occupation": "teacher", "Address": "Dunmore, Co. Galway"}, {"Language": "English"}]}, "4497723/4344686/4606476": {"title": "A Cure for a Cow in the Fairies", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0086, Page 92", "Page 92"], "url": "https://www.duchas.ie/en/cbes/4497723/4344686/4606476", "text": "\n(continued from previous page)\n92A woman was one day going through the fields with a child on her back. After a time she noticed the child chewing something She took it and saw that it was an eve stone which the fairies had thrown at the child\n\n\n\nCure for a Cow with a swelled StomachIf a cows stomach swelled up it was believed to be caused by a little reptile called a deirge which can be found in any bog-hole. One of these deirgs was supposed to have found its way inside the cow and to have caused the swelling. To effect a cure another deirg should be got and he should be put on a crook over the fire and roasted to death. This was supposed to kill the deirg in the cow and cue her.\n\n\n\nThe Worm KnotIf a cow or a horse or any other animal was attacked with a severe pain it was believed to be caused by a worm which was knotted in the cows intestines. To effect a cure a piece of string should be taken and it should be knotted in the shape of the figure 8 over the animals back. Then by twisting one end of the string through the loops of the knot and by\n(continues on next page)\n", "school_info": "School: Skerdagh, Newport", "metadata": [{"Location:": "Skerdagh Lower, Co. Mayo", "Teacher:": "\nJames Deffely\n"}, {"Language": "English"}]}, "4613671/4607045/4623971": {"title": "Pigs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0016, Page 151", "Page 151"], "url": "https://www.duchas.ie/en/cbes/4613671/4607045/4623971", "text": "\n(continued from previous page)\nbe wrong to take them back\n\n\n\na Mare = You are not suppose to put a brood mare under a cart to carry a corpse. Thats over since 1913. this is when the old dispinsation came to an end.\n\n\n\nI saw it done but I forget hour to do it now. Its done with a bit of string 2 or 3 yards long. Put three knots on the string a few inches apart.These knots if made properly when two ends of the string are caught and pulled, the knots are pulled should come asunder as if there was no knot at all put on the string. It is very difficult to do. You may do it now and fail to do it in a few minutes time.\n\n\n\nThis is a cure. These knots are made on the side of the calf and done three times on the name of the Father the Son and the Holy Ghost.I saw my father doing it several times. My father saw them cure worms out in Lincolshire. He saw a farmer getting ready\n(continues on next page)\n", "school_info": "School: Gort na Díogha", "metadata": [{"Location:": "Gortnadeeve West, Co. Galway", "Teacher:": "\nSéamus Ó Dochartaigh, Bean Uí Dhochartaigh\n"}, {"Language": "English"}]}, "4613671/4607045/4623972": {"title": "Pigs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0016, Page 151", "Page 151"], "url": "https://www.duchas.ie/en/cbes/4613671/4607045/4623972", "text": "\n(continued from previous page)\nbe wrong to take them back\n\n\n\na Mare = You are not suppose to put a brood mare under a cart to carry a corpse. Thats over since 1913. this is when the old dispinsation came to an end.\n\n\n\nI saw it done but I forget hour to do it now. Its done with a bit of string 2 or 3 yards long. Put three knots on the string a few inches apart.These knots if made properly when two ends of the string are caught and pulled, the knots are pulled should come asunder as if there was no knot at all put on the string. It is very difficult to do. You may do it now and fail to do it in a few minutes time.\n\n\n\nThis is a cure. These knots are made on the side of the calf and done three times on the name of the Father the Son and the Holy Ghost.I saw my father doing it several times. My father saw them cure worms out in Lincolshire. He saw a farmer getting ready\n(continues on next page)\n", "school_info": "School: Gort na Díogha", "metadata": [{"Location:": "Gortnadeeve West, Co. Galway", "Teacher:": "\nSéamus Ó Dochartaigh, Bean Uí Dhochartaigh\n"}, {"Language": "English"}]}, "4613725/4613153/4644972": {"title": "Cure for Rotha Péiste in a Calf", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0409, Page 105", "Page 105"], "url": "https://www.duchas.ie/en/cbes/4613725/4613153/4644972", "text": "\nWho ever sees the calf first, if it is a man, he should hit it with his cap three times and say \"In the name of the Father, Son and Holy Ghost\" three rimes, or if it is a woman she should hit it with the corner of her\n(continues on next page)\n", "school_info": "School: Dromclough (C.),", "metadata": [{"Location:": "Kilcarra Beg, Co. Kerry", "Teacher:": "\n-\n"}, {"Informant": "Mrs Mary Kirby", "Gender": "female", "Age": "72", "Address": "Mountcoal, Co. Kerry"}, {"Language": "English"}]}, "4658451/4657008/4661081": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0226, Page 066", "Page 066"], "url": "https://www.duchas.ie/en/cbes/4658451/4657008/4661081", "text": "\n(continued from previous page)\nsomething into his ear. and he got on his back and swan Garradice lake home. He lent him to another man and he put the straddle on him and he died.\n\n\n\nThis is the cure for the worms.The following prayer is written down and then folded in the shape of an \"Agnus Dei\" and hung on the childs neck. This is the prayer.\"The power of God the Father. The wisdom of God the Son, The virtue of  the Holy Ghost. Defend thee from the infirmities of the worms. May they be converted and changed into water when they\n(continues on next page)\n", "school_info": "School: An Dubh-Chearn", "metadata": [{"Location:": "Doochorran, Co. Leitrim", "Teacher:": "\nBean Mhic an Ríogh\n"}, {"Collector": "Kathleen P. Harte", "Gender": "female", "Address": "Aghavilla, Co. Leitrim"}, {"Informant": "Mrs Thomas Murray", "Gender": "female", "Address": "Keenheen, Co. Leitrim"}, {"Language": "English"}]}, "4701736/4697398/4714653": {"title": "Cure of Worms in Horses", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0181, Page 166", "Page 166"], "url": "https://www.duchas.ie/en/cbes/4701736/4697398/4714653", "text": "\nThe green tops of whins furze pounded and mixed with oats is a cure for worms in horses.\n\n\n\nAttach a bicycle pump with valve to the cow's teats in succession, pumping as much air as possible into them. Work at each for four or five minutes. The cow will be relieved in less than an hour.\n", "school_info": "School: Geevagh", "metadata": [{"Location:": "Geevagh, Co. Sligo", "Teacher:": "\nSeán Ó Gallchobhair\n"}, {"Collector": "Maeve Gallagher", "Gender": "female"}, {"Informant": "Patrick Mac Hugh", "Gender": "male", "Address": "Geevagh, Co. Sligo"}, {"Language": "English"}]}, "4713223/4709003/4813232": {"title": "Cleas na Péiste", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0449, Page 037", "Page 037"], "url": "https://www.duchas.ie/en/cbes/4713223/4709003/4813232", "text": "\nWhen a calf has a griping supposed to be caused by a worm in the intestine, make a knot over him with a cord, and unfasten again by pulling the cord. Repeat nine times and the calf is cured. Other people put a \"fist\" of salt in sour milk and give it to the calf to drink. To cure warts steal a piece of bacon, and bury it in a manure heap. Warts are a lucky sign. One is supposed to have a cow later in life for every wart. A certain boy had 30 warts on his hands and feet. He afterwards fell into a farm of thirty cows. Another cure for a wart is to rub the fasting spit to it for nine mornings. This is also a remedy for a stye in the eye.Another cure for the worm in the calf's intestine is to bless yourself with your hat off, hit him gently with the hat and walk around the house once. Repeat this nine times and the calf will be cured.Flaggers (Elestrum sort) will cure toothache. Chopped dandeline applied to a wound caused by a dog bite will cure it.\n(continues on next page)\n", "school_info": "School: Cill Mhuire (C.), Oileán Ciarraí", "metadata": [{"Location:": "Kilmurry, Co. Kerry", "Teacher:": "\nMáiréad Pléimeann\n"}, {"Language": "English"}]}, "4742109/4736814/4816649": {"title": "Calves withs Worms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0471, Page 276", "Page 276"], "url": "https://www.duchas.ie/en/cbes/4742109/4736814/4816649", "text": "\nMake a certain knot three times over the calf.\n\n\n\nCumfry and Limber-wood was a great cure for sore eyes. But comfry was deadly poison to all domestic animals. It had to be grown and cultivated in gardens\n\n\n\nSugrues Plaster was a great cure for any mattery sore. It was made by my grandfather and he learned it from Michael Sugrue of Gleanagalough. The first one it cured was my great grandmotherIngredientsa piece of Mutton sueta quart of Linseed oila square of fancy Carbolic soap1/2 comb of honeyA piece of elm bark.\n(continues on next page)\n", "school_info": "School: Kilgobnet (C.)", "metadata": [{"Location:": "Kilgobnet, Co. Kerry", "Teacher:": "\nEibhlín, Bean Uí Fhoghladha\n"}, {"Collector": "John Foley", "Gender": "male", "Address": "Meanus, Co. Kerry"}, {"Language": "English"}]}, "4922318/4869559/4932083": {"title": "Local Cures - Ruaig ar Phiast", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0600, Page 048", "Page 048"], "url": "https://www.duchas.ie/en/cbes/4922318/4869559/4932083", "text": "\nThis custom or cure called the \"Ruaig an Phiast\" (Chase the Reptile) was supposed to cure a beast which was unable to get up owing to the supposed knotting of the intestines by I assume some infernal spirit interfering with the beast. It was worked as follows: The person doing it took an ordinary piece of string and [put] taking off his hat or cap, took some holy water and sprinkled some on the beast, himself and the onlookers. He then invoked the Blessed Trinity, and put on the first knot on the cord in the name of the Father. The second knot in the name of the Son and the third in the name of the Holy Ghost. The fourth was to be put up while saying \"Amen\" to the prayer. When the two ends of the cord were pulled the knots were all loosened and the beast was supposed to be cured. N.B. When I was quite a young lad I saw this superstitious and nonsensical \"cure\" performed over a prostate beast (a year or a year and a half old heifer or bullock). The \"witch-doctor\" then gave a tremendous kick to the unfortunate beast which rose as a result and walked away. He (witch-doctor) then said in triumph at his power \"There now, isn't she alright.\" I don' now remember if the beast lived.\n", "school_info": "School: Burrane, Inis", "metadata": [{"Location:": "Burrane Upper, Co. Clare", "Teacher:": "\nMícheál Ó Tuama\n"}, {"Language": "English"}]}, "4769999/4765372/4932806": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0826, Page 300", "Page 300"], "url": "https://www.duchas.ie/en/cbes/4769999/4765372/4932806", "text": "\n(continued from previous page)\nand nobody ever could see him going away. He knew all about the raths, and used to tell the people where they were. He said that Moranelly Rath was the second largest in Ireland, an he warned the people to never have anything to do with the raths. He used to say if you don't meddle with them they won't meddle with you.#The people who knew him used to go for him when a horse would be sick to cure it and they believed he had some charm or other in curing horses. When he used to go back from his visit  if he stayed too long they used to beat him and he used to tell some of the men that only for the kindness of the women of the house he would give them a good trashing too.\n\n\n\nThis is great for a calf that would be bad with a pain.\n\n\n\nSaying Here: Paying back the cabhair (coor) in work.John Breen, Rossnadough\n", "school_info": "School: Camross, Mountrath", "metadata": [{"Location:": "Camross, Co. Laois", "Teacher:": "\nPádraig Ó Heifernáin\n"}, {"Language": "English"}]}, "4758519/4751019/4954788": {"title": "Cures for Whooping-Cough and Bronchitis", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0850, Page 119", "Page 119"], "url": "https://www.duchas.ie/en/cbes/4758519/4751019/4954788", "text": "\n(continued from previous page)\nuntil the measels are well on the body.Black currant leaves are good for hoarsness and sore throats\n\n\n\nGarlick is a small plant like an union. It is used for dogs taking hystericks and for worms in cows tails. It is sliced and put through food for dogs. It is cut up and mixed with soot and salt. Then a cut is put in the cows tail and the garlick is put in to it. Nettles are pulled before seeding in the month of May. They are used to purify the blood.\n", "school_info": "School: Muileann an Bhata (B.)", "metadata": [{"Location:": "Mullinavat, Co. Kilkenny", "Teacher:": "\nMártan Ó Crotaigh\n"}, {"Collector": "Richard Sullivan", "Gender": "male"}, {"Informant": "Ned Dolan", "Gender": "male", "Address": "Mullinavat, Co. Kilkenny"}, {"Language": "English"}]}, "4770004/4766051/4956515": {"title": "Cures in Olden Times - Burns", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0828, Page 117", "Page 117"], "url": "https://www.duchas.ie/en/cbes/4770004/4766051/4956515", "text": "\nAn egg was broken, and the skin which lies beside the shell was put on burns. A cabbage leaf was roasted on an iron pot lid, this leaf was put on burns also.Laurel leaves fried with lard and put on burns was though a great cure.\n\n\n\nBrown paper was steeped in vinegar, and placed upon the head for a headache.Duck weed reduces information, and St Anthony's Fire. The fresh herb applied to the forehead relieves headaches.\n\n\n\nFor an earache:- an onion was roasted, and past of it put into the ear.\n\n\n\nFor a child suffering with worms: - three drops of turpentine were put on a lump sugar, this was given to the child to eat.\n\n\n\nFor a child smothering :- a tallow candle was melted and rubbed into the child's chest.\n\n\n\nButtermilk and breadsoda were brought to a paste, and rubbled into hives.\n", "school_info": "School: St John of God Convent, Rathdowney", "metadata": [{"Location:": "Rathdowney, Co. Laois", "Teacher:": "\nThe Sisters\n"}, {"Language": "English"}]}, "4922332/4870946/5055715": {"title": "Snaidhm na Péiste - Cure", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0605, Page 180", "Page 180"], "url": "https://www.duchas.ie/en/cbes/4922332/4870946/5055715", "text": "\nWhen a calf id a month old and when he commences to use meal he is liable to get Snadhm na Péiste, and the cure is Castor oil, but also people cut a knot over the back of the calf and it is supposed to cure him.\n", "school_info": "School: Lios Uí Chathasaigh, Inis", "metadata": [{"Location:": "Liscasey, Co. Clare", "Teacher:": "\nSs. Ó Coileáin\n"}, {"Collector": "Fanny sexton", "Gender": "female", "Address": "Liscasey, Co. Clare"}, {"Informant": "Mr Andrew sexton", "Gender": "male", "Address": "Liscasey, Co. Clare"}, {"Language": "English"}]}, "4922277/4866632/5055733": {"title": "Cures - Sníomh na Péiste", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0575, Page 327", "Page 327"], "url": "https://www.duchas.ie/en/cbes/4922277/4866632/5055733", "text": "\nCures: Sniomh Na PéisteTo cure a calf of a gripe: Get a cord, make a loop right hand over the left hand, then another left hand over right hand resembling the figure eight.  Put one end of the cord down through the first loop and the other end up through the second loop.  Pull both ends so that the cord will come free saying at the same time in the name of the Father, and of the Son, and of the Holy Ghost. Amen.Young cattle or sheep are subject to get \"blain\" a disease on the brain.  To cure this get a knife and cut the roof of the mouth so that it bleeds.On the cliff beside Lake Muskerry on the Galtees, there is a weed called called scurvy grass which will cure scurvy.Groundsel will cure excema and other skin diseases.Parafin oil rubbed to a chilblain will cure it.\n", "school_info": "School: Tankerstown", "metadata": [{"Location:": "Tankerstown, Co. Tipperary", "Teacher:": "\nThom. F. Meagher\n"}, {"Collector": "Alice Maxey", "Gender": "female", "Address": "Cappauniac, Co. Tipperary"}, {"Informant": "Mr Jeremiah Brett", "Gender": "male", "Address": "Cappauniac, Co. Tipperary"}, {"Language": "English"}]}, "4922384/4876326/5080386": {"title": "Snaidhm na Luachair Péiste", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0622, Page 010", "Page 010"], "url": "https://www.duchas.ie/en/cbes/4922384/4876326/5080386", "text": "", "school_info": "School: Mágh, Leacht Uí Chonchobhair", "metadata": [{"Location:": "Moy More, Co. Clare", "Teacher:": "\nRisteárd Mac Risteáird\n"}, {"Collector": "Michael Garrahy", "Gender": "male"}, {"Informant": "John O' Connell", "Gender": "male", "Age": "76", "Address": "Aillbrack, Co. Clare"}, {"Language": "mixed"}]}, "4922384/4876331/5080417": {"title": "Cures for Pain in the Ear", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0622, Page 015", "Page 015"], "url": "https://www.duchas.ie/en/cbes/4922384/4876331/5080417", "text": "\n(a) A reaping hook is heated in the fire and then some butter is melted with the heated top of the hook, over the ear and allowed to drop into the cavity of the ear.(b) Water taken from the bladder of a dead hare is also looked on as an infallible remedy.\n\n\n\nA posthumous child is believed to be gifted with the power of curing this disease.  The person effecting the cure is supposed to touch or lick the tongue of the sufferer.If the parent of a suffering child meets any man with a white horse, and asks him for a cure, whatever the horseman recommends will succeed.\n\n\n\nThe family of \"Cassidy\" (each and every one of the name) is supposed to be able to cure any malady arising from, or caused by, worms (in persons or animals).The story is told of a man named Cassidy who was at a \"meihull\" and some one of the company denied or doubted the power which he was supposed to possess.Cassidy took him (the doubter) to hole in the field where they found a worm of some kind under water.  Cassidy dipped\n(continues on next page)\n", "school_info": "School: Mágh, Leacht Uí Chonchobhair", "metadata": [{"Location:": "Moy More, Co. Clare", "Teacher:": "\nRisteárd Mac Risteáird\n"}, {"Language": "English"}]}, "4922382/4876159/5082356": {"title": "Snaidhm na Ruathar Péiste", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0621, Page 227", "Page 227"], "url": "https://www.duchas.ie/en/cbes/4922382/4876159/5082356", "text": "\n227          Snaidhm na Ruathar Péiste.There is a sort of charm used locally as a cure for calves suffering from gripe,supposed to be caused by a species of rush worm in the stomach of the animal.                  An ordinary piece of string or cord about 12 or 14 inches long is used and it is looped or knotted ,and drawn three times over the loin of the beast while he is suffering from an attack of gripe..The accompanying sketch will help to show how the knot s are made ,and if correctly done they will all untie or come free on pulling both ends of the cord.the writer has seen this cure effected on several occasions.\n(continues on next page)\n", "school_info": "School: An Rinnín, Leacht Uí Chonchobhair", "metadata": [{"Location:": "Rinneen, Co. Clare", "Teacher:": "\nPádhraic Ó Cionaoith\n"}, {"Informant": "P. Finucane", "Address": "Carrowntedaun, Co. Clare"}, {"Language": "English"}]}, "4922383/4876243/5082888": {"title": "Snaidhm na Péiste", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0621, Page 352", "Page 352"], "url": "https://www.duchas.ie/en/cbes/4922383/4876243/5082888", "text": "\nSnaidhm na Péiste(Worm knot illustrations)\n(continues on next page)\n", "school_info": "School: Lahinch", "metadata": [{"Location:": "Lehinch, Co. Clare", "Teacher:": "\nDónall Ó Ríordáin\n"}, {"Informant": "Michael Finucane", "Gender": "male", "Age": "60", "Address": "Moy More, Co. Clare"}, {"Language": "mixed"}]}, "5044783/5037719/5083773": {"title": "Whooping-Cough - Sometimes Called Chincough", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0962, Page 324", "Page 324"], "url": "https://www.duchas.ie/en/cbes/5044783/5037719/5083773", "text": "\nFood left after a ferret given to the patient to drink on successive Mondays and Thursdays will undoubtedly cure this complaint: when accompanied by faithful prayers.\n\n\n\nSome young people become terribly afflicted by worms which congregate and multiply in their intestines and cause terrible trouble and annoyance to their victims. I have known an old man who could cure suffers from these pests - but his cure is known by the name of a Charm. The Cure - He writes some form of words (known only to himself) on sheet of paper, gives it over to the sufferer, sewed up in a piece of cloth, and tells him or her to wear it suspended round the neck much as an Agnes Dei is worn, and tells him that this will completely banish the worms from out his or her system.\n", "school_info": "School: Árd Móinín", "metadata": [{"Location:": "Ardmoneen, Co. Cavan", "Teacher:": "\nA. Ó Cianaigh\n"}, {"Collector": "H. Keaney", "Gender": "male", "Occupation": "teacher"}, {"Language": "English"}]}, "5009212/4998384/5105443": {"title": "Worms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0770, Page 066", "Page 066"], "url": "https://www.duchas.ie/en/cbes/5009212/4998384/5105443", "text": "\n1. Whoever has the \"Cure\" to write it on paper before sunrise. This is to be sewed in a bag and tied round the neck before sun-set the same day. On no account should the \"Prayer\" be read.2. Boil the bark of the ash tree in water, strain and give to patient to drink for nine mornings - fasting.\n\n\n\nBoil dandelion in water and drink for a sore throat.Roast a potatoe and put vinegar on it. Put it round the neck until it gets cool.\n", "school_info": "School: Monedarragh, Mostrim", "metadata": [{"Location:": "Monadarragh, Co. Longford", "Teacher:": "\nBean Uí Mhealláin\n"}, {"Language": "English"}]}, "5009007/4976417/5115414": {"title": "Local Cures - Snaidhm na Péiste", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0714, Page 222", "Page 222"], "url": "https://www.duchas.ie/en/cbes/5009007/4976417/5115414", "text": "\nThis is a special kind of knot made on a cord over the back of an animal (cow, bullock, calf) that had swallowed a worm and which was rolling and kicking with pain. This is supposed to kill the worm etc inside the animal. It is also called \"The Vanishing Knot.\"The knot is made in such a way that when the two ends of the cord are pulled, the knot disappears.The making of the knot cannot be described in words. It must be seen and practised to become skilled in making it.\n\n\n\nThis is a swelling of the joints rendering the person unable to move his legs. Water from the mearing of three Estates (i.e. where three estates meet) is rubbed to the joints by certain person to whom the cure is handed down. A woman near Ardee\n(continues on next page)\n", "school_info": "School: Rathkenny", "metadata": [{"Location:": "Rathkenny, Co. Meath", "Teacher:": "\nTomás Mac Cárthaigh\n"}, {"Collector": "Thomas Carty", "Gender": "male"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "male", "Address": "Glassan, Co. Westmeath"}, {"Language": "English"}]}, "5009270/5003373/5132447": {"title": "A Worm Cure", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0883, Page 430", "Page 430"], "url": "https://www.duchas.ie/en/cbes/5009270/5003373/5132447", "text": "\nThere is a man in this district by the name of Mr. Donnolly who has the old cure for worms or worm fever. He lives at the cross of Muchwood which is n this parish of Glynn.The cure he gives, is in the form of medicine which must be taken in the morning fasting. If it is a very small child the medicine must be rubbed into its back, its chest, its hands, the soles of its feet and its nose and it is also given a few drops to drink in the name of the father and of the Son and of the Holy Ghost. It is made from herbs which he alone can gather. The moment he begins to mix the medicine the person gets better. Many families around the district have been cured by it. I myself had a cousin\n(continues on next page)\n", "school_info": "School: Glynn (C.)", "metadata": [{"Location:": "Glynn, Co. Wexford", "Teacher:": "\nMaighréad Ní Giolla Eoin\n"}, {"Collector": "Kathleen O' Leary", "Gender": "female"}, {"Language": "English"}]}, "5009316/5006750/5140035": {"title": "Cures", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0895, Page 327", "Page 327"], "url": "https://www.duchas.ie/en/cbes/5009316/5006750/5140035", "text": "\n327CuresMiss E. Carton Ballyrankin has often seen the cure being prepared for people \"in a decline.\"A large bunch of \"She\" dandelions is gathered and the leaves pounded in a bowl till the juice is extracted.  The juice is then put in milk, and boiled and given to the patient.She believes it a perfect cure for consumption\n\n\n\nWorm CureThere is a woman by the name of Keeley that cures worm fever.She cures with an herb called the Canavan-beg.  This is how she does it.  She searches in a field for the herb and pulls it in the name of the child that is affected with the worms.Then she rubs the herb in her hand, and if a froth comes on the herb the child has the worm fever.  She then pounds the herb and gets the juice and puts it in a bottle.  The child has to be rubbed nine times every morning - on the forehead, heart, palms of hands and soles of feet.The child is soon well.Padraig O Muirgheasa\n", "school_info": "School: Tombrack", "metadata": [{"Location:": "Tombrack, Co. Wexford", "Teacher:": "\nMáighréad, Bean Uí Dhubhghaill\n"}, {"Informant": "Pádraig Ó Muirgheasa", "Gender": "male"}, {"Language": "English"}]}, "4798749/4795483/5149639": {"title": "Piseoga agus Leigheasanna", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0295, Page 039", "Page 039"], "url": "https://www.duchas.ie/en/cbes/4798749/4795483/5149639", "text": "\n(continued from previous page)\nan aicíd nú an cinniúint ar duine éigin eile.\n\n\n\n20)   Go mbeannuighidh Dia dhíbh, a fuireannGo mbeannuighidh Dia dhíbh is Múire,Bhíobhair-ne mar sinn agus beidmíd-ne mar sibh-seGo mbeannuighidh Dia dhíbh is Muire\n\n\n\n21)   Baintí feidhm as san tráth chun ainmidhthe go  mbíodh teinneas ortha a leigheas. Deintí an snaidhm  anuas sa druim ar  an ainmhidhe breóite i n-ainm  an Athar, agus an Mhic is an Spioraid Naomh.Deirtí paidreaca eile leis lena linn. Bhailig ó 1 -21  Seósamh Ó Drisceóil, Cnocán na mBáirneachFuair sé ós na sean daoine i  Lios-a-Mona iad.Gabhaim féin mo bhuideacas leis annso.D.P. de Búrca,  O.S.\n\n\n\nDo chuimhnig an tÁirseóir ar seift éigin chun daoine do sgarúint ó Dhia, agus ceap sé leis féin gur mhaith ar rud ól a dhéunamh chuige sin agus mear thal a chuir ar na daoine agus gur leis féin gac aoinne do chuirfeadh an t-ól chum báis. Thug sé féin agus a dhá scoláire déug a b'fhearr a bhí aige seacht mbliana a dhéunamh agus do chuaidh díobh í dhéunamh.Nuair    a thug an tAirseóir suas é agus nár fhéad sé é chur chun cinn, bhí  aosánach  trí bliana déag d'aois agus d'fhearraidh sé don Airseóir, \"dá\n(continues on next page)\n", "school_info": "School: Inis Cléire, Dún na Séad", "metadata": [{"Location:": "Clear Island, Co. Cork", "Teacher:": "\nDonncha de Búrca\n"}, {"Collector": "Seósamh Ó Drisceóil", "Gender": "male", "Address": "Knockannamaurnagh, Co. Cork"}, {"Language": "Irish"}]}, "4811666/4810644/5170191": {"title": "Cleas na Péiste", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0342, Page 187", "Page 187"], "url": "https://www.duchas.ie/en/cbes/4811666/4810644/5170191", "text": "\nA cord about 12 or 18 inches long is procured, and is knotted twice in reverse order, few more intertwinings take place, and the cord is ready.   If a cow has a pain re, the operator takes an end of the cord in each hand, and strikes it down the affected part three times, saying at the same time, in the name of the Father / and / the Son / and of the Holy Ghost. Amen //.  He then pulls the cord taut, and if the \"knots\" are properly made, the cord opens out and becomes as at first without a trace of a knot. The pain is supposed to depart from animal at same time[My grandmother, late Mrs. Horgan,  Shanbally Lane, Macroom, showed me how to \"knot\" the cord]  - Died 20 years ago aged 87Nov. 1939\n", "school_info": "School: Maghcromtha (B.)", "metadata": [{"Location:": "Macroom, Co. Cork", "Teacher:": "\nPádraig Ó Deasmhumhna\n"}, {"Language": "English"}]}, "4921856/4896614/5189689": {"title": "Stories of Watergrasshill and District from Old Inhabitants - Snaidhm na Péiste", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0382, Page 057", "Page 057"], "url": "https://www.duchas.ie/en/cbes/4921856/4896614/5189689", "text": "\nThis was another charm which was used to cure worm in a cow's tail. A piece of string knotted in a certain way was put over the affected part without touching it. When the knot was drawn the worm died.\n\n\n\nChildren affected with whooping cough were sometimes made to creep under a black donkey to get cured, andMilk from a vessel from which a ferret had previously drunk was a cure for the same disease. John Shinnick (see p. 37) told me that he remembers this cure being brought to himself when he had the whooping-cough.     John Shinnick's aunt, Peggy Shinnick, was married to a seventh son of a seventh son. They lived in Rathcormac, 6 miles from here, and he was invariably called \"Doctor\" Murnane, though he never practised any healing.\n\n\n\nMichael Morey of Coolquane, Father of John Morey, mentioned on page 37, was the last person in this district to practice curing \"thrush\" by breathing into the mouth of the affected person. He was a posthumous child. He had to perform the operation when he was fasting, and often walked to the village to attend to a child affected, before taking food. He died about forty years ago.   I also heard that a goose was sometimes used in the same way - to get her breath into the mouth of a person affected with thrush.\n", "school_info": "School: Cnoc na Biolaraighe", "metadata": [{"Location:": "Watergrasshill, Co. Cork", "Teacher:": "\nDll. Mac Carrthaigh\n"}, {"Collector": "Mrs Hayes", "Gender": "female", "Age": "46", "Occupation": "assistant teacher", "Address": "Watergrasshill, Co. Cork"}, {"Informant": "Thomas Manning", "Relation": "parent", "Gender": "male", "Age": "79"}, {"Language": "English"}]}}