{"4498746/4385954/4498753": {"title": "Games - Blue Bells", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0792, Page 45", "Page 45"], "url": "https://www.duchas.ie/en/cbes/4498746/4385954/4498753", "text": "\nAny number of children can play this game. The children make a ring, one is selected to go in and out through he children, while she is doing so she sings -\"In and out through the woods of bluebells,In and out through the woods of bluebells,One, two, three follow me.\"Then she hits a girl on her shoulder saying -\"Clap a little doggy on his shoulder,Clap a little doggy on his shoulder,One, two, three follow me.\"Then the little girl follows the leader. Then the children in the ring say it again till all the players are out of the ring. Then the game goes on. Vera Quirk36 Main StHowth\n", "school_info": "School: Howth (C.)", "metadata": [{"Location:": "Howth, Co. Dublin", "Teacher:": "\nM. Ní Bhuain\n"}, {"Collector": "Vera Quirk", "Gender": "female", "Occupation": "pupil", "Address": "Howth, Co. Dublin"}, {"Language": "English"}]}, "4498746/4385893/4510165": {"title": "Game - Sally Sally", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0792, Page 34", "Page 34"], "url": "https://www.duchas.ie/en/cbes/4498746/4385893/4510165", "text": "\nGame (Sally Sally)A number of children can play this game. One of them is picked out to be \"Sally\" then the others all get in a line and before she says \"Sally, Sally, on, two, three\", they all must move, and if she sees any of them moving when she turns around she puts them back to the place they started from and they have to start again. But if one is able to get where \"Sally\" is standing without being seen she wins. And the game is played over again.Hannah O'Rourke,56 St Peters TceHowth.\n\n\n\nBlind man's buffYou get a crowd of children and one of them is blind-folded. Then the other children go out and hide and the one who is blind-folded must find them. Who ever is caught last has to be blind-folded too. And the game is played all over again till every body gets a chance.Hannah O'Rourke,56 St Peters TceHowth.\n", "school_info": "School: Howth (C.)", "metadata": [{"Location:": "Howth, Co. Dublin", "Teacher:": "\nM. Ní Bhuain\n"}, {"Collector": "Hannah O' Rourke", "Gender": "female", "Address": "Howth, Co. Dublin"}, {"Language": "English"}]}, "4498746/4385910/4510185": {"title": "Games - Musical Chairs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0792, Page 41", "Page 41"], "url": "https://www.duchas.ie/en/cbes/4498746/4385910/4510185", "text": "\n(continued from previous page)\n[-]\n\n\n\nShopFirst get a few boxes, one for a counter and others for tables on which to put your goods. Next gather all the toys and anything else you can find and arrange them on the tables. You mark very high prices on everything. The money is made from paper. If you had your shop in a field, fine sand would do for sugar and you can make cakes of it also.\n\n\n\n(continued from previous page)\nWhich ever side is out first they chose somebody as \"Captain\", but they must not let the other side know who is being chosen. Then they must give him something to prove that he is \"Captain\". The other side decide whom they are going to chase and all four go after different people but two people must not go after one person. If the \"Captain\" is caught the side which were chasing are \"out\" again but if the \"Captain\" gets into den safely they are out again.\n", "school_info": "School: Howth (C.)", "metadata": [{"Location:": "Howth, Co. Dublin", "Teacher:": "\nM. Ní Bhuain\n"}, {"Language": "English"}]}, "4498746/4385921/4510187": {"title": "Games - Hot Cockles", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0792, Page 42", "Page 42"], "url": "https://www.duchas.ie/en/cbes/4498746/4385921/4510187", "text": "\nAny number may play this game. The players sit round in a ring, and one goes round and round the ring and says: \"Hot cockles, hot cockles my hands are warm, what shall I do to cool them. I wrote a letter to my sweetheart and on my way I dropped it, some of you\n(continues on next page)\n\n\n\nA great many players are required for this game, one player tries to catch another and then both of them chase the others, when they catch one they catch her hands and they keep chasing until all the players are caught and a big chain is made, the first two keeping one at each end.Miss G. Kileen.30 Main Street.Howth.\n\n\n\nAny number of children, may play this. There is an even number of girls on each side, and one side is let \"out\". The other side goes out and chases them and takes them prisoners. The other side can get away if they like.\n", "school_info": "School: Howth (C.)", "metadata": [{"Location:": "Howth, Co. Dublin", "Teacher:": "\nM. Ní Bhuain\n"}, {"Collector": "Miss G. Kileen", "Gender": "female", "Address": "Howth, Co. Dublin"}, {"Language": "English"}]}, "4498746/4385921/4510189": {"title": "Games - Hot Cockles", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0792, Page 42", "Page 42"], "url": "https://www.duchas.ie/en/cbes/4498746/4385921/4510189", "text": "\nAny number may play this game. The players sit round in a ring, and one goes round and round the ring and says: \"Hot cockles, hot cockles my hands are warm, what shall I do to cool them. I wrote a letter to my sweetheart and on my way I dropped it, some of you\n(continues on next page)\n\n\n\nA great many players are required for this game, one player tries to catch another and then both of them chase the others, when they catch one they catch her hands and they keep chasing until all the players are caught and a big chain is made, the first two keeping one at each end.Miss G. Kileen.30 Main Street.Howth.\n\n\n\nAny number of children, may play this. There is an even number of girls on each side, and one side is let \"out\". The other side goes out and chases them and takes them prisoners. The other side can get away if they like.\n", "school_info": "School: Howth (C.)", "metadata": [{"Location:": "Howth, Co. Dublin", "Teacher:": "\nM. Ní Bhuain\n"}, {"Language": "English"}]}, "4498746/4385943/4510192": {"title": "Games - There's a Lady on the Mountain", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0792, Page 44", "Page 44"], "url": "https://www.duchas.ie/en/cbes/4498746/4385943/4510192", "text": "\nAll the players make a ring they select one for the \"lady\" and put her in the middle of the ring then they sing - \"On the mountain stands a ladyWho she is I do not know.All she wants is gold and silverAnd a nice young man you know.Choose your lover, choose your loverChoose your lover fair lady\"Then the girl selects her lover with her eyes shut Then the lovers go to the edge of the ring; then they say -\"Open the gates and let us throughThen the players say \"Not till you show your black and blue. Then they answer -There's my black and there's my blue, so open the gates and let us through.\"(lifting each foot in turn)Then they get married and the players sing songs such as -\"Go to church love, go to church love; Kneel down love, kneel down love; and so on. Vera Quirk36 Main StHowth\n", "school_info": "School: Howth (C.)", "metadata": [{"Location:": "Howth, Co. Dublin", "Teacher:": "\nM. Ní Bhuain\n"}, {"Collector": "Vera Quirk", "Gender": "female", "Address": "Howth, Co. Dublin"}, {"Language": "English"}]}, "4498746/4385900/5312573": {"title": "Games - Musical Chairs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0792, Page 40", "Page 40"], "url": "https://www.duchas.ie/en/cbes/4498746/4385900/5312573", "text": "\nAny number of players can take part in this game. If there are 10 players there must be only 9 chairs, according to the number of players there must be one chair less.The chairs are placed in the middle of the room and all the players march around them, while they are doing this somebody is playing music and when the music stops all the players rush for a chair and the one who does not get a chair is \"out\" then another chair is taken away and so on until there a re only two chairs left; then there are three players left and  when two players are left there will be only one chair and who ever gets that is the winner. There is generally a little prize for the winner.\n(continues on next page)\n\n\n\nThe chairs are placed in the middle of the room and all the players march around them, while they are doing this somebody is playing music and when the music stops all the players rush for a chair and the one who does not get a chair is \"out\". then another chair is taken away and so on until there are only two chairs left; then there are three players left and when two players are left there will be only one chair and who ever gets that is the winner.\n\n\n\nCaptain KiteThere must be an even number of players for this game, if there are 8 people the two eldest toss and the sides are chosen, then they toss up again to see which side will be \"out\" first.\n(continues on next page)\n", "school_info": "School: Howth (C.)", "metadata": [{"Location:": "Howth, Co. Dublin", "Teacher:": "\nM. Ní Bhuain\n"}, {"Collector": "Bridie Doyle", "Gender": "female", "Address": "Balscadden Road, Co. Dublin"}, {"Language": "English"}]}}