{"4428184/4384640/4435717": {"title": "Lá agus Oíche", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0787, Page 90", "Page 90"], "url": "https://www.duchas.ie/en/cbes/4428184/4384640/4435717", "text": "\nBíonn fad ' coiscéim coilig ' ar lá na bliadna úire.Is ionann lá Feil Brigde agus lá Iughnasa.        Teacht na Feil Padaig briseann an tailliúir a choinnleoir .    Lá feil Brigde Darna gach aon lá ó  mo lá sa amach.      Lá Fheil Pádraig. Síneann gach lá  ó mo lá sa amach.\n\n\n\nAthair an dá lá déag. (lá Nodlac beag . Lá Nodlac na mban)   Sé  sí  an oidhche  'nar dearn ár Slánuightheoir a chead míorbuilt . Tionntuigheann an t-uisce go fíon ar teacht na hoidhche . Mar sin de bíonn lón uisce intigh in gach teach roimh tuitim na hoidhche.    Na caith amach luaith ar bith lá na bliadna úire.\n", "school_info": "School: Naul", "metadata": [{"Location:": "Naul, Co. Dublin", "Teacher:": "\nC. Mac Fhíonntaigh\n"}, {"Collector": "Cathal Mac Fhíonntaigh", "Gender": "male"}, {"Informant": "Neans Ní Chealachain", "Gender": "female", "Age": "74", "Address": "Tawnaghgorm, Co. Donegal"}, {"Language": "Irish"}]}, "4428075/4375745/4454300": {"title": "Little Christmas", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0152, Page 415", "Page 415"], "url": "https://www.duchas.ie/en/cbes/4428075/4375745/4454300", "text": "\nLittle Christmas is on the 6th of January.  It is sometimes called the 12th day by some people.  On that day the holly which was up on the walls since Christmas is taken down and burnt on that day.\n\n\n\nLong ago the people had a lot of customs about certain days.  On New Year's day it is wrong to go to bed and fall asleep.  It is said, if you did you would be sleeping for the whole year.  On New years morning if a red haired person came in, there would be bad luck in the house until that day twelve month again.  If a black haired person came in there would be good luck in the house for that year.  On New Years day if you threw out dirty water some thing would happen to you that\n(continues on next page)\n", "school_info": "School: Coill an Gharráin", "metadata": [{"Location:": "Killacorraun, Co. Mayo", "Teacher:": "\nMícheál Ó Riagáin\n"}, {"Collector": "Tomás Ó Leonard", "Gender": "male"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "male"}, {"Language": "English"}]}, "4428124/4380510/4461989": {"title": "Lá Nollag Beag", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0645, Page 245", "Page 245"], "url": "https://www.duchas.ie/en/cbes/4428124/4380510/4461989", "text": "\nLá Nodlag Beag___________________________________Pé guidhe a bhíonn ag teastáil uait deirtear go bhfuighidh tú é Oidhche na Nodlag Beig má iarrann tú ar Dhia é do thabhairt duit.\"An dara lá déag\" an ainm is coitchianta ag muintir na h-áite seo ar lá Nodlag Beag mar tuiteann an Féile sin dhá lá déag tar éis lae Nodlag.____________________________________Máire Ní Chárthaigh,Árdán Tomáis,Dúngarbhán.____________________________________Bean Uí Thúiléir,       Aois 72 bl.Árdán Tomáis,Dúngarbhán\n", "school_info": "School: Clochar na Toirbhirte, Dúngarbhán", "metadata": [{"Location:": "Dungarvan, Co. Waterford", "Teacher:": "\nAn tSr. Proinseas\n"}, {"Collector": "Máire Ní Chárthaigh", "Gender": "female", "Address": "Dungarvan, Co. Waterford"}, {"Informant": "Bean Uí Thúiléir", "Relation": "not a relative", "Gender": "female", "Age": "72", "Address": "Dungarvan, Co. Waterford"}, {"Language": "Irish"}]}, "4428112/4379357/4462755": {"title": "Lá Nollag Beag", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0641, Page 83", "Page 83"], "url": "https://www.duchas.ie/en/cbes/4428112/4379357/4462755", "text": "\nLá Nodhlag Beag:Tugtar dhá lá deag na Nodhlag ar na dhá lá deag ó lá Nodhlag go dtí an séamhad lá de Eanar. Lá Nodhlag na mban, nó lá an Chinn, nó lá Nodhlag beag a thugtar ar an séamhad lá de Eanair. Lastar coinnle an oidhche sin leis. Bíonn sé socair roimh ré ag muinntir an tighe go n-eireochadh duine d’es na garsúin go moch maidean lae Nodhlaig bhig agus go raghad sé amach agus go dtiocfadh sé isteach aris agus “beannacht Dé isteac annsa” a rádh aige. Sé an chúis a deireann sé é\n(continues on next page)\n", "school_info": "School: Baile Mhic Airt, An Rinn", "metadata": [{"Location:": "Ballymacart, Co. Waterford", "Teacher:": "\nTomás Ó Faoláin\n"}, {"Collector": "Máighread Ní Cadhla", "Gender": "female", "Address": "Ballytrisnane, Co. Waterford"}, {"Informant": "Peadar Ó Cadhla", "Relation": "parent", "Gender": "male", "Address": "Ballytrisnane, Co. Waterford"}, {"Language": "Irish"}]}, "4428112/4379148/4462925": {"title": "Lá Nollag Beag", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0641, Page 149", "Page 149"], "url": "https://www.duchas.ie/en/cbes/4428112/4379148/4462925", "text": "\nTugtar Lá Nodlag Beag ar an séamhadh lá de Eanair. Tá a lán ainmneacha eile ar an lá san leis, Lá Nodlag na mBan agus Lá an Chinn.Nuair a thagann Lá Nodlag Beag ní bhíonn sé ó aoinneac aon rud do dhéanamh. Mar deirtear pé rud a deinfeadh duine an lá san go gcaithfeadh siad é do dhéanamh gach lá i rith na bliana.Oidhche Nodlag Beag lastas dhá ceann déag de choinnle in onóir an dá asbal deugh. Deirtear go n-ionntóchadh an t-uisge i bhfuil agus d'fainidís ina suidhe go dtí an dá bhuile déag cun é fheiscint.\n(continues on next page)\n", "school_info": "School: Baile Mhic Airt, An Rinn", "metadata": [{"Location:": "Ballymacart, Co. Waterford", "Teacher:": "\nTomás Ó Faoláin\n"}, {"Collector": "Pádhraig Ó Cléirigh", "Gender": "male", "Address": "Barranastook, Co. Waterford"}, {"Informant": "Seán Ó Cléirig", "Relation": "parent", "Gender": "male", "Address": "Barranastook, Co. Waterford"}, {"Language": "Irish"}]}, "4427982/4363706/4468800": {"title": "Lá Fhéile Stiofáin", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0129, Page 227", "Page 227"], "url": "https://www.duchas.ie/en/cbes/4427982/4363706/4468800", "text": "\n(continued from previous page)\nagus tom leo é gléasta suas le paipear daiththe agus ribíní daithte. Téigheann siad go gac teach agus deireann siad rann agus tabhaireann na daoine airgead dóibh.An RannDreolín, dreolín Rí na n-éanLá’il Stiopáin ceapadh mé.Éirigh suas a bhean a tighe,Caith an donacht as do chroidheAgus tabhair cúpla pighinn don dreoilínFado ó shoin bhíodh na buachailli ag dul thart le málai ag iarraidh aráin.\n\n\n\nLá Nodlag BeagSé an chéad lá den bliadhain úr é agus deireann na daoine nach ceart uisge salach a caitheadh amac agus nach cóir rud ar bith a thabhairt isteach taréis dul faoi don gréin, go mór mór uisge, mar deireann na daoine go dtionnuigheann sé isteach i fuil é oidhche Nodlag beag.\n\n\n\nSgéalBhí bean ann fado agus chuala sí go dtionnuigheann an t-uisge isteach i fuil. Thug sí isteach canna uisge tar éis dul faoi don gréin. Nuair a thainig sí go dtí an doras chonnaic sí gur fuil a bhí ann agus tógadh suas í agus caiteadh isteach san canna agus bathadh í. Ón lá sin amac bhí mí-adh agus annro san teach sin.\n\n\n\nOidhche Seáin – Bíonn teine cnámh ag gac duine in onoin Naomh Seán\n", "school_info": "School: Droimslaod", "metadata": [{"Location:": "Drumsleed, Co. Mayo", "Teacher:": "\nMaire, Bean Mhic Suibhne\n"}, {"Collector": "Róise Ní Thachair", "Gender": "female"}, {"Informant": "Bean Ui Tachair", "Relation": "grandparent", "Gender": "female", "Age": "86", "Address": "Ballycroy, Co. Mayo"}, {"Language": "Irish"}]}, "4427982/4363710/4468813": {"title": "Lá Nollag Beag", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0129, Page 230", "Page 230"], "url": "https://www.duchas.ie/en/cbes/4427982/4363710/4468813", "text": "\nLá Nodlag BeagMaidin adhamhail maidin lae Nodlag beag. Má’s bean an chead duine a thigeanns isteac beidh an teac sin mí-adhamhail go ceann bliadhna. Ma fuileann tú an lá sin beidh tú soi-gearrtha go ceann bliadna.\n\n\n\nNaomh Pádhraic Bhí Pádhraic ar an taobh o thuaidh de hEorup. Maor ar caoirigh agus beithidhigh do bheadh é agus chuala sé sgéal faoi Éirinn go raibh droc daoine ann. Tháinig sé anonn go hÉirinn an 17adh Marta.Bhí se tuirseach agus thuit sé in a chodladh agus nuair a dhuisigh sé dubhairt sé:-“Mo seacht m’anam go hEirinn”“Ar barr na luachaire”, adeir an buacaill a bhí ag siubhal leis.Adubhairt Pádhraic aris – “Mo seacht m’anam go hÉirinn“Ar an reathnach” adeir an buachaillDubhairt Pádhraic arís “Mo seacht m’anam go hÉirinn“Ar barr cnuic”, adeir an buacaill.\n\n\n\nLa Bealtaine – bíonn na sean mna suas ar mullac na tighe ag feitheamh na toite agus ag tabhairt leo an t-im\n", "school_info": "School: Droimslaod", "metadata": [{"Location:": "Drumsleed, Co. Mayo", "Teacher:": "\nMaire, Bean Mhic Suibhne\n"}, {"Collector": "Prionnsias Mac Manamon", "Gender": "male"}, {"Informant": "Sean O Cealbhaigh", "Gender": "male", "Age": "67", "Address": "Dooreel, Co. Mayo"}, {"Language": "Irish"}]}, "4427982/4363712/4468825": {"title": "Lá Fhéile Stiofáin", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0129, Page 232", "Page 232"], "url": "https://www.duchas.ie/en/cbes/4427982/4363712/4468825", "text": "\nLá’il StiopháinInsan sean aimsear bhíodh na buachailli i gac baile ag iarraidh aráin, agus ní rachadh siad amach as a baile féin. Bhíodh cliabh ag duine aca leis an arán a chur isteach ann. Nuair a bheadh an baile siubhalta aca racadh siad isteach go teac sa baile agus dhéanfadh bean a’ tighe an té dóibh agus d’iosadh a sáith annsin.\n\n\n\nLá Nodlag BeagDeir na sean daoine nac mbeadh aon t-adh orra an chuid eile den bliadhain dá dtagadh bean isteach go moc lá Nodlag beag. Agus bhéadh sé níos measa bean ruadh a bheith an chead duine istig.\n\n\n\nLá BealtaineDeirtear go raibh cuid de na daoine ábalta an t-im a thabhairt leo lá Bealtaine.\n\n\n\nSgéalBhí bean ann fadó agus bhí sí in a comhnuidhe i Cnoc a’ Logha an taobh seo de Béal a’ Muirthidh. D’éirigh sí roimh éirigh gréine maidin lae Bealtaine. Dhearc sí uaithe agus chonnaic sí toit as teac i Sratnamonrach i Baile Cruaidh agus thug sí an t-im ón teach sin. An Samhain in a dhiaidh sin chuir sí ar ais trí croca móra ime a bhí tógta aice ón teac Srathnamonrach.\n", "school_info": "School: Droimslaod", "metadata": [{"Location:": "Drumsleed, Co. Mayo", "Teacher:": "\nMaire, Bean Mhic Suibhne\n"}, {"Collector": "Peadar Ó Cléirigh", "Gender": "male", "Address": "Ballycroy, Co. Mayo"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "male", "Age": "65", "Address": "Ballycroy, Co. Mayo"}, {"Language": "Irish"}]}, "4428016/4368439/4471731": {"title": "Festival Customs - St Stephen's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138, Page 111", "Page 111"], "url": "https://www.duchas.ie/en/cbes/4428016/4368439/4471731", "text": "\nThe boys from each village \"go, as they express it, in the wren.\" They dress up in fantastic colours, wear false beards and carry a box supposed to hold the wren. The children here, as a rule, do not catch the poor wren though they carry the box and play a game of pretence. From house to house they travel standing outside each door repeating rhymes and playing on a mouth organ. These are the verses used in this locality.\"The wren, the wren, the king of all birds.St Stephen's Day she was caught in the furze,Up with the kettle and down with the pan.Gve us some money to bury the wren.\"The two last lines are sometimes replaced by these:\"Although she was little her family was greatStand up landlady and give us a treat.\"The boys get a few pence, sometimes sixpence in each house. When evening comes they count the money and divide it equally between them.\n\n\n\nThe old custom of wishing \"A happy New Year\" prevails. Some old superstitions say that if you are sad or joyful this day you will be likewise all the year round. It is regarded as one of the great Christmas feasts.\n\n\n\nCommonly called \"Twelfth Night\"Twelve candles - small coloured ones - are lighted\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire, Leac an Anfa, Cathair na Mart", "metadata": [{"Location:": "Leckanvy, Co. Mayo", "Teacher:": "\nAn tSr. Treasa\n"}, {"Language": "English"}]}, "4428394/4403830/4514052": {"title": "Oíche Nollag Bheag", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1069, Page 279", "Page 279"], "url": "https://www.duchas.ie/en/cbes/4428394/4403830/4514052", "text": "\nSin an oidhche deireannach den t-sean bhliain. Bhí sé creidte ag an t-sean muinntir agus tá lán cor dhuine go fóill a chreideas go dtiompughadh an t-uisce i n-a fhíon an oidhche sin no gur i gcoithrim na h-oidhche sin a d'oibir Críost an chead mhiorbhailte, se sin, aistuighadh an uisce go fíon agbainfheis Chána. Bhi sé creidte aca fosta dá dtogtai uisce indiaidh ghabhail ó sholas an tráthnóna sin go dtiocfadh léan sgrios ar bhunadh an toighe agus mar sin dó, bhíodhuisce an toighe istigh i ngach teach roimhe luighe gréine.Sgéal i dtaoibh an chreideanna seo. Bhi bean ann aon uair amháin agus chuaidh sí amach agus thug sí isteach stópa uisce indiaidh luighe gréine oidhche Nodlag Beag, agus d'fhág sí an stópa i gceann an toighe. I dtráthaibh am luighe bhuail tart í\n(continues on next page)\n", "school_info": "School: Gort an Choirce", "metadata": [{"Location:": "Gortahork, Co. Donegal", "Teacher:": "\nSéamus Mac Giolla Easbuic\n"}, {"Language": "Irish"}]}, "4428394/4403832/4514054": {"title": "Achar an Dá Lá Dhéag", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1069, Page 281", "Page 281"], "url": "https://www.duchas.ie/en/cbes/4428394/4403832/4514054", "text": "\nLastai dha choinneal dheag i ngach teach i bhfad o shoin ach tá an gnás sin leigthe ar dearmad anois ins an áit seo. Cuid a deireadh gur i n-onoir an daréag apostal a lastai íad agus cuid eile gur ó thairbhe saoire an dá lá dheag idir Nodlaig Mhór agus Nodlaig na gCoinneal a leigean ar ceal. Is gnáthach go foill ánnlann neamh choitcheann a bheith ag daoine annseo le n-a dhinnear.\n\n\n\nGnidheadh na daoine trosgadh an lá seo go tráthnóna. Annsin bhíodh suipear brúitíní agus ime ag na teaglaigh. I n-a dhiaidh sin deirtí an paidrín agus annsin theigheadh ceann urraidh an tighe amach agus chuireadh sé sopóg luachra i gcliabh agus dlaoi cocain le n-a chois. Chuireadh gach duine de'n teaghlach ball de n-a chuid éadaigh sa chliabh fosta. Annsin\n(continues on next page)\n", "school_info": "School: Gort an Choirce", "metadata": [{"Location:": "Gortahork, Co. Donegal", "Teacher:": "\nSéamus Mac Giolla Easbuic\n"}, {"Language": "Irish"}]}, "4566073/4564566/4574272": {"title": "Festival Customs - Little Christmas and the Epiphany", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0028, Page 0304", "Page 0304"], "url": "https://www.duchas.ie/en/cbes/4566073/4564566/4574272", "text": "\nI got this account from my mother, aged 42 years of Lurgan, Aughrim, Ballinasloe.Little Xmas is New Years Eve and New Years Day. That is the last day of December, and the first day of January. On New Years Eve candles are lighted on each window until about twelve o clock to welcome in the New Year. There is also  Midnight Mass on this night and bells are rung to ring out the old year and to ring in the New Year. There is not  much of importance about New Years Day. It is a holiday of Obligation.The Epiphany is the sixth of January. It is     the Feast\n(continues on next page)\n", "school_info": "School: Cill a' Lachtáin", "metadata": [{"Location:": "Killallaghtan, Co. Galway", "Teacher:": "\nSeosamh Ó hAllmhuráin\n"}, {"Collector": "Maudie Fahey", "Gender": "female", "Address": "Lurgan Great, Co. Galway"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "female", "Age": "42", "Address": "Lurgan Great, Co. Galway"}, {"Language": "English"}]}, "4583295/4577295/4584908": {"title": "Festival Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0047, Page 0048", "Page 0048"], "url": "https://www.duchas.ie/en/cbes/4583295/4577295/4584908", "text": "\n(continued from previous page)\ncustom handed down to the people from their forefathers.\n\n\n\nOn the Twelfth night the people light twelve candles but we light twelve rushes. We get them growing in a bog. We pull them and bring them home. When they are dry we peel them; then we steep them in grease, stick them to a board and light them. We point out one for each member of the family and say that the person's candle that would quench the first indicates that, that person would die the first. We say that the candle that would quench the last indicates that the person would die the last and that the Robin would bury him.\n\n\n\nOn the 1st of May every year the farmers of this Parish do not work in the clay, because they fear that some accident would happen if they did. A long time ago a certain man of the Parish went out ploughing on the 1st of May and it is\n(continues on next page)\n", "school_info": "School: Cill Tártáin", "metadata": [{"Location:": "Kiltartan, Co. Galway", "Teacher:": "\nMícheál Ó Tuathaigh\n"}, {"Collector": "Paddy Nolan", "Gender": "male", "Address": "Corker, Co. Galway"}, {"Language": "English"}]}, "4583360/4583075/4587809": {"title": "Oíche Cinn an Dá Lá Dhéag", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0062, Page 0148", "Page 0148"], "url": "https://www.duchas.ie/en/cbes/4583360/4583075/4587809", "text": "\nÁine Ní Fhatharta (13 1/2) do chuir síos.Gach aon seachtmhadh bliain Oidhche Chinn A Dhá Lá Dhéag bíonn oileán draoidheachta le feiceál amach ins an bhfarraige mhór in aice le Inis Mhór in Árainn.       Anuraidh (5-1-'38) chonnaic mé féin an t-oileán.  Bhíos fhéin is gach duine againn sa teach thíos ar an ngardha Árd, garraidhe é seo atá an-árd is bíonn amharc breágh le feiceál uaidh ins gach áit thar timcheall air agus dhá bhrígh sin bhí amharc breágh le feiceál againn ar an oileán.          Mé fhéin an chéad dhuine a chonnaic an t-Oileán.  Bhreathnuigh mé ar an bfharaige is shíleas gur tré lasadh abhí sí, bhí an oireadh sin soillse le feiceál amach ar an bhfaraige.B’iongantach an t-amharc é bhí sé mar bheadh na milliún coinnle lasta amháin de'n fharaige.  Ní raibh duine ar an mbaile nach ndeachaidh ag breathnú ar na soillse an oidhche sin.         Chuala mé na seandaoine ag rádh go ndeachaidh triúr fear as an gCaorán amach i gcurrach oidhche dhá bfhaca siad an t-oileán le súil is go bhféadfhadh siad é a choinneál i mbarr uisge i comhnuidhe mar deirtear dá gcaithfeá bróg nó caipín nó rud ar bith isteach ar an oileán go bfanfhadh sé tirm.            Bhí go maith agus ní raibh go h-olc nuair a chonnaic an triúr seo é dubhairt siad go ngabhfadh siad amach go dtí é.  Nuair a cheap siad a bheith in aice leis shíl duine aca a hata a chaitheamh isteach air acht bhí an t-oileán imighthe is ní fhaca siad ní ba mhó é.\n", "school_info": "School: An Tulach", "metadata": [{"Location:": "Tully, Co. Galway", "Teacher:": "\nTadhg Ó Séaghdha, Máire, Bean Uí Dhuigneáin\n"}, {"Collector": "Áine Ní Fhatharta", "Gender": "female", "Age": "13", "Address": "Ballynahown, Co. Galway"}, {"Language": "Irish"}]}, "4583331/4580245/4591690": {"title": "Festival Customs - New Year's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0055, Page 0117", "Page 0117"], "url": "https://www.duchas.ie/en/cbes/4583331/4580245/4591690", "text": "\nNew Year's NightOn New Year's Night candles are left lighting in the windows just as is done on Christmas night.  Then before twelve o'clock the old chapel bell is run to \"Ring out the old year\", and after twelve the newer bell is rung to \"Ring in the New\".  There are two bells in Lawrencetown, an old one and a new.\n\n\n\nTwelfth Night:It is an old custom to have twelve candles lighting while the Rosary is being said.  Each member of the family selects one of these candles as representing himself. Which ever candle is burned out first the member of family who selected this candle will die first, and so on\n(continues on next page)\n", "school_info": "School: Baile Mór Síl Anmchadha (Laurencetown)", "metadata": [{"Location:": "Laurencetown, Co. Galway", "Teacher:": "\nSeán Ó Cogaidhín\n"}, {"Language": "English"}]}, "4583348/4581712/4593220": {"title": "Béasanna", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0059, Page 0149", "Page 0149"], "url": "https://www.duchas.ie/en/cbes/4583348/4581712/4593220", "text": "", "school_info": "School: Cillíní Díoma", "metadata": [{"Location:": "Killeenadeema, Co. Galway", "Teacher:": "\nUinsionn Ó Conáin\n"}, {"Informant": "Séamus Mac Lochlainn", "Gender": "male", "Age": "75", "Occupation": "feirmeoir", "Address": "Curhoor, Co. Galway"}, {"Language": "Irish"}]}, "4613681/4608107/4623270": {"title": "Nollaig Bheag", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0018, Page 229", "Page 229"], "url": "https://www.duchas.ie/en/cbes/4613681/4608107/4623270", "text": "\nAn séadh la de mí Eanair an oidhche sin gheibhidís leasú agus cuiridís ar cathaor é. Annsin cuiridís geatraí in a lár. Ar dtús do thogadh gach duine geataire agus do shaithfeadh siad iad san leasú. Bhíodh ar gach aca a cheann féin a lasú agus an ceann théigeadh amúa ar dtús sin é an duine a gheibheadh bás ar dtús. Amannta gheibhidís fód móna agus cuiridís la ann. Annsin dhéanaidís an rud chéadna. Anois ní bhíonn aon geatraí aca ach ag cor dhuine. Bíonn coinnle a gheibheann siad san siopa aca anois agus bíonn siad ar cathaor aca. Anois deireann siad an paidrín páirtheach thar thimeall\n(continues on next page)\n", "school_info": "School: Árd Aoibhinn", "metadata": [{"Location:": "Ardeevin, Co. Galway", "Teacher:": "\nMáire Úna Ní Chonfhaola\n"}, {"Informant": "Seán Ó Chonghaile", "Gender": "male", "Age": "42", "Occupation": "feirmeoir", "Address": "Loughpark, Co. Galway"}, {"Language": "Irish"}]}, "4613681/4608108/4623271": {"title": "Nollaig Bheag", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0018, Page 230", "Page 230"], "url": "https://www.duchas.ie/en/cbes/4613681/4608108/4623271", "text": "\n(continued from previous page)\northa.\n\n\n\n[-]\n(continues on next page)\n", "school_info": "School: Árd Aoibhinn", "metadata": [{"Location:": "Ardeevin, Co. Galway", "Teacher:": "\nMáire Úna Ní Chonfhaola\n"}, {"Informant": "Kate Timothy", "Gender": "female", "Age": "50", "Occupation": "farmer's wife", "Address": "Stonetown, Co. Galway"}, {"Language": "English"}]}, "4613671/4606933/4623399": {"title": "Funerals", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0016, Page 049", "Page 049"], "url": "https://www.duchas.ie/en/cbes/4613671/4606933/4623399", "text": "\nwhy people close doors when funerals pass- long ago it was the custom to carry the corpse from house to house when the occupants of the later would carry it to the next house and so on. People were so weakened out from hunger as that they felt they were not able and so closed doors to prevent people from asking their help.\n\n\n\nAbout a fortnight before time, rushes of 6\" or 8\" long are pulled tied in a bundle and hung in the loft or such dry place to dry. That day (12th) these (12) rushes are dipped in butter juice, fat, or rolled in a pan in which there is gravey and allowed to dry again. Cow-manure has been kept for this purpose. (see later) Cow-manure is shaped into something like a pancake and these rush candles are stuck into it.(see sketch) They are then named after the father, Mother, Tom, Mary etc. all living members of the family, and which ever candle dies\n(continues on next page)\n", "school_info": "School: Gort na Díogha", "metadata": [{"Location:": "Gortnadeeve West, Co. Galway", "Teacher:": "\nSéamus Ó Dochartaigh, Bean Uí Dhochartaigh\n"}, {"Informant": "Thomas Brennan", "Gender": "male", "Age": "91", "Address": "Knockmascahill, Co. Galway"}, {"Language": "English"}]}, "4622966/4617924/4628341": {"title": "Muintir Árann", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0070, Page 179", "Page 179"], "url": "https://www.duchas.ie/en/cbes/4622966/4617924/4628341", "text": "\n(continued from previous page)\né Oidhche Lae Cinn an Dá Lá Dhéag. Ní bhiodh an aimsear indon ag muinntir na háite seo dhul isteach go hArainn an uair sin le móin, mar bhí sé ráidhte go raibh an aimsear go dona, le gála agus 'chuile shórt dá dhonacht\".\n\n\n\n\"Bhiobh trí chácaí deanta ag mná óga an tighe mar gheall ar go dtáinig triúr righthe as an Domhan Thoir ag cuairt ag an Maighdean Mhuire agus ag Iosa Criost nuair rugadh é 'sa máinséar.\n\n\n\nBhiodh trí shuipéir aca oidhche lae Chin an Dá lá dhéag mar deir an sean-fhocal \"Oidhche lar Chinn an Dá lá Dhéag,Cuir do bhéilidh ar an mias,Oidhche Nodlag Mhór cuir do bhéilí ar an stól.Oidhche Nodlag bheag cuir do bhéilí ar an sop.Oidhche Nodlag bheag cuir de bhéilí ar an sop.\"\n", "school_info": "School: An Cnoc (Leitir Mór)", "metadata": [{"Location:": "Knock, Co. Galway", "Teacher:": "\nBríd Puirséal, Máire, Bean Uí Dhuibheagáin\n"}, {"Informant": "Tomás Mac Dhonnchadha", "Gender": "male", "Address": "Knock, Co. Galway"}, {"Language": "Irish"}]}, "4622966/4617925/4628345": {"title": "Crónán na Banaltra", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0070, Page 180", "Page 180"], "url": "https://www.duchas.ie/en/cbes/4622966/4617925/4628345", "text": "\n\"Bean a d'fhan ina suidhe Oidhche Lae Chinn an Dá Lá Dhéag agus d'fhag sí an doras ar osgailt. Chuaidh gach a raibh 'sa teach a chodhladh acht í féin. Is gearr annsin gur chuala sí torann ag an táirseach agus tháinig an Mhaighdean Mhuire isteach agus thosuigh sí ar an Suantraighe sin, agus is gearr go raibh an leanbh Iosa 'na chodhlad aice. Nuair abhí sí tamall istigh d'fhág sí a beannacht ag an mnaoi agus d'imthigh sí amach agus sin í an chéad bhean ar innis an Mhaighdean Mhuire a Suantraighe di.\"\n\n\n\nFágann siad na dóirse ar osgailt Oidhche Lae Cinn an Dá Lá Dhéag, mar bíodh na sean daoine ag rádh go mbiodh geatai na bhFhlaitheas ar osgailt.Don duine nach mbiodh bainne aca an uair sin, chuireadh na comharsana bainne agus im ag a chéile mar bhronntanais.\n(continues on next page)\n", "school_info": "School: An Cnoc (Leitir Mór)", "metadata": [{"Location:": "Knock, Co. Galway", "Teacher:": "\nBríd Puirséal, Máire, Bean Uí Dhuibheagáin\n"}, {"Informant": "Brighid Ní Fhlaithearta", "Gender": "female", "Address": "Knock, Co. Galway"}, {"Language": "Irish"}]}, "4622964/4617734/4628528": {"title": "Lá Nollag Beag", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0069, Page 713", "Page 713"], "url": "https://www.duchas.ie/en/cbes/4622964/4617734/4628528", "text": "\nTagann lá Nodhlag Beag ar an 6 adh lá d’Eanair. Tá sé de nós ag na daoine i gConamaracoinnle a lasadh an oidhche sin. Cuirtear ceathair nó cúig cinn de choinle ar gach fuinneóig.Breathnuigheann chuile áit go deas an oidhche sin. Deirtear go mbíonn an MhaighdeanMhuire ag dul thart an oidhche sin agus ní ceart do dhuine ar bith an doras a dhúnadh gombíonn sé an dó dhéag san oidhche. Deirtear má theigheann tú ag an sgioból ag a dódhéag san oidhche go\n(continues on next page)\n", "school_info": "School: Ros Muc", "metadata": [{"Location:": "Rosmuck, Co. Galway", "Teacher:": "\nStiofán Ó hOisín\n"}, {"Collector": "Tomás Ó Máille", "Gender": "male", "Address": "Turlough, Co. Galway"}, {"Informant": "Colm Ó Máille", "Gender": "male", "Age": "44", "Address": "Turlough, Co. Galway"}, {"Language": "Irish"}]}, "4622994/4621933/4629028": {"title": "A Story about Penance", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0078, Page 136", "Page 136"], "url": "https://www.duchas.ie/en/cbes/4622994/4621933/4629028", "text": "\n(continued from previous page)\npleased for getting the heat of the fire very day and she died and before she died she told the woman she would pray for her. The poor woman was very poor and she afterwards became the richest woman in the parish.\n\n\n\nIt is a rule throughout the country that on the \"Twelfth Night\" that is, Jan. 6th the people of each house gather rushes and put them near the fire to dry. When they are dry, they are peeled and dipped in grease. Then a cake of clay is got and each candle is cut the same length and they are stuck in the cake of clay and before the people go to bed they light them and each one names a candle\n(continues on next page)\n", "school_info": "School: Gallach", "metadata": [{"Location:": "Gallagh, Co. Galway", "Teacher:": "\nBean Uí Mhaoiléidigh\n"}, {"Collector": "Sean Ford", "Gender": "female", "Address": "Lehanagh, Co. Galway"}, {"Language": "English"}]}, "4622995/4621949/4629044": {"title": "The Twelfth Night and St Bridget's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0078, Page 152", "Page 152"], "url": "https://www.duchas.ie/en/cbes/4622995/4621949/4629044", "text": "\nLong ago as in now the people use to light candles. The people thought that the owner of the candle that lives longest will be the person that lives longest in that household and the owner candle that lives shortest will be the person that dies first in that house. They also say that the man of the house use to bring in the cows manure and leave it on the table and then he would stick the candles in it. Then they used to say the Rosary and when all the candles burnt out he used to take the manure and spread it parts of the table. He then made a ball of it and then he used to put it behind the rafters. The people believed that no misfortune would happen his family till that time twelve months on.\n", "school_info": "School: Naomh Ruadhan, Gallach", "metadata": [{"Location:": "Gallagh, Co. Galway", "Teacher:": "\nD. Ó Neachtain\n"}, {"Language": "English"}]}, "4622978/4619849/4629292": {"title": "Nósanna Nollag", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0074, Page 260", "Page 260"], "url": "https://www.duchas.ie/en/cbes/4622978/4619849/4629292", "text": "\n(continued from previous page)\nan chead coinneal a lasadh Oidhche Nodlag. Cuirtear cuileann agus eidheann suas i ngac teac Oidhche Nodlag le h-aghaidh an tighe a dheasú i n-onór Iósa.Ní fhagann aon dhuine ar bith a teac féin Oidhche Nodlag.\n\n\n\nPisreóga Lá Nodlag Beag--------------------Ní caithtear amac aon salacas nó an luaith Lá Nodlag Beag ar fhaitchios go gcaithtear amac an t-ádh.An rud bheadh tú ag deanamh agus an caoi a bheadh ort Lá Nodlag Beag, bhead tú ag deanamh an rud céana agus beadh an caoi céana ort ar feadh na bliadhna.Dá mbheadh tuilte móra ann Lá Nodlag Beag, bheadh na h-aibhne líonta ar feadh na bliadna.Ní chuirtear amac aon airgead Lá Nodlag Beag, ar fhaitchios go mbeadh siad á gcur amac é ar feadh na bliadhna.Lasann cuid de'n na daoine dá choinneal deag Oidhche an Dá Lá Déag i n-onór an dá Abstal déag.\n(continues on next page)\n", "school_info": "School: Coill Maolacáin", "metadata": [{"Location:": "Kilmeelickin, Co. Galway", "Teacher:": "\nAnna M. Ní Loingsigh\n"}, {"Collector": "Micheál Ó Congailligh", "Gender": "male", "Address": "Knockaunbaun, Co. Galway"}, {"Informant": "Pádraic Ó Congailligh", "Relation": "parent", "Gender": "male", "Age": "59", "Address": "Knockaunbaun, Co. Galway"}, {"Language": "Irish"}]}, "4602708/4597355/4631121": {"title": "Féilí na Bliana - Oíche Shamhna", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0082, Page 203", "Page 203"], "url": "https://www.duchas.ie/en/cbes/4602708/4597355/4631121", "text": "\n(continued from previous page)\nag ithe chomh mhaith is a bheith siad inann. Deanann bean an tighe caca milis agus cuireann sí fainne innti. An duine geibhfeann an fáinne, phósfaidhthe sé.Oidhche Shamhna freisin bíonn go leór sean nósa ag na daoinibh. Cuireann síad púicín ar duine eicint, gheobhann síad fó-cupán lán de créafoig agus fo cupán de uisge glan fo cupán de uisge salach fo cupán eile agus paidrín inntí. An duine a leagann a láimh ar an paidrín beadh sé in a mhanach, an duine a cuirfheadh a láim ar an uisge salach do phosadh sé baintreabach, an duine a cuirfeadh a láimh san uisge glan phosfhadh sé cailín maith, an duine a leagadh a láimh ar an gcréafoig gheobhadh sé bás.\n\n\n\nAn dara oidhche deag, sé sin an oidhche roimhe, deirtear go n-iompuightear an fior-uisge ins na h-iomair uisge go fíon. Cúpla lá roimh an oidhche faightear broibheanna  móra láidra agus deanann muinntir an tighe dhá choineal déag  asta, le geir. An dara oidhche deag annsin, cuirtear in a seasamh ar chac-bó iad. Lastar iad in onóir an dá aspal deag. An duine is óige sa tigh a lasanns iad. Fághann gach duine coineal áiritha dó féin, agus an coineal a mhuchanns i dtosach, 'sé an duine ar leis é, a fhághanns bás i dtosach, deirtear. Nuair a bhionn  na coinlí ar fad múchta, cuirtear  an cac-bó suas i mbothán na mbó, sa gcaoi go mbeadh na ba saor ó aicéidí na bliadhna. Deirtear an Paidrín Pairteach thart timcheall na gcoineal fhad is  bhionn siad 'gá lasadh.\n", "school_info": "School: Cromghlinn (B)", "metadata": [{"Location:": "Crumlin, Co. Galway", "Teacher:": "\nSeán Ó Donnchadha\n"}, {"Collector": "Micheál C. de Búrca", "Gender": "male", "Age": "12", "Address": "Crumlin, Co. Galway"}, {"Language": "Irish"}]}, "4649678/4645917/4659730": {"title": "The Twelfth Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0030, Page 551", "Page 551"], "url": "https://www.duchas.ie/en/cbes/4649678/4645917/4659730", "text": "\nThe  fifth of January is known as the Twelfth Night. Twelve rush candles are lit on this night.          The rushes are cut on the day before. They are left on the hob to dry and when they are dry they are peeled. One little bit of the rush is left on each without peeling for support. These rushes are then dipped in grease and dried.  \"Cow-dung\" is then got and made into the shape of a cake.     The candles are then stuck in this \"cake\" from \"cow-dung\" and ashes mixed.              Then the candles are lit. Each candle is named after some member of the family or relation.           The first candle to burn it is said that the person after whom it is named will die first. If a lot of grease comes out of the candle it is  said that the person after whom it\n(continues on next page)\n", "school_info": "School: Garbh Fhearáin (Garrafrauns)", "metadata": [{"Location:": "Garrafrauns, Co. Galway", "Teacher:": "\nSeán Ó Fionnagáin\n"}, {"Collector": "Micheál Breathnach", "Gender": "male"}, {"Language": "English"}]}, "4649694/4647862/4659853": {"title": "Rush Candles", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0211, Page 427", "Page 427"], "url": "https://www.duchas.ie/en/cbes/4649694/4647862/4659853", "text": "\n(continued from previous page)\n427making either reisin or rush candles.  They were made by the people of every house.\n\n\n\n12th NightI remember one curious custom in connection with the rush candles, but I'm not sure if it were a general custom in the parish or not. Here it is for what it is worth. On the \"12th Night\" a dried cow-dung was procured.  In it was placed standing 12 rush candles which were lighted in honour of the 12 Apostles.   I dont remember if there were any prayers said on this occasion, but I distinctly  remember the cow-dung being taken when the candles had burnt out and placed behind the couples of the kitchen roof.  The cow-dung was supposed to be a cure for a cure for a pain in the back.  I never saw it used to drive sway such a pain.\n", "school_info": "School: Aughacashel", "metadata": [{"Location:": "Aghacashel, Co. Leitrim", "Teacher:": "\nJoseph Conifry\n"}, {"Collector": "Joseph Conifry", "Gender": "male", "Occupation": "teacher"}, {"Informant": "Micheal Mc Kieornan", "Gender": "male", "Age": "0", "Address": "Mullaghgarve, Co. Leitrim"}, {"Language": "English"}]}, "4649705/4648848/4661517": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0214, Page 342", "Page 342"], "url": "https://www.duchas.ie/en/cbes/4649705/4648848/4661517", "text": "\nTwelve rush candles were burned on night of January 5th in honour of twelve apostles. This custom survived down to quite recently\n\n\n\nTaking white heads of cabbage and breaking them on road or at a doorstep; often led to serious trouble.Ducking for applesMelting lead and pouring into water to see shape of future husband or wife.Three saucers, one with clay, one with ring and one with water to signify marriage, emigration and death\n", "school_info": "School: Gort Leitreach", "metadata": [{"Location:": "Gortletteragh, Co. Leitrim", "Teacher:": "\nSeosamh Mac Cionnaith\n"}, {"Language": "English"}]}, "4672108/4670992/4673064": {"title": "May Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0171, Page 151", "Page 151"], "url": "https://www.duchas.ie/en/cbes/4672108/4670992/4673064", "text": "\nOn the last night of April, Marsh marigolds (May flowers) were pulled. Holy Water was shaken on them They were strewn at the doors of dwelling house and byres. The custom still prevails. It was done to get the blessing of Mary, Queen of May on house and stock. Also to keep harm and witchcraft away from the cows and milk. It has the special power of preventing the butter being charmed off the milk by witches.\n", "school_info": "School: Ceathrú na Leac", "metadata": [{"Location:": "Carrownaleck, Co. Sligo", "Teacher:": "\nMáire, Bean Uí Bhig\n"}, {"Collector": "Mrs. Mary Small", "Gender": "female", "Address": "Carraun, Co. Sligo"}, {"Language": "English"}]}, "4687714/4686463/4689710": {"title": "Féilí na Bliana - Lá Nollaig na mBan", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0434, Page 143", "Page 143"], "url": "https://www.duchas.ie/en/cbes/4687714/4686463/4689710", "text": "\nó Máiréad Ní AodhaBóthar an MhuillinCill-OrglanTwo men remained up until twelve o'clock on Little Christmas Night, and went to a well to watch the water turn into wine and they were never seen or heard of again. They took a gallon with them to bring a gallon of wine home, and they were to have a great night. On that night it is not right to leave the house without water. A few buckets are filled with\n(continues on next page)\n", "school_info": "School: Killorglin (C.)", "metadata": [{"Location:": "Killorglin, Co. Kerry", "Teacher:": "\nÚna Nic Coluin\n"}, {"Collector": "Máiréad Ní Aodha", "Gender": "female", "Address": "Killorglin, Co. Kerry"}, {"Language": "English"}]}, "4687719/4687053/4708803": {"title": "Féilte na Bliana - Oíche Nollag", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0435, Page 430", "Page 430"], "url": "https://www.duchas.ie/en/cbes/4687719/4687053/4708803", "text": "\n(continued from previous page)\ngo raibh na h-ainmaidhthe go léir ag caint le na céile ar oidhche san..  Ní ceart d'aoine dul amach ar a dó deag a clog cun fíon-uisge d'fághailt mar deiridís go mbeadh fion ann in ionad uisge.Siobhán Ní DhonnchadhaDubhglais,Cill Orglan\n\n\n\n\"Nodlag na mban Nodlag gan maith\"Sé an Nodlag a théighead na mná go léir go dtí an baile mór mar bé sin an lá geibheadh siad an féirín ar a ghlaodhtar \"Christmas Box\". Geibhidís an feirín sin ins an tig in a ceannuighidis na nidhthe ar feadh bna blíadhna.\n(continues on next page)\n", "school_info": "School: Dubhghlas (C.)", "metadata": [{"Location:": "Douglas, Co. Kerry", "Teacher:": "\nEibhlín, Bean de Róiste\n"}, {"Collector": "Síle Máire Ní Dhuígín", "Gender": "female", "Address": "Killorglin, Co. Kerry"}, {"Informant": "Sean P. Ó Duígín", "Gender": "male", "Age": "86", "Address": "Killorglin, Co. Kerry"}, {"Language": "Irish"}]}, "4701705/4694429/4760505": {"title": "The Rush Candles of the Epiphany", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0170, Page 0444", "Page 0444"], "url": "https://www.duchas.ie/en/cbes/4701705/4694429/4760505", "text": "\nThis is a custom which I am inclined to believe is confined to parts of Connacht. It still survives in this area. On the day of the \"Twelfth night\" (as it called here) rushes are gathered, peeled and dried. They are then left steeping in grease. Each rush candle is  about  six inches long. When night comes, the candles are put standing upright is some soft matter- cally (concannon). (The old people used cowdung.) A candle is set up and named after each member of the family not forgetting the absent ones. The candles are then lighted. The tradition is that the person whose candle burns out first, will die first, and the other members of the family will die in the order in which their candles burn out. We, children, all believed in this when growing up, and oh: the delight of each one when his (or her candle did not burn out first or second.\n", "school_info": "School: Curraigh (B.)", "metadata": [{"Location:": "Curry, Co. Sligo", "Teacher:": "\nPeadar Ó Braonáin\n"}, {"Collector": "Peter Brennan", "Gender": "male", "Occupation": "teacher"}, {"Language": "English"}]}, "4770044/4768870/4818410": {"title": "Christmas Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0836, Page 118", "Page 118"], "url": "https://www.duchas.ie/en/cbes/4770044/4768870/4818410", "text": "\n(continued from previous page)\n6. The people wish each other \"Happy Christmas\" when coming from \"Mass.\"\n\n\n\n1. People stay up until after 12 o'clock to hear the bells ringing out the old year (out) and ringing in the new. 2. When people hear the bells they bless themselves and say a short prayer so that the New Year may bring wealth and health. 3. The Christmas Candle is again lighted at nightfall.\n\n\n\nThe Christmas Holly\n(continues on next page)\n", "school_info": "School: Ballyadams", "metadata": [{"Location:": "Ballyadams, Co. Laois", "Teacher:": "\nP. Ó Bruadair\n"}, {"Language": "English"}]}, "4798671/4788984/4836921": {"title": "Twelfth Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0239, Page 148", "Page 148"], "url": "https://www.duchas.ie/en/cbes/4798671/4788984/4836921", "text": "\nTwelfth night is always at the very end of Christmas. There is an old custom practised in the west of Ireland. - There is twelve small coulred little candles got for the night and there is a cake of manure got also and they are stuck in it till they are burned. The rosary is said around them while they are burning. Other people use rushes. When they get them they peel them and dip them in grease till they stiffen so they are as good as the candles but many people use the candles. It is said that the person's candle that lives the longest will die first. And the one who dies first will live the longest.If there not twelve people in the house there are some neighbours or a friend in America named on the candles. When all the candles are burned and the candle grease and the cake of manure are put up among the rafters.\n(continues on next page)\n", "school_info": "School: Mullach na Sídhe (C.)", "metadata": [{"Location:": "Fairymount, Co. Roscommon", "Teacher:": "\nBean Uí Dhubhthaigh\n"}, {"Collector": "Máire E. Ní Druraide", "Gender": "female"}, {"Language": "English"}]}, "4798697/4791019/4923196": {"title": "Customs of St Stephen's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0252, Page 104", "Page 104"], "url": "https://www.duchas.ie/en/cbes/4798697/4791019/4923196", "text": "\n(continued from previous page)\nin long dresses and tall hats. The wren boys have great fun on that day.\n\n\n\nThe twelfth night is a feast night, it falls on the 6th of January. It is the twelfth night after Christmas day. On that night after the supper people light twelve candles. A few days before that night the people go out and gather rushes and let them season on the hob. On the twelfth night we pare them and dip them in grease\n(continues on next page)\n", "school_info": "School: Corraslira", "metadata": [{"Location:": "Corraslira, Co. Roscommon", "Teacher:": "\nBean Uí Dhubhláin\n"}, {"Collector": "Annie Egan", "Gender": "female", "Address": "Doonard Beg, Co. Roscommon"}, {"Informant": "Edward Holmes", "Gender": "male", "Address": "Annaghbeg, Co. Roscommon"}, {"Language": "English"}]}, "4798699/4791228/4924556": {"title": "New Year's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0252, Page 313", "Page 313"], "url": "https://www.duchas.ie/en/cbes/4798699/4791228/4924556", "text": "\nNew Year's day is another great festival. On the eve of the new year the bells are chimed, to ring out the old year. In many places bands march to play out the old year.\n\n\n\nLittle Christmas is the twelfth night.  There are generally 12 candles lit in every house.  The candles are made out of rushes.  The people get the rushes out of the bog and they peel them for the night, then at night they mix cowdung and ashes and they put the candles in it.  Then they say the rosary.  They leave the cake up on the rafters till the next year.\n", "school_info": "School: Cluain Fraoich", "metadata": [{"Location:": "Cloonfree, Co. Roscommon", "Teacher:": "\nSeán Ó Fiachra\n"}, {"Collector": "Biddy Hunt", "Gender": "female", "Address": "Cloonfree, Co. Roscommon"}, {"Language": "English"}]}, "4925220/4791580/4925555": {"title": "The Twelfth Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0253, Page 132", "Page 132"], "url": "https://www.duchas.ie/en/cbes/4925220/4791580/4925555", "text": "\nThe twelfth night falls on the sixth of January. On that night the twelve candles are lit in honour of the twelve Apostles. Long ago they candles used to be made from rushes. A week before the twelvth  night the rushes would be pulled and left to season.Then the would be peeled all to one side. Next there would be a pound of sheeps suet got and dip made of it. Then the rushes would be dipped in the dip and after that left up untill the twelvth  night.Then a cow-dung would be brought in and the rushes would be rolled up in it. Then they candles would be lit and a candle would be named for every person\n(continues on next page)\n", "school_info": "School: Carniska", "metadata": [{"Location:": "Carrownaskeagh, Co. Roscommon", "Teacher:": "\nRichard Healy\n"}, {"Language": "English"}]}, "4921567/4880367/4930031": {"title": "New Year's Night - The Night of New Year's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0269, Page 149", "Page 149"], "url": "https://www.duchas.ie/en/cbes/4921567/4880367/4930031", "text": "\nA large log of timber or block from a neighbouring bog was burned in the kitchen fire. This was called the \"Night of the Blocks\".\n\n\n\nTwelve rushes were obtained and steeped in grease. Cow dung was then obtained and flattened out on a board. The twelve candles were then stuck in the cow dung and lighted. This was done about 10.00 pm. All knelt and said the rosary. The cake was preserved and put under the cows’ heads in the manger on the morning of  1st May. It was supposed to ward off disease among the cows.The candles are still used but are the ordinary coloured candles. They are placed on a board and after being lighted - the rosary is said. The ceremony on 1st May however is discontinued .The material boiled in new milk was considered a cure for kidney trouble.\n", "school_info": "School: Baile 'n tSléibhe (B.)", "metadata": [{"Location:": "Cornalee, Co. Roscommon", "Teacher:": "\nMáirtín Mac Conchradha\n"}, {"Language": "English"}]}, "4811586/4799342/4931158": {"title": "Twelfth Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0265, Page 039", "Page 039"], "url": "https://www.duchas.ie/en/cbes/4811586/4799342/4931158", "text": "\nOn 12th Eve 12 little candles are lit each named after a member of the family. The person whose candle burns out first is said to be the first member of the family to die.\n", "school_info": "School: Baile Uí Mhuireadhaigh", "metadata": [{"Location:": "Ballymurray, Co. Roscommon", "Teacher:": "\nEibhlín Ní Ghealbháin\n"}, {"Collector": "Maura Gilmartin", "Gender": "female", "Address": "Ballymurray, Co. Roscommon"}, {"Language": "English"}]}, "4811608/4801513/4941990": {"title": "Máire Ní Mhurchadha", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0275, Page 238", "Page 238"], "url": "https://www.duchas.ie/en/cbes/4811608/4801513/4941990", "text": "\n(continued from previous page)\n-\n\n\n\nTá dá nós ag baint le hoidhche Nodlag Beag;-Seo ceann aca:-Creideadh na seandaoine go ndeineadh fíon de'n uisge Oidhche Nodlag Beag timcheall am mhairbh na hoidhche, agus d'fhanaidís suidhe go dtí an uair sin ag faireadh air.Seo ceann eile:-Do deintí dhá bhúaiceas déag, agus do deintí iad a lasadh Oidhche Nodlag Beag, i n-onóir do'n dá asbal déag.Pádruig Ó SíothcháinCathaircuimFuair ó n-a shean-mháthair\n", "school_info": "School: Urhan (B.)", "metadata": [{"Location:": "Urhin, Co. Cork", "Teacher:": "\nSeán Ó Murchadha\n"}, {"Collector": "Pádruig Ó Síothcháin", "Gender": "male", "Address": "Caherkeen, Co. Cork"}, {"Informant": "Máire Ní Shíothcháin", "Relation": "grandparent", "Gender": "female", "Address": "Caherkeen, Co. Cork"}, {"Language": "Irish"}]}, "4811606/4801230/4943568": {"title": "Ainmhithe Allta", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0274, Page 449", "Page 449"], "url": "https://www.duchas.ie/en/cbes/4811606/4801230/4943568", "text": "\nIt was an old custom in olden days and is even nowadays\n(continues on next page)\n", "school_info": "School: An Chluain", "metadata": [{"Location:": "Cloan, Co. Cork", "Teacher:": "\nTadhg Ó Cearbhaill\n"}, {"Collector": "Diarmuid Ó hArrachtáin", "Gender": "female", "Address": "Cahermeeleboe, Co. Cork"}, {"Informant": "Seán Ó Murchadha", "Gender": "male", "Age": "85", "Occupation": "feirmeoir", "Address": "Allihies, Co. Cork"}, {"Language": "English"}]}, "4922029/4920138/4948884": {"title": "Festival Customs - Epiphany", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0506, Page 071", "Page 071"], "url": "https://www.duchas.ie/en/cbes/4922029/4920138/4948884", "text": "\nEpiphany.Epiphany on little Christmas falls on the 6th January, which is twelve days after Christmas.  It is also called in Irish Nolaig na Mban.There are services held in all the Churches on that day and it is unlucky to take down decorations till the service is over on little Christmas day.It is not kept as a very special holiday for all shops are open on the day.It is customary not to take down the Christmas decorations until Epiphany because it is known as very unlucky.  Epiphany is the close of the Christmas feast.  Epiphany is in memory of \"the manifestation of Christ to the Gentiles, and also the visiting of the wise men to Jesus with presents of gold, frankincense and myrrh.  Gold which signifies his Kingship and Frankincense which signifies his preisthood and Myrrh which signifies his death.There is an old saying about the Chrismas day, that the cock takes longer steps on the dung pit on little\n(continues on next page)\n", "school_info": "School: Áth Dara (C.)", "metadata": [{"Location:": "Adare, Co. Limerick", "Teacher:": "\nMáire Boardman\n"}, {"Collector": "Phyllis Miller", "Gender": "female", "Age": "14", "Address": "Graigue, Co. Limerick"}, {"Language": "English"}]}, "4922119/4853991/4950498": {"title": "New Year's Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0530, Page 226", "Page 226"], "url": "https://www.duchas.ie/en/cbes/4922119/4853991/4950498", "text": "\nNew Year's Eve.  In some districts the local band is taken out that night, and tunes are played to usher in the New Year and to play the Old Year out.Bells of Churches are rung in villages on New Years Night also.\n\n\n\nThis is the 6th Jan. or feast of the Epiphany. The night before is called the 12th night and at the Rosary on that night twelve candles made from rushes dried, peeled and dipped in tallow, are lighted and allowed to burn out. This is a custom in honour of the Twelve Apostles, and also in honour of the light of Faith.Every member selects a candle or two for himself. Whatever candle dies out first the person who owns that light is supposed to die first in that family. The person whose candle burns longest is supposed to live the longest\n(continues on next page)\n", "school_info": "School: Redwood", "metadata": [{"Location:": "Redwood, Co. Tipperary", "Teacher:": "\nMáighréad Nic Chormaic\n"}, {"Language": "English"}]}, "5008826/4959209/5072944": {"title": "Halloween", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0662, Page 099", "Page 099"], "url": "https://www.duchas.ie/en/cbes/5008826/4959209/5072944", "text": "\nHallowe'en    Two basins - one of clean water and of dirty water. A girl was blindfolded, and if she selected the clean water she got a young man, and if the dirty water an old man.A girl blindfolded goes out and pulls a cabbage stalk. If she gets a straight one she gets a nice man, and if a crooked one a bad man.\n\n\n\nTwelfth Night: On eve of twelfth night twelve blessed candles were lighted in honour of the twelve apostles, and the remains of the candles were put up over the stable door.\n\n\n\nHallowe'en: The hearth was swept clean and a plate of champ was left for the poor souls.\n\n\n\nBonfire night: On St. John's eve 24th June fiddlers came and there was Irish dancing round the bonfire.\n\n\n\nThe Black Pig ran down the Ardee Road on his way to the Boyne. There will be trouble on the [Race?] of the Black Pig. (Miss Annie Costello).\n", "school_info": "School: Mullaharlin", "metadata": [{"Location:": "Mullagharlin, Co. Louth", "Teacher:": "\nSs. Mac Siúrdáin\n"}, {"Language": "English"}]}, "5044780/5037454/5082326": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0962, Page 060", "Page 060"], "url": "https://www.duchas.ie/en/cbes/5044780/5037454/5082326", "text": "\nIt is a custom to make twelve rush candles on the Feast of the Epiphany and to set them upright in a piece of clay. The candles are then lighted and named after each member of the family. The persons candle who burns out first will die first.\n\n\n\nIt is said there was a giant in the townland of Carrawhela. One evening he met a man and was going to kill him.  Before he would do so he would give him a chance. If he was able to eat as much porridge as the giant he would he would be a free man and so he agreed. He was going to the shop when he was captured and he had a bag with him. When they reached the Giant's house he had two great barrels of porridge ready and two spoons stuck in them.When the man was full he started filling the bag and soon his barrel was empty and the other barrel was not half empty and the giant was full.The small man then took a knife and cut his stomach as the giant thought and let out the porridge.\n(continues on next page)\n", "school_info": "School: Kilduff", "metadata": [{"Location:": "Kilduff Upper, Co. Cavan", "Teacher:": "\nS. Ó Floinn\n"}, {"Collector": "Joseph Mc Grail", "Gender": "male"}, {"Informant": "Phil Dolan", "Gender": "male", "Age": "69", "Address": "Dowra, Co. Cavan"}, {"Language": "English"}]}, "5009138/4990403/5101152": {"title": "Twelfth Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0750, Page 382", "Page 382"], "url": "https://www.duchas.ie/en/cbes/5009138/4990403/5101152", "text": "\nA custom which used to be observed in my childhood when I was living at Carrick-on-Shannon, but which has never been heard of here, was as follows:Early in the evening, the man of the house would go out and pick up a fairly dry piece of cow manure. This he would knead into the shape of a cake, and leave near the fire to harden a little. He would also bring in a bundle of rushes. These we would peel and soak in melted fat of any kind.  The rushes then would be cut into lengths of about 6\" and stuck at intervals here and there through the \"cake\". Each member of the family would name a particular candle as his own. We would then sit round watching the rush candles burning and keeping then snuffed. (The cake would be left on a plate on a table near the fire)The candles were burned in honour of the twelve Apostles.\n(continues on next page)\n", "school_info": "School: Forgney, Ballymahon", "metadata": [{"Location:": "Forgney, Co. Longford", "Teacher:": "\nMrs B. Higgins\n"}, {"Collector": "B. Higgins", "Gender": "female", "Occupation": "teacher"}, {"Language": "English"}]}, "5008912/4966208/5106059": {"title": "12th Night Custom", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0687, Page 080", "Page 080"], "url": "https://www.duchas.ie/en/cbes/5008912/4966208/5106059", "text": "\nFarmers in this locality make 12 rush lights on the eve of January 6th. They stick them in a large slab of cow manure and allow them to burn to the end. Then they take the manure and scatter it on the frames of doors or walls of the outhouses, invoking at the same time the blessing of God and the 12 apostles on their stock and crops. They believe that luck will attend their farming undertakings during the following year. There is a farmer's house about a 1/4 mile from the school. Mr O. has told me of this custom which is still practised.\n", "school_info": "School: Johnstown", "metadata": [{"Location:": "Johnstown, Co. Meath", "Teacher:": "\nMiss H.C. Hickie\n"}, {"Informant": "C. Oakes", "Address": "Croboy House, Co. Meath"}, {"Language": "English"}]}, "5008938/4968390/5108670": {"title": "Little Christmas", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0694, Page 076", "Page 076"], "url": "https://www.duchas.ie/en/cbes/5008938/4968390/5108670", "text": "\nLong ago twelfth night was called Little Christmas.  All the things that were left after big Christmas was kept for this feast.On Christmas night long ago each person in the house had his own print of butter and six or seven big sixpenny loaves were bought.  The loaves were four times the size they are now.  They were so big that sometimes the children used to put a board across them and make a stool of them.There were also twopenny loaves that time.  The people always kept some of the plumpudding for Little Christmas and they finished it on that night.  The holly and ivy are taken down the next day after Little Christmas and burned. Eat when you're hungryDrink when you're dryGo to bed when you're sleepyAnd go to heaven when you dieYou are to eat what is put before\n(continues on next page)\n", "school_info": "School: Castlejordan", "metadata": [{"Location:": "Castlejordan, Co. Meath", "Teacher:": "\nM. Nic Amhlaoidh\n"}, {"Collector": "Lizzie Coyne", "Gender": "female", "Address": "Kildangan, Co. Meath"}, {"Informant": "Mary Coyne", "Relation": "parent", "Gender": "female", "Address": "Kildangan, Co. Meath"}, {"Language": "English"}]}, "5008974/4972518/5111656": {"title": "Feast Days - New Year's Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0704, Page 267", "Page 267"], "url": "https://www.duchas.ie/en/cbes/5008974/4972518/5111656", "text": "\n(continued from previous page)\ntrow your luck away.\n\n\n\nLittle Christmas is the last day of Christmas. It is the day the people visit the crib and leave offerings at it.\n\n\n\nEvery year in every church in the parish a crib is errected so as to bring to the people's mind the birth of our Lord. Everybody go to visit it and leave offering at it. The three wise men who was guided by the star from the east are to be seen in the crib and also Our Lord and his Mother and the shepherds.\n", "school_info": "School: Kilskeer (B.)", "metadata": [{"Location:": "Kilskeer, Co. Meath", "Teacher:": "\nMáirtín Ó Loingsigh, R. Ó Fithcheallaigh\n"}, {"Language": "English"}]}, "5008989/4974534/5112663": {"title": "Hallow Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0709, Page 137", "Page 137"], "url": "https://www.duchas.ie/en/cbes/5008989/4974534/5112663", "text": "\nThe last night of October is called Hallow Eve. The boys in this district have great sport on that night. They go around taking down gates and hiding them. The children have great sport also. They put three basins on a table. Then one child puts a handkerchief on his eyes. Then the children put a ring on one basin, water on another, and clay on the third. Then the blind-folded person goes to the table and if he puts his hand on the ring he will be married first, and if he puts his hand on the water he will cross the sea first, and if he puts his hand on the clay he will be dead first.\n\n\n\nThe feast of the Epiphany is called Little Christmas Day. Nearly all\n(continues on next page)\n", "school_info": "School: Kilbeg", "metadata": [{"Location:": "Robertstown, Co. Meath", "Teacher:": "\nAodh Ó Duibhgeannáin\n"}, {"Collector": "Mary Moore", "Gender": "female", "Address": "Newrath, Co. Meath"}, {"Language": "English"}]}, "5009009/4976644/5113552": {"title": "Little Christmas", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0715, Page 020", "Page 020"], "url": "https://www.duchas.ie/en/cbes/5009009/4976644/5113552", "text": "\nThe 6th January is here called \"Little Christmas\" or \"Twelfth Day\".Large candles are lit on that night and the night before.Most people celebrate it by having dinner as on Christmas Day.\n", "school_info": "School: Grangegeeth", "metadata": [{"Location:": "Grangegeeth, Co. Meath", "Teacher:": "\nSéosaimhín, Bean Uí Dhubhghaill\n"}, {"Language": "English"}]}, "5044615/5026052/5141153": {"title": "Twelfth Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0811, Page 068", "Page 068"], "url": "https://www.duchas.ie/en/cbes/5044615/5026052/5141153", "text": "\nOn the night before the Twelfth Night there is a cake made of cow-dung and ashes. Then twelve rushes are got and the green skin is peeled off them. The part that is left is dipped in hot lard and left to dry and after a while get hard and like a candle. Then on the Twelfth the cake is got and the twelve ruskes is stuck in it in the shape of a cross and lighted. The rosary is then said. When the candle die down the ashes are gathered and put in the chimney along with the cake in the chimney. It is said that will preserve the house from all dangers during the year.\n", "school_info": "School: Ballycumber (B.), St Ciaran's", "metadata": [{"Location:": "Ballycumber, Co. Offaly", "Teacher:": "\nG. Ó Súilleabháin\n"}, {"Collector": "Joseph Geraghty", "Gender": "male", "Address": "Ballycumber, Co. Offaly"}, {"Informant": "Mr Owen Coughlan", "Gender": "male", "Age": "70", "Address": "Ballycumber, Co. Offaly"}, {"Language": "English"}]}, "5044617/5026395/5141362": {"title": "Christmas", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0812, Page 150", "Page 150"], "url": "https://www.duchas.ie/en/cbes/5044617/5026395/5141362", "text": "\n(continued from previous page)\nnight. All the men join together and pay in a certain sum of money, and for that they buy refreshments, such as tea, sugar cakes, wine, and other things. Then they all go to a certain house, already decided on, and have a dance there. The girls are all allowed in free, but they must be invited to it. This dance lasts until nearly next morning.\n\n\n\nTwelfth Night is sometimes called Little Christmas Night. It is the night before Twelfth Day or January 6th. On that night parties are given, and everyone is invited. The people eat plenty, and dance all night.In olden times and in many houses still twelve candles are made from rushes. Large rushes are pulled and peeled\n(continues on next page)\n", "school_info": "School: Clonmacnoise", "metadata": [{"Location:": "Clonmacnoise, Co. Offaly", "Teacher:": "\nP. Ó Maolmhuaidh\n"}, {"Language": "English"}]}, "5044618/5026553/5141759": {"title": "Customs on Twelfth Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0812, Page 339", "Page 339"], "url": "https://www.duchas.ie/en/cbes/5044618/5026553/5141759", "text": "\nIt is an old custom with the Irish Catholics to light twelve candles or rushes on Twelfth Night.A couple of days before that night the rushes are cut, and hung in the chimney so that they may dry out thoroughly. Then they are taken down and peeled on one side, and candle grease rubbed on them. Then there is a sod made, of cow manure, and the rushes are stuck in it. The twelve rushes are named after the twelve Apostles. Every person chooses a candle for himself and what-ever candle dies first signifies that, the person who chose it will dies first.Paddy RedicanClonfanlough\n", "school_info": "School: Clonfinlough, Athlone", "metadata": [{"Location:": "Clonfinlough, Co. Offaly", "Teacher:": "\nE. Ní Mhionacháin\n"}, {"Collector": "Paddy Redican", "Gender": "male", "Address": "Clonfinlough, Co. Offaly"}, {"Informant": "Kieran Hynes", "Relation": "grandparent", "Gender": "male", "Age": "80", "Address": "Clonascra, Co. Offaly"}, {"Language": "English"}]}, "4921756/4903900/5166956": {"title": "Another Story About the Holy Family", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0356, Page 257", "Page 257"], "url": "https://www.duchas.ie/en/cbes/4921756/4903900/5166956", "text": "\n(continued from previous page)\ngone into the tree the web would have been broken so they passed by.Thus the spider saved the Holy Family and for that reason we never like to kill a spider. Nora Sullivan.\n\n\n\nIt is generally believed that on Little Christmas night all the water in the world is changed into wine at midnight.A man remained up one night to test the truth of the story and he was dead in the morning. Nora Sullivan.\n", "school_info": "School: Coiscéim (C.), Átha Treasna", "metadata": [{"Location:": "Newmarket, Co. Cork", "Teacher:": "\nMáire Bean Uí Nialláin\n"}, {"Collector": "Nora Sullivan", "Gender": "female"}]}, "5177602/5172492/5185626": {"title": "New Year's Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0586, Page 107", "Page 107"], "url": "https://www.duchas.ie/en/cbes/5177602/5172492/5185626", "text": "\n(continued from previous page)\nPloughing or turning. Up the clay. This is regarded as unlucky.Dances are very often held during the holidays and in towns concerts for charitable purposses as the St Vincents’De Paul Scoiety. A good number of people receive Holy Comunion New Years ‘day though the mass is at the same time.It is a custom with most people to make good resolutions on this day and they family intend to keep them.\n\n\n\nThis feast day which is called by the church the feast of the Ephipany is always called little Christmas Day.It occurs the 12th day after Christmas and marriages never take place till after it. It falls on the 6th January.School children have to\n(continues on next page)\n", "school_info": "School: Belvoir, Kilkishen", "metadata": [{"Location:": "Belvoir, Co. Clare", "Teacher:": "\nBríd Ní Chadhla\n"}, {"Language": "English"}]}, "5177626/5173936/5199817": {"title": "New Year Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0591, Page 321", "Page 321"], "url": "https://www.duchas.ie/en/cbes/5177626/5173936/5199817", "text": "\n(continued from previous page)\nCandles are lighted in every window New Year's Eve and New Year's night, same as Christmas custom.The first man to enter your house New Year's day is to be offered a drink.The first Monday of the New Year is regarded an unlucky day to turn the clay, or to give a coal of fire.\n\n\n\nThis day is also called the 12th day.  Candles are lighted on the Eve and the night of the feast.  There is very little fuss about this night.  The sweet cakes are again plentiful again and there is an end to them.  Back again to the plain fare.After this 12th day the decorations are taken down.The old people used to say that from the 12th day or 6th January the day lengthens a cock's step till on Candlemas Day they say, \"On Candlemas Day.\"\"Throw candles and candlesticks away, and eat your supper with the light of the day.\"\n", "school_info": "School: Lúbán Díge (Bodyke)", "metadata": [{"Location:": "Bodyke, Co. Clare", "Teacher:": "\nBríd, Bean Uí Chadhla\n"}, {"Language": "English"}]}, "5215813/5215018/5237873": {"title": "Small Christmas", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138D, Page 09_008", "Page 09_008"], "url": "https://www.duchas.ie/en/cbes/5215813/5215018/5237873", "text": "\nSmall Christmas People  believe that every drop of water is changed into wine on the 12th night of Christmas\n", "school_info": "School: St Bridget's", "metadata": [{"Location:": "Derrymore, Co. Mayo", "Teacher:": "\nMáire Uí hOistín\n"}, {"Collector": "Tomás Ó Tónra", "Gender": "male"}, {"Language": "English"}]}}