{"4428278/4391190/4463798": {"title": "Scéal", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1034, Page 303", "Page 303"], "url": "https://www.duchas.ie/en/cbes/4428278/4391190/4463798", "text": "\nI saoghal Chormaic Mhac Airt bhí saoghal bhreagh aoibhinn ait. Bhí naoi gcéad cno ar an chraoibhín agus naoi gcéad craoibhinn ar an tslait.Lá amháin theann sé air a mheigeall mhóra bhána, san faimfeas mór, san toras bán agus shuidh sé ar thaoibh ardáin ar thaoibh na mallacha móire báine. D'amharc sé uaidh siar agus chonnaic sé chuige, aniar an chailleach, ba ghraice i nshúil no i ndall de iomaibh an domhain uilig go léir. Bhí a cuid fiacla a dheanamh stafogaí duithe ins na habaraca agus a chuid gruaige ag sguabadh an talaimh.\"A Chormaic\" arsa sise, ciaca is graice, mise nó an dúil ndiaidh chugat aniar.\" D'amharc sé uaidh siar agus chonnaic sé chuige aniar. Fainnse beaga air, fainnse móra air, fleasg óir i gcúl i chinn, fleag airgid\n(continues on next page)\n", "school_info": "School: Aodh Rua, Dún na nGall", "metadata": [{"Location:": "Donegal, Co. Donegal", "Teacher:": "\nSéamus Mag Shamhráin\n"}, {"Language": "Irish"}]}, "4428280/4391375/4478745": {"title": "Níon Chormaic Mhic Airt", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1035, Page 139", "Page 139"], "url": "https://www.duchas.ie/en/cbes/4428280/4391375/4478745", "text": "", "school_info": "School: Cineal Conaill", "metadata": [{"Location:": "Garvagh, Co. Donegal", "Teacher:": "\nAntoin Ó Dochartaigh\n"}, {"Informant": "Eoin Ó Gallchobhair, Eóin Peadar ", "Gender": "male", "Age": "71", "Address": "Meenderrynasloe, Co. Donegal"}, {"Language": "Irish"}]}, "4922129/4854781/5009784": {"title": "An Old Irish Tale", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0532, Page 260", "Page 260"], "url": "https://www.duchas.ie/en/cbes/4922129/4854781/5009784", "text": "\nKing Cormac macAirt was one of the most famous kings of Ireland.  He ruled his people wisely and while he was on the throne there was peace and plenty in the country.  Cormac served his people well and they all loved him.  King Cormac was a great traveller and when visiting Rome it is said that he heard the story of the Cross and that he became a Catholic secretly.  He refused to worship the pagan idols and on that account he quarrelled with his druids.  One day when Cormac was eating his dinner a salmon bone stuck in his throat and it choked him.  The druids decided that he should be buried in the royal burial ground at Brugh on the river Boyne.  Cormac himself before he died had given orders that he\n(continues on next page)\n", "school_info": "School: An Clochar, Buirgheas Uí Chatháin", "metadata": [{"Location:": "Borrisokane, Co. Tipperary", "Teacher:": "\nSr M. Vincent\n"}, {"Collector": "Maureen O' Donohue", "Gender": "female", "Address": "Bushy Park, Co. Tipperary"}, {"Informant": "John O' Donohue", "Relation": "parent", "Gender": "male", "Address": "Bushy Park, Co. Tipperary"}, {"Language": "English"}]}, "5009312/5006513/5134346": {"title": "An Old Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0895, Page 094", "Page 094"], "url": "https://www.duchas.ie/en/cbes/5009312/5006513/5134346", "text": "\nOnce when Cormac was in Tara he saw on the green, a youth who bore in his hand a fairy branch with apples of red gold amidst it's green leaves.  When one shook the branch sweet music issued from the fruit, which lulled everyone who heard it to sleep and forgetfullness.Cormac coveted the branch and asked the youth if he would sell it to him.  The lad said he would do so for a good price.  Cormac asked what was the price.  \"I shall take no less for it than thy wife Eithne, thy son Cairbre, and thy daughter Ailbe.\"\"Thou shalt have thy price,\"  said Cormac, he then brought the branch into his house and told his wife and son and daughter, he had given them in exchange for it.  When they heard this sorrow filled their hearts.  Cormac shook the branch and when his wife and children heard the sweet music they forgot their troubles and went at Cormac's bidding to meet the man to whom they had been sold.After a year had passed Cormac went to look for his wife, son and daughter.In a short time he entered a great forest.  He came upon a number of men thatching a house with the feathers of foreign birds half the roof was covered with the feathers.  Then the men went to look for more in a distant country.  When they were gone the wind rose and they were all blown off.\n(continues on next page)\n", "school_info": "School: Askamore", "metadata": [{"Location:": "Askamore, Co. Wexford", "Teacher:": "\nMargaret McGrath\n"}, {"Collector": "Daniel Gilbert", "Gender": "male", "Address": "Askamore, Co. Wexford"}, {"Informant": "Mr John Moore", "Gender": "male", "Address": "Ballytarsna, Co. Wexford"}, {"Language": "English"}]}}