{"4427866/4352012/4435482": {"title": "Old Games, Old Songs etc.", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0102, Page 234", "Page 234"], "url": "https://www.duchas.ie/en/cbes/4427866/4352012/4435482", "text": "\nThe old people had a lots of game, which they practise, such as bowling and hurling, and playing marbles. Bowling was played by pitching an iron ball. Who ever pitched it the farthest was supposed to be the best bowler. Playing marbles was supposed to be the best school game.A wake night long ago was a night to be remembered for weeks afterwards, because there were all sorts of games and amusements practised to pass the night. A game called \"Ag diol an coirce\" was a very popular game that was practised at wakes. \"Súgán\" was another game they pracitised during that night. This game was played by gathering in a ring, and having one person in the centre. This crowd passed a ball around, under their feet, and if the man in the centre failed to catch it, he would get a blow of the \"Súgán\" across the neck for every time he failed to catch it. A blow of this Súgán was very severe, as the top of it was a knot of leather. A box of clay pipes was distributed at every wake. These pipes were called \"Lord have Merceys\" or the \"forty-threes.\" A box of rolled tobacco was also given out to the people. The old people of long ago were\n(continues on next page)\n", "school_info": "School: Sruthar (C.)", "metadata": [{"Location:": "Shrule, Co. Mayo", "Teacher:": "\nBríd, Bean Uí Éanacháin\n"}, {"Collector": "Nóra Ní Dhubhdha", "Gender": "female", "Address": "Cahernabrock, Co. Mayo"}, {"Informant": "James Dowd", "Relation": "parent", "Gender": "male", "Age": "65", "Address": "Cahernabrock, Co. Mayo"}, {"Language": "English"}]}, "4427871/4352586/4437092": {"title": "Wakes and Funerals", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0103, Page 388", "Page 388"], "url": "https://www.duchas.ie/en/cbes/4427871/4352586/4437092", "text": "\n(continued from previous page)\nThe Rosary is recited several times during the night of the wake.Any person going on a journey and meeting a funeral should turn and go some distance, no matter how short, with the funeral.It is considered unlucky for a wedding party to meet a funeral. It is said that the bride will not enjoy married life very long.\n\n\n\nOne young fellow would sit in the middle of the floor, and the rest would sit around him in a ring. They would have a Súgán made out of straw and would keep passing it under their legs.The lad in the middle would have to keep a tight watch on every side, or some fellow would hit him with the Súgán. If he was not lively enough to catch the fellow, who struck him, he had to stay in till he got the next blow. When he caught the fellow that hit him he could get out, and the other fellow had to get in.\n\n\n\nLong ago when the people were bringing the corpses, in carts, to the graveyard, they would bring the horse round the cart three times before he would be put under it.\n", "school_info": "School: Loch Measca", "metadata": [{"Location:": "Caherrobert, Co. Mayo", "Teacher:": "\nMáire, Bean an Bhrúnaigh\n"}, {"Collector": "Peggy Lynagh", "Gender": "female", "Address": "Killour, Co. Mayo"}, {"Informant": "Mrs Morrin", "Relation": "unknown", "Gender": "female", "Age": "60", "Address": "Ballyrourke, Co. Mayo"}, {"Language": "English"}]}, "4427871/4352586/4437093": {"title": "Wakes and Funerals", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0103, Page 388", "Page 388"], "url": "https://www.duchas.ie/en/cbes/4427871/4352586/4437093", "text": "\n(continued from previous page)\nThe Rosary is recited several times during the night of the wake.Any person going on a journey and meeting a funeral should turn and go some distance, no matter how short, with the funeral.It is considered unlucky for a wedding party to meet a funeral. It is said that the bride will not enjoy married life very long.\n\n\n\nOne young fellow would sit in the middle of the floor, and the rest would sit around him in a ring. They would have a Súgán made out of straw and would keep passing it under their legs.The lad in the middle would have to keep a tight watch on every side, or some fellow would hit him with the Súgán. If he was not lively enough to catch the fellow, who struck him, he had to stay in till he got the next blow. When he caught the fellow that hit him he could get out, and the other fellow had to get in.\n\n\n\nLong ago when the people were bringing the corpses, in carts, to the graveyard, they would bring the horse round the cart three times before he would be put under it.\n", "school_info": "School: Loch Measca", "metadata": [{"Location:": "Caherrobert, Co. Mayo", "Teacher:": "\nMáire, Bean an Bhrúnaigh\n"}, {"Collector": "Peggy Lynagh", "Gender": "female", "Address": "Killour, Co. Mayo"}, {"Informant": "Mrs Morrin", "Relation": "unknown", "Gender": "female", "Age": "60", "Address": "Ballyrourke, Co. Mayo"}, {"Language": "English"}]}, "4427872/4352962/4437631": {"title": "Games", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0104, Page 340", "Page 340"], "url": "https://www.duchas.ie/en/cbes/4427872/4352962/4437631", "text": "\n340GamesLong, Long ago there was a game played at wakes called Slapping. A man would get up put his hand behind his back with his palm outwards The he would challenge any man in the house for slapping. Then a man would get up and give him three slaps on the hand as hard as he could draw them.Then they would change places and keep on like that every second time till one could give in. Sometimes before they would give in the blood would be streaming out of the tips of their fingers.\n(continues on next page)\n", "school_info": "School: Sruth Nua", "metadata": [{"Location:": "Ardnacally, Co. Mayo", "Teacher:": "\nTomás de Brún\n"}, {"Collector": "Bernard Niland", "Gender": "male", "Address": "Newbrook, Co. Mayo"}, {"Informant": "Patrick Niland", "Relation": "unknown", "Gender": "male", "Age": "64", "Address": "Newbrook, Co. Mayo"}, {"Language": "English"}]}, "4427872/4352964/4437632": {"title": "Games at Wakes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0104, Page 342", "Page 342"], "url": "https://www.duchas.ie/en/cbes/4427872/4352964/4437632", "text": "\n342Games at WakesA man would dress himself in a white sheet. He was called láir bháin. He used to come into the wake and a few more boys with him.They would sit on chairs in the middle of the floor. The láir bhán would have a sticks with pins on the top of it and anyone he did not like he would give them a stab of the pin.Making the BridgeA lot of people would sit in a line opposite the door there would be a man looking to see if they were sitting right for fear the bridge\n(continues on next page)\n", "school_info": "School: Sruth Nua", "metadata": [{"Location:": "Ardnacally, Co. Mayo", "Teacher:": "\nTomás de Brún\n"}, {"Collector": "Christina Fahy", "Gender": "female", "Address": "Robeen, Co. Mayo"}, {"Informant": "John Fahy", "Relation": "unknown", "Gender": "male", "Age": "50", "Address": "Robeen, Co. Mayo"}, {"Language": "English"}]}, "4428079/4375886/4450165": {"title": "Games at Wakes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0153, Page 117", "Page 117"], "url": "https://www.duchas.ie/en/cbes/4428079/4375886/4450165", "text": "\nThe games are usually played at the wakes of old people. When a young person is dead, the sorrow is too great to allow of any such joviality or fun. However those games are dying out rapidly as people become more “civilised”.Thart-an-bróg: A group of men sit round a circle on the floor. They form a close ring, and keep their legs in front of them, with their knees huddled in to their bodies. One man stands in the centre of the ring.Someone in the ring has the “brogue”. It is made of plaited straw, with a knot at one\n(continues on next page)\n", "school_info": "School: Eiscreach", "metadata": [{"Location:": "Eskeragh, Co. Mayo", "Teacher:": "\nSeán Ó Raghallaigh\n"}, {"Collector": "Seán S. Ó Raghallaigh", "Gender": "male", "Occupation": "múinteoir", "Address": "Eskeragh, Co. Mayo"}, {"Informant": "John Gallagher", "Gender": "male", "Age": "circa 55", "Occupation": "farmer", "Address": "Eskeragh, Co. Mayo"}, {"Language": "mixed"}]}, "4427905/4356537/4450901": {"title": "Games Played at Wakes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0112, Page 105", "Page 105"], "url": "https://www.duchas.ie/en/cbes/4427905/4356537/4450901", "text": "\nIn the olden times people played games. All the boys and girls of the village gathered to the house in which the wake was, and they played different games during the night.This is the way they played them. One person would stoop down and put his hand behind his back, then another one would strike him with the palm of his hand and that was called slapping.Next three or four boys would get brushes and they would sweep the dust of the walls on the people that were sitting down and this was called \"Sowing the seed.\"\n", "school_info": "School: Tooreen (St. Brigid's)", "metadata": [{"Location:": "Tooreen, Co. Mayo", "Teacher:": "\nÁine Ní Fhlannagáin\n"}, {"Language": "English"}]}, "4427853/4350778/4453350": {"title": "Games and Pastimes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0099, Page 081", "Page 081"], "url": "https://www.duchas.ie/en/cbes/4427853/4350778/4453350", "text": "\nIn olden times games and pastimes were common among the Irish people. This is one game which they used to play, The name of it is Tharta Bróg. This is the way which it is played, all the men at the house where the person would be dead would sit down on straw on the floor. They would make a rope a few feet long out of the straw which would be left near them and they would put a knot at the end of the rope. THen they would put the rope between their legs and everyone that would be in the game would shout Tharta Bróg. No one would know who had the rope and every one would be expecting a blow. in the end one would catch a hold of the rope and give the other a blow on the foot. The game then would be finished\n", "school_info": "School: Koilmore", "metadata": [{"Location:": "Cuilmore, Co. Mayo", "Teacher:": "\nSéamus Ó Murchadha\n"}, {"Language": "English"}]}, "4427917/4357346/4453437": {"title": "Wakes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0114, Page 136", "Page 136"], "url": "https://www.duchas.ie/en/cbes/4427917/4357346/4453437", "text": "\nWakes.People practised funny games and customs in bygone days. When a person dies they all gathered into the house and remained there during the night. During the day all the people who came to the house would first apoligise with the people of the house on account of their trouble and then they would gather round the corpse and cry for a half-an hour then as the night came they were afraid of the corpse to go home in the dark so they remained in the house all night till day break came.\n", "school_info": "School: Cill Moibhí (C.)", "metadata": [{"Location:": "Kilmovee, Co. Mayo", "Teacher:": "\nÁine, Bean Uí Dhubhthaigh\n"}, {"Collector": "Bea Duffy", "Gender": "female", "Address": "Clooncarha, Co. Mayo"}, {"Informant": "Ann Mc Donagh", "Gender": "female", "Address": "Raherolus, Co. Mayo"}, {"Language": "English"}]}, "4427917/4357363/4453467": {"title": "Wakes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0114, Page 151", "Page 151"], "url": "https://www.duchas.ie/en/cbes/4427917/4357363/4453467", "text": "\nWakes\tLong ago they played many games at wakes such as Rather, Rather, Watch the candle and my ninth daughter.Watch the candle\tThe young boys placed a lighted candle in the middle of the floor and the boys sat around it and kept watching it. A man stood up and went around with a belt and the first one who looked away from the candle got a slap of the belt.Told by, Nancy Griffin\tWritten by, Annie Mc Donagh\n\n\n\nWeddings\tIn olden times the people never got married in the morning, they always got married in the evening. They walked to the chapel. At night, the wedding was held and for the supper they had potatoes, turnips and bacon.Told by, Nancy Griffin\tWritten by, Annie Mc Donagh\n(continues on next page)\n", "school_info": "School: Cill Moibhí (C.)", "metadata": [{"Location:": "Kilmovee, Co. Mayo", "Teacher:": "\nÁine, Bean Uí Dhubhthaigh\n"}, {"Collector": "Nancy Griffin", "Gender": "female", "Address": "Killaclare, Co. Mayo"}, {"Informant": "Annie Mc Donagh", "Gender": "female", "Address": "Raherolus, Co. Mayo"}, {"Language": "English"}]}, "4427917/4357378/4453554": {"title": "Games Played at Wakes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0114, Page 165", "Page 165"], "url": "https://www.duchas.ie/en/cbes/4427917/4357378/4453554", "text": "\nThere were many games play at wakes long ago and these are some of them, Ratha, Ratha, Watch the candle, shean haca, and the nine daughters. This is the way they played Ratha, Ratha. The people all sat on the ground in a circle and put their feet together and passed a belt under their feet while one person stood in the middle of the circle and when they get his back turned they struck him with the belt. Watch the Candle.This is the way they played it. They all stood in a circle while a lighted candle was placed in the centre of the circle and they had to watch it. There was one person going around with a belt watching the people and if he saw anyone looking from the candle he struck him with the belt.\n", "school_info": "School: Cill Moibhí (C.)", "metadata": [{"Location:": "Kilmovee, Co. Mayo", "Teacher:": "\nÁine, Bean Uí Dhubhthaigh\n"}, {"Collector": "Kathleen Mullen", "Gender": "female", "Address": "Killaclare, Co. Mayo"}, {"Language": "English"}]}, "4427934/4358889/4454799": {"title": "Customs at Wakes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0118, Page 142", "Page 142"], "url": "https://www.duchas.ie/en/cbes/4427934/4358889/4454799", "text": "\nCustoms at Wakes.Long ago when a person died in a house when a wake was held all the men of the sourrounding villages would go to wake. They playing (*ed) games some of the games they played were Faugh a Solús, Thart and slaping\" They gave a pipe to everyone in the house and tobacco. They gave drink to the men. They used hold the wake for two days and two nights.I heard those customs from Mrs. Kilgallon, Treenagleragh,Kiltimagh,60 years.May Roche,Treenaglergh,Kiltimagh\n", "school_info": "School: Trian na gCléireach", "metadata": [{"Location:": "Treannagleragh, Co. Mayo", "Teacher:": "\nLiam Breathnach\n"}, {"Collector": "May Roche", "Gender": "female", "Address": "Treannagleragh, Co. Mayo"}, {"Informant": "Mrs Kilgallon", "Gender": "female", "Age": "60", "Address": "Treannagleragh, Co. Mayo"}, {"Language": "English"}]}, "4428145/4381831/4457545": {"title": "Wakes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0650, Page 20", "Page 20"], "url": "https://www.duchas.ie/en/cbes/4428145/4381831/4457545", "text": "\nThis was the custom up to a few years ago. They don't do that now - They only tell stories and jokes. The corpse is left lying down and a habit is worn. When an old person died people used to dress them in their best clothes and put the corpse sitting up. They would go out of the room and close the door for a couple of hours. Then they would start dancing and singing. After that anyone who wanted to go in to see the corpse should go in alone.\n", "school_info": "School: Cnoc Machan, Bun Machan", "metadata": [{"Location:": "Ballynasissala, Co. Waterford", "Teacher:": "\nBríd Ní Fhaoláin; Bríd Ní Mhathúna\n"}, {"Collector": "Brighidh Níc Craith", "Gender": "female", "Address": "Knockmahon, Co. Waterford"}, {"Language": "English"}]}, "4428122/4380161/4463409": {"title": "Tórramh", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0644, Page 230", "Page 230"], "url": "https://www.duchas.ie/en/cbes/4428122/4380161/4463409", "text": "\nTórramhNuair do bhíos-sa óg fuair comharsa béil doruis bás. Tig beag crun-tighe do bhí sé i na chomhnuidhe ann agus bhí sé lán go dous oidhche an tórraimh. Bhí beirt spaisteóirí láthair agus ní rabhdar díomhaoin. Shuidh duine acu ar gach taobh de'n chorp. Tharraing duine acu churg crius a bhí ag coimeád greama ar a bhríste nuair a fuair sé an chaoi ar san do dhéanadh. Do shleamhnuigh sé é f ghuaillmibh an chuirp. Ghreamuig a chomhrádaí an crios ar an dtaobh eile. Ar dúnadh na súl bhí an corp i na shuidhe tabhaill díreach a an leabaidh. Níos scannradh go dtí é agus scréach na mná agus na raibh na fir i na dtost nach an oiread. Thug gach duine aghaidh ar an dorus acht bhí sé sin dúnta agus ní raibh óil ar ó d'oscailt. Ansan d'éirigh an brúghadh-carnáil-gach aoinne i na gheilt ag iarraidh an dorus do dheánadh.Dóbar go mbeadh níos mó ná aon tórramh amháin mar bhí na mná i ndeireadh na sthuige(?) nuair d'éirigh le duine éigin an dorus d'oscailt. Deirimse leat-sa gur fuair an tórramh sa bhí ar an fear-bocht a bhí a an gclár gur cuireadh féin bhfód é. Budh mhilltheach agus budh náireach an cleas é.\n", "school_info": "School: Coill Íseal, Ceapach Chuinn", "metadata": [{"Location:": "Killeeshal, Co. Waterford", "Teacher:": "\nSeán Ó Conaire\n"}, {"Collector": "Seán Ó Conaire", "Gender": "male"}, {"Language": "Irish"}]}, "4428122/4380162/4463411": {"title": "Tórramh Eile", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0644, Page 231", "Page 231"], "url": "https://www.duchas.ie/en/cbes/4428122/4380162/4463411", "text": "\nIs cuimhin liom bheith ag tórramh eile i dTuar an Fhíona agus bhí an té dá chur i gcóir. Is cuimhin liom an té dá tharraingt le hais na tine. Bhí an tobac agus na píopaí á dtabhairt amach san am chéana agus bhí an tobac agus an snaoisín ar bóirdín i gcúinne na cistine. Bhraitheas ar aghaidh lad óg go raibh droch-fhuadar fé agus bhraitheas cad a bhí ag tabhairt scrine dó - an tobac. Ní ró-fhada go raibh ladhar de ina ghlaic agus shíleas gur ag líónadh a phíopa a bhí, ach ba gairid gur shleamhnaigh sé é chun bhioránaig eile a bhí ina shuí ar stóilín le hais na tine. Chrom sé seo ag láimhseáil chlúdaigh an taypot agus d'éirigh leis an tobac do chur á tharraingt i dteannta an tay.Glaodhadh ar na mná chun an tay agus ó go raibh sé timpeall an dó ar maidin bhí saghas cíocrais ortha chuige. Bhraitheadar ná raibh an blas r-shlántiúl ach thairis sin ní raibh amhras an domhain ortha. Ba ró-ghairid ina dhiaidh sin go raibh an goile ag goillúint ortha ach is fánaire dhíobh ar d'éirigh leo an doras do dhéanadh agus bhíodh 'ag tórraimh' cuid díobh ar feadh dhó uair a chloig agus cuid acu i riocht an bháis. Bhí an stuif ag teacht ina thulcaí comh mion, minic sin go raibh air an dá bhóthair - síos agus suas - do thógaint ar féin.\n", "school_info": "School: Coill Íseal, Ceapach Chuinn", "metadata": [{"Location:": "Killeeshal, Co. Waterford", "Teacher:": "\nSeán Ó Conaire\n"}, {"Collector": "Seán Ó Conaire", "Gender": "male"}, {"Language": "Irish"}]}, "4428122/4380163/4463414": {"title": "An Piobar Dearg", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0644, Page 232", "Page 232"], "url": "https://www.duchas.ie/en/cbes/4428122/4380163/4463414", "text": "\nSeo im'óige féin leis. Cleasaidheacht ag tórram shean-duine. Ag dorus againn-ne a pléidheag an cleas so. Bhí an tigín lán go dorus aét ó bhí an oidhche glas bhí an dorus dúnta. Ní fhaca aornne dada acht sgéidh an scéal amach tamall i na dhaidh sin. Beirt chleasaidhe a thug fé an job do dhéanadh. Níor chuadar ar an dtórran acht d'fhanadar ag sliúcamaoracht ar fuaid baill go raibh an áit leath-stig lán. D'éaluigdear dtín dorus agus tré pholl na h-eochrach do shéoladar and \"Fear bríoghmhar,\" an piobar dearg, isteach imeasc an torraimh.Ní raibh a bhfad le fuireacht ag ana cearrammaig leath-smuig nuair a bhí toradh-á-saothair acu. Biongtach an míle-muider bhí sa seomrín sin agus budh ró-thapaidh a bhíodhg ag fhollamhaghadh na h-áite. Dá bhfuighfí teacht suas leó so a bhí cronntach a bheadh droch-obair ar bun agus gortuighadh gan slánughadh ar an dream beirte sin.Ní dhéantar a leithéid seo anois mar tá meas níos fearr ná san againn ar an mbás agus ortha so a bhíonn básuighthe- moladh go deó leó.\n", "school_info": "School: Coill Íseal, Ceapach Chuinn", "metadata": [{"Location:": "Killeeshal, Co. Waterford", "Teacher:": "\nSeán Ó Conaire\n"}, {"Collector": "Seán Ó Conaire", "Gender": "male"}, {"Language": "Irish"}]}, "4427952/4360556/4464150": {"title": "Wakes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0122, Page 137", "Page 137"], "url": "https://www.duchas.ie/en/cbes/4427952/4360556/4464150", "text": "\nI was again talking with my grandmother about the wakes in olden times. Now the people who die in Midfield parish have no wakes but they are brought the evening before burial to the church. This custom was reintroduced a few months ago by Father Gildea the Curate who said from the alter he would not bless the graves if they would refuse to do that. \tLong ago the young people conducted themselves very badly at wakes. The old people used to be drunk and the men were very often arguing and fighting. My grandmother told me that boys and girls often sang, and played cards at wakes. They also “slapped” at wakes and behaved in a very mischievous manner and had no sympathy for the sorrowful relatives of the dead person. Long ago the people had a pisrogue connected with wakes. Any person would not go home by himself or herself from a\n(continues on next page)\n", "school_info": "School: Caiseal", "metadata": [{"Location:": "Cashel, Co. Mayo", "Teacher:": "\nPádraig Mac Mághnuis\n"}, {"Collector": "Paddy Mc Donnell", "Gender": "male", "Address": "Curryaun, Co. Mayo"}, {"Informant": "Mrs Mc Donnell", "Relation": "grandparent", "Gender": "female", "Address": "Curryaun, Co. Mayo"}, {"Language": "English"}]}, "4428064/4374347/4464660": {"title": "A Wake", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0149, Page 408", "Page 408"], "url": "https://www.duchas.ie/en/cbes/4428064/4374347/4464660", "text": "\nWhen the corpse is washed all the people come to the wake. All the persons friends that is dead come to the wake. They wait until eight oclock in the morning. They get whiskey and tobacco. When they go into the house they kneel down outside the corpse and pray. They spend the night playing games. When it is morning they put the corpse into the coffin. They put the sheet of the bed in around the corpse. The name of the person that is dead is written on the lid and the age. If you meet a funeral you should always go three steps with it or yourself might go next. It is not lucky to dig a grave on a Monday.\n", "school_info": "School: Sruthán an Aifrinn", "metadata": [{"Location:": "Massbrook Lower, Co. Mayo", "Teacher:": "\nBríd Ní Mhóráin\n"}, {"Language": "English"}]}, "4427961/4361310/4465722": {"title": "Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0124, Page 20", "Page 20"], "url": "https://www.duchas.ie/en/cbes/4427961/4361310/4465722", "text": "\nLong ago the people used to play a lot of tricks at a wake. They used to play care. The people used to have a thick rope made from straw. On the night of a wake they would sit down on the floor in a ring and they would have one person in the middle of the ring. They would pass the rope from person to person and they would keep hitting the person in the middle until he would catch the rope.\n", "school_info": "School: Sráid (C.)", "metadata": [{"Location:": "Strade, Co. Mayo", "Teacher:": "\nBean Uí Liodáin\n"}, {"Collector": "Máire Ní Aodha", "Gender": "female"}, {"Informant": "(name not given)", "Relation": "grandparent", "Gender": "male"}, {"Language": "English"}]}, "4427961/4361228/4465916": {"title": "Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0124, Page 126", "Page 126"], "url": "https://www.duchas.ie/en/cbes/4427961/4361228/4465916", "text": "\nLong ago the people used to play a lot of tricks at a wake. They used to play. The people used to have a thick rope made from straw. On the night of a wake they would sit down on the floor in a ring and they would have one person in the middle of the ring. They would pass the rope from person to person and they would keep hitting the person in the middle until he would catch the rope.\n", "school_info": "School: Sráid (C.)", "metadata": [{"Location:": "Strade, Co. Mayo", "Teacher:": "\nBean Uí Liodáin\n"}, {"Collector": "Máire Ní Aodha", "Gender": "female"}, {"Language": "English"}]}, "4428335/4396521/4466051": {"title": "Wake Games", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1049, Page 18", "Page 18"], "url": "https://www.duchas.ie/en/cbes/4428335/4396521/4466051", "text": "\nThe people of my district play lots of games at the wakes. This is their names, hide the gully, putting the eye in the pig, the Parish priest, and sell the knife. This is how they play hide the gully a man get a piece of turf and goes round the people with it and he say's hide the gully hide the gully  in a wee wee well. then he asks some person who has got the gully if the person guesses right there will be nothing done on him but if he guesses wrong he will get penance to do and if he does not do the penance he will be blackened with polishThis is how you play \"sell the knife\" a crowd of people sit round and every one must have a partner. The man that is giving out the game says that is a good knife. what ever person he points till, his partner has to answer. Then the man will say how much will you give me for the knife and he will point to some one else. If his partner dose not answer quick he will get\n(continues on next page)\n", "school_info": "School: Clochar", "metadata": [{"Location:": "Inishkeel, Co. Donegal", "Teacher:": "\nSeán Mac Giolla Bhríghde\n"}, {"Informant": "Patrick Moore", "Gender": "male", "Age": "65", "Occupation": "farmer", "Address": "Naran, Co. Donegal"}, {"Language": "English"}]}, "4428335/4396550/4466074": {"title": "Wake Games", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1049, Page 22", "Page 22"], "url": "https://www.duchas.ie/en/cbes/4428335/4396550/4466074", "text": "\nsays \"Poor Jenny Jone's is sick in bed, sick in bed sick in bed, poor Jenny Jone's is sick in bed you cannot see her now\"The children say the same again and she answers the same again only this time she say's \"she is dying and that you cannot see her now\" Again they say the same and she answer's \" Poor Jenny Jone's is dead, dead, dead. Poor Jenny Jone's is dead you can see her now \"What shall I dress her in will white do\" They say \"White is for wedding's that won't do\" again she ask's \"What shall I dress her in will blue do\" \"Blue is for sailor's that won't do\" Again she ask's \"What shall I dress her in will brown do\" \"Brown is for funerals, that will do\". Then they carry her to the graveyard and lay her in a grave. All the people begin to cry. she rises up out of the grave. all the people begin to cry. she rises up out of the grave and runs after them and who wer she catche's must be Jenny Jone's again.Another game is. All the people sit around the fire and some lights a piece of stick in the fire and he says Jacky my man if you die in my hand the straddle and hads will go on me. Then the person hand it to de next\n(continues on next page)\n", "school_info": "School: Clochar", "metadata": [{"Location:": "Inishkeel, Co. Donegal", "Teacher:": "\nSeán Mac Giolla Bhríghde\n"}, {"Informant": "Patrick Moore", "Gender": "male", "Age": "65", "Occupation": "farmer", "Address": "Naran, Co. Donegal"}, {"Language": "English"}]}, "4427969/4361953/4466260": {"title": "Wake Games - Reata", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0126, Page 124", "Page 124"], "url": "https://www.duchas.ie/en/cbes/4427969/4361953/4466260", "text": "\nGames were played in this district called \"Reaca\". The young men sat in a ring on the floor and and another man stood in the middle. Those who were seated on the floor concealed under their knees a belt which the young man had to search for. While searching for the belt he got three or four blows in quick succession. This game was also calle \"bróg about\" and has not been played for over forty years.\n", "school_info": "School: N. Seosamh, Cill Lasrach", "metadata": [{"Location:": "Killasser, Co. Mayo", "Teacher:": "\nS. Mac Carrghamhna\n"}, {"Language": "English"}]}, "4427984/4363889/4469264": {"title": "Pisreogaí", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0129, Page 392", "Page 392"], "url": "https://www.duchas.ie/en/cbes/4427984/4363889/4469264", "text": "", "school_info": "School: Gleann Caisil", "metadata": [{"Location:": "Glencastle, Co. Mayo", "Teacher:": "\nEoghan Ó Súilleabháin\n"}, {"Informant": "Pádraic Ó Ciaráin", "Gender": "male", "Age": "75", "Address": "Doolough, Co. Mayo"}, {"Language": "Irish"}]}, "4428008/4367753/4471196": {"title": "Cleasanna i dTigh Tórraimh", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0136, Page 149", "Page 149"], "url": "https://www.duchas.ie/en/cbes/4428008/4367753/4471196", "text": "", "school_info": "School: Eachléim", "metadata": [{"Location:": "Aghleam, Co. Mayo", "Teacher:": "\nMáire Ní Chróinín\n"}, {"Collector": "Mairéad Ní Mhaoineacháin", "Gender": "female"}, {"Language": "Irish"}]}, "4428047/4371974/4474063": {"title": "Folklore", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0145, Page 215", "Page 215"], "url": "https://www.duchas.ie/en/cbes/4428047/4371974/4474063", "text": "\nWhen the young people would gather into the wake, a bundle or two of straw would be thrown on the kitchen floor. The girls would keep their seats on the forms round the fire, but most of the boys would sit in a ring on the straw around the floor and play the game of \"thart a bhróg.\" In this game one of the boys was told off to stand in the middle of the ring. His job was to get the \"bróg\" which was a plaited straw rope about two feet long, and which the sitters passed from one to another under their knees. Their knees were covered with straw. The person with whom he found the knot would have to stand up then until he would find the \"bróg\" at somebody else. The game would\n(continues on next page)\n", "school_info": "School: Baile Mhic Citheóla", "metadata": [{"Location:": "Ballymackeehola, Co. Mayo", "Teacher:": "\nSeán Mac Giolla Bharraigh\n"}, {"Collector": "Mary G. Gilvarry", "Gender": "female", "Address": "Rathoma, Co. Mayo"}, {"Informant": "Mr Michael Callaghan", "Gender": "male", "Address": "Rathoma, Co. Mayo"}, {"Language": "English"}]}, "4428047/4371976/4474064": {"title": "Folklore", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0145, Page 217", "Page 217"], "url": "https://www.duchas.ie/en/cbes/4428047/4371976/4474064", "text": "\nWhen the young boys would gather into the wake all their caps would be gathered and put in a pile on the table. Then each boy would be asked to sing. If he sang he would get his cap back all night, but if he would not sing his cap would be ripped and then given to him.\n", "school_info": "School: Baile Mhic Citheóla", "metadata": [{"Location:": "Ballymackeehola, Co. Mayo", "Teacher:": "\nSeán Mac Giolla Bharraigh\n"}, {"Collector": "Mary G. J. Gilvarry", "Gender": "female", "Address": "Rathoma, Co. Mayo"}, {"Informant": "Mr Michael Callaghan", "Gender": "male", "Address": "Rathoma, Co. Mayo"}, {"Language": "English"}]}, "4498605/4385178/4498639": {"title": "Wakes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0790, Page 125", "Page 125"], "url": "https://www.duchas.ie/en/cbes/4498605/4385178/4498639", "text": "\nWhen one of the people around the village dies the remains is waked. A person going by the house is always allowed in to say some prayers for the repose of the dead man's soul. In the night-time people crowd to the wake. When a person comes in and before they go out they say prayers beside the remains. During the night until day break the next day the house is generally full with people. There is plenty of beer at every wake and while people are drinking it they converse on all the good things the dead man did during his lifetime but very little is said about the bad things he did. When every-body's stomach is satisfied games are played. The following are some of the games that are played at wakes:\"The grass that grew crooked around the crooked crab tree\", \"Band Master\" \"Bird lost\" Chew, \"Chew the Button\" \"My Man Jack\" \"All hammers on the block\" Little bit of fish\".\n(continues on next page)\n", "school_info": "School: Mulhuddart", "metadata": [{"Location:": "Mulhuddart, Co. Dublin", "Teacher:": "\nTomás Ó Broin\n"}, {"Collector": "Kathleen Caffrey", "Gender": "female", "Address": "Mulhuddart, Co. Dublin"}, {"Language": "English"}]}, "4498641/4385278/4498670": {"title": "A Wake Long Ago", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0790, Page 215", "Page 215"], "url": "https://www.duchas.ie/en/cbes/4498641/4385278/4498670", "text": "\nA wake long ago.Long ago I was told that my grandma went to a wake.I was an old friend that was dead and all the neighbours went in.Things were not as quite as we know them now.They were making teas in one room, and playing cards and games in the room the corpse was in.One woman asked \"what was such an uproar made for and they answered To keep the people of the house from freting.As soon as the tea was over they all shouted out, All in for a game of \"spin the bottle. There is not one in the house can't play that.So they all joined in and they and my grandma had a great night of sport.It last all night, but my grandma left at five o'clock.\n\n\n\n(continued from previous page)\n[/]\n\n\n\nLong ago I was told that my grandma went to a wake.I was an old friend that was dead and all the neighbours went in.Things were not as quite as we know them now.They were making tea in one room, and playing cards and games in the room the corpse was in.One woman asked \"what was such an uproar made for\" and they answered To keep the people of the house from freting.As soon as the tea was over they all shouted out, All in for a game of \"spin the bottle. There is not one in the house who can't play that.So they all joined in and they and my grandma had a great night of sport.It last all night, but my grandma left at five o'clock.\n", "school_info": "School: St Brigid's, Castleknock", "metadata": [{"Location:": "Castleknock, Co. Dublin", "Teacher:": "\nMrs Thornton\n"}, {"Collector": "Rita Hughes", "Gender": "female", "Age": "13", "Occupation": "pupil"}, {"Informant": "Peter Hughes", "Relation": "unknown", "Gender": "male"}, {"Language": "English"}]}, "4497908/4344703/4506560": {"title": "Archaeological - Wake Games", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0087, Page 106", "Page 106"], "url": "https://www.duchas.ie/en/cbes/4497908/4344703/4506560", "text": "\nWake games - 1. Thart-a-Bhróg -Description - Some straw is got and twisted together like a sugán. About 1 1/2 or 2 feet in length. One end is to be much thicker than the other. The men and boys sit down on the floor in a ring close together and one is to sit in some straw in the centre of the crowd.Someone in the ring hides the twisted straw at the back of his shoes, and suddenly pulls it and starts to wallop the person in the centre with it. Then he passes it - without being seen to the next person, and he gives a few blows also to the fellow in the centre. The centre fellow tries to grasp the tart-a-bróg (as it is termed) and if he succeeds in doing so the fellow he grasped it from has then to sit in centre and gets the walloping like the other. He tries to grasp it also as he gets a blow and the person he pulls it from has to take his place in the centre\n(continues on next page)\n", "school_info": "School: Sraith Mór", "metadata": [{"Location:": "Srahmore, Co. Mayo", "Teacher:": "\nBríd Bean Mhic Ultaigh\n"}, {"Collector": "Bríghid Bean Mhic Ultaigh", "Gender": "female", "Occupation": "múinteoir"}, {"Language": "English"}]}, "4497908/4344705/4506561": {"title": "Wake Games", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0087, Page 108", "Page 108"], "url": "https://www.duchas.ie/en/cbes/4497908/4344705/4506561", "text": "\nCéadaoin - \"The round about\"3. One man would stand in the floor of Kitchen or room where dead person would be laid out, 8 or 9 others would stand at his back. The man standing would have his eyes closed, and his hands to his eyes.Someone of the 8 or 9 would tip him on the ear or the hands.He'd turn 'round quickly- open his eyes, and search along the line to see if he could find out the man that struck him, and if he hadn't the right man that struck him he would be taken around the whole ring by the ear - by the man that struck him.He should remain standing thus, until he'd find the man that\n(continues on next page)\n", "school_info": "School: Sraith Mór", "metadata": [{"Location:": "Srahmore, Co. Mayo", "Teacher:": "\nBríd Bean Mhic Ultaigh\n"}, {"Collector": "Bríghid Bean Mhic Ultaigh", "Gender": "female", "Occupation": "múinteoir"}, {"Informant": "Seán Muiréadh", "Gender": "male", "Age": "72"}, {"Language": "English"}]}, "4497908/4344708/4506562": {"title": "Archaeological - Pósadh or Marrying", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0087, Page 110", "Page 110"], "url": "https://www.duchas.ie/en/cbes/4497908/4344708/4506562", "text": "\nThere would be one man singled out of the crowd at the wake, and he'd be dressed as a false priest. His dress would be a straw sugán around his waist, another straw sugán around his neck and 2 straw sugáns around his legs and a high straw hat.Then they would put a big stick in his (the priest's) hand with a \"cáns\"? on it. Then the priest would stand up and 2 clerks with him. They would take out the most respectable and tasty man in the crowd, to stand before the priest and the priest would say to that man \"Frumsa Fromsa seo\" Céard atá tú ag iarraidh\n(continues on next page)\n", "school_info": "School: Sraith Mór", "metadata": [{"Location:": "Srahmore, Co. Mayo", "Teacher:": "\nBríd Bean Mhic Ultaigh\n"}, {"Collector": "Brighid Bean Mhic Ultaigh", "Gender": "female"}, {"Informant": "Seán Muiréad, John Murray", "Gender": "male", "Age": "72", "Address": "Newport, Co. Mayo"}, {"Language": "mixed"}]}, "4497908/4344712/4507439": {"title": "Wake and Funeral Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0087, Page 114", "Page 114"], "url": "https://www.duchas.ie/en/cbes/4497908/4344712/4507439", "text": "\nPeople when dead were not \"laid out\" in beds, as now, but on a table. There were no \"habits\" then, but their ordinary night attire was put on the departed person.\n", "school_info": "School: Sraith Mór", "metadata": [{"Location:": "Srahmore, Co. Mayo", "Teacher:": "\nBríd Bean Mhic Ultaigh\n"}, {"Collector": "Brighid Bean Mhic Ultaigh", "Gender": "female", "Occupation": "múinteoir"}, {"Language": "English"}]}, "4498641/4385278/4509835": {"title": "A Wake Long Ago", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0790, Page 215", "Page 215"], "url": "https://www.duchas.ie/en/cbes/4498641/4385278/4509835", "text": "\nA wake long ago.Long ago I was told that my grandma went to a wake.I was an old friend that was dead and all the neighbours went in.Things were not as quite as we know them now.They were making teas in one room, and playing cards and games in the room the corpse was in.One woman asked \"what was such an uproar made for and they answered To keep the people of the house from freting.As soon as the tea was over they all shouted out, All in for a game of \"spin the bottle. There is not one in the house can't play that.So they all joined in and they and my grandma had a great night of sport.It last all night, but my grandma left at five o'clock.\n\n\n\n(continued from previous page)\n[/]\n\n\n\nLong ago I was told that my grandma went to a wake.I was an old friend that was dead and all the neighbours went in.Things were not as quite as we know them now.They were making tea in one room, and playing cards and games in the room the corpse was in.One woman asked \"what was such an uproar made for\" and they answered To keep the people of the house from freting.As soon as the tea was over they all shouted out, All in for a game of \"spin the bottle. There is not one in the house who can't play that.So they all joined in and they and my grandma had a great night of sport.It last all night, but my grandma left at five o'clock.\n", "school_info": "School: St Brigid's, Castleknock", "metadata": [{"Location:": "Castleknock, Co. Dublin", "Teacher:": "\nMrs Thornton\n"}, {"Language": "English"}]}, "4428244/4388086/4510755": {"title": "Customs Associated with Wakes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0799, Page 280", "Page 280"], "url": "https://www.duchas.ie/en/cbes/4428244/4388086/4510755", "text": "\nDistrict:- BroomfieldParish  Donaghmoyne, Co. MonaghanSingingSinging songs was quite a common practice at wakes down to recent times, say 20 yrs.  It was the rule always to seek permission from the people of the house before starting to sing.  Local singers were asked to contribute a song and occasionally there would be a competition as to who could sing the most songs.I have never heard of the above customs being followed in any other district.  Has it any origin?  Was it merely meant to while away the tedious hours at a wake?Game\"Fair Judge and Foul Judge\"Games of rather a rough type were practised at wakes.  \"Fair Judge and Foul Judge\" was a popular one.Method of Playing:-Two men were chosen to act as Judges, one\n(continues on next page)\n", "school_info": "School: St Peter's, Phibsboro", "metadata": [{"Location:": "Phibsborough, Co. Dublin", "Teacher:": "\nSs. Breathnach\n"}, {"Language": "English"}]}, "4428244/4388089/4510762": {"title": "Customs Associated with Wakes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0799, Page 283", "Page 283"], "url": "https://www.duchas.ie/en/cbes/4428244/4388089/4510762", "text": "\n(continued from previous page)\nShould the charge fail according to the verdict of the Judge the defendant took hold of the accuser by the ear and marched him round as before and back to his original position where he had to withstand another 'slap' from someone else.  The accused kept repeating the words -\" You have the wrong sow by the lug\" while he was marching his accuser up and down the line.Where the Game was Played:-Usually in a barn; never in the kitchen of the wake-house.I have, when a boy, seen the above game played on several occasions.\n\n\n\nThis was a most popular game at wakes in the Broomfield district.  It was also played at wakes.A lighted candle was placed on the floor.  Two young fellows got an ashen stick about 5 feet long, and stood astride it one behind the other.  Both of them gripped the stick tightly with their hands.  The fellow behind was to try and overturn the candle\n(continues on next page)\n", "school_info": "School: St Peter's, Phibsboro", "metadata": [{"Location:": "Phibsborough, Co. Dublin", "Teacher:": "\nSs. Breathnach\n"}, {"Language": "English"}]}, "4428244/4388091/4510766": {"title": "Fear an Tí agus Bean an Tí", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0799, Page 285", "Page 285"], "url": "https://www.duchas.ie/en/cbes/4428244/4388091/4510766", "text": "\nThe above was another popular game played at wakes but it ceased to be played some 60 years ago.  The two previous games already described survived to a much later date, say down to 1914.  I don't believe they are played at the present time.Description of the Game:A ring of young fellows was formed, about 10 or 12 participating.  Two lads stood in the centre of the ring, one was known as Fear a tighe, the other as Bean a tighe.  Bean a tighe was armed with a saucer of soot.  Names were given to each member in the ring as Jug, Mug, Cup, Can, Knife, Plate, Fork, Spoon etc etc.Fear a tighe would call out say \"Turn about Spoon.  Spoon would immediately call out some name int he list, and say, for example, Turn about Jug.  Jug then would call out another name say \"Turn about Can\" and so on.  When a member in the ring failed to respond to his name being called out (the game was played rapidly and it was quite easy to miss one's name) - Bean a tighe would go over and daub his face with soot.  Again, if a member\n(continues on next page)\n", "school_info": "School: St Peter's, Phibsboro", "metadata": [{"Location:": "Phibsborough, Co. Dublin", "Teacher:": "\nSs. Breathnach\n"}, {"Language": "English"}]}, "4428244/4388093/4510771": {"title": "Game", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0799, Page 287", "Page 287"], "url": "https://www.duchas.ie/en/cbes/4428244/4388093/4510771", "text": "\nAnother game in which both boys and girls participated at wakes has an important historical significance.A number of boys and girls formed into a ring in the centre of which sat either a boy or a girl.  Those in the ring marched around singing.\"We all are marching to Quebec,Where the drums are loudly batin'Where the 'mericans they gained the day,And the British are retratin'So now the war is over,We return to where we startedSo open up the ring, And let another in.That seems to be true-hearted\"It fell to the lot of some boy members in the ring to take his place beside the girl in the centre.  How this was determined I do not know as I have never seen the game played.  It was a popular game some 60 or 70 years ago.\n", "school_info": "School: St Peter's, Phibsboro", "metadata": [{"Location:": "Phibsborough, Co. Dublin", "Teacher:": "\nSs. Breathnach\n"}, {"Language": "English"}]}, "4428387/4402894/4510942": {"title": "Coimhéad na hUaighe", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1067, Page 144", "Page 144"], "url": "https://www.duchas.ie/en/cbes/4428387/4402894/4510942", "text": "\n(continued from previous page)\ngo luath is bheadh ceathrar tuirseach, bhí ceathrar eile na áit. Bhain an taobh i bhfos an rása. Níor fhan siad le geafta a fhosgladh ach chuir an choimhnair suas an bhalla na roillge agus isteach leo. Bhí siad i seilbh mar deirfea sul a dtainig an bunadh eile. Thoisigh an bhruigheann eadar an dá thaobh agus ghread siad a chéile. Chuir seo dúradh le coimhlint dul na h-uisge.\n\n\n\nSa t-sean aimsir agus go dtí na moillibh bheadh mórán greann agus plérácha da iomchar ar aghaidh ag farraigheacha go h-áiridh nuair a bhain (?) sean duine ar bhar a raibh a shaoghal caithte. Chruinniughadh an t-aos óg isteach i ndiaidh dhul a sholus agus ní chormochadh an mhór chuid aca go bóranacht an lae. Bheadh mórán cleas (?) da imirt aca. Thart a bhróg - Díol an\n(continues on next page)\n", "school_info": "School: Doire Beag (B.)", "metadata": [{"Location:": "Derrybeg, Co. Donegal", "Teacher:": "\nLiam Mac Giolla Chomhghaill\n"}, {"Language": "Irish"}]}, "4428394/4403859/4514649": {"title": "Cleas an Chnaipe", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1069, Page 308", "Page 308"], "url": "https://www.duchas.ie/en/cbes/4428394/4403859/4514649", "text": "\nCleas é seo a chleachtuightí ag cruinnigheacha aois óig go h-áirithe ag faire. Bheireadh fear leis cnaipe no leithphighinn agus chuireadh sé idir a dhá bhais í. Shuidheadh an chuid eile de'n aos óg thart agus mbasa le chéile aca fosta. Theideadh an fear a mbíodh an cnaipe aige thart agus ghnidheadh sé mar bhéadh sé a gabhail a chur an chnaipe idir bhasa gach duine agus bheireadh sé an cnaipe dó dhuine éigin aca. Annsin théideadh sé thart arais agus crios leathair leis agus d'fhíafruigheadh sé dó gach duine cé aige a rabh an cnaipe. Muna dtomhaisfeádh an duine é gheobhadh sé uimhir áirighthe buillí de'n chrios. I n-amanna eile bhainfidh geall do'n duine sin agus rachaidh ar aghaidh leis an chleas go mbíodh geall bainte do gach duine. Rachadh fear ar a ghlúine annsin agus chuirfeadh a cheann i n-ucht an fhir a rabh na gealltai aige. Thógfadh seisean geall agus déarfadh, \"Ta ball mór maith annseo\n(continues on next page)\n", "school_info": "School: Gort an Choirce", "metadata": [{"Location:": "Gortahork, Co. Donegal", "Teacher:": "\nSéamus Mac Giolla Easbuic\n"}, {"Language": "Irish"}]}, "4493685/4410596/4524708": {"title": "Amusements at Wakes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1090, Page 485", "Page 485"], "url": "https://www.duchas.ie/en/cbes/4493685/4410596/4524708", "text": "\nAmusement at WakesOne of the old games some forty or fifty years ago was what they called (hide the gully). The gully was a pocket knife or a short piece of a stick so they would sit all around the kitchen in a row on the floor there would be one person appointed for searching them so one in the row would have the (gully) but the searcher would not know who had it so he would start at one end of the row and search trying to find it they would pass it from one to another in the row under their laps all calling out (hide the gully, hide the gully, hide the gully well) and whatever person the gully would be found with the penalty was a number of strokes of soot from the chimney put on his cheek. The would carry on at that game until they would be as black as nigers.Another game they played at wakes was the miller grinding the corn into meal. One of the strongest men at the wake would be appointed for carrying the corn bags. He would carry the men or boys that were at the wake on his back and place them in a row sitting on the floor until he would have\n(continues on next page)\n", "school_info": "School: St Davaddog's, Tamney", "metadata": [{"Location:": "Tawny, Co. Donegal", "Teacher:": "\n-\n"}, {"Collector": "Katie Mc Bride", "Gender": "female"}, {"Language": "English"}]}, "4493685/4410597/4524715": {"title": "Amusements at Wakes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1090, Page 486", "Page 486"], "url": "https://www.duchas.ie/en/cbes/4493685/4410597/4524715", "text": "\n(continued from previous page)\nquite a member of them. Then he would get his mill into working order he would have so many men carrying water then the mill would take fire. The miller would call out water, water, like the mill is on fire. Then the two men would come forward with the water and throw it on the men that the were making the corn bags of the people would get all drenched to the skin the owners of the house would put them out then the would go outside and stop the chimney on tie the doors.\n\n\n\nThis was a game they played at nearly every wake called Sweet. Draughts. They way the played them was two men sat down on the floor and got their heels together they got a big strong stick. Each one of them got a end and pulled to see which could lift each other. When they would be pulling right hard too men would stand on the tails of their coats to keep them from rising and very often the pulled that hard that some of them got their backs hurt.\n", "school_info": "School: St Davaddog's, Tamney", "metadata": [{"Location:": "Tawny, Co. Donegal", "Teacher:": "\n-\n"}, {"Collector": "Mary Ann Gibbons", "Gender": "female"}, {"Language": "English"}]}, "4493706/4412966/4528682": {"title": "Wake Games - The House that Jack Built", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1096, Page 336", "Page 336"], "url": "https://www.duchas.ie/en/cbes/4493706/4412966/4528682", "text": "\n1. The House that Jack built.  Any number of players may take part with one person in charge.   This latter takes some convenient object a stick, clod, (?) and presents it to the first of the others taking part, saying \"Take that\". \"What is that?\" the other asks as he takes it, and he is told \"That is the house that Jack built\" The person who now has it passes it on to the next with the same words as were used when he got it himself. The second passes it to the third and so on until it is passed round all the players and come back again to the one in charge. He now turns again to the first player and again presents him with the object, saying 'Take that', and in answer to the question \"What is that\" he says \"That is the malt (/) that lay in the house that Jack built\".The first player passes it on to the second with the same series of question and answers and thus it is passed round and back to the leader again. Presenting it once\n(continues on next page)\n", "school_info": "School: Dubhais", "metadata": [{"Location:": "Dooish, Co. Donegal", "Teacher:": "\n-\n"}, {"Language": "English"}]}, "4493706/4412968/4528684": {"title": "Wake Games - The House that Jack Built", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1096, Page 338", "Page 338"], "url": "https://www.duchas.ie/en/cbes/4493706/4412968/4528684", "text": "\n(continued from previous page)\nand torn, to the maiden all forlorn, that milked the cow with crumbledy horn, that pitched the wee dog over the barn, that worried that cat, that killed the rat, that cut the cord, that tied the sack, that held the malt that lay in the house that Jack built.   2. The Crooked crab tree.   This is played on the same lines as 'the house that Jack built\".   Take that. What is that? That is the crooked crab tree.   Take that. What is that? That is the crooked grass, that grew crooked under the crooked crab tree.Then - That is the crooked horse that ate the crooked grass that grew crooked under the crooked crab tree.   Finally each player has the following to get over: That is the crooked hen that laid the crooked egg, that the crooked child ate, that the crooked\n\n\n\nThis is played on the same lines as 'the house that Jack built\".Take that. What is that? That is the crooked crab - tree.Take that. What is that? That is the crooked grass, that grew crooked under the crooked crab - tree.Then - That is the crooked horse that ate the crooked grass that grew crooked under the crooked crab - tree.Finally each player has the following to get over: That is the crooked hen that laid the crooked egg, that the crooked child ate, that the crooked\n(continues on next page)\n", "school_info": "School: Dubhais", "metadata": [{"Location:": "Dooish, Co. Donegal", "Teacher:": "\n-\n"}, {"Language": "English"}]}, "4493706/4412969/4528686": {"title": "Wake Games - The Crooked Crab Tree", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1096, Page 339", "Page 339"], "url": "https://www.duchas.ie/en/cbes/4493706/4412969/4528686", "text": "\n(continued from previous page)\nwoman had, to the crooked man, that owned the crooked horse that ate the crooked grass that grew crooked under the crooked crab tree.\n\n\n\nThis is a kind of musical game.The head man gathers his players no fixed numbers - and assigns to each of them and to himself a certain musical instrument.He himself selects a fiddle and gets a big stick to represent the bow.Of the other players one is supposed to have a melodeon, another a flute, another a mouth organ, another a harp, another a tin whistle and so on. Each player must remember what instrument he is supposed to have and also he must carefully watch the leader. The leader begins by playing his own instrument, the fiddle, while each player plays his own- melodeon, whistle &c and\n(continues on next page)\n", "school_info": "School: Dubhais", "metadata": [{"Location:": "Dooish, Co. Donegal", "Teacher:": "\n-\n"}, {"Language": "English"}]}, "4493706/4412972/4528688": {"title": "Wake Games - The Priest of the Parish", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1096, Page 341", "Page 341"], "url": "https://www.duchas.ie/en/cbes/4493706/4412972/4528688", "text": "\nIn this game each player was assigned a special name, c. f, My man Jack, Blue Cap, Red Cap, Black Cap, White Cap, .    The player in charge then announced the \"the priest of the parish lost his cap. some say this and some say that, but I say _ My man Jack\"   the player who had been christened 'My Man Jack' must be ready on the (instrument) instant with a protest \"Me, me, sir?\" - Say \"White Cap\"And 'White Cap' must not be slow with \"Me, me, Sir?\"   Failure to respond on the instant to the accusation is punished by forfeit. Some possession, watch, penknife, cap, must be handed up to the leader and will not be returned until the owner has for example, washed his face with ink\n(continues on next page)\n", "school_info": "School: Dubhais", "metadata": [{"Location:": "Dooish, Co. Donegal", "Teacher:": "\n-\n"}, {"Language": "English"}]}, "4493706/4412973/4528689": {"title": "Wake Games - The Priest of the Parish", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1096, Page 342", "Page 342"], "url": "https://www.duchas.ie/en/cbes/4493706/4412973/4528689", "text": "\n(continued from previous page)\nsmeared himself with the ashes etc. Sometimes the leader has in his hand a wet rag smeared liberally with soot and he strikes the defaulting player on the face with it. When the two or three get punished in this manner they look very ludicrous and there is good fun.\n\n\n\nSeven player take part and are named as follows:-First, Old Father NippeltyThe remaining six :- Donal a ScrippeltyKid,Killy me Ked.Cooper a guildewJackie NiroyThe Comical BoyWhoever is in charge seizes one of the seven by the hand and begins drumming on his knuckles with a stick to the tune of \"Old Father Nippelty, Donal a Scrippelty, Ked, Killy me Ked, Cooper a guildew, Jackie\n(continues on next page)\n", "school_info": "School: Dubhais", "metadata": [{"Location:": "Dooish, Co. Donegal", "Teacher:": "\n-\n"}, {"Language": "English"}]}, "4493706/4412974/4528692": {"title": "Wake Games - Old Father Nippelty", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1096, Page 343", "Page 343"], "url": "https://www.duchas.ie/en/cbes/4493706/4412974/4528692", "text": "\n(continued from previous page)\nMiroy, and the Comical Boy\" Then suddenly he points at another of the seven and asks the person on whose hand he is beating, \"who is he\" and if the player addressed cannot remember, the hammering on his Knuckles is continued until he names the person indicated correct. by. The head-man then transfers his attentions to the player named and begins rhyming the seven names again while beating the stick on the others knuckles and then suddenly demanding who is he? pointing to another of the seven as he does so - the beating continues till he is answered correctly and so from one to another till the players tire of it and start another game.\n\n\n\nFor this game, a straw rope about eighteen inches long- thick, tightly twisted, and with a hard knot on one end, is required.\n(continues on next page)\n", "school_info": "School: Dubhais", "metadata": [{"Location:": "Dooish, Co. Donegal", "Teacher:": "\n-\n"}, {"Language": "English"}]}, "4427984/4363890/4545949": {"title": "Ag Déanamh Cleas i dTeach Tórraimh - Bualadh Bosaí", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0129, Page 393", "Page 393"], "url": "https://www.duchas.ie/en/cbes/4427984/4363890/4545949", "text": "\n(continued from previous page)\nrud ceadhna leis sin agus bheidhfí a magódh air dá mba ná beadh sé i ndán a fhuilingt.\n\n\n\nDo shínfeadh fear ar an úrlár agus déanfaidh sé na h-ioscoidí chómh teann in Éireann agus is thiofadh leis a dhéanamh. Thiocfadh fear eile annsin agus íoisfeadh sé é dá mbeadh sé i ndán. Chuirfeadh sé a dá lámh isteach faoi na h-ioscaidí agus ná lúbfaidh siad bhí an bhiodh aige.\n\n\n\nSeasadh beirt gasúr ar smoch ar an urlár agus déardfad duine seo-I am a poor wedda that come from AthloneThat has ne'er a daughter to marry but oneO my dear daughter choose your ownChoose a good warrant or else choose noneDo dhéanfadh an cailín a rogha annsin agus bheadh siad a dul ar aghaidh mar sin nó go mbí gach beirt le chéile - buachaill & cailín. Chaithfeadh chuile duine amhrán nó píosa racairneacht\n(continues on next page)\n", "school_info": "School: Gleann Caisil", "metadata": [{"Location:": "Glencastle, Co. Mayo", "Teacher:": "\nEoghan Ó Súilleabháin\n"}, {"Informant": "Pádraic Ó Ciaráin", "Gender": "male", "Age": "75", "Address": "Doolough, Co. Mayo"}, {"Language": "Irish"}]}, "4427984/4363890/4545950": {"title": "Ag Déanamh Cleas i dTeach Tórraimh - Bualadh Bosaí", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0129, Page 393", "Page 393"], "url": "https://www.duchas.ie/en/cbes/4427984/4363890/4545950", "text": "\n(continued from previous page)\nrud ceadhna leis sin agus bheidhfí a magódh air dá mba ná beadh sé i ndán a fhuilingt.\n\n\n\nDo shínfeadh fear ar an úrlár agus déanfaidh sé na h-ioscoidí chómh teann in Éireann agus is thiofadh leis a dhéanamh. Thiocfadh fear eile annsin agus íoisfeadh sé é dá mbeadh sé i ndán. Chuirfeadh sé a dá lámh isteach faoi na h-ioscaidí agus ná lúbfaidh siad bhí an bhiodh aige.\n\n\n\nSeasadh beirt gasúr ar smoch ar an urlár agus déardfad duine seo-I am a poor wedda that come from AthloneThat has ne'er a daughter to marry but oneO my dear daughter choose your ownChoose a good warrant or else choose noneDo dhéanfadh an cailín a rogha annsin agus bheadh siad a dul ar aghaidh mar sin nó go mbí gach beirt le chéile - buachaill & cailín. Chaithfeadh chuile duine amhrán nó píosa racairneacht\n(continues on next page)\n", "school_info": "School: Gleann Caisil", "metadata": [{"Location:": "Glencastle, Co. Mayo", "Teacher:": "\nEoghan Ó Súilleabháin\n"}, {"Informant": "Pádraic Ó Ciaráin", "Gender": "male", "Age": "75", "Address": "Doolough, Co. Mayo"}, {"Language": "Irish"}]}, "4427984/4363891/4545951": {"title": "Ag Déanamh Cleas i dTeach Tórraimh - Poor Wedda", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0129, Page 394", "Page 394"], "url": "https://www.duchas.ie/en/cbes/4427984/4363891/4545951", "text": "", "school_info": "School: Gleann Caisil", "metadata": [{"Location:": "Glencastle, Co. Mayo", "Teacher:": "\nEoghan Ó Súilleabháin\n"}, {"Informant": "Pádraic Ó Ciaráin", "Gender": "male", "Age": "75", "Address": "Doolough, Co. Mayo"}, {"Language": "English"}]}, "4427984/4363891/4545952": {"title": "Ag Déanamh Cleas i dTeach Tórraimh - Poor Wedda", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0129, Page 394", "Page 394"], "url": "https://www.duchas.ie/en/cbes/4427984/4363891/4545952", "text": "", "school_info": "School: Gleann Caisil", "metadata": [{"Location:": "Glencastle, Co. Mayo", "Teacher:": "\nEoghan Ó Súilleabháin\n"}, {"Informant": "Pádraic Ó Ciaráin", "Gender": "male", "Age": "75", "Address": "Doolough, Co. Mayo"}, {"Language": "Irish"}]}, "4428007/4367551/4549360": {"title": "Cleasanna i dTigh Tórraimh", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0135, Page 374", "Page 374"], "url": "https://www.duchas.ie/en/cbes/4428007/4367551/4549360", "text": "\nCírín about. Seasann líne buachaillí ar an urlár agus cuireann siad a lámha ar a súilibh ar fhainchois go mbéidh siad ag fáire. Buaileann duine de na buachaillí an chéad bhuachaillí an chéad bhuachaill le leadóg agus annsin bhéarfaidh an buachaillí greim cluaise ar an té a cheapann sé a bhuail é agus tugann sé thart ar an urlár é muna a bhfuil sé ceart annsin tugann an buachaill eile thart aríst é agus buaileann duine éicint eile. Buaidhreach.Suidheann sgata fear nó buachaill ar an urlár agus déanann siad ciorcal. Annsin gheibheann duine éicin an buaidhreach agus caitheann.\n(continues on next page)\n", "school_info": "School: Eachléim", "metadata": [{"Location:": "Aghleam, Co. Mayo", "Teacher:": "\nMáire Ní Chróinín\n"}, {"Collector": "Mairéad Ní Mhaoineacháin", "Gender": "female", "Address": "Letterbeg, Co. Mayo"}, {"Informant": "Áine Nic Amhlaoibh", "Gender": "female", "Address": "Letterbeg, Co. Mayo"}, {"Language": "Irish"}]}, "4569054/4567217/4575098": {"title": "Customs at Wakes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0035, Page 0303", "Page 0303"], "url": "https://www.duchas.ie/en/cbes/4569054/4567217/4575098", "text": "\nCustoms at WakeLong agoPeople used have numerous habits some of which are still in existence.Number one was Harrow.  This was played in this manner:- All the people sit in the middle of the floor in a circle.  A large rope is then foud and a person sits in the centre of the floor.  The rope is rolled into a ball and is hidden under some person's legs without the others seeing it. then comes the bustle trying to find the harrow as it is called whoever it is found with gets a blow of it on the head.Another was \"Glasses\" which was as follows.  There was a certain man whose favourite hobby seemingly was marrying couples in his own way. He would have all the unmarried people around him\n(continues on next page)\n", "school_info": "School: Cill Críosta", "metadata": [{"Location:": "Kilchreest, Co. Galway", "Teacher:": "\nSeán Ó Cléirigh\n"}, {"Collector": "Mena Fallon", "Gender": "female", "Address": "Raheen Oughter, Co. Galway"}, {"Informant": "Michael Forde", "Gender": "male", "Address": "Raheen Oughter, Co. Galway"}, {"Language": "English"}]}, "4569054/4567218/4575099": {"title": "Customs at Wakes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0035, Page 0304", "Page 0304"], "url": "https://www.duchas.ie/en/cbes/4569054/4567218/4575099", "text": "\n(continued from previous page)\neach with his or her sex. He would marry each couple saying certain words.  One night at a wake a man walked in and sat beside a girl.  They soon became great friends until lo and behold the looked n down at his feet only to behold a pair of cows hoofs.  This soon put an end to the classes and it was later said by a priest that the marriage was completed only that a few words were omitted.  That meant that the girl would be married to the devil.  Mena Fallon,     Michael Forder.Raheen,               Raheen.Loughrea,              Loughrea.  Co. Galway.\n\n\n\nAt wakes long ago the people used to have drinks but, it is now a reserved sin. It is still held in some places. It was on\n(continues on next page)\n", "school_info": "School: Cill Críosta", "metadata": [{"Location:": "Kilchreest, Co. Galway", "Teacher:": "\nSeán Ó Cléirigh\n"}, {"Collector": "Clare Ward", "Gender": "female", "Address": "Ballynacurragh, Co. Galway"}, {"Informant": "John Ward", "Gender": "male", "Address": "Ballynacurragh, Co. Galway"}, {"Language": "English"}]}, "4569054/4567220/4575100": {"title": "Customs at Wakes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0035, Page 0306", "Page 0306"], "url": "https://www.duchas.ie/en/cbes/4569054/4567220/4575100", "text": "\nThe following are some of the tricks which the people used to play at wakes. Bee hive: straw used to be put in the centre of the floor and the crowd used to sit around it. Then one of the crowd used to sit on the straw and the rest used to go out as though for honey. Then they used to come in again and they used to begin buzzing like bees. They used to go out again for more honey and they used bring in a mouthful of water and instead of doing as before, they all used to throw the water on the queen bee as that was what they used to call the man sitting on the straw.Ear: The crowd used stand in a row one after the other and the first man in the row had to put his hand to his ear. Then someone used hit him on the hand\n(continues on next page)\n", "school_info": "School: Cill Críosta", "metadata": [{"Location:": "Kilchreest, Co. Galway", "Teacher:": "\nSeán Ó Cléirigh\n"}, {"Collector": "Teresa Fallon", "Gender": "male", "Address": "Raheen Oughter, Co. Galway"}, {"Informant": "Michael Forde", "Gender": "male", "Address": "Raheen Oughter, Co. Galway"}, {"Language": "English"}]}, "4591097/4590634/4592950": {"title": "Folklore - Customs at Wakes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0015, Page 210", "Page 210"], "url": "https://www.duchas.ie/en/cbes/4591097/4590634/4592950", "text": "\nIn ancient times it was a custom to keep a corpse in a house for two nights.  All the friends and relatives of the deceased used cry and lament.  The neighbouring boys would gather and carry on all sorts of games.  They used play a game called \"Slapping\" and another called \"Spoil the Market\" and also a game called \"Hort.\" Each individual used be supplied with a pipe, tobacco and snuff.  Next day, all used pay their homage to the dead, by going to the funeral.  At that time, the coffin used be carried from the deceasd's residence to the graveyard on a cart and it was a custom for three female relatives to sit on the coffin and lament for the dead.\n", "school_info": "School: Na Creaga", "metadata": [{"Location:": "Creggs, Co. Galway", "Teacher:": "\nLiam Ó Breandáin\n"}, {"Collector": "Peggy Geraghty", "Gender": "male", "Address": "Creggs, Co. Galway"}, {"Informant": "William Keaveney", "Gender": "male", "Address": "Creggs, Co. Galway"}, {"Language": "English"}]}, "4591098/4590684/4592996": {"title": "Folklore - Pastimes at Wakes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0015, Page 260", "Page 260"], "url": "https://www.duchas.ie/en/cbes/4591098/4590684/4592996", "text": "\nA funny game is fair and foul Judge. Two old men are appointed Judges. Then one of players is blind folded, and his hand held on his hip, so that he would be slapped. So he then picks someone of the crowd and brings him before the Judge, he says he never did it, if he brings him to the other Judge he says he did, so it is great fun and harmless.Another game the Mulberry tree, this fame is funny, but rough. As many as can be got to play are put on the floor, then after being told what to do they go outside, and returns each with his mouth full of water very much to, this discontent of parties or no engaged in the game then when that round is over. They recite a ryline before going out.\n", "school_info": "School: Na Creaga", "metadata": [{"Location:": "Creggs, Co. Galway", "Teacher:": "\nLiam Ó Breandáin\n"}, {"Collector": "Desmond Clifford", "Gender": "male", "Address": "Creggs, Co. Galway"}, {"Informant": "John Keaveney", "Gender": "male", "Address": "Creggs, Co. Galway"}, {"Language": "English"}]}, "4602676/4594641/4615238": {"title": "Old Irish Tricks", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0004, Page 150", "Page 150"], "url": "https://www.duchas.ie/en/cbes/4602676/4594641/4615238", "text": "\nLong ago the people had a lot of tricks at wakes. A lad or two would go around and collect all the caps and put them in to a bag. Then he would take them out one by one and say a song for this cap. If you were not able to sing yourself you would have to get some other one to sing for you or if you didn't your fine cap would be ripped up. Another one is: two young strong men would get an old spade and each of them would sit down with their feet together. They would begin pulling then until one would lift the other and he would be the winner. Another on is to turn the stool upside down and walk around on the legs without falling. You could catch the legs of the stool but it is very hard all the same.\n", "school_info": "School: An Clochán (B)", "metadata": [{"Location:": "Clifden, Co. Galway", "Teacher:": "\nAn Br. Angelo Mac Shámhais\n"}, {"Informant": "Joe Keady", "Gender": "male", "Age": "80", "Address": "Fakeeragh, Co. Galway"}, {"Language": "English"}]}, "4613677/4607635/4616863": {"title": "Games", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0017, Page 265", "Page 265"], "url": "https://www.duchas.ie/en/cbes/4613677/4607635/4616863", "text": "\n265Games.1.  The games played in the country are, throwing weights, \"cleasa stoilin\",  \"Pig,\" jumps and races, bird nesting, rabbit hunting.2.  Throwing weights is done by getting a very stone and setting two sticks a certain length apart and whoever would throw the stone from one stick to the other, would be a very strong boy or man.3.  \"Clease stoilin\"  is usually played at wakes.  A young man, he may be nice-looking or ugly looking, would sit on a stool and call out whatever girl he liked and she would have to kiss him.  If she did not she would have to get a heavy beating with a belt.4.  \"Pig\" is also done at wakes.  A man covered by a sheet lies on the floor and represents the pig and twelve others represent the young pigs.  He has to be able to grunt like a pig.  5.  Bird catching is done in Winter or early Spring.  They set a crib and and shake oats under it.  When the bird comes she knocks the stick which keeps up the crib\n(continues on next page)\n", "school_info": "School: Scoil Sheosaimh Ntha (Cailíní)", "metadata": [{"Location:": "Glennamaddy, Co. Galway", "Teacher:": "\nÚna, Bean Uí Threasaigh\n"}, {"Collector": "Freda Warde", "Gender": "female"}, {"Informant": "Michael Warde", "Gender": "male", "Address": "Shannagh More, Co. Galway"}, {"Language": "English"}]}, "4613677/4607637/4616864": {"title": "Games", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0017, Page 267", "Page 267"], "url": "https://www.duchas.ie/en/cbes/4613677/4607637/4616864", "text": "\n267Games1.  \"Pucog\" (is) They used to put a piece of cloth round the      one who was going to play.  That one used to go round      looking  for the rest.  The children used to have great fun      knocking the child round.  He used to keep looking till he      caught one.2.  The people used to sit round the fire and play a game.       Everyone used put out his feet, and the player used say      some words.  The last word that would fall on the      person's foot would have to sing or dance.3.  They play games at wakes such as \"Cleas an stoilin.\"  A      boy would have to sit on a stool and call out a girl.  That      girl would have to kiss him, if she did not she would be      dragged out, or she would have to sing a song.Frances Corely,Got from,Tommy Hussey,Scotland,Glenamaddy.\n", "school_info": "School: Scoil Sheosaimh Ntha (Cailíní)", "metadata": [{"Location:": "Glennamaddy, Co. Galway", "Teacher:": "\nÚna, Bean Uí Threasaigh\n"}, {"Collector": "Frances Corely", "Gender": "female"}, {"Informant": "Tommy Hussey", "Gender": "male", "Address": "Scotland, Co. Galway"}, {"Language": "English"}]}, "4622995/4621959/4629059": {"title": "Story of Mr Blake", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0078, Page 162", "Page 162"], "url": "https://www.duchas.ie/en/cbes/4622995/4621959/4629059", "text": "", "school_info": "School: Naomh Ruadhan, Gallach", "metadata": [{"Location:": "Gallagh, Co. Galway", "Teacher:": "\nD. Ó Neachtain\n"}, {"Language": "English"}]}, "4622998/4622201/4629883": {"title": "Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0079, Page 022", "Page 022"], "url": "https://www.duchas.ie/en/cbes/4622998/4622201/4629883", "text": "\nLong ago people had a lot of old customs one of these was; when a person used to be dead they used to skin a goat and put the skin on someone then they used to go in to the house and after a while the person with the skin on used to come in and the people used to say that it was a ghost.Another custom was when a person would be dead they used to play harrow. This is how it was done one man used to sit down in the middle of the floor and all the rest used to sit down around him and start passing a stick to each other and saying \"harrow\"  \"harrow\" \"harrow\" and whoever he would catch having the stick that person would have to go in the middle.\n", "school_info": "School: Muine an Mheadha", "metadata": [{"Location:": "Monivea, Co. Galway", "Teacher:": "\nPádraic S. Ó hÓbáin\n"}, {"Collector": "Delia Kelly", "Gender": "female"}, {"Informant": "Patrick Flaherty", "Gender": "male", "Age": "80", "Address": "Ballyskeagh, Co. Galway"}, {"Language": "English"}]}, "4623003/4622764/4630843": {"title": "Games at Wakes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0080, Page 174", "Page 174"], "url": "https://www.duchas.ie/en/cbes/4623003/4622764/4630843", "text": "\nLong ago many games were played at wakes one of which was - Selling the Old Cow.This game was played as follows.An old cow was bought and sold and her skin was sent to the tanner. There was a rhyme in connection with this game which is as follows - \"If the tanner does not tan it and tan it well it will be hung on a nail in hell, if the nail in hell crack it will be hung on the Devil's back\" One of the boys repesented the old cow and he was tanned. The Bees.This was another game wich was played. One boy sat on a chair and about a score of others came with their mouths filled with water humming like bees. The queen bee sitting on\n(continues on next page)\n", "school_info": "School: Cill Chiaráin", "metadata": [{"Location:": "Kilkerrin, Co. Galway", "Teacher:": "\nCaitlín, Bean Uí Chuimín\n"}, {"Language": "English"}]}, "4602749/4600863/4633832": {"title": "Wake and Funeral Customs in Leitrim", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0197, Page 209", "Page 209"], "url": "https://www.duchas.ie/en/cbes/4602749/4600863/4633832", "text": "\nWhen a person dies he is clothed in a special dress for the grave. Long candles in brass candlesticks are lighted in the shape of a cross, on a table beside the bed, and a plate of salt is left on top of the body just where the hands of the dead person rest. The relatives of the dead person have a store of pipes and tobacco, and a pipeful is handed to each person at the wake and when the pipe is empty it is re filled. They also pass round saucers of snuff and once at least in the night wine and whisky with plates of biscuits. Towards morning all partake of tea, bread and butter. Before the funeral leaves the house, a meat lunch with plenty of wine and whiskey is provided. During the wake songs are sung, stories told and games such as: \"Hardy Knuckles\" are played, and often pieces of pipe shanks are thrown at each other for fun. I remember seeing a wake and funeral of this description about 50 years ago and 9 know it was the custom from much earlier times. I remember being at a Roman Catholic house in S Leitrim when a funeral was leaving the house. The priest blessed a bucket of water, dipped a new whitewash brush into it and sprinkled the crowd who were waiting round the door. The priest was Father Kiernan.\n", "school_info": "School: Mastersons", "metadata": [{"Location:": "Manorhamilton, Co. Leitrim", "Teacher:": "\nGobnait de Búit\n"}, {"Informant": "D. Boyd", "Address": "Manorhamilton, Co. Leitrim"}, {"Language": "English"}]}, "4605955/4605630/4644002": {"title": "Games at Wakes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0208, Page 223", "Page 223"], "url": "https://www.duchas.ie/en/cbes/4605955/4605630/4644002", "text": "\nJohn Lynch of Deffier saw the following games played at wakes.1. The Poor Widow.2. The Nine Daughters.3. Brogue About.4. Round the Button5. Cock o the Corner.6. Riding the Wild Ass7. [?] the [C?]For explanation see page 149-150 etc.2. [Taking?] hold of one another round the waist and singing as they marched round there was a song \"He a fine fellow for your daughter [so found?]\" Some out outside hut.3. Boys got on hunkers around in a circle. One boy was fool in the middle. A belt was passed from one to another under their legs. When the fool would not be looking he got a stroke of the belt on the head. When he got the man that had the belt he was released and the one named took his place as fool in the middle. Last played around here at Pat Gilrane's grandfathers wake about fifty or fifty four years ago.5. Riding the Wild Ass. Put a narrow plank or [log?] shaft from one table to another. Sit on it as a tailor sits, and a stick in your hand. You had to knock [?] two at one end of stick and [?] clothes at the other end.If you did not know the game or  had no [?] you got a fall and laugh[?]\n", "school_info": "School: Corderay", "metadata": [{"Location:": "Shancurry, Co. Leitrim", "Teacher:": "\nSeán Ó Céilleachair\n"}, {"Collector": "Seán Ó Céilleachair", "Gender": "male", "Occupation": "múinteoir"}, {"Language": "English"}]}, "4605955/4605656/4644089": {"title": "Games at Wakes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0208, Page 249", "Page 249"], "url": "https://www.duchas.ie/en/cbes/4605955/4605656/4644089", "text": "\nExplained to me by Michael Hanager of  Cormongan Parish of Drumshanbo or properly called by the old people and yet by the Diocesan Reports Parish of Murhawn.The Poor WidowAt the wake one gets out on the floor and sings the following verse or hums it in monotone voice.I am a poor widow that comes from AthloneI married my daughters them all but oneGo away daughters and choose your ownChoose your ownChoose a good man or else choose noneMy daughter she's married and married awayAnd all my good people then do as I sayDo as I sayThe boy that recites this then calls out a girl and she recites it and calls out a boy and so on till a number are on the floor. A girl then says I'd rather have so and so for a husband not the boy that called her out. Then the man she names makes a hold for her and the boy that called her tries to keep her. Used to be [?] if the boys had [?].\n(continues on next page)\n", "school_info": "School: Corderay", "metadata": [{"Location:": "Shancurry, Co. Leitrim", "Teacher:": "\nSeán Ó Céilleachair\n"}, {"Collector": "Seán Ó Céilleachair", "Gender": "male", "Occupation": "múinteoir"}, {"Informant": "Michael Flanagan", "Gender": "male", "Address": "Cormongan, Co. Leitrim"}, {"Language": "English"}]}, "4649691/4647685/4658661": {"title": "Local Games", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0211, Page 251", "Page 251"], "url": "https://www.duchas.ie/en/cbes/4649691/4647685/4658661", "text": "\nThese games were played at every wake in the district long ago. \"The Nine Daughters\", \"Brogue-about\", \"The candle trick\". This is how they played \"The Nine Daughters\". Some person sat in the corner and represented an old woman. He called himself Mrs. O'Brien. A number of young boys then came in asking his daughters in marriage. Mrs. O'Brien then answered \"I have nine daughters down by my knee. And no dirty carpenter will get them from me.\" Then she ordered her daughters to put them out. Sometimes there was a great fight to get them out. The Candle-trickA man was put sitting on a chair and one of his eyes was closed and a lighted candle was put before his other eye. Then he put out his hand and a man slapped him. He had to bear the slaps until he guessed who slapped him.\n", "school_info": "School: Coill Chláir", "metadata": [{"Location:": "Kilclare, Co. Leitrim", "Teacher:": "\nTreasa Ní Oibeacáin\n"}, {"Language": "English"}]}, "4649693/4647840/4659768": {"title": "Customs at Wakes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0211, Page 405", "Page 405"], "url": "https://www.duchas.ie/en/cbes/4649693/4647840/4659768", "text": "\nWhen a person was dying he or she was taken out of the bed and laid on the floor on some straw. The dead person was then laid out on two tables in the kitchen and all the people around the district came to the wake. Singing was very common at wakes and noted traditional singers used to promise that whoever should die first the other would sing at his wake. Each person got a pipe and tobacco at a wake and sometimes the women got snuff. The young people especially used to play games at the wake. A favourite game was \"Shuffle the brogue\". Each person who was playing sat down on the floor in the form of an ellipse with feet outstretched. One man stood in the middle of the circle or ellipse and his duty was to find a strap that was passed from one\n(continues on next page)\n", "school_info": "School: Rosaí", "metadata": [{"Location:": "Rossy, Co. Leitrim", "Teacher:": "\nPádhraic Ó Baoighill\n"}, {"Informant": "Thomas Doran", "Gender": "male", "Age": "64", "Occupation": "farmer", "Address": "Rossy, Co. Leitrim"}, {"Language": "English"}]}, "4658432/4654955/4660445": {"title": "Wakes Long Ago", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0221, Page 519", "Page 519"], "url": "https://www.duchas.ie/en/cbes/4658432/4654955/4660445", "text": "\nLong ago wakes were very rough. The corpse was laid out on the kitchen table and a lot of tricks were played. A pipe was put in the mouth of the corpse, and the men began to peg “clods” eg. little bits of turf, at the pipe to see who would hit it first. The pipes in those days had very long “shanks”. Then a rope was tied around the leg of the corpse, and drawn under the table. Then when there were some nervous women in the kitchen, the rope was pulled and the corpse stood up on the table. The light was blown out and there used to be great screaming & commotion.\n\n\n\nThen there used to be games of “slapping”. The men stood round the kitchen in a circle and put their open right hand on the back. Then the person slapped the hand in front of him and the slapping went round the circle. If there was any person in the ring that wasn’t liked his hand was hit with a short piece of stick & dirt was put on it.\n\n\n\nThe Dirty and Clean Sheep.Two men stood at the door, and every man\n(continues on next page)\n", "school_info": "School: Dromlachan", "metadata": [{"Location:": "Sunnagh More, Co. Leitrim", "Teacher:": "\nPeadar Mac Giolla Choinnigh\n"}, {"Collector": "P. Mac Giolla Choinnigh", "Gender": "male"}, {"Informant": "John Donohue", "Gender": "male", "Age": "70"}, {"Language": "English"}]}, "4658432/4654955/4660456": {"title": "Wakes Long Ago", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0221, Page 519", "Page 519"], "url": "https://www.duchas.ie/en/cbes/4658432/4654955/4660456", "text": "\nLong ago wakes were very rough. The corpse was laid out on the kitchen table and a lot of tricks were played. A pipe was put in the mouth of the corpse, and the men began to peg “clods” eg. little bits of turf, at the pipe to see who would hit it first. The pipes in those days had very long “shanks”. Then a rope was tied around the leg of the corpse, and drawn under the table. Then when there were some nervous women in the kitchen, the rope was pulled and the corpse stood up on the table. The light was blown out and there used to be great screaming & commotion.\n\n\n\nThen there used to be games of “slapping”. The men stood round the kitchen in a circle and put their open right hand on the back. Then the person slapped the hand in front of him and the slapping went round the circle. If there was any person in the ring that wasn’t liked his hand was hit with a short piece of stick & dirt was put on it.\n\n\n\nThe Dirty and Clean Sheep.Two men stood at the door, and every man\n(continues on next page)\n", "school_info": "School: Dromlachan", "metadata": [{"Location:": "Sunnagh More, Co. Leitrim", "Teacher:": "\nPeadar Mac Giolla Choinnigh\n"}, {"Collector": "P. Mac Giolla Choinnigh", "Gender": "male"}, {"Informant": "Frank Quinn", "Gender": "male", "Age": "55", "Address": "Sunnagh More, Co. Leitrim"}, {"Language": "English"}]}, "4658432/4654955/4660736": {"title": "Wakes Long Ago", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0221, Page 519", "Page 519"], "url": "https://www.duchas.ie/en/cbes/4658432/4654955/4660736", "text": "\nLong ago wakes were very rough. The corpse was laid out on the kitchen table and a lot of tricks were played. A pipe was put in the mouth of the corpse, and the men began to peg “clods” eg. little bits of turf, at the pipe to see who would hit it first. The pipes in those days had very long “shanks”. Then a rope was tied around the leg of the corpse, and drawn under the table. Then when there were some nervous women in the kitchen, the rope was pulled and the corpse stood up on the table. The light was blown out and there used to be great screaming & commotion.\n\n\n\nThen there used to be games of “slapping”. The men stood round the kitchen in a circle and put their open right hand on the back. Then the person slapped the hand in front of him and the slapping went round the circle. If there was any person in the ring that wasn’t liked his hand was hit with a short piece of stick & dirt was put on it.\n\n\n\nThe Dirty and Clean Sheep.Two men stood at the door, and every man\n(continues on next page)\n", "school_info": "School: Dromlachan", "metadata": [{"Location:": "Sunnagh More, Co. Leitrim", "Teacher:": "\nPeadar Mac Giolla Choinnigh\n"}, {"Collector": "P. Mac Giolla Choinnigh", "Gender": "male"}, {"Informant": "Frank Quinn", "Gender": "male", "Age": "55", "Address": "Sunnagh More, Co. Leitrim"}, {"Language": "English"}]}, "4658432/4654956/4660737": {"title": "The Dirty and Clean Sheep", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0221, Page 520", "Page 520"], "url": "https://www.duchas.ie/en/cbes/4658432/4654956/4660737", "text": "\n(continued from previous page)\nin the kitchen had to go out. As each man was going out the men at the door said:  \"Mind that one, that's a clean sheep\" or, \"Mind that one that's a dirty sheep\". There werea crowd outside the door and they they had red bags steeped in the cows' \"group\" and when a dirty sheep came out, they hit him with the dirty bags, but they let the clean sheep pass.\"Slapping\" and \"The dirty and Clean Sheep\" from : Frank Quinn Drumloughan aged 55.\n\n\n\nMarrying the Nine Daughters.One man, the father, sits in the middle of the floor and is surrounded by his nine daughters who are well armed with sticks or belts. One man, (say a cobbler) comes in and says:\"There comes and old cobblerso neat and so fineComing to court your nine daughters divine\"And the father replies:\"I'll set my nine daughtersRight down by my knee,and damn the old cobbler will get one from meYou may ask no lodgings here, for you get no lodgings here, here, here.\n(continues on next page)\n", "school_info": "School: Dromlachan", "metadata": [{"Location:": "Sunnagh More, Co. Leitrim", "Teacher:": "\nPeadar Mac Giolla Choinnigh\n"}, {"Collector": "P. Mac Giolla Choinnigh", "Gender": "male"}, {"Informant": "Francis Keegan", "Gender": "female", "Age": "50", "Occupation": "farmer", "Address": "Racullen, Co. Leitrim"}, {"Language": "English"}]}, "4658432/4654957/4660738": {"title": "Marrying the Nine Daughters", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0221, Page 521", "Page 521"], "url": "https://www.duchas.ie/en/cbes/4658432/4654957/4660738", "text": "\n(continued from previous page)\nAnd the cobbles replies:\"A fig for your daughtersand another for yourselfand for four farthings more, I'd get a far better wife.\"Then the nine daughters rose up and beat out the cobbler with their sticks and belts. Next the tailor came in, and the same verses were sang and the same thing happened. This continued until all got tired or till the farmer came in and got the nine daughters.from Francis Keegan farmeraged 50 who saw it played.\n\n\n\nThere was a wake long ago in Jooma. The man that was dead was a cripple and the men that laid him out let him stiffen. They the tried to straighten him so that he'd be got into the coffin. They strapped him on the kitchen table with ropes, but in the middle of the night when they were all taking tea, the ropes broke or some playboy cut them and the corpse leaped off the table into the middle of the people who were taking tea. Several women fainted with the fright.from Frank Quinn. Drumloughan.\n", "school_info": "School: Dromlachan", "metadata": [{"Location:": "Sunnagh More, Co. Leitrim", "Teacher:": "\nPeadar Mac Giolla Choinnigh\n"}, {"Collector": "P. Mac Giolla Choinnigh", "Gender": "male"}, {"Informant": "Frank Quinn", "Gender": "male", "Address": "Sunnagh More, Co. Leitrim"}, {"Language": "English"}]}, "4649705/4648921/4662346": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0214, Page 414", "Page 414"], "url": "https://www.duchas.ie/en/cbes/4649705/4648921/4662346", "text": "\nWhen a person die the clock is stopped immediately and is not allowed to work again until after the funeral.There is always someone in the corpse room, and each wake night some of the friends and neighbours make it a matter of obligation to remain in the house till daylight.Clay pipes filled with tobacco are given to all, and even non-smokers try to take a few pull in honour of the dead.When men come as far as the door they take off their caps and remain outside for some short time saying a few prayers for the departed soul.Conversation is generally carried on in a low tone and a wake is a tedious affair, but sometimes a local wit or good storyteller does his little bit to relieve the monotomy.\n(continues on next page)\n", "school_info": "School: Gort Leitreach", "metadata": [{"Location:": "Gortletteragh, Co. Leitrim", "Teacher:": "\nSeosamh Mac Cionnaith\n"}, {"Language": "English"}]}, "4649705/4648922/4662348": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0214, Page 415", "Page 415"], "url": "https://www.duchas.ie/en/cbes/4649705/4648922/4662348", "text": "\n(continued from previous page)\nOwing to church laws intoxicating drink has almost disappeared from corpse houses, and for the same reason wakes have got much smaller than they were about the end of the nineteenth century and tricks at wakes have ceased entirely.\n\n\n\nA captain of yeomen was killed about the time of the battle of Ballinamuck in the townland for Drumconney, in a field at present in the possession of Mrs McIntyre.\n", "school_info": "School: Gort Leitreach", "metadata": [{"Location:": "Gortletteragh, Co. Leitrim", "Teacher:": "\nSeosamh Mac Cionnaith\n"}, {"Informant": "M. Cobreavy", "Gender": "male"}, {"Language": "English"}]}, "4658454/4657286/4662397": {"title": "Old Games", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0226, Page 503", "Page 503"], "url": "https://www.duchas.ie/en/cbes/4658454/4657286/4662397", "text": "\nOld Games1/ A game called \"Sewing the Old Coach\" used to be played at wakes.An old coat was placed on the middle of the floor and a ring of boys sat around it and sang these words - while pretending to sew.\"Go to Mass MondayStay at home SundayCurse your father + MotherAnd throw stones at the beggar\"Told by Jas. O'Rourke, Drumcoura (82 11/5/382/ Another game \"Shuffle the Crog\" played at wakes. -All sit in ring round on the floor. One stands in centre, and one of those in ring hits him with a rope saying - One yard and oneTwo yards strongA bit a scrap + a shuffleThe person standing in centre tries to get the rope which is passed round under the feet of those sitting. The person he succeeded in getting it from must Then stand in centre + game starts again.\n(continues on next page)\n", "school_info": "School: Kilmore", "metadata": [{"Location:": "Kilmore, Co. Leitrim", "Teacher:": "\nMáire, Bean Uí Shamhráin\n"}, {"Informant": "Mrs Holohan", "Gender": "female", "Age": "48", "Address": "Kilmore, Co. Leitrim"}, {"Language": "English"}]}, "4658454/4657288/4662398": {"title": "Names on Fields", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0226, Page 505", "Page 505"], "url": "https://www.duchas.ie/en/cbes/4658454/4657288/4662398", "text": "\nThe Ált. Nadadh Ruadh  in Michael Quinns farm, Drumcoura,Poll a Phooka owned by the Baxters of KilmoreThe Dhereen owned by Dan Rielly  Kilmore.\n\n\n\nSongs are sung by Mrs. Murray  Kinkeen (82) which were composed by her father. She sings nine or ten with 80 to 100 lines in each.In many countries I have beenAnd lasses I've seen many O.The fairest lass that e'er I've seenIs charming dark-haired Annie O.She has my heart entire in woeI love her beyond many O.The ruling empress of my soulIs charming dark-haired Annie O.(The above old lady is at present ill but I may get the songs later & forward them).\n", "school_info": "School: Kilmore", "metadata": [{"Location:": "Kilmore, Co. Leitrim", "Teacher:": "\nMáire, Bean Uí Shamhráin\n"}, {"Language": "English"}]}, "4658454/4657288/4662401": {"title": "Names on Fields", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0226, Page 505", "Page 505"], "url": "https://www.duchas.ie/en/cbes/4658454/4657288/4662401", "text": "\nThe Ált. Nadadh Ruadh  in Michael Quinns farm, Drumcoura,Poll a Phooka owned by the Baxters of KilmoreThe Dhereen owned by Dan Rielly  Kilmore.\n\n\n\nSongs are sung by Mrs. Murray  Kinkeen (82) which were composed by her father. She sings nine or ten with 80 to 100 lines in each.In many countries I have beenAnd lasses I've seen many O.The fairest lass that e'er I've seenIs charming dark-haired Annie O.She has my heart entire in woeI love her beyond many O.The ruling empress of my soulIs charming dark-haired Annie O.(The above old lady is at present ill but I may get the songs later & forward them).\n", "school_info": "School: Kilmore", "metadata": [{"Location:": "Kilmore, Co. Leitrim", "Teacher:": "\nMáire, Bean Uí Shamhráin\n"}, {"Collector": "M. T. Mc Govern", "Occupation": "teacher"}, {"Language": "English"}]}, "4706351/4705123/4726641": {"title": "Folklore", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0446, Page 060", "Page 060"], "url": "https://www.duchas.ie/en/cbes/4706351/4705123/4726641", "text": "\nLong ago there lived in Currans a man named Rooney who lived to be very old. For some time before his death he was accustomed to sleep sitting in a chair. It was customary in those days to lay out the corpse on the kitchen table. From being in a sitting posture so long, they found that they could not lay the corpse flat, so they put a rope across the chest and tied it to the table. About twelve o clock that night as the porter was being given round some person cut the rope and the corpse immediately sat up and the people made a rush for the door and some were trampled under-foot.\n", "school_info": "School: Ráth na Loch (B.), Fearann Fuar", "metadata": [{"Location:": "Ranalough, Co. Kerry", "Teacher:": "\nSeán Ó Donnchadha\n"}, {"Collector": "Pat Foley", "Gender": "male"}, {"Informant": "Mr William Hickey", "Gender": "male", "Age": "65", "Address": "Kilfelim, Co. Kerry"}, {"Language": "English"}]}, "4701770/4701312/4727207": {"title": "Customs at Wakes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0188, Page 079", "Page 079"], "url": "https://www.duchas.ie/en/cbes/4701770/4701312/4727207", "text": "\nCustoms at WakesThee following are games which were played at wakes up to as recently as fifteen or twenty years ago in the following areas convenient to this school.(1) Derrycough.   Kingsland(2) Portnacrinnagh  \"(3) Breedogue         \"(4) Ardsoran    Killaraght(5) Ardlora      \"(6) Ardmoyle   \"(7) Derrybeg   \"The games were(a) Ratha(b) My nine daughters(c) Catching the goat(e) The Tailor(f) Old Fr Brown.(a) Ratha was played in this manner A bubdle of hay and straw was thrown on the floor. A straw rope was\n(continues on next page)\n", "school_info": "School: St. Michael's Clooncunny", "metadata": [{"Location:": "Clooncunny, Co. Sligo", "Teacher:": "\nÚna, Bean Uí Stondúin\n"}, {"Informant": "Mr J. Finnegan", "Gender": "male"}, {"Language": "English"}]}, "4701689/4692818/4728118": {"title": "Wakes and Funerals", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0163, Page 027", "Page 027"], "url": "https://www.duchas.ie/en/cbes/4701689/4692818/4728118", "text": "\n(continued from previous page)\n[-]\n\n\n\nWhen a person dies in a house the young folk gather in at night. These are the games they used to play:-A crowd of men would go out, and one of them would dress himself in the shape of an ass.Another man of them would bring him in and start selling him to the other men. One of them would start testing him to see was he well trained. Then he would start jumping and kicking until he would knock and break everything that was in the house.Ten men would gather together in a ring in the corner of the house. Then they would shake straw on their knees. One of them would stand up in the middle. Then\n(continues on next page)\n", "school_info": "School: Cor Bealaigh", "metadata": [{"Location:": "Corbally, Co. Sligo", "Teacher:": "\nPádhraic Ó Marcacháin\n"}, {"Collector": "Patrick Reynolds", "Gender": "male", "Address": "Rathglass, Co. Sligo"}, {"Informant": "Mr Patrick Foody", "Gender": "male", "Address": "Rathglass, Co. Sligo"}, {"Language": "English"}]}, "4701689/4692819/4728119": {"title": "Games at Wakes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0163, Page 028", "Page 028"], "url": "https://www.duchas.ie/en/cbes/4701689/4692819/4728119", "text": "\n(continued from previous page)\nthey would pass the pipe from one to the other.\n\n\n\nOne of the games played at wakes some time ago was Forfeits. Two men went round through the house taking something from everybody such as :- pipes, tobacco, pocket-knives, handkerchiefs, and all such small articles. When they would have all collected, one bowed down, and the other hands the pledges over in turn, asking what is this person to do to get his pledges back. Then he gives everybody a very hard task. Some might have to stand with their heads up the chimney for an hour. Another\n(continues on next page)\n", "school_info": "School: Cor Bealaigh", "metadata": [{"Location:": "Corbally, Co. Sligo", "Teacher:": "\nPádhraic Ó Marcacháin\n"}, {"Collector": "Jack Donegan", "Gender": "male", "Address": "Newtown, Co. Sligo"}, {"Informant": "Mr Peter Hanley", "Gender": "male", "Address": "Newtown, Co. Sligo"}, {"Language": "English"}]}, "4723818/4716093/4743604": {"title": "A Wake", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0935, Page 044", "Page 044"], "url": "https://www.duchas.ie/en/cbes/4723818/4716093/4743604", "text": "\nIt is the custom in this parish when a preson dies for the people to all gather together into the house and sit around the fire telling stories and smoking.  This is called a \"Wake\".When a person dies with old age, there is usually a good night's sport, with dancing and story-telling and drinking.  Before the neighbours go into the house they say to the people of they house, \"I am sorry for your trouble\".Then they go to see the dead person and say a few prayers for him.\n(continues on next page)\n", "school_info": "School: Magheross", "metadata": [{"Location:": "Magheross, Co. Monaghan", "Teacher:": "\nAoife Ní Shíomons\n"}, {"Collector": "Edward Hill", "Gender": "male", "Address": "Dunoge, Co. Monaghan"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "male", "Age": "50", "Address": "Dunoge, Co. Monaghan"}, {"Language": "English"}]}, "4758476/4747279/4780147": {"title": "The Wake", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0250, Page 299", "Page 299"], "url": "https://www.duchas.ie/en/cbes/4758476/4747279/4780147", "text": "\nOn the approach of night the men gather to the wake. In old days all comers were supplied with a long shanked pipe, and tobacco was handed round during the night. In the corpse room as well as in the kitchen the fire was kept up well all night. Songs were sung and porter went about in buckets, each person getting an equal share. The talk was subdued, and no loud laughter was to be heard. Games and pastimes used to be carried on generally: a common game was a trial of strength between two lads. They sat flat on the ground putting the soles of their shoes together. They were then given a short strong stick such as a broom handle, and each taking hold of the stick, they pulled, endeavoring to make each other stand up off the floor. (Further wake games at end of book)All clocks, watches, are stopped at a wake or corpse house in some parts of this district. It is usual when putting name on the coffin lid to put down more or less than it actually is\n(continues on next page)\n", "school_info": "School: Cluain Uí Chuinn", "metadata": [{"Location:": "Cloonyquin, Co. Roscommon", "Teacher:": "\nMícheál Mac Floinn\n"}, {"Informant": "M. Mc Glynn", "Age": "45", "Address": "Killynagh More, Co. Roscommon"}, {"Language": "English"}]}, "4758476/4747282/4780151": {"title": "Wake Games", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0250, Page 302", "Page 302"], "url": "https://www.duchas.ie/en/cbes/4758476/4747282/4780151", "text": "\nDuring a wake to while away the time several types of games used to be played which however have gone out of use late years. One of these was a wordy game which they called Priest of the Parish.One led the game saying \"The Priest of the Parish lost his considering cap\". \"Some say this and some say that and some say my man Jack\". Each man in the circle had a title such as \"Black Cap\", \"Cos\", Red Head\" &c.My man Jack asked Is it \"me\" sir, yes, you sir; \"you lie sir\" \"who then sir \"Black Cap\".If Black Cap fails to take up \"Is it me sir\" or fails to give the answers in the usual order, passing on the blame to some one else, his face is blackened with soot from the chimney, by the leader.\n", "school_info": "School: Cluain Uí Chuinn", "metadata": [{"Location:": "Cloonyquin, Co. Roscommon", "Teacher:": "\nMícheál Mac Floinn\n"}, {"Language": "English"}]}, "4758476/4747283/4780159": {"title": "The Fat Hen", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0250, Page 303", "Page 303"], "url": "https://www.duchas.ie/en/cbes/4758476/4747283/4780159", "text": "\nThis was a game in which the answers multiplied with great rapidity and it was difficult to avoid being smulted [smutted ?].It began with the leader handing something to his neighbour. It might be a button, a clod of turf or match, with the words \"Here's this\". \"What's this \". \"A fat hen for my lord's table\" This man passed the object on to his neighbour saying \"Here's this\". \"What's this\" \"Two ducks, and a fat hen for my lord's table\". Each added on something, the order being now - \"Three grey geese in a green field grazing\" ..  ..  ..  ..  ..  ..Five squeeking, squalling, squirrels in a green tree shaking\" ..  ..  ..  ..  ..\"Seven fillies shod and shorn\"and so on till it required a great effort to remember the last lines, and to put them in their order.I cannot remember the whole number of the lines as it is a long time since the game was played as a fireside pastime at a wake.\n(continues on next page)\n", "school_info": "School: Cluain Uí Chuinn", "metadata": [{"Location:": "Cloonyquin, Co. Roscommon", "Teacher:": "\nMícheál Mac Floinn\n"}, {"Informant": "M. Mc Glynn", "Address": "Killynagh More, Co. Roscommon"}, {"Language": "English"}]}, "4742063/4732058/4781900": {"title": "Wake Games", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0959, Page 064", "Page 064"], "url": "https://www.duchas.ie/en/cbes/4742063/4732058/4781900", "text": "\nIn olden times when there was a wake a crowd would gather to see the gamesThey played a lot of games. One was the tinkers, A man goes outside and comes in with some one on his back, They would say \"We are the three jolly tinkers and tinkers we are coming to court your three daughters so fair\". I will keep my three daughters quite close to my knee and none of your tinkers will get them from me. Then one of the leaders would ask who was the best man in the house send him out, the man on the stool would call one name and he would not be willing to go out then men with the belts would come at him and put him out and again and this would be repeated till the last man would be put out. \"We are three jolly tinkers and tinkers we are coming to courts your three daughters so fair and none of your tinkers will get them from me\".                next Trick\"Jenne I'll put out your light\" This would start with two men a stick and a lighted candle on the ground. One man would hold the stick beneath his legs and the other man would hold the other\n(continues on next page)\n", "school_info": "School: Deravoy", "metadata": [{"Location:": "Derryveagh, Co. Monaghan", "Teacher:": "\nE. Treanor\n"}, {"Collector": "E. Treanor", "Gender": "male", "Occupation": "teacher"}, {"Language": "English"}]}, "4723871/4721005/4786284": {"title": "A Game", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0954, Page 062", "Page 062"], "url": "https://www.duchas.ie/en/cbes/4723871/4721005/4786284", "text": "\nA Game.  Two little dicky birds       Sat on a wall.  One was named Peter,       The other named Paul.  Fly away Peter !       Fly away Paul!   Come back Peter !        Come back Paul !The above is a trick with two pieces of paper attached to the index finger of each hand.By substituting the \"méar fada\"for same the papers disappear and come again at command.\n\n\n\n62           XIII.        Wake Games1.\"Jimmy will you bake a bit\"? Devil the bit the day!    I'll put out your bit of light\" Deed and so you may.!This is performed by means of a thick stick held tightly between the knees and a lighted candle.\n(continues on next page)\n", "school_info": "School: Cill an Charnáin", "metadata": [{"Location:": "Killycarnan North, Co. Monaghan", "Teacher:": "\nMrs Meehan\n"}, {"Language": "English"}]}, "4723871/4721005/4786287": {"title": "A Game", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0954, Page 062", "Page 062"], "url": "https://www.duchas.ie/en/cbes/4723871/4721005/4786287", "text": "\nA Game.  Two little dicky birds       Sat on a wall.  One was named Peter,       The other named Paul.  Fly away Peter !       Fly away Paul!   Come back Peter !        Come back Paul !The above is a trick with two pieces of paper attached to the index finger of each hand.By substituting the \"méar fada\"for same the papers disappear and come again at command.\n\n\n\n62           XIII.        Wake Games1.\"Jimmy will you bake a bit\"? Devil the bit the day!    I'll put out your bit of light\" Deed and so you may.!This is performed by means of a thick stick held tightly between the knees and a lighted candle.\n(continues on next page)\n", "school_info": "School: Cill an Charnáin", "metadata": [{"Location:": "Killycarnan North, Co. Monaghan", "Teacher:": "\nMrs Meehan\n"}, {"Language": "English"}]}, "4742167/4741555/4814646": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0775, Page 035", "Page 035"], "url": "https://www.duchas.ie/en/cbes/4742167/4741555/4814646", "text": "\nA game called \"Beat out the bull\" used to be played at wakes. This is how it was played. Five or six fellows would get pieces of rope and plait them and at the end of each they would put a big knot. They would then get out some other person on the floor and they would give him a terrible beating.Told by Patrick Lyons, aged 72 to Eileen Connelly, Allenwood NS, Naas, Co. Kildare\n\n\n\nThere is well in Mr Thorton's field and it is called the \"Fuaran\". Another game they used to play at wakes was called \"Box the Fox\". Patrick Lyons.\n\n\n\nA black pig is supposed to have run across the bog before the '98 rising and nobody could catch it. The old people say that when the black pig runs across the bog, something bad is going to happen.Told by Patrick Lyons, aged 72, to Eileen Connolly, Allenwood NS Robertstown Naas.\n", "school_info": "School: Allenwood, Robertstown", "metadata": [{"Location:": "Allenwood, Co. Kildare", "Teacher:": "\nSeán Ó Clúmháin\n"}, {"Collector": "Eileen Connelly", "Gender": "female"}, {"Informant": "Patrick Lyons", "Gender": "male", "Age": "72"}, {"Language": "English"}]}, "4742167/4741555/4814649": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0775, Page 035", "Page 035"], "url": "https://www.duchas.ie/en/cbes/4742167/4741555/4814649", "text": "\nA game called \"Beat out the bull\" used to be played at wakes. This is how it was played. Five or six fellows would get pieces of rope and plait them and at the end of each they would put a big knot. They would then get out some other person on the floor and they would give him a terrible beating.Told by Patrick Lyons, aged 72 to Eileen Connelly, Allenwood NS, Naas, Co. Kildare\n\n\n\nThere is well in Mr Thorton's field and it is called the \"Fuaran\". Another game they used to play at wakes was called \"Box the Fox\". Patrick Lyons.\n\n\n\nA black pig is supposed to have run across the bog before the '98 rising and nobody could catch it. The old people say that when the black pig runs across the bog, something bad is going to happen.Told by Patrick Lyons, aged 72, to Eileen Connolly, Allenwood NS Robertstown Naas.\n", "school_info": "School: Allenwood, Robertstown", "metadata": [{"Location:": "Allenwood, Co. Kildare", "Teacher:": "\nSeán Ó Clúmháin\n"}, {"Informant": "Patrick Lyons", "Gender": "male"}, {"Language": "English"}, {"Location": "Allenwood"}]}, "4798653/4787224/4818782": {"title": "Wake and Funeral Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0232, Page 118", "Page 118"], "url": "https://www.duchas.ie/en/cbes/4798653/4787224/4818782", "text": "\nWhen a person dies he is washed and 'laid out'. The shroud is usually brown and the bed is draped in white and black.Three candles are kept burning in the corpse room. Chairs are placed in the room and the people come in and pray and then sit for a short time or until another neighbour comes in.Long ago it was the custom to have \"decent\" wakes. Tobacco, pipes, whiskey and porter were supplied to all and sundry. The neighbours sat up all night and when all were 'treated' the games began. Some one was called on to sing \"The Bells of Shandon\"\" \"Seán O'Farrell\" \"To work upon the Railway\" \"The Old Mail Coach\" etc. Then the games started including \"The Seven Daughters\" and \"Ratha\" \"eipín a coin\" \"The Ship Put Sailing\" \"The Hen\". The seven daughters was a game where all locked arms and everyone had a \"sugar\" covered rod. The seven had to go out through the door and two men were behind the door beating them and preventing their getting out. If any spite existed the game became venomous and often resulted in quarreling.\"Ratha\" was played with a leather strap. These games were not very polite. Mock courts were also held and evidence etc. given. Mock marriages were also common.The clock in a corpse house was always stopped and the bed, chairs, etc. were turned over when the corpse left the house. A cat was not allowed into the corpse room. The funeral took place in the usual way but if there were gaps, it was a sign of another funeral to follow out of the same house.\n", "school_info": "School: Leamh-choill", "metadata": [{"Location:": "Drumsillagh, Co. Roscommon", "Teacher:": "\nCáit Ní Ghadhra\n"}, {"Language": "English"}]}, "4498641/4385195/4822683": {"title": "The Rat", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0790, Page 140", "Page 140"], "url": "https://www.duchas.ie/en/cbes/4498641/4385195/4822683", "text": "\nThe RatWritten by Winifred Coyle aged 11Castleknock, Co DublinOctober 1937Told to her by her motherMrs CoyleCastleknockCo Dublin\n(continues on next page)\n\n\n\nWakesLong ago the wakes were different to what they are now. The people from around the neighbourhood would come in and dance and sing and play games of every sort. Between times they would say the Rosary and sing hymns\n\n\n\nRiddlesWhat fish has its eyes nearest together.The smallestIf your uncle's sister ist not your aunt what relatioion is she to you?your motherWhy is a train ticket a riddle?Because you have to give it upWhen is a man like a looking-glass?When he reflects\n", "school_info": "School: St Brigid's, Castleknock", "metadata": [{"Location:": "Castleknock, Co. Dublin", "Teacher:": "\nMrs Thornton\n"}, {"Collector": "Winifred Coyle", "Gender": "female", "Age": "11", "Address": "Castleknock, Co. Dublin"}, {"Informant": "Mrs Coyle", "Relation": "parent", "Gender": "female", "Address": "Castleknock, Co. Dublin"}, {"Language": "English"}]}, "4798681/4789739/4922596": {"title": "Bread", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0241, Page 076", "Page 076"], "url": "https://www.duchas.ie/en/cbes/4798681/4789739/4922596", "text": "\nThe pancógs was another kind of bread which the people used to eat.  Pancóg bread was made by mixing Indian meal with buttermilk.  The bread was then baked between two leaves of cabbage.Customs at Wakes and Funerals.Long ago the Irish people practised some strange customs at wakes and funerals.  They played a game called the \"nine millers\".  This was the way it was played.  Four men went outside and four remained inside.  Then they took another man and put him standing on the floor.  The four men inside had four belts with which they started to strike the man, trying to send him out to the four who were outside.The four men outside had four more belts to strike him trying to keep him in, and they would continue this game until they had the man almost killed.There was a man in Banada\n(continues on next page)\n", "school_info": "School: Banada", "metadata": [{"Location:": "Banada, Co. Roscommon", "Teacher:": "\nLaoise Ní Dhochartaigh\n"}, {"Collector": "Kathleen Towey", "Gender": "female", "Address": "Lung, Co. Roscommon"}, {"Informant": "Mrs Gara", "Gender": "female", "Address": "Lung, Co. Roscommon"}, {"Language": "English"}]}, "4811581/4798917/4927750": {"title": "Old Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0260, Page 126", "Page 126"], "url": "https://www.duchas.ie/en/cbes/4811581/4798917/4927750", "text": "\nWakesAt wakes long ago people used to be singing and playing tricks and keening.  When a person would be dead the house would be crowded with people.  Every man would get a clay pipe full of tobacco.  They would be left around in scibs and every man that would come in would get one.  There was also plates of snuff left around for the women and every woman that would come in would take a pinch.  There was also jiw harps and they would play on them.Thart was a game played at wakes.  All the men sat in a ring with their feet out before them.  One man was picked out and put in the middle.  Then a short hard rope was given to a man in the ring and he hit the man in the middle and then he passed the rope to some one else who did the same thing.  So the rope went round with the man in the middle getting beaten until he was able to take the rope from one of the men in the ring.\n(continues on next page)\n", "school_info": "School: Radharc na Sionainne", "metadata": [{"Location:": "Clooncah, Co. Roscommon", "Teacher:": "\nNóirín Ní Uiginn\n"}, {"Language": "English"}]}, "4811581/4798918/4927751": {"title": "Old Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0260, Page 127", "Page 127"], "url": "https://www.duchas.ie/en/cbes/4811581/4798918/4927751", "text": "\n(continued from previous page)\nWinkwas another game played at wakes long ago.  One man would stand on the middle of the floor and six men would stand around him.  He would put a hand on one eye and some one would hold a candle fornint the other eye and keep on slapping him on the hands until he would know who was slapping him.\n\n\n\nLong ago people used to get married at wakes and it was against the rules of the Church so the custom died out.Long ago the priest used to come to the houses and Christen the children.\n\n\n\nWhen Our Saviour saw the CrossHe was to be Crucified on He shivered and shookThe Jews asked him was it fever or ague He hadAnd He said \"No, Thank God\".Anyone that keeps this prayer in memory or in writing shall never have fever or ague (ache).\n", "school_info": "School: Radharc na Sionainne", "metadata": [{"Location:": "Clooncah, Co. Roscommon", "Teacher:": "\nNóirín Ní Uiginn\n"}, {"Informant": "Mrs L. English", "Gender": "female", "Age": "87", "Address": "Clooncah, Co. Roscommon"}, {"Language": "English"}]}, "4798729/4794031/4928361": {"title": "Funeral Games", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0261, Page 057", "Page 057"], "url": "https://www.duchas.ie/en/cbes/4798729/4794031/4928361", "text": "\nLong ago games were played at wakes and funerals.  One game played was Slapping.  One man would stand with his hand on his hip while another man slapped it with his hand until both of their hands were sore.Another game played was Thart.  A crowd of men would sit on the floor in a ring with one man standing in the middle.  They had a belt which they passed from one to another under their knees.  When the man in the middle was not looking he was struck with the belt.  That was kept up until he caught someone with the belt.  Then that man stood in the middle.Another game played was Hearing Confessions.  A man sat in the corner with a straw-rope round his neck.  A great many sins were told to him and he gave penances.The next day before the funeral, stone-throwing was done to find out the strongest man in the parish.  Long jumping and high jumping were also.\n(continues on next page)\n", "school_info": "School: Drumatemple (B.)", "metadata": [{"Location:": "Drumatemple, Co. Roscommon", "Teacher:": "\nMichael Quinn\n"}, {"Collector": "Joe Griffin", "Gender": "male", "Address": "Cloonadarragh, Co. Galway"}, {"Language": "English"}]}, "4798729/4794034/4928362": {"title": "Funeral Games", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0261, Page 060", "Page 060"], "url": "https://www.duchas.ie/en/cbes/4798729/4794034/4928362", "text": "\n(continued from previous page)\nmen with belts would beat until he was outside the door. Another trades man would then be brought and if he was not suitable he would also be beaten until he was outside the door and so the game would be continued until the father was satisfied.Joe Griffin, Cloonadarragh,\n\n\n\nThey had a small table also and on the table was drawn a foxe's head. They had a belt and they used to fold it up and leave it on the table. The person who put the top of the pencil in the foxe's ear had the game won.John Joseph WalshBallaghemurray\n\n\n\nDoras.- When people would be going in and out from the wake A man would be standing behind the door with a leather belt in his hand. Everyone who went in or out got a lash down on the head with the belt.James WalshCloonruff When a crowd of men gathered at a wake\n(continues on next page)\n", "school_info": "School: Drumatemple (B.)", "metadata": [{"Location:": "Drumatemple, Co. Roscommon", "Teacher:": "\nMichael Quinn\n"}, {"Collector": "James Walsh", "Gender": "male", "Address": "Cloonruff, Co. Galway"}, {"Language": "English"}]}, "4798729/4794034/4928364": {"title": "Funeral Games", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0261, Page 060", "Page 060"], "url": "https://www.duchas.ie/en/cbes/4798729/4794034/4928364", "text": "\n(continued from previous page)\nmen with belts would beat until he was outside the door. Another trades man would then be brought and if he was not suitable he would also be beaten until he was outside the door and so the game would be continued until the father was satisfied.Joe Griffin, Cloonadarragh,\n\n\n\nThey had a small table also and on the table was drawn a foxe's head. They had a belt and they used to fold it up and leave it on the table. The person who put the top of the pencil in the foxe's ear had the game won.John Joseph WalshBallaghemurray\n\n\n\nDoras.- When people would be going in and out from the wake A man would be standing behind the door with a leather belt in his hand. Everyone who went in or out got a lash down on the head with the belt.James WalshCloonruff When a crowd of men gathered at a wake\n(continues on next page)\n", "school_info": "School: Drumatemple (B.)", "metadata": [{"Location:": "Drumatemple, Co. Roscommon", "Teacher:": "\nMichael Quinn\n"}, {"Collector": "Lawrence Edwards", "Gender": "male", "Address": "Cloonruff, Co. Galway"}, {"Language": "English"}]}, "4798729/4794035/4928366": {"title": "Funeral Games", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0261, Page 061", "Page 061"], "url": "https://www.duchas.ie/en/cbes/4798729/4794035/4928366", "text": "\n(continued from previous page)\nthey put a scóilín in the middle of the floor. Then the best looking girl in the house was brought out and put sitting on it. Then a man was brought out who had to kiss her. If he did not go, ten men would off their belts and compel him.Lawrence EdwardsCloonruff\n\n\n\nAnother game is called \"Button\". It is very nice also. All the people sit round in a ring and they get a belt with a big buckle on it and they also get a button. One person stands up and gives the button to some one and asks the others to guess who has the button and all who are wrong he hits them with the buckle of the belt.Peter GovernClooneygrasson\n", "school_info": "School: Drumatemple (B.)", "metadata": [{"Location:": "Drumatemple, Co. Roscommon", "Teacher:": "\nMichael Quinn\n"}, {"Collector": "Peter Govern", "Gender": "male", "Address": "Cloonagrassan, Co. Roscommon"}, {"Language": "English"}]}, "4811593/4800096/4928518": {"title": "Funeral Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0268, Page 009", "Page 009"], "url": "https://www.duchas.ie/en/cbes/4811593/4800096/4928518", "text": "\nIt was the custom long when they would be going to bury the corpse to place the coffin on a horses cart. It was a rule for two women to sit on the coffin and cry until they would reach the churchyard. They used to carry the corpse on their shoulders and then place the coffin on sticks or poles which they called a \"bearer.\" When a hersow would die there used to be two nights of a wake and all sorts of games used to be played. During the day according as anyone would come in they got a pipe of tobacco and snuf. As each person would come in the keening was raised by all that were in the house. The coffin was placed on four chairs outside the door of the house for a few minutes before they started for the graveyard. It was a belief that if one died three were supposed to die out of the district. If a crane flew over the house one of the members would die. If it rained a shower while the coffin was being carried out, it was supposed their sins where all washed away. During the nights of the wake much marriages took place and games of lined man's buff and the bosehara.\n", "school_info": "School: An Charraig", "metadata": [{"Location:": "Carrick, Co. Roscommon", "Teacher:": "\nSeán Ó Súilleabháin\n"}, {"Language": "English"}]}, "4811599/4800569/4929095": {"title": "Old Wake Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0270, Page 205", "Page 205"], "url": "https://www.duchas.ie/en/cbes/4811599/4800569/4929095", "text": "\n\"My Man John\"It was customary in this district in former times to play games of different kinds at wakes. In fact, some of the men had quite a reputation as leaders of those games. One of the most popular was called \"The Priest of the Parish\" which was played in this way. The players sat in a circle and each put a name \"Priest of the Parish\" \"My Man John\"  \"Green Cap\" \"White Cap\" and so on. The man in charge was called \"The Master\"He held a lighted candle in his hand and a cork charred in the flame.He repeated the following rhyme \"the Priest of the parish has lost his considering cap, some say this, some say that and some say \"My man John\" or \"White Cap\". calling on the players at random. The player named would have to be on the alert, and the\n(continues on next page)\n", "school_info": "School: Cluain na Cille", "metadata": [{"Location:": "Cloonakille, Co. Roscommon", "Teacher:": "\nEithne , Bean Uí Fhallamhain\n"}, {"Language": "English"}]}, "4723821/4716265/4936398": {"title": "Old Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0936, Page 003", "Page 003"], "url": "https://www.duchas.ie/en/cbes/4723821/4716265/4936398", "text": "\nTongs over cradle to prevent wicked Gods from stealing baby.Give nothing away on New Year's Day.People used to plant as much as possible on St. Patricks day. Anything that had a root was sure to grow.Rake out ashes on All Souls' night.Many allege they saw track of foot thereon next morning.Some put on a good fire on that night, and put bread on the table.\n\n\n\nWakes - Clay pipes and tobacco.Razor dead man shaved with always given to man who shaves him.Any tobacco left is thrown out - considered unlucky to keep it.\n\n\n\nGames at Wakes - Buttony ButtonyThose in the game sit in a line with their hands joined. One has button in his joined hands and he goes round and puts it into somebody's hand and no one knows who. Then he asks some player who has the button, and if the guess is wrong, the person guessed can put some penalty on the guesser and this continues till the button is found and the correct guesser starts all over again\n", "school_info": "School: Moys", "metadata": [{"Location:": "Moy Otra, Co. Monaghan", "Teacher:": "\nP. Dawson, C. Mac an Ghirr\n"}, {"Language": "English"}]}, "4723821/4716265/4936401": {"title": "Old Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0936, Page 003", "Page 003"], "url": "https://www.duchas.ie/en/cbes/4723821/4716265/4936401", "text": "\nTongs over cradle to prevent wicked Gods from stealing baby.Give nothing away on New Year's Day.People used to plant as much as possible on St. Patricks day. Anything that had a root was sure to grow.Rake out ashes on All Souls' night.Many allege they saw track of foot thereon next morning.Some put on a good fire on that night, and put bread on the table.\n\n\n\nWakes - Clay pipes and tobacco.Razor dead man shaved with always given to man who shaves him.Any tobacco left is thrown out - considered unlucky to keep it.\n\n\n\nGames at Wakes - Buttony ButtonyThose in the game sit in a line with their hands joined. One has button in his joined hands and he goes round and puts it into somebody's hand and no one knows who. Then he asks some player who has the button, and if the guess is wrong, the person guessed can put some penalty on the guesser and this continues till the button is found and the correct guesser starts all over again\n", "school_info": "School: Moys", "metadata": [{"Location:": "Moy Otra, Co. Monaghan", "Teacher:": "\nP. Dawson, C. Mac an Ghirr\n"}, {"Language": "English"}]}, "4723821/4716265/4936405": {"title": "Old Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0936, Page 003", "Page 003"], "url": "https://www.duchas.ie/en/cbes/4723821/4716265/4936405", "text": "\nTongs over cradle to prevent wicked Gods from stealing baby.Give nothing away on New Year's Day.People used to plant as much as possible on St. Patricks day. Anything that had a root was sure to grow.Rake out ashes on All Souls' night.Many allege they saw track of foot thereon next morning.Some put on a good fire on that night, and put bread on the table.\n\n\n\nWakes - Clay pipes and tobacco.Razor dead man shaved with always given to man who shaves him.Any tobacco left is thrown out - considered unlucky to keep it.\n\n\n\nGames at Wakes - Buttony ButtonyThose in the game sit in a line with their hands joined. One has button in his joined hands and he goes round and puts it into somebody's hand and no one knows who. Then he asks some player who has the button, and if the guess is wrong, the person guessed can put some penalty on the guesser and this continues till the button is found and the correct guesser starts all over again\n", "school_info": "School: Moys", "metadata": [{"Location:": "Moy Otra, Co. Monaghan", "Teacher:": "\nP. Dawson, C. Mac an Ghirr\n"}, {"Language": "English"}]}, "4723821/4716278/4936436": {"title": "Fairies", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0936, Page 016", "Page 016"], "url": "https://www.duchas.ie/en/cbes/4723821/4716278/4936436", "text": "\n(continued from previous page)\nFreets:- especially is she is barefooted.If you want to keep great with the fairies do not cut down the gentle bushes and don't build your house on their pads\n\n\n\nAbout fifty years ago the people had oaten meal porridge for their breakfast in the morning, potatoes for dinner and supper. They made oaten meal bread and hardened to the fire, and that is what the children got to school. They took no tea that time but took milk instead.\n\n\n\nCill on FireThere are a number of people left sitting that doesn't know the game. There is a man left holding a cap and he is the king bee and the rest go outside and come in and out a few times, humming with a straw accross their mouth and then they come in with their mouths of water and they all stand around the man holding the cap and they all spit the water on him and he does be nearly drowned.\n\n\n\nAll the men that are the masons go outside and one man in the house gives command what to do. When the masons come in with their hands full of Claber (?) and clay, then they all stand in a line one after the other, then the commander says\n(continues on next page)\n", "school_info": "School: Moys", "metadata": [{"Location:": "Moy Otra, Co. Monaghan", "Teacher:": "\nP. Dawson, C. Mac an Ghirr\n"}, {"Language": "English"}]}, "4723821/4716278/4936437": {"title": "Fairies", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0936, Page 016", "Page 016"], "url": "https://www.duchas.ie/en/cbes/4723821/4716278/4936437", "text": "\n(continued from previous page)\nFreets:- especially is she is barefooted.If you want to keep great with the fairies do not cut down the gentle bushes and don't build your house on their pads\n\n\n\nAbout fifty years ago the people had oaten meal porridge for their breakfast in the morning, potatoes for dinner and supper. They made oaten meal bread and hardened to the fire, and that is what the children got to school. They took no tea that time but took milk instead.\n\n\n\nCill on FireThere are a number of people left sitting that doesn't know the game. There is a man left holding a cap and he is the king bee and the rest go outside and come in and out a few times, humming with a straw accross their mouth and then they come in with their mouths of water and they all stand around the man holding the cap and they all spit the water on him and he does be nearly drowned.\n\n\n\nAll the men that are the masons go outside and one man in the house gives command what to do. When the masons come in with their hands full of Claber (?) and clay, then they all stand in a line one after the other, then the commander says\n(continues on next page)\n", "school_info": "School: Moys", "metadata": [{"Location:": "Moy Otra, Co. Monaghan", "Teacher:": "\nP. Dawson, C. Mac an Ghirr\n"}, {"Language": "English"}]}, "4723821/4716279/4936441": {"title": "The Game of the Free Mason", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0936, Page 017", "Page 017"], "url": "https://www.duchas.ie/en/cbes/4723821/4716279/4936441", "text": "\n(continued from previous page)\nrub and scrub and then each man rubs it on each others faces.\n\n\n\nI am an Irish labourerBoth hardy stout and strongTis idleness I never professThat race I don't belongI would like to toil and look for workTo preserve my life so dear. But when I go to look for workIt's no Irish wanted here. Chorus:You may think it a misfortuneTo be christened Pat or DanBut to me it is an honourTo be called an Irishman.That we may live to see the dayIt will come yet never fearWhen ignorance gives away to sense And you are wanted Irish here\n", "school_info": "School: Moys", "metadata": [{"Location:": "Moy Otra, Co. Monaghan", "Teacher:": "\nP. Dawson, C. Mac an Ghirr\n"}, {"Language": "English"}]}, "4723821/4716362/4936520": {"title": "Limgare Ragman", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0936, Page 099", "Page 099"], "url": "https://www.duchas.ie/en/cbes/4723821/4716362/4936520", "text": "\nLimgare RagmanI have travelled all Ireland from top to the bottom. I have attended all weddings and wakes near and near and far but the greatist of all that I ever attended was the death of a Ragman that died in Lemgare.II nd VerseThere was a wee grain of meall in a bag in the corner it was shook on the pot for the boys who came far but two greedy fellows with spoons in their pockets put an end to the porridge that night in Lemgare.\n\n\n\nBravo ye bold Clontibret boys youshowed a grand displayon the 17th of August not far from Ballybayupon that noted sheep walkthere stood three thousand Gails tojoin in song and dancing andthe war pipes of O´Neill    IInd Verse\n(continues on next page)\n", "school_info": "School: Moys", "metadata": [{"Location:": "Moy Otra, Co. Monaghan", "Teacher:": "\nP. Dawson, C. Mac an Ghirr\n"}, {"Language": "English"}]}, "4758587/4756920/4936528": {"title": "An Dán Breac", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0931, Page 359", "Page 359"], "url": "https://www.duchas.ie/en/cbes/4758587/4756920/4936528", "text": "\nThe following poem I took down from Mrs Mary McMahon of Dian shortly before she died. I wrote it down hurriedly (phonetically) without due regard to sense or meaning intending to pay her another visit in order to check up upon the meaning of the poem. Unfortunately the old woman then grew ill and I never got n opportunity to question her on the meaning of the lines. On the evening I wrote down the poem I didn't think it fair to the old woman to ask question as to the meaning of the lines - seeing that she was in a weak state of health and her husband Pat didn't want her to over exert herself either - the more so as another visit by me to their home would mean another ounce of tobacco for Pat.Mary said that the poem used to be sung at wakes in her earlier days. It is a long poem and as her memory was failing I doubt if it is complete. The poem is entitled - An Dán Breac. (Mary owned the farm in Dian originally; her husband married in to the place.)\n(continues on next page)\n", "school_info": "School: Taplach", "metadata": [{"Location:": "Taplagh, Co. Monaghan", "Teacher:": "\nP. Ó Dubhthaigh\n"}, {"Informant": "Mrs Mary Mc Mahon", "Gender": "female", "Address": "Dian, Co. Monaghan"}, {"Language": "mixed"}]}, "4758587/4756928/4936529": {"title": "An Dán Breac", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0931, Page 367", "Page 367"], "url": "https://www.duchas.ie/en/cbes/4758587/4756928/4936529", "text": "\n(continued from previous page)\nThe foregoing poem \"An Dan Breac\" used to be sung at wakes by old people who had it. Nancy Callan from Lisnamoyle (who was cottering where Owney McBride now lives) taught the foregoing poem to Mrs Mary McMahon of Dian (when Mary was a young girl) for a few yards of yarn.\n\n\n\nThe following verses I took down from Mrs. McMahon of Dian - before mentioned.Ó Caoin Éire na Seirce, tá me do do caoineadh go bhfuil tart orm.Bhal, ars an fear gurab é scadán greigeal d'fhág a tart ort.Éirigidh suas is triallaighidh go Co. Dúin na nGallCasfaidh Pádraig orthaibh agus béidh sé libhNuair a rachas sibh isteach ins na mbádaíBéidh na grástaí da roinnThart ar seipéal Chríosta agus ó shoin go leach na mbonnGoidé mur ngroithe go Loch Dearg, na gur chuir sibh fearg ar mur Rí,Chan Loch Dearg é, ach Loch na nDeór agus an áithrighe.\n", "school_info": "School: Taplach", "metadata": [{"Location:": "Taplagh, Co. Monaghan", "Teacher:": "\nP. Ó Dubhthaigh\n"}, {"Informant": "Mrs Mary Mc Mahon", "Gender": "female", "Address": "Dian, Co. Monaghan"}, {"Language": "mixed"}]}, "4742048/4730881/4939161": {"title": "Wake Games", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0955, Page 262", "Page 262"], "url": "https://www.duchas.ie/en/cbes/4742048/4730881/4939161", "text": "\nThe Priest of the Parish lost his Hat.The leader of this game stands in the middle of the floor of the wake-room, and the other players are seated around. The leader gives each player a name such as \"Kid in the Clover\" \"Mouse in the Meal\", \"Trip trap at the Barn door\" etcHe then begins: The priest of the parish lost his hatSome say this and some say thatBut I say My man Jack\"Jack who is also standing answers:\"Me, me sir?\"The accuser replies \"Yes, you sir!Jack, angrily , shout \"You're a liar, sir\"The accuser then asks \"Who then, sir?\" Jack tries to blame one of his fellow players shouting out his name, as -- \"Kind in the Clover\"All eyes are directed to poor \"Kid in the Clover\", who if he fails to answer instantly exactly as Jack did has to give up a forfeit - a hankerchief, pipe pin or something. The game proceeds till the leader has succeeded in exacting a forfeit from each player, for failing to answer promptly and correctly. Then a game of\n(continues on next page)\n", "school_info": "School: Cnoc an tSalainn", "metadata": [{"Location:": "Knockatallan, Co. Monaghan", "Teacher:": "\nF. Ó Cathasaigh\n"}, {"Language": "English"}]}, "4742049/4730906/4939224": {"title": "Wake Games", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0955, Page 290", "Page 290"], "url": "https://www.duchas.ie/en/cbes/4742049/4730906/4939224", "text": "\nI The Priest of the Parish.The principal actor in this game stands in the centre of the floor of the room (in which the corpse is) while the other players sit around the walls. The man in charge gives each of the players a name\"Mouse in the meal\" Pinner (Pin her)  in the Whins\" \"Drake in the Lough Bog Drain\", Over the ditch and at her\", \"Kid in the Clover\", \"Trip trap at the back barn-door\". He then begins as follows:-The Priest of the Parish lost his hat.Some say this & some say thatBut I say my man JackJack, who is also standing, answers\"Me, me, sir?\"the accuser shouts out \"Yes, you, sir\"Jack who appears to be angry retorts \"you're a liar, sir\".The accuser then asks \"Who then, sir?\"Jack blames one of his neighbours -\"Kid in the Clover\" for example. All eyes are set on \"the kid\" who answers as Jack did. Any person who fails to answer word for word as Jack did must \"give up something as a fine - a pipe or a handerchief or a comb.\n(continues on next page)\n", "school_info": "School: Iorball Sionnaigh", "metadata": [{"Location:": "Scotstown, Co. Monaghan", "Teacher:": "\nE. Mac Thaidhg\n"}, {"Language": "English"}]}, "4723869/4720939/4941328": {"title": "Nósanna an Tórraimh", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0953, Page 389", "Page 389"], "url": "https://www.duchas.ie/en/cbes/4723869/4720939/4941328", "text": "\n1/ Bhí nós ag muinntir na Conndae seo an marbhán do chur ós cionn cláir ar an mbórd, ó lá bháis go dtí lá na sochraide.2/ D'imrightí cluichthe i rith an sóttaim. B'iad na cinn ba thabhachtaighe orta siud ná \"an pósadh\", \"Falluidheachta,\" \"Díol na Feóla,\" agus \"Bualadh Bos\", rl.3/ Nós an- choitcheannta imeasg na ndaoine a b'eadh \"caoineadh\" na marbh, timcheall tríocha bliadhain ó shoin.\n\n\n\nCuirtí an cóinra ar chathaoireachaibh 'san tsráid, agus nuair a thógtaí an cóinra leagtaí na cathaoireacha2/ Tugtaí an cóinra chuig agus ó'n séipéal ar ghuailnibh cheathrair fear de'n ainm sloinne chéadna leis an mharbhán.3/ Nuair a bhíodh an marbhán eádtrom, deirtí gur comhartha é go bhfuigheadh duine eile den tsliocht bás gan mhoill.4/ Deirtí fresin gur sonasach an marbhán ar a dtuiteann an fhearthainn.\n", "school_info": "School: Threemilehouse", "metadata": [{"Location:": "Three Mile House, Co. Monaghan", "Teacher:": "\nI. Mc Eneaney\n"}, {"Language": "Irish"}]}, "4723869/4720939/4941329": {"title": "Nósanna an Tórraimh", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0953, Page 389", "Page 389"], "url": "https://www.duchas.ie/en/cbes/4723869/4720939/4941329", "text": "\n1/ Bhí nós ag muinntir na Conndae seo an marbhán do chur ós cionn cláir ar an mbórd, ó lá bháis go dtí lá na sochraide.2/ D'imrightí cluichthe i rith an sóttaim. B'iad na cinn ba thabhachtaighe orta siud ná \"an pósadh\", \"Falluidheachta,\" \"Díol na Feóla,\" agus \"Bualadh Bos\", rl.3/ Nós an- choitcheannta imeasg na ndaoine a b'eadh \"caoineadh\" na marbh, timcheall tríocha bliadhain ó shoin.\n\n\n\nCuirtí an cóinra ar chathaoireachaibh 'san tsráid, agus nuair a thógtaí an cóinra leagtaí na cathaoireacha2/ Tugtaí an cóinra chuig agus ó'n séipéal ar ghuailnibh cheathrair fear de'n ainm sloinne chéadna leis an mharbhán.3/ Nuair a bhíodh an marbhán eádtrom, deirtí gur comhartha é go bhfuigheadh duine eile den tsliocht bás gan mhoill.4/ Deirtí fresin gur sonasach an marbhán ar a dtuiteann an fhearthainn.\n", "school_info": "School: Threemilehouse", "metadata": [{"Location:": "Three Mile House, Co. Monaghan", "Teacher:": "\nI. Mc Eneaney\n"}, {"Language": "Irish"}]}, "4742060/4731806/4942053": {"title": "Churning", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0958, Page 191", "Page 191"], "url": "https://www.duchas.ie/en/cbes/4742060/4731806/4942053", "text": "\n(continued from previous page)\nthe milk. Then they rinced the churn down with spring water.Then they put a little block under the churn and rocked it for a few minutes until they had the butter in a solid big lump. Then they washed their hands cleanly. They placed the butter in a wooden dish and washed the butter until they had the butter free from milk. Then they would add sufficient salt to taste it. They would put a quart or two of water in the dish.Then they used a trencher and a butter board made of secamore. They would cut it out with a butter board in one or two pound rolls as required. Then they would put it into rolls with sufficient labour as possible to prepare it for the market or home use.\n\n\n\nIn olden days at wakes particular if there was not much need for sympathy, they would carry on more like a dance than a wake. It was customary jibbing or mobbing each other and still there was no ill-feeling afterwards.They played tricks on each\n(continues on next page)\n", "school_info": "School: Rakeeragil", "metadata": [{"Location:": "Rakeeragh, Co. Monaghan", "Teacher:": "\nP. Murray\n"}, {"Informant": "P. Brennan", "Age": "55", "Address": "Sheetrim, Co. Monaghan"}, {"Language": "English"}]}, "4742060/4731807/4942060": {"title": "Wakes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0958, Page 192", "Page 192"], "url": "https://www.duchas.ie/en/cbes/4742060/4731807/4942060", "text": "\n(continued from previous page)\nother and singing comic songs all the time. It was the talk of the county next week until the next funny wake would turn up.\n\n\n\nA long time ago there lived in Ireland a woman who could turn herself into a hare. She would go around the country taking milk from the cows. If she ran under the cows she would have their milk. One morning a man saw her coming out of the byre.He thought she was a hare but when the man went out to the byre to milk the cows they had only a little drop. The next morning the man rose early and took a hail of a three-penny bit with him. When he was going over the street, the hare ran out from the byre door and the man shot at her and he broke her hind leg. He tracked her over the hills and when he came to an old house at the other side of the hill, he saw an old woman sitting on a chair with her leg bleeding. It was she that was taking the milk.\n", "school_info": "School: Rakeeragil", "metadata": [{"Location:": "Rakeeragh, Co. Monaghan", "Teacher:": "\nP. Murray\n"}, {"Informant": "H. Murphy", "Age": "70", "Address": "Crosshugh, Co. Monaghan"}, {"Language": "English"}]}, "4921985/4915513/4943681": {"title": "Customs at Wakes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0494, Page 213", "Page 213"], "url": "https://www.duchas.ie/en/cbes/4921985/4915513/4943681", "text": "\nLong ago when a person died the remains were laid out on the kitchen table. Then the neighbors gathered to the wake, there were clay pipes given out filled with tobacco, there was also snuff, and porter. When the men drank to excess and got merry they began to throw caídreáns at one another and sometimes at the corpse to see if they wake it. They used also throw them at the clay pipes in the men's mouths and brake them. It was also a custom to get all the old women that were good for caoining to come the night of the wake and the day of the funeral to caoin over the corpse, as they used get payment to do this.\n", "school_info": "School: Mín na Cille, Mainistir na Féile", "metadata": [{"Location:": "Meenkilly, Co. Limerick", "Teacher:": "\nAindrias Ó Dúnadhuighe\n"}, {"Collector": "Maireád Nic Chárthaig", "Gender": "female"}, {"Informant": "(name not given)", "Relation": "grandparent", "Gender": "female"}, {"Language": "English"}]}, "4922032/4920506/4950019": {"title": "Local Traditions - Miscellaneous", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0506, Page 738", "Page 738"], "url": "https://www.duchas.ie/en/cbes/4922032/4920506/4950019", "text": "", "school_info": "School: Cromadh (B.)", "metadata": [{"Location:": "Croom, Co. Limerick", "Teacher:": "\nDáithí Ó Ceanntabhail\n"}, {"Collector": "Daithí O Ceanntabhail", "Gender": "male", "Occupation": "múinteoir"}, {"Informant": "(name not given)", "Relation": "relative (other than parent or grandparent)", "Gender": "male"}, {"Language": "English"}]}, "4742041/4730192/4950982": {"title": "An Glas Gaibhneach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0932, Page 005", "Page 005"], "url": "https://www.duchas.ie/en/cbes/4742041/4730192/4950982", "text": "\n(continued from previous page)\ngo raibh loch ‘na thimcheall. Taréis tamaill thug an bó chúil fheachaint siar agus chonnaic sí an loch. Tháinig d’eisteann ar an mbuin nuair a chonnaic sí an báinne ag dul amudha agus ní dhearn sé ceo na frighde ach an cos a tharraingt, speach a thabhairt do’n mhnai idir an dá súil. Bhroch léi annsin, thugh an fhairrge uirthi fein, radharch ní fhachtas uirthí ar thalamh na h’Éireann ó shoin.\n\n\n\nTá tobar in-aice na n-áite luaidhte thuas ar a dtugtar Tobar Lastra, agus deirtear go bhfuil dá naoimh curtha ann – Naomh Clara agus Naomh Lastra. Téigheann daoine chuig an tobar gach céad Domhnach de Lughnasa agus Bealtaine.Bhí sgrín de Naomh Adhamnáin san gceanntair sin freisin ach sgriosadh é in aimsir na  Lochlannach san naomhadh aois.\n", "school_info": "School: Drom Loiste", "metadata": [{"Location:": "Drumlusty, Co. Monaghan", "Teacher:": "\nSeán Ó Maoláin\n"}, {"Informant": "Aodh Ó Dubhthaig", "Gender": "male", "Age": "65", "Occupation": "feirmeoir", "Address": "Dundrockan, Co. Monaghan"}, {"Language": "Irish"}]}, "4922068/4849624/4954636": {"title": "Travelling Folk", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0516, Page 445", "Page 445"], "url": "https://www.duchas.ie/en/cbes/4922068/4849624/4954636", "text": "\n(continued from previous page)\nat the place where the Lost Stream from Lough Gur disappears under Carraigín Hill (as described in page 79).She used to buy the eels for 6D to 8D a dozen and sell them for more twice that price.Mary Clancy (Farmer)Lower Grange, Kilmallock.\n\n\n\nWakes – Continued from page 114IThe Rope Games = A rope was procured and actually tied around the corpse either to the body or to one or both of the hands; and sometimes to one of the legs.Then the rope was taken under the clothes or covered in some way, so that it would not be visible to a person entering the room and taken to some distant corner of the room where from time to time one of the “prime boys” would\n(continues on next page)\n", "school_info": "School: Gráinseach, Cill Mocheallóg", "metadata": [{"Location:": "Grange, Co. Limerick", "Teacher:": "\nTomás Ó Loínsigh\n"}, {"Language": "English"}]}, "4922122/4854245/4956930": {"title": "Wake Games", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0530, Page 496", "Page 496"], "url": "https://www.duchas.ie/en/cbes/4922122/4854245/4956930", "text": "\nA favourite wake game of long ago used to be performed in houses. A man in the house would pretend illness. He would go to bed and the doctor would be sent for. One man then left the house. The doctor would enter riding on his horse. This was represented by two men one on the back of the other. As the supposed doctor came along on his horse some one would trip the animal i.e. the man who was carrying the doctor. Both would get a heavy fall causing the death of the doctor. The sick man would also die.  A court would then be held and the guilty person sentenced to punishment.\n", "school_info": "School: Tír-Dhá-Ghlas (Terryglass)", "metadata": [{"Location:": "Terryglass, Co. Tipperary", "Teacher:": "\nSeán Ó Gliasáin\n"}, {"Informant": "John Parkinson", "Gender": "male", "Age": "circa 50", "Occupation": "farmer", "Address": "Slevoir, Co. Tipperary"}, {"Language": "English"}]}, "4922150/4856535/5012177": {"title": "Wake Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0538, Page 063", "Page 063"], "url": "https://www.duchas.ie/en/cbes/4922150/4856535/5012177", "text": "\n(a). When the coffin would be brought home from the town those in charge would get a gad of herrings and put them in the coffin.Sometime during the night potatoes were boiled and those herrings were roasted and given for supper.(b) Clay pipes and tobacco were also distributed during the night.(c) During the Whiteboy Act all who were expected at the wake were put on a paper and nailed behind the door. Should the police come, this list was examined; a roll would be called and anyone over this number would be imprisoned or asked to explain.\n\n\n\n(a) 'Soldier'. Ten or twelve young men would stand in a row and numbered. One would escape(highman)After he was caught he was flogged, and put first. This procedure was continued till all got flogged. (b)  'Bersy'  A number of men or boys sat around in a  ring with knees raised. A twisted rope of straw called a 'sugan' was hidden by one of the boys. In the middle of the ring was another boy in a partly\n(continues on next page)\n", "school_info": "School: Burgess, Aonach Úrmhumhan", "metadata": [{"Location:": "Burgesbeg, Co. Tipperary", "Teacher:": "\nMícheál Ó Cearnaigh\n"}, {"Language": "English"}]}, "4922150/4856535/5012178": {"title": "Wake Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0538, Page 063", "Page 063"], "url": "https://www.duchas.ie/en/cbes/4922150/4856535/5012178", "text": "\n(a). When the coffin would be brought home from the town those in charge would get a gad of herrings and put them in the coffin.Sometime during the night potatoes were boiled and those herrings were roasted and given for supper.(b) Clay pipes and tobacco were also distributed during the night.(c) During the Whiteboy Act all who were expected at the wake were put on a paper and nailed behind the door. Should the police come, this list was examined; a roll would be called and anyone over this number would be imprisoned or asked to explain.\n\n\n\n(a) 'Soldier'. Ten or twelve young men would stand in a row and numbered. One would escape(highman)After he was caught he was flogged, and put first. This procedure was continued till all got flogged. (b)  'Bersy'  A number of men or boys sat around in a  ring with knees raised. A twisted rope of straw called a 'sugan' was hidden by one of the boys. In the middle of the ring was another boy in a partly\n(continues on next page)\n", "school_info": "School: Burgess, Aonach Úrmhumhan", "metadata": [{"Location:": "Burgesbeg, Co. Tipperary", "Teacher:": "\nMícheál Ó Cearnaigh\n"}, {"Language": "English"}]}, "4922254/4864493/5051719": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0568, Page 164", "Page 164"], "url": "https://www.duchas.ie/en/cbes/4922254/4864493/5051719", "text": "\nLong ago the people had no chairs or tables like the have now. Mrs London who lived in Lisheen had chairs called sugan bottom chairs. These chairs were made at home. There were timber legs on them and the seats were made of hay plaited together like a sugan. They were very nice seats to sit on.\n\n\n\nLong ago the people kept a dead person two nights in the house before they were brought to the chapel.At the wake they had Snuff, Drinks Pipes, Tobacco, candles and an old woman paid to cry over the dead person.There was a funeral in Ballyoline a long time ago of Kitty Kennedy. When they were saying the Rosary Geaghan said Hail Mary about one hundred time. The mare\n(continues on next page)\n", "school_info": "School: Newtownanner, Cluain Meala", "metadata": [{"Location:": "Newtownanner Demesne, Co. Tipperary", "Teacher:": "\nProinnsias Ó Corcoráin\n"}, {"Collector": "Eamon Fogarty", "Gender": "male", "Address": "Derrinlaur Lower, Co. Waterford"}, {"Informant": "Edward Fogarty", "Relation": "parent", "Gender": "male", "Address": "Derrinlaur Lower, Co. Waterford"}, {"Language": "English"}]}, "4922254/4864493/5051721": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0568, Page 164", "Page 164"], "url": "https://www.duchas.ie/en/cbes/4922254/4864493/5051721", "text": "\nLong ago the people had no chairs or tables like the have now. Mrs London who lived in Lisheen had chairs called sugan bottom chairs. These chairs were made at home. There were timber legs on them and the seats were made of hay plaited together like a sugan. They were very nice seats to sit on.\n\n\n\nLong ago the people kept a dead person two nights in the house before they were brought to the chapel.At the wake they had Snuff, Drinks Pipes, Tobacco, candles and an old woman paid to cry over the dead person.There was a funeral in Ballyoline a long time ago of Kitty Kennedy. When they were saying the Rosary Geaghan said Hail Mary about one hundred time. The mare\n(continues on next page)\n", "school_info": "School: Newtownanner, Cluain Meala", "metadata": [{"Location:": "Newtownanner Demesne, Co. Tipperary", "Teacher:": "\nProinnsias Ó Corcoráin\n"}, {"Collector": "Mary F. Prendergast", "Gender": "female", "Address": "Ballynevin, Co. Tipperary"}, {"Informant": "Thomas Prengergast", "Gender": "male", "Address": "Ballynevin, Co. Tipperary"}, {"Language": "English"}]}, "4922254/4864494/5051725": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0568, Page 165", "Page 165"], "url": "https://www.duchas.ie/en/cbes/4922254/4864494/5051725", "text": "\n(continued from previous page)\nhe was saying Hail Mary the more William Lynch was saying \"Glory John.\" They lied the dead person with ropes and put her sitting up in the bed.\n\n\n\nMy grandfather told me about these customs. He lives at Newtown Annes. Long ago when a person died they left him in the house for two nights and they buried him the following day. They carried the coffin on a bearer on their shoulders. A bearer is made of tars sticks about seven or eight feet long with two sticks nailed across and the coffin was tied on them so that it would not fall off. Four men carried the bearer. Every man took a turn of carrying it. The people used be casining going after the coffin.\n", "school_info": "School: Newtownanner, Cluain Meala", "metadata": [{"Location:": "Newtownanner Demesne, Co. Tipperary", "Teacher:": "\nProinnsias Ó Corcoráin\n"}, {"Collector": "Biddie Cronin", "Gender": "female", "Address": "Newtownanner Demesne, Co. Tipperary"}, {"Informant": "James O' Halloran", "Relation": "grandparent", "Gender": "male", "Address": "Newtownanner Demesne, Co. Tipperary"}, {"Language": "English"}]}, "5008871/4962366/5077334": {"title": "Wake and Funeral Customs - Every Observance from Death Until Burial", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0675, Page 126", "Page 126"], "url": "https://www.duchas.ie/en/cbes/5008871/4962366/5077334", "text": "\n(continued from previous page)\nThe women and girls frequently carried a girl or woman corpse.A hearse supplied for young and unmarried person had white bobbins on the horses' heads. Married and elderly people had black bobbins on the horses' heads.The priest recited the last prayers at the graveyard and he also put the first clay on the coffin.\n\n\n\n58. Wake Games.Forfeits were played at a wake long ago. In order to recover articles forfeited the person had to perform rediculous things.\n", "school_info": "School: Termonfeckin", "metadata": [{"Location:": "Termonfeckin, Co. Louth", "Teacher:": "\nBean Uí Mhurchadha\n"}, {"Language": "English"}]}, "5044788/5038181/5081796": {"title": "Old Wake and Funeral Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0964, Page 029", "Page 029"], "url": "https://www.duchas.ie/en/cbes/5044788/5038181/5081796", "text": "\nOld wake and funeral customs.Like many other things, the old customs concerning wakes and funerals are fading rapidly. These changes have all been brought about within the last twenty or thirty years. Here are some of the customs. When a person died, all the friends and neighbours gathered into the house. Then the preparations for their wake began. A few persons went to town to get what was called \"the funeral charges\". This included , pipes, tobacco, whiskey, and groceries.On the following night, the house would fill in with the dead persons neighbours relatives. They would be entertained heartily, and offered plenty of food and drink. Then a man would go around with a clay pipe full of tobacco. After smoking and chatting around the blazing fire, singing, tricks and games would start. Often the man of the house or who ever in charge would say boys, why are you not enjoying yourselves.Here are some of the games that were played. All the men would sit around on the floor. A strong stick was got. Each man would get hold of this, and pull until some one of them would take it from all the rest. He would get up with the stick in his hand, and give the men on the floor a heavy stroke on the back with it. There was also another game called \"Dividing the bull\", and \"a tug of war\"\n(continues on next page)\n", "school_info": "School: Curratavy", "metadata": [{"Location:": "Corratawy, Co. Cavan", "Teacher:": "\nE. Ó Gallchobhair\n"}, {"Collector": "Roise Ní Samhrain", "Gender": "female"}, {"Language": "English"}]}, "5044788/5038183/5081799": {"title": "The Customs of Wakes and Funerals", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0964, Page 031", "Page 031"], "url": "https://www.duchas.ie/en/cbes/5044788/5038183/5081799", "text": "\nThe customs of our day are different to the customs of our fore fathers. As regards funerals and wakes when a person died he would be wake for two nights. During these two nights a crowd of men and women would gather to the nice people of the house would give them tea, tobacco, generally snuff and whiskey. As whiskey was cheap in those days. Then they would play games and such as might, “mine daughters” putting a cabe on the big coat “wrestling the Connaughtman” and so on.They would also play tricks with cards. Then they would recite rhymes which had to be said so many times without drawing their breath and whoever was the best at this was supposed to live the longest. When all would be gathered in they would say a long rosary for the dead person. When the cock would crow they would all go home. Some of them would go before twelve o’clock and all that would remain on would not go until after the cock would no as it was considered unlucky.I heard of one man who left a wake alone after twelve o’clock and on his way home he met the man that was dead. Then on the day of the burial the men and women\n(continues on next page)\n", "school_info": "School: Curratavy", "metadata": [{"Location:": "Corratawy, Co. Cavan", "Teacher:": "\nE. Ó Gallchobhair\n"}, {"Collector": "Seosainn Ní Giolla Padraigh", "Gender": "female"}, {"Language": "English"}]}, "5044798/5039427/5083525": {"title": "Wake Games", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0967, Page 126", "Page 126"], "url": "https://www.duchas.ie/en/cbes/5044798/5039427/5083525", "text": "\nThe spotter. The Crane.Swing the Big coat.The Nine Pins.Black and White.The nine Daughters.The Slapper.The Mad jack-ass.\n(continues on next page)\n", "school_info": "School: Tullyveela", "metadata": [{"Location:": "Tullyveela, Co. Cavan", "Teacher:": "\nP. Murray\n"}, {"Collector": "Mary Mc Manus", "Gender": "female", "Address": "Cartronnagilta, Co. Cavan"}, {"Language": "English"}]}, "5008881/4963294/5086762": {"title": "Wake Games", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0678, Page 161", "Page 161"], "url": "https://www.duchas.ie/en/cbes/5008881/4963294/5086762", "text": "\n\"Spoil the Market\" \"The crooked crab-tree\" & The little tailor.These three games have been described by Mr. Patrick Moore, a farmer who lives in the townland of ____ near the school. His daughter Brigid who is a pupil here wrote them down.1. \"Spoil the Market\"Any number of players can play this game. Two men are chose as the market men. At the beginning of the game each player gests his price 2d, 4d, 6d, 8d etc. Then the first market man says to the second \"Who sells oats?\" The second man repeats this. The first man says it again and the second man says \"sir\" Then the first man says \"Its all evens and no odds playing spoil the market who sells oats\" The second man says \"Top of the house\" or any of the players prices if he likes. if the player does not answer quickly or right he gets a slap for each word of this rhyme:-I am a man of great honour & fameI earn my bread at this innocent\n(continues on next page)\n", "school_info": "School: Ballymakenny, Drogheda", "metadata": [{"Location:": "Ballymakenny, Co. Louth", "Teacher:": "\nM. Ní Chearbhaill\n"}, {"Language": "English"}]}, "5086706/5041293/5086895": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0972, Page 468", "Page 468"], "url": "https://www.duchas.ie/en/cbes/5086706/5041293/5086895", "text": "\nLucky Maguire lived in Drumavaddy close by a old apple tree which is still to be seen in John Hynchs field growing yet & bearing fruit. Close to it lived four Reilly's all called Terrys so they all had to have nicknames Terry above & Terry belowTerry a smig & Terry BockrowThe all died before Poor Lukey so before he died he arranged all about his remains when he would be dead with a James Moran the undertaker when he would be laid out to fill a clay pipe which was a usual thing at Wakes & light it & stick it in his\n(continues on next page)\n", "school_info": "School: Fairgreen", "metadata": [{"Location:": "Belturbet, Co. Cavan", "Teacher:": "\nS. Mac Gabhann\n"}, {"Language": "English"}]}, "5044858/5044459/5091703": {"title": "Wakes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0982, Page 260", "Page 260"], "url": "https://www.duchas.ie/en/cbes/5044858/5044459/5091703", "text": "\nWakes are still a feature of Irish life.  In towns and cities things have changed, all the same, and in a less degree in the country also.  The old custom of sitting till morning has almost died out.  Very few houses keep open-.  The friends drop off one by one around midnight, and the relatives get a chance to sleep.The visitors always get tea, often a ham, or roast of beef is provided for wake and funeral, as well as the famed snuff, tobacco, and clay pipe.  Drink is too dear now to allow of any of the rowdy goings on of years ago.  I myself saw funerals where the funeral people were staggering into the open grave.  That has ceased.As regards the wake games, not so much chance for that nowadays, and the corpse is often in the home for only one night, and the short sitting helps also.One famous wake game was\"Shuffle the Bróg\".All sat down in a ring.  One stood in centre.  They used an old brog, stick, turf, Ec.  They started or rope with a good knot on the one end.\n(continues on next page)\n", "school_info": "School: Drumcoghill", "metadata": [{"Location:": "Drumcoghill Lower, Co. Cavan", "Teacher:": "\nBean Uí Iomaire\n"}, {"Collector": "Mrs A. Montgomery", "Gender": "female", "Occupation": "teacher", "Address": "Corr, Co. Cavan"}, {"Language": "English"}]}, "5070796/5064741/5097072": {"title": "Games at Wakes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1003, Page 118", "Page 118"], "url": "https://www.duchas.ie/en/cbes/5070796/5064741/5097072", "text": "\nSome years ago is was a common custom to play certain games at wakes. In this district the custom prevails no longer.One of the games called          was played in the following manner. A number of young fellows are gathered in the wake-house and the game starts. A player - we will call him No 1 - stands in the centre of the floor. Behind him No 2 takes up position and with his left hand covers the left eye of No 1, while with his right hand he holds a lighted candle close before No 1's right eye. This player, now practically blinded, holds out his right hand, open, palm upwards. Some of the other players give this a sounding slap with the open hand, and immediately a number of the players close in around No 1, who, the candle being removed is asked to say who struck him. If he guesses correctly the individual named takes the place of No 1. If he fails to find the striker the same procedure is continued and sometimes the amount of punishment received is serious especially when there is some ill feeling towards the recipient.\n(continues on next page)\n", "school_info": "School: Mullagh (B)", "metadata": [{"Location:": "Mullagh, Co. Cavan", "Teacher:": "\nJames Drury\n"}, {"Collector": "J. Drury", "Gender": "male", "Age": "62", "Occupation": "múinteoir"}, {"Language": "English"}]}, "5009142/4990871/5103399": {"title": "Wake Games", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0751, Page 430", "Page 430"], "url": "https://www.duchas.ie/en/cbes/5009142/4990871/5103399", "text": "\nGames were played at wakes for the purpose of passing the hours away, without falling asleep. One game was Tug-o-War, with a short stick, which two strong fellows pulled while they sat on the floor with their feet meeting, until the stronger or heavier lifted the lighted one off the ground. Then another challenged the winner.   Another game called 'Hoora Haara' was played by ten or twelve persons or more, sitting down in a circle with their feet in and their knees up. One person stood in the centre. Beneath the knees of those in the circle they passed a short rope about 18\" long with a knot at one end. Each smart person in the circle drew the rope from beneath his knees and landed a blow on the one in the centre, without being caught. If the rope was caught with you while striking you changed places.      (Goldsmith in the \"Vicar of Wakefield\" called the Play \"Follow the Shoe\")\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire, Baile Mathúna", "metadata": [{"Location:": "Ballymahon, Co. Longford", "Teacher:": "\nSr. M. Clement\n"}, {"Informant": "Patrick Casey", "Gender": "male", "Address": "Ardoghil, Co. Longford"}, {"Language": "English"}]}, "5008920/4966643/5107161": {"title": "Wake Games", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0688, Page 076", "Page 076"], "url": "https://www.duchas.ie/en/cbes/5008920/4966643/5107161", "text": "\nWake GamesMany games were played at wakes in the locality in former times when a corpse was kept for two night at home such as \"All the birds fly\" Here is the button - My man Jack ect. \"All birds fly\" is played as follows. All the players sit in a circle round one player who is standing and has a leather strap. He says all the birds fly lifting his two hands quickly at the same time. Any player failing to fly his hands receives a smart slap. If the player says \"Cows fly\" and any player flays he is likewise punished. It surely kept one very\n(continues on next page)\n", "school_info": "School: Dunboyne", "metadata": [{"Location:": "Dunboyne, Co. Meath", "Teacher:": "\nN.F. Ó Donncha\n"}, {"Informant": "Mrs J. Byrne", "Gender": "female", "Address": "Dunboyne, Co. Meath"}, {"Language": "English"}]}, "5008941/4968753/5110822": {"title": "Funerals and Wakes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0694, Page 433", "Page 433"], "url": "https://www.duchas.ie/en/cbes/5008941/4968753/5110822", "text": "\n(continued from previous page)\nIt was the custom that everyone would smell snuff and smoke clay pipes at the expense of the house at wakes.My father told me that he never heard tell of a caoine.  So it must be a long time since it was practised in Rathkeenan because my father's people are here for the past three generations.They used to play games at wakes such as (1)\"The Cobbler and the tinker(2) The house that Jack built.(3) The priest of the parish lost his considering cap.\n\n\n\nEssie got this from her father Patrick Keogh.  It is a wake game or rhyme.The Crooked crab tree.Heres the crooked crab treeHeres the crooked grass that grewaround the crooked crab treeHere's the crooked horse that ate the grass that grew around the crooked crab tree.Heres the crooked man that rode the\n(continues on next page)\n", "school_info": "School: Coolronan", "metadata": [{"Location:": "Coolronan, Co. Meath", "Teacher:": "\nBean Uí Chonmhidhe\n"}, {"Collector": "Essie Keogh", "Gender": "female"}, {"Informant": "Patrick Keogh", "Relation": "parent", "Gender": "male"}, {"Language": "English"}]}, "5008941/4968755/5110829": {"title": "Funerals and Wakes - Bees in the Hive", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0694, Page 435", "Page 435"], "url": "https://www.duchas.ie/en/cbes/5008941/4968755/5110829", "text": "\nBees in the HiveThere used to be seats in the barn, one here and one there, for the hives. There would be one hive less than the number of people so that one man would be left without a seat. One would stand in the centre and give out:-Ding DingHush DingCuit flickery (like cúir)Cuit flackeryCuit fór.Cuit fór away.At the word \"away\" all would run to the hives. One is left out and the others blackens all his face with soot from the chimney.\n\n\n\nAnother game: All hold round the edges and corners of a hankerchief except the one giving out the game. He saysThis pocket hancerchief goes by rule of contrary.When I say \"Let go\" you hold fast and when I say \"hold fast let go\".\n(continues on next page)\n", "school_info": "School: Coolronan", "metadata": [{"Location:": "Coolronan, Co. Meath", "Teacher:": "\nBean Uí Chonmhidhe\n"}, {"Language": "English"}]}, "5008941/4968755/5110831": {"title": "Funerals and Wakes - Bees in the Hive", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0694, Page 435", "Page 435"], "url": "https://www.duchas.ie/en/cbes/5008941/4968755/5110831", "text": "\nBees in the HiveThere used to be seats in the barn, one here and one there, for the hives. There would be one hive less than the number of people so that one man would be left without a seat. One would stand in the centre and give out:-Ding DingHush DingCuit flickery (like cúir)Cuit flackeryCuit fór.Cuit fór away.At the word \"away\" all would run to the hives. One is left out and the others blackens all his face with soot from the chimney.\n\n\n\nAnother game: All hold round the edges and corners of a hankerchief except the one giving out the game. He saysThis pocket hancerchief goes by rule of contrary.When I say \"Let go\" you hold fast and when I say \"hold fast let go\".\n(continues on next page)\n", "school_info": "School: Coolronan", "metadata": [{"Location:": "Coolronan, Co. Meath", "Teacher:": "\nBean Uí Chonmhidhe\n"}, {"Language": "English"}]}, "5009042/4980150/5116047": {"title": "An Dara Insint ar Scéal faoi Ballinlough", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0725, Page 011", "Page 011"], "url": "https://www.duchas.ie/en/cbes/5009042/4980150/5116047", "text": "\nCromwell came to Ballinlough Castle with many soldiers. They went up to the owner of the Castle  (Mr. Nugent) and asked  for shelter  The owner told them they could have a couple of rooms, Cromwell told him he  had a horse and a cow with him. He went down for them and brought them up to the Castle and stabled  them in a room there. When leaving, Cromwell forgot to bring with him the deeds of the Castle and at Ballinlough Cross Roads he sent one of the soldiers back for them. When the soldier reached the Castle he asked for them. The owner went upstairs for them and brought  back with him a shining sword and a rusty one. He gave the rusty sword to the soldier and kept the shining one.  He slew this soldier and the other soldiers who came up later. Cromwell, hearing how the fight was going, ran away.Another version says that soldier refused to fight for the title-deeds and that when he overtook Cromwell, the latter shot him for cowardice. The tracks of the horses  feet are in the room in the Castle yet. There is a Bishop's skull in the Castle and it cures children 'suffering from \"Chin-cough\" if they drink out of it' .[Fuair Padraig Gavagan an sgeál seo ó n-a mháthair (meadhon-aosta)]\n\n\n\nAll the young people formed a ring. The \"leader\" got the first man to say \"Knife and fork for my Lord's table\" (name of game). Each would repeat  the following rhyme until this was finished. Those failing to do so received several strokes of the leather strap. The rhyme ran: \"Ten gray mares with their manes and tails all shearn and shorn,\n(continues on next page)\n", "school_info": "School: Clonmellon (B.)", "metadata": [{"Location:": "Clonmellon, Co. Westmeath", "Teacher:": "\nP. Ó Droighneáin\n"}, {"Collector": "Padraig Gillick", "Gender": "male", "Age": "11"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "male"}, {"Language": "English"}]}, "5009023/4978298/5116617": {"title": "Games at Wakes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0719, Page 227", "Page 227"], "url": "https://www.duchas.ie/en/cbes/5009023/4978298/5116617", "text": "\nGames at WakesThey would play a lot of games at the Wakes, such as \"The Cobbler and the Tinker\". \"How did the market rate today\". \"Hurry the brog\". \"Making nails\". \"The innocent lamb\". \"The cow with the crumbled horns\". and a lot of othersThe way they used to play \"Hurry the brog\" is they sit down in a ring, they get a rope about two feet long and put a large knot at one end of it. Then one of the boys would stand up in the middle and one would get the rope and sing the rhyme:\"Here is the brog and here is the slipper:\"And I am the boy that will give you your supper\"\"Tinker hill and Tullamore\"\n(continues on next page)\n", "school_info": "School: Balrath (1)", "metadata": [{"Location:": "Balrath, Co. Westmeath", "Teacher:": "\nC. Ní Pharthaláin\n"}, {"Collector": "Michael Clavan", "Gender": "male", "Address": "Carlanstown, Co. Westmeath"}, {"Language": "English"}]}, "5009113/4988035/5122589": {"title": "Peter McGiff's Wake", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0744, Page 033", "Page 033"], "url": "https://www.duchas.ie/en/cbes/5009113/4988035/5122589", "text": "\nA cripple named Peter McGiff lived in this parish. When he died - laid out.  Legs tied to end of bed.  At night - big wake.  Some tuckster cut cord tying legs.  Corpse suddenly jumped up.  Terror and confusion immediately.House cleared\n\n\n\nGroup of men \"ceiledhing\" in neighbour's house.  One of them had to pass graveyard on way home.  Others decided to give him a fright.  Newly - dug grave for person who had just died.  Spades and shovels near it.  One of the men, got into grave and laid himself down in bottom of it.  Others hiding around.  Man comes on whom the wish to wish to frighten.  When passing grave, man below spoke\n(continues on next page)\n", "school_info": "School: Boher", "metadata": [{"Location:": "Bracknahevla, Co. Westmeath", "Teacher:": "\nT. Kavanagh\n"}, {"Collector": "Betty Pidgeon", "Gender": "female", "Address": "Killeenbrack, Co. Westmeath"}, {"Language": "English"}]}, "5009111/4987797/5129995": {"title": "Games at Wakes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0743, Page 223", "Page 223"], "url": "https://www.duchas.ie/en/cbes/5009111/4987797/5129995", "text": "\nSlapA man sits on a chair and another man kneels down and places his head on the hands of the man who is sitting. A number (of) of men are standing around. One of them hits the blindfolded man on the hand. The chair man says who hits you and if he answers correctly, the man that hits him has to kneel down and do the same thing, so it continues on until they are tired of it.HarrowAbout ten men sit around on stools. One man (sits) stands in the middle of the ring. A rope is taken round under the stools. After a while when the man in the ring has his back turned one of the men hits him with the rope. If he finds out who hits him that man will have to get up and go into the ring and the other man sits down. It continues on until they think of another game.\n(continues on next page)\n", "school_info": "School: Ballymore (B.)", "metadata": [{"Location:": "Ballymore, Co. Westmeath", "Teacher:": "\nP.J. Cooney\n"}, {"Collector": "Thomas Grant", "Gender": "male", "Age": "14", "Address": "Shinglis, Co. Westmeath"}, {"Informant": "Thomas Noonan", "Gender": "male", "Age": "33", "Address": "Duneel, Co. Westmeath"}, {"Language": "English"}]}, "5009333/5007759/5132898": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0899, Page 272", "Page 272"], "url": "https://www.duchas.ie/en/cbes/5009333/5007759/5132898", "text": "\nThe people of the house did not use him until he was stiff.They laid him out alnight till they came to stretch him out, which they were not able to do.They had to lie him to the bed with ropes. Some of the purtie boys were at the wake, and they knew about him bein tied down, and they cut the ropes.Immediately the man sprung up an' the people thought he was alive, so they fled for their lives.\n", "school_info": "School: Adamstown", "metadata": [{"Location:": "Adamstown, Co. Wexford", "Teacher:": "\nDonnchadh Cuirtéis\n"}, {"Collector": "Micheal Martin", "Gender": "male", "Address": "Rathkyle, Co. Wexford"}, {"Informant": "John Martin", "Gender": "male", "Age": "55", "Address": "Rathkyle, Co. Wexford"}, {"Language": "English"}]}, "5009281/5004333/5133774": {"title": "Old Stories", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0886, Page 413", "Page 413"], "url": "https://www.duchas.ie/en/cbes/5009281/5004333/5133774", "text": "\nThere was a wake one time in Oulart. A very old man was waking. Three old men were sitting by the bedside and fourteen young men were roasting mushrooms in the kitchen. The old men rushed down to the kitchen and said that the dead man had opened his eyes. The young men rushed up to the bedroom leaving the mushrooms. \"A chance for us now\" said one of the old men. The young men could see nothing wrong with the dead man and (could) came down to the kitchen. When they came down the old men had vanished and the mushrooms were eaten.\n", "school_info": "School: Oulart", "metadata": [{"Location:": "Oulart, Co. Wexford", "Teacher:": "\nSéamus Ó hAilleacháin\n"}, {"Collector": "Mollie Dempsey", "Gender": "female", "Address": "Kyle, Co. Wexford"}, {"Informant": "M.W. Mythen", "Address": "Oulart, Co. Wexford"}, {"Language": "English"}]}, "5009339/5008499/5135140": {"title": "Superstitions in Connection with Wakes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0901, Page 282", "Page 282"], "url": "https://www.duchas.ie/en/cbes/5009339/5008499/5135140", "text": "\n(continued from previous page)\nIn the graveyard each relative throws in a handful of clay before the covering of the grave is begun. In this parish a Month's Mind is generally held over the deceased person - also a twelve months' Memory (Both requiem Mass & Office).\n\n\n\nPat Hennessey (22) Davidstown, told him by his father, Michael Hennessey (5-) who heard it from the late Nicholas Keating, Ballinavarry who died in 1918 aged 100.Wakes were held in barn or outhouse. Whiskey & tobacco given out. Games, such as \"Hide the button\", \"the Priest of the Parish\", the rule of contrariness\" &c were played to pass the night away. Cards were sometimes played, at which the corpse would be counted a player.Relatives walking behind the bier at a funeral were expected to cry. The bed in which the person was waked had to be moved immediately for fear another member of the family would soon be waking. A limber corpse was supposed to presage the same went.No member of the family would answer a knock at the door after nightfall in a house where a person had died, for fear it might be the dead person returning for another member of the family. After three weeks the danger had passed.\n", "school_info": "School: Davidstown", "metadata": [{"Location:": "Davidstown, Co. Wexford", "Teacher:": "\nMarion G. Brennan\n"}, {"Informant": "Pat Hennessey", "Gender": "male", "Age": "22", "Address": "Davidstown, Co. Wexford"}, {"Language": "English"}]}, "5009128/4989475/5136348": {"title": "Wake Games", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0747, Page 620", "Page 620"], "url": "https://www.duchas.ie/en/cbes/5009128/4989475/5136348", "text": "\nLong ago it was the custom to keep the corpse two nights in the house and there used always be some games played to pass the night. This is one of the games and it is called \"Slap\". A number of people stand in a row and a certain is called and blindfolded and put standing by the wall. Then each in turn would give him a slap. As this is done the blindfolded person must be able to tell who it was that slapped him. If he guesses correctly the one who slapped him, that person would have to blindfold instead.\n", "school_info": "School: Drumraney", "metadata": [{"Location:": "Drumraney, Co. Westmeath", "Teacher:": "\nMl Mc Garry, Alice Mc Garry\n"}, {"Collector": "James Slevin", "Gender": "male", "Address": "Baskin Low, Co. Westmeath"}, {"Informant": "John Slevin", "Gender": "male", "Age": "56", "Occupation": "farmer", "Address": "Baskin Low, Co. Westmeath"}, {"Language": "English"}]}, "5009128/4989476/5136350": {"title": "Wake Games", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0747, Page 621", "Page 621"], "url": "https://www.duchas.ie/en/cbes/5009128/4989476/5136350", "text": "\nThis is a game that used to be played at wakes long ago. Any number of people could take part in it. One out of the number would get down on his hands and feet on the floor and hold down his head. The rest would get round him in a ring and begin pounding him on the back and saying, \"Hurly, burly, trump the case the cow bees down the market place. Simon Alloy hunt the buck, how many horns stand up\" Meanwhile those taking part would put up as many fingers as they liked and their fingers would count as horns. The person on the floor must guess how many horns up. If he said five were up and there were eight , the crowd would answer \"Five you said and eight there was.\"The person on the ground would have to stay down until he would guess correctly .\n", "school_info": "School: Drumraney", "metadata": [{"Location:": "Drumraney, Co. Westmeath", "Teacher:": "\nMl Mc Garry, Alice Mc Garry\n"}, {"Collector": "Teresa Shanley", "Gender": "female", "Address": "Fearmore, Co. Westmeath"}, {"Informant": "John Slevin", "Gender": "male", "Age": "56", "Occupation": "farmer", "Address": "Baskin Low, Co. Westmeath"}, {"Language": "English"}]}, "5009128/4989477/5136354": {"title": "Wake Games", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0747, Page 622", "Page 622"], "url": "https://www.duchas.ie/en/cbes/5009128/4989477/5136354", "text": "\nThis is a game that was played at wakes. It is called \"Harrow.\" The way this game was played was a number of men would sit down on the ground and put their legs out from them. Then one man would sit inside the circle of men. This man was called the fool. The men in the circle would have a rope and pass it under their legs. As the rope was passed around, one one would shout \"Harrow. Harrow. where is the harrow\" As these words were said one of the men would pull out the rope and hit the fool on the head. When the man hits the fool on the head, the fool tries to snape the rope. If he gets it he goes into the circle with the men and the man that hits him would have to go into the middle and be the fool.\n", "school_info": "School: Drumraney", "metadata": [{"Location:": "Drumraney, Co. Westmeath", "Teacher:": "\nMl Mc Garry, Alice Mc Garry\n"}, {"Collector": "Patrick Moran", "Gender": "male", "Address": "Toorbeg, Co. Westmeath"}, {"Informant": "Thomas Cunningham", "Gender": "male", "Age": "60", "Occupation": "farmer", "Address": "Drumraney, Co. Westmeath"}, {"Language": "English"}]}, "5044726/5034770/5136681": {"title": "Archaeological - Wake and Funeral Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0917, Page 268", "Page 268"], "url": "https://www.duchas.ie/en/cbes/5044726/5034770/5136681", "text": "\nIn this locality and for miles around, in case of deaths all clocks are stopped and set on again only when the funeral is over.  All mirrors or looking glasses are covered and Kept so until the funeral is over.  The last corpse entering the graveyard should have a bottle of water (in it) with it.  When two funerals are approaching from opposite directions there is a mad race to see which coffin shall be first in\n\n\n\nNo wake games are remembered in this parish, but tobacco and pipes are supplied in addition to a small dist of snuff being placed on the breast of the diseased.The custom of \"Keening\" over the dead does not appear to have ever existed here but if it ever existed it must have died out very soon after the eviction of the old inhabitants by the first of the Wingfields to make way for the New-comers ([?])\n(continues on next page)\n", "school_info": "School: Annacarter", "metadata": [{"Location:": "Mullinaveige, Co. Wicklow", "Teacher:": "\nMary C. Mulligan\n"}, {"Language": "English"}]}, "5044686/5031979/5145797": {"title": "Wake Games", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0909, Page 146", "Page 146"], "url": "https://www.duchas.ie/en/cbes/5044686/5031979/5145797", "text": "\nThe people now would be shocked for to hear the way wakes was carried on in old times. There was all kinds of games and singing. I never heard tell of dancing and young men and young girls thought nothing about going miles to these wakes for the fun of it. They had plays called \"Hurra the bróg\" \"Hiving the bees\". Forfeits, Trials by judge and jury \"Sending sinners to the bishop for forgiveness and others too that I disremember. 1) You know Dan Murphy is called the Bishop always well how he got the nickname was, his grandfather who he is called after used to attend all the wakes round here and he was always the Bishop in one of the games and sinners would be brought before him and all their sins exposed before the whole house and he would pronounce some terrible penance for them to make and the crowd would make the culprit to carry out the penance pronounced upon him by the bishop.\n(continues on next page)\n", "school_info": "School: Cluain Mór (1), Baile an Droichid", "metadata": [{"Location:": "Clonmore, Co. Carlow", "Teacher:": "\nSéamus Ó Laochdha\n"}, {"Informant": "James Byrne", "Gender": "male", "Age": "70", "Occupation": "farmer", "Address": "Gowle, Co. Wicklow"}, {"Language": "English"}]}, "5044695/5032662/5146743": {"title": "Boxty", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0910, Page 250", "Page 250"], "url": "https://www.duchas.ie/en/cbes/5044695/5032662/5146743", "text": "\nIn olden times Boxty was a great treat. It was made by grating potatoes into a bowl and mixing flour with them until there was a stiff dough. Salt was then sprinkled on this and it was fried in fat, and when cooked eaten with butter.\n\n\n\nAt the wakes in olden times snuff, pipes, and tobacco were distributed. At old peoples wakes there was singing, and all kinds of games were played around the hearth.An old cripple named Tommy White once lived alone, who one morning was found dead in his bed.As they could not straighten his knees, they tied them down to the bed with a rope. One of the boys who took charge of the candles, decided to play a trick on the others, cut the cord and caused the corpse to spring up in bed. He then put a pipe in his mouth, and dressed him up at the sight of which one of the nervous boys fainted when he went into the room alone later.\n", "school_info": "School: Myshall (C.)", "metadata": [{"Location:": "Myshall, Co. Carlow", "Teacher:": "\nBean Uí Mhaoláin\n"}, {"Language": "English"}]}, "5044695/5032662/5146744": {"title": "Boxty", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0910, Page 250", "Page 250"], "url": "https://www.duchas.ie/en/cbes/5044695/5032662/5146744", "text": "\nIn olden times Boxty was a great treat. It was made by grating potatoes into a bowl and mixing flour with them until there was a stiff dough. Salt was then sprinkled on this and it was fried in fat, and when cooked eaten with butter.\n\n\n\nAt the wakes in olden times snuff, pipes, and tobacco were distributed. At old peoples wakes there was singing, and all kinds of games were played around the hearth.An old cripple named Tommy White once lived alone, who one morning was found dead in his bed.As they could not straighten his knees, they tied them down to the bed with a rope. One of the boys who took charge of the candles, decided to play a trick on the others, cut the cord and caused the corpse to spring up in bed. He then put a pipe in his mouth, and dressed him up at the sight of which one of the nervous boys fainted when he went into the room alone later.\n", "school_info": "School: Myshall (C.)", "metadata": [{"Location:": "Myshall, Co. Carlow", "Teacher:": "\nBean Uí Mhaoláin\n"}, {"Collector": "Lena Murphy", "Gender": "female", "Address": "Myshall, Co. Carlow"}, {"Language": "English"}]}, "5009265/5002872/5147401": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0882, Page 463", "Page 463"], "url": "https://www.duchas.ie/en/cbes/5009265/5002872/5147401", "text": "\nWakes long ago used to be always held in barns they never used to be in dwellin' houses an' we used to spend the night playing all sorts of games. \"Hurry the brogue was war of the games a slipper or an ould shoe would be thrown from one to the other to see who would catch it. Whoever would miss it would have to pay a forfeit. There was no seem atall put in the corpse, sometimes some of the dead man's friends would come an' sit at the bed, and sometimes they'd join in the fun. New clay-pipes an' tobacco used to be given round as a trate to the people an' snuff too. There was no tay that time\n", "school_info": "School: Carrigbyrne", "metadata": [{"Location:": "Carrickbyrne, Co. Wexford", "Teacher:": "\nMáire Cuirtéis\n"}, {"Collector": "Josie Kehoe", "Gender": "female", "Address": "Carrickbyrne, Co. Wexford"}, {"Informant": "James L. Doyle", "Gender": "male", "Age": "87", "Address": "Carrickbyrne, Co. Wexford"}, {"Language": "English"}]}, "5044681/5031573/5147526": {"title": "Old Customs at Wakes in this District", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0907, Page 489", "Page 489"], "url": "https://www.duchas.ie/en/cbes/5044681/5031573/5147526", "text": "\nAbout 60 years ago there was an old custom in the part of the country among the people who used to attend wakes at night.  Some used to play games as \"Hiving the Bees\"  \"The Flower\"  \"Selling the Oats\"  \"The Badger\"  Riddles and rhymes were also given out.  The following is an example.  Here's to the ship that sailed from FlandersThat carried the blacksmith, hammer, tongs and anvilsThat made the spade both stiff and strongThat dug the grave both wide and longThat buried the huntsman hounds and hornThat hunted the fox from under the thornThat killed the hen that hatched the cockThat crew early in the morningThat wakened the priest all shaved and shornThat married the lad all tattered and tornTo the made that was left forlornThat milked the cow with the crumbly hornThat tossed the dog right over the barnThat killed the cat that worried the ratThat cut the string that tied the sackThat lay in the house that Jack built\n(continues on next page)\n", "school_info": "School: Tinryland, Carlow", "metadata": [{"Location:": "Tinriland, Co. Carlow", "Teacher:": "\nPádraig Ó Seidhin\n"}, {"Language": "English"}]}, "5044687/5032254/5147676": {"title": "A Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0909, Page 422", "Page 422"], "url": "https://www.duchas.ie/en/cbes/5044687/5032254/5147676", "text": "\nOne night a man was coming to Hacketstown. He was coming along Jones road when he saw a lot of little men jumping in and out through the gate. This man was on a bicycle, and when he came very near the gate he could not ride any further, so he got off the bicycle and started to walk, but the little men got in a line across the road and would not let him pass. After some time the man said to them, \"Clear the way and let the people pass\", so the divided and let him pass.\n", "school_info": "School: Hackettstown (St Joseph's)", "metadata": [{"Location:": "Hacketstown, Co. Carlow", "Teacher:": "\nM. Ní Raghallaigh\n"}, {"Collector": "Sarah Willoughby", "Gender": "female"}, {"Informant": "Brigid Willoughby", "Gender": "female", "Age": "41", "Address": "Hacketstown, Co. Carlow"}, {"Language": "English"}]}, "4798762/4796145/5149569": {"title": "A Story Heard at a Wake", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0298, Page 075", "Page 075"], "url": "https://www.duchas.ie/en/cbes/4798762/4796145/5149569", "text": "\nThere was once a boy who went to a wake one night. He wore a hard hat, and after saying his prayers he went up and sat on a stool by the fire. Before the dawn the poor boy fell fast asleep, and when he was snoring some other young lads rubbed soot on his face, and when he woke up later he couldn't understand what the others were laughing at. So he knelt down and said his prayers, and home he went. He went upstairs to bed, and soon was sound asleep. Later in the day his mother went into his bedroom to rouse him when on looking at the sleeping boy she gave a loud scream, which woke her son. He thought his poor mother had gone mad when he saw her crying and \"olagón\"-ing that her own son was gone, and that a black man had come home instead. The boy quickly dressed himself, went down stairs and looking in the glass, he jumped when he saw his sooty face. Then he knew why his mother was frightened, and also the young men who had played the trick on him while he was asleep in the wake-house.\n", "school_info": "School: Tráigh Omna", "metadata": [{"Location:": "Drishanemore, Co. Cork", "Teacher:": "\nMícheál Ó Dálaigh\n"}, {"Informant": "Denis O' Sullivan", "Gender": "male", "Age": "50", "Address": "Bawnlahan, Co. Cork"}, {"Language": "mixed"}]}, "4921645/4887479/5154017": {"title": "Wakes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0313, Page 319", "Page 319"], "url": "https://www.duchas.ie/en/cbes/4921645/4887479/5154017", "text": "\nWakes: The corpse was laid out on the kitchen table and a long seat was placed quite close to it; on this form the women sat. Five or six times during the night they stood up to \"caoin\" the dead person in chorus, when they stopped on woman took it up and continued \"caoining\" for about twenty minutes.The Minihane family of Baurleigh were all great \"caoiners\". One of them was known as \"Molly an Chaointe\" and the following piece was chanted by her when Charles Dineen, Gareendruig, Kilbrittain  was being waked:\"..... Do thiocfadh chúgat capall agus fiche,Agus cúlóg ag gach nduine;Mar tá a gcapall súd gan cruidte,A ndiallaití súd bristeAgus a ngiortaí leo ar sileadh.\"This is only a fragment of a very long \"caoineadh\": I have not been able to get the rest of it.While the women sat on form the men were reclining on the straw-covered floor. Some slept; others played games-\"Hide the halfpenny\". The players sat in a circle with hands, joined one person had a halfpenny between his hands and going from player to player he pretended to drop it between each ones hands so that nobody knows who has it. When finished each player is asked \"Who has the halfpenny.\" If he gives the\n(continues on next page)\n", "school_info": "School: Cill Bhriotáin (C.)", "metadata": [{"Location:": "Kilbrittain, Co. Cork", "Teacher:": "\nCáit de Búrca\n"}, {"Language": "mixed"}]}, "4921645/4887480/5154023": {"title": "Wakes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0313, Page 320", "Page 320"], "url": "https://www.duchas.ie/en/cbes/4921645/4887480/5154023", "text": "\n(continued from previous page)\nwrong answer he has to pay or forfeit and someone else is asked and so on until the person who gets the halfpenny is discovered and then he takes his place in the middle of the circle and the game commences again.\n", "school_info": "School: Cill Bhriotáin (C.)", "metadata": [{"Location:": "Kilbrittain, Co. Cork", "Teacher:": "\nCáit de Búrca\n"}, {"Informant": "Mícheál De Búrc", "Gender": "male", "Address": "Baltinakin, Co. Cork"}, {"Language": "Irish"}]}, "5162177/5161212/5162533": {"title": "Wake-Games - Bees", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0960, Page 223", "Page 223"], "url": "https://www.duchas.ie/en/cbes/5162177/5161212/5162533", "text": "\nIn this game a man who does not know the game is chosen to be the hive. Another man is chosen to be the queen bee. All the rest are bees.The bees then go outside and bring in sticks and other articles. These they leave at the foot of the man who is the hive. When they have enough in the queen bee tells the bees to go and gather honey. The bees all go outside fill their mouths of water come in and spits the water on the hive.\n(continues on next page)\n\n\n\nEvery person is given a part of the plough. One person gets the handles another gets the mould board and so on. The M.C. asks the people who are playing a number of questions e.g. to the person who has the handles \"are the handles painted red. If the person answers \"It is\" \"yes\" or \"No\" the M.C. blackes him with soot.\n(continues on next page)\n", "school_info": "School: An t-Éadan Mór", "metadata": [{"Location:": "Edenmore, Co. Monaghan", "Teacher:": "\nS. Mac Philib\n"}, {"Collector": "Frank Kelly", "Gender": "male", "Address": "Davagh, Co. Monaghan"}, {"Informant": "Peter Skinnader", "Gender": "male", "Age": "74", "Address": "Davagh, Co. Monaghan"}, {"Language": "English"}]}, "5162177/5161212/5162534": {"title": "Wake-Games - Bees", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0960, Page 223", "Page 223"], "url": "https://www.duchas.ie/en/cbes/5162177/5161212/5162534", "text": "\nIn this game a man who does not know the game is chosen to be the hive. Another man is chosen to be the queen bee. All the rest are bees.The bees then go outside and bring in sticks and other articles. These they leave at the foot of the man who is the hive. When they have enough in the queen bee tells the bees to go and gather honey. The bees all go outside fill their mouths of water come in and spits the water on the hive.\n(continues on next page)\n\n\n\nEvery person is given a part of the plough. One person gets the handles another gets the mould board and so on. The M.C. asks the people who are playing a number of questions e.g. to the person who has the handles \"are the handles painted red. If the person answers \"It is\" \"yes\" or \"No\" the M.C. blackes him with soot.\n(continues on next page)\n", "school_info": "School: An t-Éadan Mór", "metadata": [{"Location:": "Edenmore, Co. Monaghan", "Teacher:": "\nS. Mac Philib\n"}, {"Collector": "Mollie Treanor", "Gender": "female", "Address": "Derrilla, Co. Monaghan"}, {"Informant": "Mrs Treanor", "Gender": "female", "Age": "50", "Address": "Derrilla, Co. Monaghan"}, {"Language": "English"}]}, "5162177/5161213/5162535": {"title": "Wake-Games - Putting Round the Plough", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0960, Page 224", "Page 224"], "url": "https://www.duchas.ie/en/cbes/5162177/5161213/5162535", "text": "\n(continued from previous page)\nThe M.C asks everyone a number of questions to make them say \"It is\" \"Yes\" or \"no\" and if the persons say any of these three things he is blackened with soot.\n(continues on next page)\n\n\n\nSome person is called the Priest of the parish\". Others are called \"My man Jack\", \"Cow in the corn\", \"Bull in the hay\" \"Mouse in the meal\" and so on. \"Priest of the Parish\" then gets up and says \"Priest of the parish has lost his hat, some say this and some say that but I say \"My man Jack\" \". Then \"My man Jack\" gets up and says \"me me sir\" and \"Priest of the parish\" says \"Yes you sir\" My man Jack says \"You are a liar sir\" \"Priest of the parish says \"who then sir\" and he answers \"Cow in the corn, Cow in the corn\" If that person has not \"me me sir\" said before the \"Priest of the parish\" has his name said three times he is blackened with soot.\n(continues on next page)\n", "school_info": "School: An t-Éadan Mór", "metadata": [{"Location:": "Edenmore, Co. Monaghan", "Teacher:": "\nS. Mac Philib\n"}, {"Collector": "Bridie Mc Kenna", "Gender": "female", "Address": "Tamlat, Co. Monaghan"}, {"Informant": "Mary Mc Kenna", "Gender": "female", "Age": "70", "Address": "Tamlat, Co. Monaghan"}, {"Language": "English"}]}, "5162159/5160114/5164059": {"title": "Pistreoga", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0939, Page 164", "Page 164"], "url": "https://www.duchas.ie/en/cbes/5162159/5160114/5164059", "text": "\n57.     Pistreoga.   57.   Customs in connection with death:-   When a young person died corps was   \"laid out\" on a table. Such person    was said to be waked \"overboard\".   When an old person died corps was   placed under table. Such person was   said to be \"underboard\"           Tricks at Wakes.   1. Throwing the ball.   Boys procured some straw and made   it into a ball; they sat round room   where wake was being held. One    person was made stand in the middle   of the room. Ball was passed from   one to another under their knees    they saying \"sin é seo é\" while   passing it. Boy who was standing   tried to get the ball while the others   tried to prevent him from getting it.    The person beside whom it was at   last caught by him had to stand up    and try to get it next time.   2. A girl was selected and put sitting   on a \"creepy\" stool. She had the    privilege of calling on any boy whom   she chose to sing for her. He had to    contribute song after song until she   got up off the stool. This she   wouldn't do until he sung badly.\n\n\n\n1. Throwing the ball.Boys procured some straw and madeit into a ball; they sat round roomwhere wake was being held. Oneperson was made stand in the middleof room. Ball was passed fromone to another under their kneesthey saying \"sin é seo é\" whilepassing it. Boy who was standingtried to get the ball while the otherstried to prevent him from getting it.The person beside whom it was atlast caught by him had to stand upand try to get it next time.2. Singing. A girl was selected & put sitting on a \"creepy\" stool. She had theprivilege of calling on any boy whomshe chose to sing for her. He had tocontribute song after song until shegot up off the stool. This shewouldn't do until he sung badly.\n(continues on next page)\n", "school_info": "School: Láithreach", "metadata": [{"Location:": "Laragh, Co. Monaghan", "Teacher:": "\nMrs Duffy\n"}, {"Language": "English"}]}, "5162159/5160114/5164060": {"title": "Pistreoga", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0939, Page 164", "Page 164"], "url": "https://www.duchas.ie/en/cbes/5162159/5160114/5164060", "text": "\n57.     Pistreoga.   57.   Customs in connection with death:-   When a young person died corps was   \"laid out\" on a table. Such person    was said to be waked \"overboard\".   When an old person died corps was   placed under table. Such person was   said to be \"underboard\"           Tricks at Wakes.   1. Throwing the ball.   Boys procured some straw and made   it into a ball; they sat round room   where wake was being held. One    person was made stand in the middle   of the room. Ball was passed from   one to another under their knees    they saying \"sin é seo é\" while   passing it. Boy who was standing   tried to get the ball while the others   tried to prevent him from getting it.    The person beside whom it was at   last caught by him had to stand up    and try to get it next time.   2. A girl was selected and put sitting   on a \"creepy\" stool. She had the    privilege of calling on any boy whom   she chose to sing for her. He had to    contribute song after song until she   got up off the stool. This she   wouldn't do until he sung badly.\n\n\n\n1. Throwing the ball.Boys procured some straw and madeit into a ball; they sat round roomwhere wake was being held. Oneperson was made stand in the middleof room. Ball was passed fromone to another under their kneesthey saying \"sin é seo é\" whilepassing it. Boy who was standingtried to get the ball while the otherstried to prevent him from getting it.The person beside whom it was atlast caught by him had to stand upand try to get it next time.2. Singing. A girl was selected & put sitting on a \"creepy\" stool. She had theprivilege of calling on any boy whomshe chose to sing for her. He had tocontribute song after song until shegot up off the stool. This shewouldn't do until he sung badly.\n(continues on next page)\n", "school_info": "School: Láithreach", "metadata": [{"Location:": "Laragh, Co. Monaghan", "Teacher:": "\nMrs Duffy\n"}, {"Collector": "Brighid Ní Leannáin", "Gender": "female"}, {"Informant": "Michael Lennon", "Relation": "parent", "Gender": "male"}, {"Language": "English"}]}, "5162170/5160575/5164585": {"title": "Cure of the Rickets", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0947, Page 023", "Page 023"], "url": "https://www.duchas.ie/en/cbes/5162170/5160575/5164585", "text": "\n(continued from previous page)\nprayers over the person and then wets the person's clothes with the water. The cure has to be done three times.\n", "school_info": "School: Killyfargy", "metadata": [{"Location:": "Killyfargy, Co. Monaghan", "Teacher:": "\nB. Ó Mórdha\n"}, {"Language": "English"}]}, "5162170/5160577/5164586": {"title": "Wake Games - Priest of Parish", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0947, Page 024", "Page 024"], "url": "https://www.duchas.ie/en/cbes/5162170/5160577/5164586", "text": "\nThe House that Jack built. A circle was made round fire. A person at end of circle takes a piece of stick or buttons or any small object in his hand and passes it to his neighbor saying \"Here's this, take this\". Neighbour says \"What's this\". \"This is house jack built\". In this way supposed house is passes round in circle with same words from one person to another until it reaches slarle again. He again hands it to his neighbour saying again \"What's this\" etc; this time saying \"this is malt that lay in house that jack built\". In this fashion circle is again rounded. Each time round rhyme gets longer. Whole rhyme is 1 The is house that jack built 2 this is malt that lay in house that jack built.\n(continues on next page)\n", "school_info": "School: Killyfargy", "metadata": [{"Location:": "Killyfargy, Co. Monaghan", "Teacher:": "\nB. Ó Mórdha\n"}, {"Language": "English"}]}, "5162169/5160576/5164666": {"title": "My Home District", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0947, Page 023a", "Page 023a"], "url": "https://www.duchas.ie/en/cbes/5162169/5160576/5164666", "text": "\n(continued from previous page)\nplenty of streams.\n\n\n\nMy townland is Corrinshigo, my parish Currin and my Barony Dartry. The number of families in the townland are ten and the number of people   are thirty-two and the most common name is Curran.Some of the houses are thatched some slated and some ironed.The townland got its name from Corr-na-Fuinseóige which means the corner of the the ash tree. There are two old inhabitants in this townland namely Mrs Lancashire Corrinshigo Drum Newbliss Co Monaghan and Mr B. Currans same address. Neither of these two know Irish  nor can they tell Irish stories. The houses are more numerous than they were some years before and there is only the one old ruin; it is a mill.\n(continues on next page)\n", "school_info": "School: Corrinshigo", "metadata": [{"Location:": "Corrinshigo, Co. Monaghan", "Teacher:": "\nKathleen Wilson\n"}, {"Informant": "C. Duffy", "Gender": "unknown", "Address": "Corrinshigo, Co. Monaghan"}, {"Language": "English"}, {"Location": "Corrinshigo"}]}, "5162170/5160698/5165381": {"title": "Games at Wakes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0947, Page 134", "Page 134"], "url": "https://www.duchas.ie/en/cbes/5162170/5160698/5165381", "text": "\nGames at Wakes.Many games used to be played at wakes in this locality but many are completely dead out and forgotten, others nearly so. Shaving a man. A pretence is made to shave a man. Water is held in mouth and is [shilied?] out [?] on another participant in game. Shuffle the brogue. An old brogue (shoe) is got and the players form a ring and sit around on their hunkers. Lots are drown and a person gots into the middle of the ring. The the brogue is passed round the ring, then the player in centre challenges someone whom he thinks to have it and if he challenges wrong person the person who has it slaps him on back with brogue which is sent on its round again. If a person who has the brogue is challenged he has to go into middle of circle and game continues. The Priest of the Parish. Players got round in a ring. One was selected as priest of parish. Names were given to other players, strange names, hard to remember like, \"[Shoddle the turf - slach?]\", \"Rough-tuff-tumbly-{Heathay-Haring-cap?]\", names of travelling folk (Pooky, Blue-Cloak, [Borders?] [?]). One had to be called Jack - priests boy. Priest starts game pretending to have lost his cap accusing Jack of taking it. He says, \"The priest of the parish has lost his [conoiding?] cap, some say this and some say that, but I say my man Jack\". Pointing an accusing finger at Jack. Jack says \"Is it m...\"\n", "school_info": "School: Killyfargy", "metadata": [{"Location:": "Killyfargy, Co. Monaghan", "Teacher:": "\nB. Ó Mórdha\n"}, {"Language": "English"}]}, "5162170/5160722/5165428": {"title": "The Fight at the Funeral", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0947, Page 158", "Page 158"], "url": "https://www.duchas.ie/en/cbes/5162170/5160722/5165428", "text": "\nWhen there was anyone being buried the custom was always to have a row or a big fight and if there was not one of the friends of the dead person would consider this as an act of disrespect to the dead man. Once there lived a young person and his father together. His father died and strange to say when his father was buried all the people went home quietly and the young lad says \"Are you going to disrespect my father like this?\" The young lad had a big stick with him and he hit the first man he saw with it. The other man hit back again. The whole party came back again and half killed one another before they left. Then the young man said \"if you had done this at first it would not have turned out like this but anyway you have to put up with it now.\n", "school_info": "School: Killyfargy", "metadata": [{"Location:": "Killyfargy, Co. Monaghan", "Teacher:": "\nB. Ó Mórdha\n"}, {"Collector": "Michael Moore", "Gender": "male"}, {"Informant": "Thomas Molloy", "Gender": "male", "Age": "circa 74", "Address": "Aghnaskew, Co. Monaghan"}, {"Informant": "James Molloy", "Gender": "male", "Age": "circa 70", "Address": "Aghnaskew, Co. Monaghan"}, {"Language": "English"}]}, "4498641/4385195/5183745": {"title": "The Rat", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0790, Page 140", "Page 140"], "url": "https://www.duchas.ie/en/cbes/4498641/4385195/5183745", "text": "\nThe RatWritten by Winifred Coyle aged 11Castleknock, Co DublinOctober 1937Told to her by her motherMrs CoyleCastleknockCo Dublin\n(continues on next page)\n\n\n\nWakesLong ago the wakes were different to what they are now. The people from around the neighbourhood would come in and dance and sing and play games of every sort. Between times they would say the Rosary and sing hymns\n\n\n\nRiddlesWhat fish has its eyes nearest together.The smallestIf your uncle's sister ist not your aunt what relatioion is she to you?your motherWhy is a train ticket a riddle?Because you have to give it upWhen is a man like a looking-glass?When he reflects\n", "school_info": "School: St Brigid's, Castleknock", "metadata": [{"Location:": "Castleknock, Co. Dublin", "Teacher:": "\nMrs Thornton\n"}, {"Collector": "Winifred Coyle", "Gender": "female", "Address": "Castleknock, Co. Dublin"}, {"Informant": "Mrs Coyle", "Gender": "female", "Address": "Castleknock, Co. Dublin"}, {"Language": "English"}]}, "4921871/4897519/5192349": {"title": "Wake and Funeral Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0385, Page 244", "Page 244"], "url": "https://www.duchas.ie/en/cbes/4921871/4897519/5192349", "text": "\n(continued from previous page)\n58. Wake Games etc. All wake games have died out in this parish but the old people remember singing and playing of cards at a wake. The rule was to sing at wakes and cry when children were born. 59. \"Keening at funerals etc. John Grey, ex-postman, remembers seeing a funeral of old Mr Coppinger of Rossmore.He says, six women, the tallest that could be found were employed to \"Keen\" at the funeral. They walked three at each side of the coffin from Rossmore to Templecurraheen graveyard a distance of about three miles \"keening\" all the way.(John Grey is 72 years of age)\n\n\n\nThe bride arrives last at the church,and the newly married pair leave first, the other cars following\n", "school_info": "School: An Clochar, Carraig Thuathail", "metadata": [{"Location:": "Carrigtohill, Co. Cork", "Teacher:": "\nAn tSr. Celestine\n"}, {"Collector": "An tSr. Celestine", "Gender": "female"}, {"Language": "English"}]}}