{"4428184/4384338/4436224": {"title": "Stories", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0787, Page 107", "Page 107"], "url": "https://www.duchas.ie/en/cbes/4428184/4384338/4436224", "text": "\nStories. About sixty years after the Danes came to Ireland it was discovered that the Danes could make their own wine. It was some of the ships for the Irish that found out about this it is said but none of them could actually find out how or from what it was made. After some years it was discovered that they made it from a kind of heather which they gathered on the mountains but yet how to make it was not known. Year after year went by and the making of this was not found out. Towards the end of their stay in Ireland a Dane and his son came to live in a house about one hundred yards from the left bank of the river Delvin and about a mile and a half from the Black Castle of Naul. The people of the village decided to capture this old Dane and unless he told them how to make the wine they said they would kill him. His son whose name was goblin was at this time away with\n(continues on next page)\n", "school_info": "School: Naul", "metadata": [{"Location:": "Naul, Co. Dublin", "Teacher:": "\nC. Mac Fhíonntaigh\n"}, {"Collector": "Eileen Andrews", "Gender": "female", "Age": "16", "Address": "Rath Little, Co. Dublin"}, {"Informant": "Patrick Andrews", "Relation": "parent", "Gender": "male", "Address": "Rath Little, Co. Dublin"}, {"Language": "English"}]}, "4428129/4380620/4460194": {"title": "Áitainmneacha Bhaile na Cúirte", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0646, Page 173", "Page 173"], "url": "https://www.duchas.ie/en/cbes/4428129/4380620/4460194", "text": "\n(continued from previous page)\ntreabhadh iad. Ó shoin i leith níor briseadh an pháirc sin.Páirc na Muc : Áit a thaghadh muca mara isteachBárr a' Leasa : \"Manure Gap\" a deir daoine eile : Tá an lios seo i bpáirc le Muinntir Dubhsméar i mBaile an Chlampair.\n\n\n\nHow the Danes were banished from the Lios.Years ago a man came to this district with an army to drive out the Danes from the lios. He had a battle with them on the field outside the lios. He killed them all except two – a father and son who had a secret for making porter out of fraoch. He said to the Dane “If you will tell me the secret I will not kill you or your son”. The Dane said to him “Kill my son & I will tell you the secret”. When the man had killed the son, the Dane said to him “You can kill myself now.”\n\n\n\nCarraig na bhFranncach = Rats' RockCarraig éigin ar an dtráigh. Ní bhfuigheadh\n(continues on next page)\n", "school_info": "School: Baile na Cúirte, Dúngarbhán", "metadata": [{"Location:": "Ballynacourty, Co. Waterford", "Teacher:": "\nMuiris Breannóc\n"}, {"Collector": "Muiris Breannóc", "Gender": "male", "Occupation": "teacher"}, {"Language": "English"}]}, "4428331/4396419/4481489": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1048, Page 6", "Page 6"], "url": "https://www.duchas.ie/en/cbes/4428331/4396419/4481489", "text": "\nDuring the Danish occupation of this country it was well known that they brewed a kind of beer from heather but the secret seems to have died out and the following story is told regarding it.When nearly all the Danes were killed a party of Irish surprised a Danish father and son brewing the beer.They offered them their life and liberty if they taught them how to make it. The father said he would do so but that he was afraid his son would tell on him and ask them to kill his son. The Irish did so and the old man then said in defiance there is now only one Dane alive who knows the secret and you can kill me for I will never tell you and he was at once put to death.\n", "school_info": "School: Beitheach (Beagh)", "metadata": [{"Location:": "Beagh, Co. Donegal", "Teacher:": "\nMaitiú Mac Suibhne\n"}, {"Informant": "Mr John Sweeney", "Gender": "male", "Age": "75", "Address": "Ardara, Co. Donegal"}, {"Language": "English"}]}, "4606492/4593753/4606558": {"title": "Ciste Óir", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0001, Page 124", "Page 124"], "url": "https://www.duchas.ie/en/cbes/4606492/4593753/4606558", "text": "\nTá sé ráidhte gur iomda áit in Árainn a bhfuil ór a bhfolach. Chuir fear as Gort na gcapall i bhfolach é fadó, agus níor innis sé é d'aon duine nó go raibh sé ag fágail bháis. Dúbhairt sé le fear muinntreach go raibh sé i bhfolach shuas i gcreig ag an Réidh Bhig faoi mhullán eibhir. D'fhág sé i bhfolach annsin é ar fhaithchíos go ngoidfidhe uaidh é. Chuaidh an fear muinntreach ar a lorg, acht nuair a chuaidh sé go dtí an chreig bhí sé lán le mullánaibh eibhir, agus ní raibh a fhios aige cá raibh sé. Daoine an-saidhbhre a bhí insna lochlannaigh, nuair a bhíodar in Árainn fadó. Dubhradh go raibh a leasughadh féin i gceann gach iomaire acu. Tháinig troid ortha shuas ag an Dún Angusa, agus marbhuigheadh uilig iad acht an t-athair agus an mac. Dubhairt siad leis an mbeirt acu innseacht dóib cé'n chaoi a mbíodh siad ag fágail an leasuighthe agus go bhfágfadh siad beó iad.\n(continues on next page)\n\n\n\n(continued from previous page)\nchionn agus fear le leath-chois ag tabhairt aire do'n chiste.  Tá sgáth ar na daoiníbh a dhul ann san oidhche, mar gheall ar an áit uaigneach a bhfuil sé.\n", "school_info": "School: Fearainn an Choirce", "metadata": [{"Location:": "Farrnacurka or Oatquarter, Co. Galway", "Teacher:": "\nSeán Ó Maoldhomnaigh\n"}, {"Collector": "Séamus Uá Flaithbheartaigh", "Gender": "male", "Address": "Ourtnagapple, Co. Galway"}, {"Informant": "Domhnall Uá Flaithbheartaigh", "Relation": "parent", "Gender": "male", "Address": "Ourtnagapple, Co. Galway"}, {"Language": "Irish"}]}, "4613671/4607043/4623966": {"title": "Poem from Tom Brennan", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0016, Page 149", "Page 149"], "url": "https://www.duchas.ie/en/cbes/4613671/4607043/4623966", "text": "\n(continued from previous page)\nMy shoes will be polished and cleanAnd then all my day's work is overWhen I take a walk round the domain.Chorus arís.\n\n\n\nBeór ar bhárr an Ríogh = heather the same as Bhfreach=meaning heath or heather \"Tá beor ar (top of heather). The Danes had the secret of how this was to be used. A father and son lived together and they had the secret of how to use it. When the people used to  ask them for the method the old fellow said he would give the secret to them if they would kill the son. So they killed the son, and then he asked them to kill himself, and the secret died with him. The father thought if they killed himself first the son would split on him and give away the secret.\n\n\n\nIt is not right to let fire or milk out of a house, especially milk without water and every time throughout the\n(continues on next page)\n", "school_info": "School: Gort na Díogha", "metadata": [{"Location:": "Gortnadeeve West, Co. Galway", "Teacher:": "\nSéamus Ó Dochartaigh, Bean Uí Dhochartaigh\n"}, {"Informant": "Martin Connell", "Gender": "male", "Age": "70", "Address": "Clooncullaun, Co. Galway"}, {"Language": "English"}]}, "4602725/4598584/4627697": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0190, Page 150", "Page 150"], "url": "https://www.duchas.ie/en/cbes/4602725/4598584/4627697", "text": "\nLong ago the last three of the Danes was left in Ireland. They knew the secret how to make the wine of the heather and the people wanted to know it. One day three men went to the father of the two sons and they asked him for the secret. He told them that when his two sons would be killed they would know how to make the wine out of the heather. They killed the two sons and they did not know the secret. Then they went back to the father and asked him for the secret. The father told them that when he would be dead they would know the secret so they killed him. They never knew (the) how to make the wine out of the heather. The Danes used to give the people plenty of wine but they never told them the secret of how to make it.\n", "school_info": "School: Tulchán", "metadata": [{"Location:": "Tullaghan, Co. Leitrim", "Teacher:": "\nSeosamh Mac Guidhir\n"}, {"Informant": "Felix Gallagher", "Gender": "male", "Age": "62", "Address": "Doobally, Co. Leitrim"}, {"Language": "English"}]}, "4622995/4621969/4629080": {"title": "Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0078, Page 172", "Page 172"], "url": "https://www.duchas.ie/en/cbes/4622995/4621969/4629080", "text": "\nWhen the Danes were beaten in this country they mostly all fled. A Dane and his son stayed in the country. They had a great drink made out of the heath of the bog. The Irish Government asked the father to tell them how it was made but he said he could not tell it while his son was living. Then he told them to kill his son and they did. They came back to the father and asked him how it was made. He answered \"do the same to me but I will not disclose the secret\"\n\n\n\nOne night in Iraquin a few years ago there were eight men paying cards. Then after a while another man came in and he asked for a hand of cards. He got them and then the joker fell. One of the men stooped down to pick up the joker and he noticed that the man who had come in last had cows feet. The man that saw him fainted and the next night he was dead. It was said that it was the devil who had entered the house.\n\n\n\nAbout one mile from Menlough there is a hill on the road and it is said who stands on it can see fairy cars running up and down the fields. There\n(continues on next page)\n", "school_info": "School: Naomh Ruadhan, Gallach", "metadata": [{"Location:": "Gallagh, Co. Galway", "Teacher:": "\nD. Ó Neachtain\n"}, {"Language": "English"}]}, "4622995/4621969/4629081": {"title": "Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0078, Page 172", "Page 172"], "url": "https://www.duchas.ie/en/cbes/4622995/4621969/4629081", "text": "\nWhen the Danes were beaten in this country they mostly all fled. A Dane and his son stayed in the country. They had a great drink made out of the heath of the bog. The Irish Government asked the father to tell them how it was made but he said he could not tell it while his son was living. Then he told them to kill his son and they did. They came back to the father and asked him how it was made. He answered \"do the same to me but I will not disclose the secret\"\n\n\n\nOne night in Iraquin a few years ago there were eight men paying cards. Then after a while another man came in and he asked for a hand of cards. He got them and then the joker fell. One of the men stooped down to pick up the joker and he noticed that the man who had come in last had cows feet. The man that saw him fainted and the next night he was dead. It was said that it was the devil who had entered the house.\n\n\n\nAbout one mile from Menlough there is a hill on the road and it is said who stands on it can see fairy cars running up and down the fields. There\n(continues on next page)\n", "school_info": "School: Naomh Ruadhan, Gallach", "metadata": [{"Location:": "Gallagh, Co. Galway", "Teacher:": "\nD. Ó Neachtain\n"}, {"Language": "English"}]}, "4622991/4621537/4629440": {"title": "The Malt House", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0077, Page 268", "Page 268"], "url": "https://www.duchas.ie/en/cbes/4622991/4621537/4629440", "text": "\nThe Malt HouseThe oldest house round here is \"The Malt House about two miles from this school. It is situated in Mullaghmore.In olden times they made malt there. A few years ago men came from Dublin to see it. The old ruins still remain but part of it was taken away for building purposes.At one time the English came over to see it as it was one of the best distilleries in Ireland. These men caught two men, whom they threatened to kill unless they showed them how whiskey was made. One man told them he would if they killed the other man. This they did and then he said \"Kill me now as I never will tell how whiskey is made. If you killed me first,\" he said \"the other man would tell you.\"\n(continues on next page)\n", "school_info": "School: Naomh Seosamh, Baile an Ruadháin", "metadata": [{"Location:": "Ballinrooaun, Co. Galway", "Teacher:": "\nMrs Nora Lally\n"}, {"Collector": "Michael Quirke", "Gender": "male", "Address": "Windfield, Co. Galway"}, {"Informant": "James Quirke", "Relation": "parent", "Gender": "male", "Age": "50", "Occupation": "farmer", "Address": "Windfield, Co. Galway"}, {"Language": "English"}]}, "4742076/4733100/4761381": {"title": "Na Lochlannaigh - Tobar na Lochlannach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0461, Page 186", "Page 186"], "url": "https://www.duchas.ie/en/cbes/4742076/4733100/4761381", "text": "\nNa LochlannaighTobar na Lochlannach: -Tá an tobar sin suidhte ar an dtaobh thiar den pharóisde ar bharr an chnuic, Nuair bhí na Lochlannaigh ag déanamh beorach as an bhfraoich gheibhidís uisge ón dtobar san mar deirtear ná raibh aon uisge eile oireamhnach chun é do dhéanamh san gceanntar seo. Deirtear go raibh rún ag na Lochlannaigh ar cionnus an b[h]eoir do dhéanamh agus deirtear nár deineadh riamh ó shoin í agus dá n-ólthá an t-uisge do bheithfeá seacht mbliana níos óige.[Nótaí:] Tá an tobar so láimh le scoil G[h]ort na binne, baile fearainn: Cnoc Dubh; par. An Bunán.Bóthar na Lochlannach: i gcomhursanacht Chill Orglan\n", "school_info": "School: Tulca", "metadata": [{"Location:": "Tullaha, Co. Kerry", "Teacher:": "\nMícheál Ó Dálaigh\n"}, {"Language": "Irish"}]}, "4723831/4717111/4780751": {"title": "Stories", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0938, Page 106", "Page 106"], "url": "https://www.duchas.ie/en/cbes/4723831/4717111/4780751", "text": "\n(continued from previous page)\npaid \"Give me a horse\". He was soon on a horse too. Off they all went & he did not know where he was but the fairies would tell him. They rode through Belfast & Dublin & returned again late in the night.\n\n\n\nAfter the Battle of Clontarf some of the Danes remained in Ireland and at night one stopped in every house. The Irish arranged to kill everyone of them & the plot was carried out and only two escaped in a boat. They were captured. One of them was able to make a certain drink so the Irish said they would not kill him if he gave them the secret. He said he would if they would kill the other man & then he said \"You can kill me now for I will not tell you\". So the Irish killed him too.\n\n\n\nThere was once a beggar man at Croc An Andy Bridge who was refused bread and he prophesied there would not be the cry of a child\n(continues on next page)\n", "school_info": "School: Lappen", "metadata": [{"Location:": "Lappan, Co. Monaghan", "Teacher:": "\nSeán Ó Ruanadha\n"}, {"Informant": "Owen Sherry", "Gender": "male", "Age": "75", "Address": "Drummuck, Co. Monaghan"}, {"Language": "English"}]}, "4798710/4792422/4927363": {"title": "Angel and Eagle", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0255, Page 125", "Page 125"], "url": "https://www.duchas.ie/en/cbes/4798710/4792422/4927363", "text": "\n(continued from previous page)\nthey were alive that he immediately sent for the, Eagle's father did not like to let them go but Eagle said that Angel's father was a father to him and saved him when he was in the Eagle's nest. They set out for her home and great were the rejoicings on their arrival. They lived and reigned many years as King and Queen of that lovely land.\n\n\n\nHeather Wine:-The Danes when they occupied Ireland used to make drink out of the heather that grows in the bog but no one child ever find out the secret of how they made\n", "school_info": "School: An Carraigín", "metadata": [{"Location:": "Carrigeen, Co. Roscommon", "Teacher:": "\nBean Mhic Oireachtaigh\n"}, {"Language": "English"}]}, "4798690/4790491/4927600": {"title": "The Danes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0243, Page 193", "Page 193"], "url": "https://www.duchas.ie/en/cbes/4798690/4790491/4927600", "text": "\nLong ago when the Danes were in Ireland one of them used to sleep in each house of the Irish.  The Irish got up one night and killed them all but one man and his two sons who begged them to leave him alive but kill his two sons.  He told the Irish people that if they left him he would tell them how to make wine.  The Danes would tell nobody the secret because they used to sell it to the people in other countries and get a good price for it.  Then they killed the two sons.  He then said \"ye can kill myself now.\"  He was afraid his sons would tell the Irish, so he was satisfied to give his life rather than tell the secret.\n", "school_info": "School: Tibohine", "metadata": [{"Location:": "Tibohine, Co. Roscommon", "Teacher:": "\nÚna Ní Thiomáin\n"}, {"Collector": "Maureen Callaghan", "Gender": "female"}, {"Informant": "Mrs Bridget Callaghan", "Relation": "grandparent", "Gender": "female", "Age": "84", "Occupation": "farmer's wife", "Address": "Cloonfad, Co. Roscommon"}, {"Language": "English"}]}, "4723836/4717480/4939179": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0940, Page 109", "Page 109"], "url": "https://www.duchas.ie/en/cbes/4723836/4717480/4939179", "text": "\nIt is traditional that when the Danes were in Ireland they could make very good whiskey out of heather.The people were very anxious to know how they made it. Brian Boru drove the Danes out of this country at the battle of Clontarf. It is said there were three of them left after the battle, “a father and two sons”. The people asked them to tell how they made the whiskey but they were not willing to do so. They executed the two sons before the father’s face and said they would give him a chance. Then they told him they would kill him also if he would not tell them. The father said “you can kill me now because I will never tell”.\n", "school_info": "School: Aghmakerr", "metadata": [{"Location:": "Aghmakerr, Co. Monaghan", "Teacher:": "\nPeadar Ua Dubhthaigh\n"}, {"Collector": "Sheila O' Duffy", "Gender": "female"}, {"Informant": "Frank Duffy", "Gender": "male", "Age": "55", "Occupation": "farmer", "Address": "Cooltrimegish, Co. Monaghan"}, {"Language": "English"}]}, "4921983/4915393/4943512": {"title": "An Old Road", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0494, Page 093", "Page 093"], "url": "https://www.duchas.ie/en/cbes/4921983/4915393/4943512", "text": "\nAt the lower portion of our farm runs the remains of an old road. Tradition says that St. Patrick travelled there, and that Bianconi's coaches were going to Cork, the driver of one of the coaches went into an old man's house and he asked the old man for something to eat. The old man was very poor and he had only a small grain of meal. He said that he could not give it away. The driver gave hi a crock of gold and the man gave him the meal for the gold. He was very fond of the gold and would not buy anything for it. He died of hunger and when the coaches were coming back the men took the gold.\n\n\n\nThere are heaps of burnt stones found in most of the farms and they are always found near spring water, and it is said       that the Danes used to make wine out of the stones, but they told the secret to no one. There is a legend that an old man and his son (who were the last of the Danes). The old man said that his son had the secret so they killed him and the father said that they could kill him  too.Paddy Leahy (minor)(Told by by his Grandmother aged 87)\n", "school_info": "School: Cnoc Uí Choileáin, Mainistir na Féile", "metadata": [{"Location:": "Mountcollins, Co. Limerick", "Teacher:": "\nPádraig Ó Coileáin\n"}, {"Collector": "Paddy Leahy", "Gender": "male"}, {"Informant": "(name not given)", "Relation": "grandparent", "Gender": "female", "Age": "87"}, {"Language": "English"}]}, "4921983/4915393/4943516": {"title": "An Old Road", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0494, Page 093", "Page 093"], "url": "https://www.duchas.ie/en/cbes/4921983/4915393/4943516", "text": "\nAt the lower portion of our farm runs the remains of an old road. Tradition says that St. Patrick travelled there, and that Bianconi's coaches were going to Cork, the driver of one of the coaches went into an old man's house and he asked the old man for something to eat. The old man was very poor and he had only a small grain of meal. He said that he could not give it away. The driver gave hi a crock of gold and the man gave him the meal for the gold. He was very fond of the gold and would not buy anything for it. He died of hunger and when the coaches were coming back the men took the gold.\n\n\n\nThere are heaps of burnt stones found in most of the farms and they are always found near spring water, and it is said       that the Danes used to make wine out of the stones, but they told the secret to no one. There is a legend that an old man and his son (who were the last of the Danes). The old man said that his son had the secret so they killed him and the father said that they could kill him  too.Paddy Leahy (minor)(Told by by his Grandmother aged 87)\n", "school_info": "School: Cnoc Uí Choileáin, Mainistir na Féile", "metadata": [{"Location:": "Mountcollins, Co. Limerick", "Teacher:": "\nPádraig Ó Coileáin\n"}, {"Collector": "Paddy Leeahy", "Gender": "male"}, {"Informant": "(name not given)", "Relation": "grandparent", "Gender": "female", "Age": "87"}, {"Language": "English"}]}, "4921988/4915665/4945276": {"title": "Folklore", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0495, Page 002", "Page 002"], "url": "https://www.duchas.ie/en/cbes/4921988/4915665/4945276", "text": "\nThere are heaps of burnt stones found in most of the farms and they were always found near spring water. It is said that the Danes used make wine out of the stones but they told the secret to no one.There is a legend told of an old man and his son who were the last of the Danes. The old man said that his son had the secret of how to make the wine, the son would not tell them the secret and they kiled him, and the father said they could kill him too.\n", "school_info": "School: Árd na Glaise (M.), Mainistir na Féile", "metadata": [{"Location:": "Ballaghbehy North, Co. Limerick", "Teacher:": "\nSeosamh Ó Ceallaigh\n"}, {"Collector": "Kitty Leahy", "Gender": "female", "Address": "Ballaghbehy, Co. Limerick"}, {"Informant": "Mrs Mary Leahy", "Relation": "grandparent", "Gender": "female", "Age": "91", "Address": "Ballaghbehy, Co. Limerick"}, {"Language": "English"}]}, "4742123/4738048/4950301": {"title": "Na Danair", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0474, Page 210", "Page 210"], "url": "https://www.duchas.ie/en/cbes/4742123/4738048/4950301", "text": "\nTá le feiscint go soiléir fós ar Chnoc Chill Mhic Ciarainn ranna fé leith rianta le clochaibh. Glaodhtar ortha 'Ranna na Beórach' ortha. Deirtear go raibh fás iongantach fán bhfraoch ar an gcnoc san agus pé beag nú mór feidhme do baineadh aisti bhí san uatha do bheóir a dheunamh. Cuirtear i leith na nDanair san agus innstear go raibh rún a dhéanta fé athair agus mac. Nuair a bhí ó dhaoinibh iasachta an rún d'fhághailt dubhairt an t-athair leó an mac do chur chun báis mar gur fearr a bhí a fhios aige féin ná aoinne eile. Nuair deineadh dá réir bhí an breall ortha  ní scéitheadh sé a rún agus básuigheadh é. Is amhlaidh a bhí eagla ar an sean duine go sgéithfeadh an mac muna mbeadh sé féin 'na bheathaidh chun cosg do chur leis. Sin d'fhág bun ós cionn le beóir a dheanamh na daoine annso.\n", "school_info": "School: Cill Mac Ciarainn", "metadata": [{"Location:": "Kilmackerrin East, Co. Kerry", "Teacher:": "\nSeán Ó Cathasaigh\n"}, {"Language": "Irish"}]}, "5055995/4879706/5056073": {"title": "A Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0631, Page 224", "Page 224"], "url": "https://www.duchas.ie/en/cbes/5055995/4879706/5056073", "text": "\nA STORYBrian Boru left Kincora with his army and came down the Shannon. The first place they arrived was to Scattery Island. They then left the Island and went to Kilrush and remained there for a few days.They then left Kilrush and came up through Cooraclare and there Brian Boru left his army. He then rode on his horse with one of his soldiers towards Cahermurphy as the Danes were camped in the fort and Brian Boru could not get in to the fort as the gates were locked.He rode near a\n(continues on next page)\n", "school_info": "School: An Chríoch (Cree), Cuar an Chláir", "metadata": [{"Location:": "Creegh, Co. Clare", "Teacher:": "\nMártan Ó Ceallaigh\n"}, {"Collector": "Teresa Galvin", "Gender": "female"}, {"Informant": "(name not given)", "Relation": "grandparent", "Gender": "female", "Age": "75"}, {"Language": "English"}]}, "5008802/4957594/5056228": {"title": "Legends", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0657, Page 083", "Page 083"], "url": "https://www.duchas.ie/en/cbes/5008802/4957594/5056228", "text": "\nLegends(1) At Sunny Side of Golden River - Three Danes, a father and 2 sons were captured and were being pressed for secret of a lovely wine, known only to the 3. The father told their captors to kill his 2 sons first, and he would then give the secret. This was done, but he then refused, and was himself killed. By his ruse, he knew the secret would die with him.(2) There is a Fairy Tree in Willie Donnelly's - said you will be haunted if you forget to bless yourself.\n\n\n\nBeliefs:-12 (a) Giant believed buried in Eddie Maguire's garden (near Queen Maeve's Gap). Sword dug up some years ago by H. Quinn and others.(b) Long Loch on Mountain, about 200 sq. yds, rises and falls with tide.(c) Larkin's Field, beside Quay, said to be Skating Rink, in olden times.\n", "school_info": "School: Carlingford (B.)", "metadata": [{"Location:": "Carlingford, Co. Louth", "Teacher:": "\nMl. Ó Spealáin\n"}, {"Language": "English"}]}, "5008802/4957594/5056229": {"title": "Legends", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0657, Page 083", "Page 083"], "url": "https://www.duchas.ie/en/cbes/5008802/4957594/5056229", "text": "\nLegends(1) At Sunny Side of Golden River - Three Danes, a father and 2 sons were captured and were being pressed for secret of a lovely wine, known only to the 3. The father told their captors to kill his 2 sons first, and he would then give the secret. This was done, but he then refused, and was himself killed. By his ruse, he knew the secret would die with him.(2) There is a Fairy Tree in Willie Donnelly's - said you will be haunted if you forget to bless yourself.\n\n\n\nBeliefs:-12 (a) Giant believed buried in Eddie Maguire's garden (near Queen Maeve's Gap). Sword dug up some years ago by H. Quinn and others.(b) Long Loch on Mountain, about 200 sq. yds, rises and falls with tide.(c) Larkin's Field, beside Quay, said to be Skating Rink, in olden times.\n", "school_info": "School: Carlingford (B.)", "metadata": [{"Location:": "Carlingford, Co. Louth", "Teacher:": "\nMl. Ó Spealáin\n"}, {"Language": "English"}]}, "4922390/4877064/5078018": {"title": "A Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0623, Page 198", "Page 198"], "url": "https://www.duchas.ie/en/cbes/4922390/4877064/5078018", "text": "\n198              A Story. Three men came from Clontarf called the Danes. When they came to the top of \"Leacht de line- they discovered the heather .Out of the heather they started to make whiskey or some kind of drink and later on they were captured by some of the men from Brian Borús army and when the whiskey was got with them,the men asked how they were making it.The father said to kill the two sons first and then that he himself would tell the secret .So when the two sons were dead he said to  kill himself now ,that he would never tell the secret.So the three of them are buried in \"leacht de line\" and there graves are to be seen there today.\n", "school_info": "School: Scropul, Mullach", "metadata": [{"Location:": "Drummin, Co. Clare", "Teacher:": "\nM. Ó Callanáin\n"}, {"Collector": "Mary Killeen", "Gender": "female", "Address": "Carrownagry South, Co. Clare"}, {"Informant": "Patrick Downes", "Gender": "male", "Age": "45", "Address": "Carrownagry South, Co. Clare"}, {"Language": "English"}]}, "5044858/5044491/5091918": {"title": "Names of Fields on Our Farm", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0982, Page 292", "Page 292"], "url": "https://www.duchas.ie/en/cbes/5044858/5044491/5091918", "text": "\nThe Long Meadow, Narrow Meadow. I lover Hut Field, Railway Meadow. Big Field. The Point, Bull's Field. Horse Field. Avenue Meadow The Rocks, Fort Hill. Square Meadow, Hilly Armolting Meadow, The Lodge Field, The threecorned  Ardress Point. The Front Meadow.\n\n\n\nA man was asked how many servants he kept, \"one,\" said he. \"That's nothing\" said the clown. I always keep two - One coming and the other going.\n\n\n\nIt is said the Danes could make Poteen from heather. The Irish wanted to learn the secret from a Father + Son. (Danes) Said the Father if you kill my son I'll tell you. They did so. Now, said he, you may kill me too. They did so. The father was afraid the son might divulge the secret recipe.People say the Irish first learnt how to grow grain from the Danes too.\n", "school_info": "School: Drumcoghill", "metadata": [{"Location:": "Drumcoghill Lower, Co. Cavan", "Teacher:": "\nBean Uí Iomaire\n"}, {"Collector": "Ruby Armstrong", "Gender": "female"}, {"Language": "English"}]}, "5044858/5044491/5091926": {"title": "Names of Fields on Our Farm", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0982, Page 292", "Page 292"], "url": "https://www.duchas.ie/en/cbes/5044858/5044491/5091926", "text": "\nThe Long Meadow, Narrow Meadow. I lover Hut Field, Railway Meadow. Big Field. The Point, Bull's Field. Horse Field. Avenue Meadow The Rocks, Fort Hill. Square Meadow, Hilly Armolting Meadow, The Lodge Field, The threecorned  Ardress Point. The Front Meadow.\n\n\n\nA man was asked how many servants he kept, \"one,\" said he. \"That's nothing\" said the clown. I always keep two - One coming and the other going.\n\n\n\nIt is said the Danes could make Poteen from heather. The Irish wanted to learn the secret from a Father + Son. (Danes) Said the Father if you kill my son I'll tell you. They did so. Now, said he, you may kill me too. They did so. The father was afraid the son might divulge the secret recipe.People say the Irish first learnt how to grow grain from the Danes too.\n", "school_info": "School: Drumcoghill", "metadata": [{"Location:": "Drumcoghill Lower, Co. Cavan", "Teacher:": "\nBean Uí Iomaire\n"}, {"Collector": "Mrs A. Montgomery", "Gender": "female", "Occupation": "teacher", "Address": "Corr, Co. Cavan"}, {"Language": "English"}]}, "5044858/5044491/5091938": {"title": "Names of Fields on Our Farm", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0982, Page 292", "Page 292"], "url": "https://www.duchas.ie/en/cbes/5044858/5044491/5091938", "text": "\nThe Long Meadow, Narrow Meadow. I lover Hut Field, Railway Meadow. Big Field. The Point, Bull's Field. Horse Field. Avenue Meadow The Rocks, Fort Hill. Square Meadow, Hilly Armolting Meadow, The Lodge Field, The threecorned  Ardress Point. The Front Meadow.\n\n\n\nA man was asked how many servants he kept, \"one,\" said he. \"That's nothing\" said the clown. I always keep two - One coming and the other going.\n\n\n\nIt is said the Danes could make Poteen from heather. The Irish wanted to learn the secret from a Father + Son. (Danes) Said the Father if you kill my son I'll tell you. They did so. Now, said he, you may kill me too. They did so. The father was afraid the son might divulge the secret recipe.People say the Irish first learnt how to grow grain from the Danes too.\n", "school_info": "School: Drumcoghill", "metadata": [{"Location:": "Drumcoghill Lower, Co. Cavan", "Teacher:": "\nBean Uí Iomaire\n"}, {"Collector": "Mrs A. Montgomery", "Gender": "female", "Occupation": "teacher", "Address": "Corr, Co. Cavan"}, {"Language": "English"}]}, "4798767/4796648/5164345": {"title": "Unpublished Irish Stories - Beoir na Lochallaig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0299, Page 450", "Page 450"], "url": "https://www.duchas.ie/en/cbes/4798767/4796648/5164345", "text": "", "school_info": "School: Doire Clathach", "metadata": [{"Location:": "Derryclogh Upper, Co. Cork", "Teacher:": "\nÉamonn Mac Firbisigh\n"}, {"Informant": "Seán Ó Bhriain", "Gender": "male", "Address": "Drimoleague, Co. Cork"}, {"Informant": "Diarmuid Ó Coileáin", "Gender": "male", "Address": "Caheragh, Co. Cork"}, {"Language": "Irish"}]}}