{"4427931/4358469/4457727": {"title": "May Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0117, Page 158", "Page 158"], "url": "https://www.duchas.ie/en/cbes/4427931/4358469/4457727", "text": "\n(continued from previous page)\nsame applies while churning.\n\n\n\nAsh Wednesday is the first day of Lent and there is Ashes put on the people's foreheads. A grain of salt is thrown on each boy and girl during shrove to preserve them for another year.\n\n\n\nThe girls who did not get married during shrove were supposed to have a \"smut\" or cross looking face on them, and that  is why it is \"called \"smut\" Sunday. A fist of salt was thrown on those girls to preserve them for another year  (This was done on Ash Wednesday)\n\n\n\nPeople do not cut their hair or finger nails on this day.\n", "school_info": "School: Páirc Íseal (C.)", "metadata": [{"Location:": "Lowpark, Co. Mayo", "Teacher:": "\nSorcha Ní Dhumhnaigh\n"}, {"Language": "English"}]}, "4428016/4368436/4471710": {"title": "Festival Customs - Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138, Page 108", "Page 108"], "url": "https://www.duchas.ie/en/cbes/4428016/4368436/4471710", "text": "\nPancakes are made in most homes on this night. The ring is put in the cake and the old superstition that whoever gets it will marry first is attached to the finding of the ring\n\n\n\nCrowds attend morning mass and get the holy ashes. They bring home some of it to those who have not been to mass. There is a pious belief that the ashes should not be rubbed off on any account until the day is over. Some farmers in this district like to sow their oats on this day.\n\n\n\nA great number attend Mass and visit the Blessed Sacrament during the day.\n\n\n\nGood Friday is observed something like a holiday. Very little work is done and almost everyone young and old go to the church and perform the Stations of the Cross\n\n\n\nEaster Sunday there is great rejoicing for the feast. The young children and some of the grown ups to rise very early to see the sun dancing.\n\n\n\nThe people believe that it is not lucky to bathe at Whitsuntide as it is a season of accidents.\n\n\n\nAll crops are supposed to be sown before this date. There is a tradition that no one should touch clay this day. The children erect\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire, Leac an Anfa, Cathair na Mart", "metadata": [{"Location:": "Leckanvy, Co. Mayo", "Teacher:": "\nAn tSr. Treasa\n"}, {"Language": "English"}]}, "4428316/4394121/4482698": {"title": "Féilí na Bliana - Féile Bríde", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1042, Page 337", "Page 337"], "url": "https://www.duchas.ie/en/cbes/4428316/4394121/4482698", "text": "\n(continued from previous page)\nNuair a bhéas an chistineach réidhtighthe, suidheann gach duine thart agus caithfidh gach uile duine cros a déanadh. Corr uair ghnidhthear na crosannaí le cochan.Lá thar na bhárach chraitheann bean an toighe uisge coisreaca orthú agus cuirtear in áirde iad ins an teach agus ins an bhoitheach.Bíonn an brat Bríghde aca fosta, giota beag líneadach. Fágtar amuigh an oidhche sin é.\n\n\n\nNíl a'n duine beag na mór nach dtéidheann go teach a 'phobail  an lá sin le marc a fhágháil ar a          n-éadain. Tá deireadh anois le rinnce agus  ceol, le hoidhcheannai  móra agus le spóirt go mbíonn an Cargas amuigh.Cuireann na daoine oibliogóid orthú féin Turas na Croise a siubhal gach lá ar feadh an Chargais. Nil an troscadh comh mór ar na daoine anois agus bí  san i sean am. Is minic annseo ghnidheadh na seanmhna agus na sean duinidhe an Troscad  Tréadhannach agus ba mhinic a chaithfeadh an saghart cosc a chur  orthú ar eagla go ndeanfadh siad dochar daobtha  féín.An Troscadh Tréadhanach  ó Deardaoin go Domhnach. Ar Aoine a' Chéasta ní bhlaiseann na daoine  greim bídh agus ní ólann siad dadai acht uisge\n(continues on next page)\n", "school_info": "School: Cill Chartha", "metadata": [{"Location:": "Kilcar, Co. Donegal", "Teacher:": "\nEighneachan Ó Muireadhaigh\n"}, {"Language": "Irish"}]}, "4427796/4345105/4497905": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0087, Page 94", "Page 94"], "url": "https://www.duchas.ie/en/cbes/4427796/4345105/4497905", "text": "\nAsh Wednesday - Not right to put out ashes on this day.\n\n\n\nSt Patricks Day - Buy new clothes on this dayFirst Sunday in May - If you forget beads or prayer book on this day you will forget something every other Sunday of the year. St John's Day - Bonfire - Get bone of animal. Put standing up straight. Lay turf around and light. Leave there until fire quenches and then go round deiseal saying five Ave Maria.Do not on any account quench the fire Make a torch of bag dipped in oil. Light at fire wave three times round your head and throw into the fire.Twelve days of Christmas - No work to be done on the land during this period\n(continues on next page)\n", "school_info": "School: An Choill Mhór", "metadata": [{"Location:": "Cuilmore, Co. Mayo", "Teacher:": "\nFrainc de Paor\n"}, {"Collector": "Frainc de Paor", "Gender": "male", "Occupation": "múinteoir"}, {"Informant": "Patrick Dever", "Relation": "unknown", "Gender": "male", "Age": "50", "Address": "Cuilmore, Co. Mayo"}, {"Language": "English"}]}, "4493754/4416777/4530951": {"title": "Ash Wednesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1110, Page 274", "Page 274"], "url": "https://www.duchas.ie/en/cbes/4493754/4416777/4530951", "text": "\nIt was Ash Wednesday, and the priest was putting ashes on the people. He had a great number of people to put ashes on, and it took him a good while.A man came in who thought the priest was tired. He said to the priest if you tell me the \"words\" I'll help you. The priest said to him \"you were born an idiot and you'll die an idiot. He said it for fun. The man thought that was the exact words, and he went up and lifted the plate and went round everybody saying those words. When the priest caught him he had nearly all the people done.\n(continues on next page)\n", "school_info": "School: Drumfries", "metadata": [{"Location:": "Drumfree, Co. Donegal", "Teacher:": "\nP. E. Ó Dubhthaigh\n"}, {"Collector": "Ethel Fullerton", "Gender": "female", "Address": "Drumfree, Co. Donegal"}, {"Informant": "Sadie Doherty", "Gender": "female", "Age": "circa 14", "Address": "Ballintlieve, Co. Donegal"}, {"Language": "English"}]}, "4493771/4418739/4534299": {"title": "Runaway Monday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1114, Page 299", "Page 299"], "url": "https://www.duchas.ie/en/cbes/4493771/4418739/4534299", "text": "\n(continued from previous page)\na name for Pancake or Shrove Tuesday as young couples trotted off to the Church to get married before Lent.\n\n\n\nAlthough the Church permits the use of milk on this day it is still a custom for the people to take black tea and diminish the bread they were accustomed to.I was told of an old man of this district who would go out to pray at a Mass Rock with his hands outstretched and placed in the form of a cross. It is also a custom to have all their children to go barefooted on this day and they would not eat any eggs.\n\n\n\nIt is a custom for the children to go barefooted on this day also at the hour of three o'clock the\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire, Carn Domhnaigh", "metadata": [{"Location:": "Ballylosky, Co. Donegal", "Teacher:": "\nAn tSr. M. Beirín Ní Bhaoighill\n"}, {"Language": "English"}]}, "4687719/4687008/4708681": {"title": "Féilte na Bliana - Inid", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0435, Page 385", "Page 385"], "url": "https://www.duchas.ie/en/cbes/4687719/4687008/4708681", "text": "\n(continued from previous page)\niad bheith pósta le na chéile. Nuair ná bhíodh airgead ag daoine cun an spré do thabhairt do cailín is amhlaidh a tabharfhaidís beithidhigh do'n fear chéile. Bíodh cóisire mór aca nuair bhídís ag dul cun pósadh.\n\n\n\nBí Máirt na h-Inide an lá deirneach d'Inid, lá mór spóirt iseadh an lá seo. Bailigheann buacaillí óga na h-áite isteac sa bhaile nó sa chathair an tráthnóna agus gach buachaill agus cailín oireamhnach nár pósadh ar feadh na h-Inide do casaidís téada mór thímpeall ortha agus tiománaidís go dtí Sgeilg iad. Déanfaidís pancóga an oidhche san, sin sean nós agus bíodh an spórt aca á chaitheamh suas féacaint cioca a bheadh oireamhnach i gcóir pósadh nó cioca ná bheadh.\n\n\n\nSan allód bíodh na daoine níos críostamhla na mar atáid anois. Sa tráth san bíodh\n(continues on next page)\n", "school_info": "School: Dubhghlas (C.)", "metadata": [{"Location:": "Douglas, Co. Kerry", "Teacher:": "\nEibhlín, Bean de Róiste\n"}, {"Collector": "Síle Máire Ní Dhuígín", "Gender": "female", "Address": "Killorglin, Co. Kerry"}, {"Informant": "Seán P. Ó Dhuigín", "Gender": "male", "Age": "86", "Address": "Killorglin, Co. Kerry"}, {"Language": "Irish"}]}, "4687719/4687020/4708723": {"title": "Féilte na Bliana - Céadaoin an Luaithrigh", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0435, Page 397", "Page 397"], "url": "https://www.duchas.ie/en/cbes/4687719/4687020/4708723", "text": "\nEolas: Seán P. Ó Duígín.Slínn,Cill Orglan,Cíarraidhe.CEADAOIN  an LUAITHRIDH.Fadó níor chuireadh na daoine bainne ar an dtae. Níor ith na daoine ím ná uibheacha Ceadaoin an Luaithridh. Thugaidís \"trochad dubh\" ar an lá seo. Aonne go raibh  chreideamh maith aige théighead sé cun aifreann. Bhíodh na daoine i bhfad níos críostamhla fadó ná mar atá siad anois. Níor thógaidís a mbrechfast fadó go dtí a dó dhéág a chlog. Seo sean-fochail  \"Ceadaoin an Luaithridh bhainfaí na cluasa do'n té a íosfadh feóil.\"Gobnait Ní Dhuigín,Slínn,Cill-Orglan,Cíarraidhe.\n", "school_info": "School: Dubhghlas (C.)", "metadata": [{"Location:": "Douglas, Co. Kerry", "Teacher:": "\nEibhlín, Bean de Róiste\n"}, {"Collector": "Gobnait Ní Dhuigín", "Gender": "female", "Address": "Killorglin, Co. Kerry"}, {"Informant": "Seán P. Ó Duigín", "Gender": "male", "Age": "86", "Address": "Killorglin, Co. Kerry"}, {"Language": "Irish"}]}, "4742071/4732673/4821950": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0460, Page 329", "Page 329"], "url": "https://www.duchas.ie/en/cbes/4742071/4732673/4821950", "text": "\n(continued from previous page)\nwas the Banshee the woman heard.\n\n\n\nIt was a piseog long ago that if a girl was looking for a husband during Shrove and if she didn't find him she would have a puss on her that day.\n\n\n\nOnce a lunatic was sitting on the wall of the mental Hospital.  The Asylum clock was hanging near him.  A man walking along the road said to the lunatic  \"is that clock right\"  The lunatic answering said  \"Shure 'tis well you know that if it were right it isn't here it would be\"\n\n\n\nA man came home drunk one night and his wife began to scold him.  When she was getting\n(continues on next page)\n", "school_info": "School: Cnoc an Doire (C.)", "metadata": [{"Location:": "Knockaderry, Co. Kerry", "Teacher:": "\nNóra Ní Chorcoráin, Maire Nic Chárthaigh\n"}, {"Informant": "M. Keane", "Gender": "male", "Address": "Killeagh, Co. Kerry"}, {"Language": "English"}]}, "4922029/4920146/4948910": {"title": "Festival Customs - Ash Wednesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0506, Page 079", "Page 079"], "url": "https://www.duchas.ie/en/cbes/4922029/4920146/4948910", "text": "\nAsh Wednesday falls on the day after Shrove Tuesday, it it the first day of Lent which holds for seven weeks, and during that period it is a custom to abstain from certain things especially the people of the Roman Catholic church who spend most of that time fasting and praying.On that day all Protestant schools are closed, but the Roman Catholic schools are open becasue they do not think it right to keep that day as a holiday.On the morning the priest of the Roman Catholic church burns the palm which is left after Palm Sunday and puts the shape of the cross on the foreheads of the people with it.It is customary for people to make new resolutions at the  beginning of Lent even though people make resolutions at the beginning of the New Year, but sometimes  they are broken because of weakness of character and another chance is taken at the beginning of Lent so as to try and strengthen ones character.\n(continues on next page)\n", "school_info": "School: Áth Dara (C.)", "metadata": [{"Location:": "Adare, Co. Limerick", "Teacher:": "\nMáire Boardman\n"}, {"Collector": "David G. Knott", "Gender": "male", "Age": "15", "Address": "Adare, Co. Limerick"}, {"Language": "English"}]}, "4770004/4766023/4956429": {"title": "St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0828, Page 089", "Page 089"], "url": "https://www.duchas.ie/en/cbes/4770004/4766023/4956429", "text": "\n(continued from previous page)\nis a day of great devotion in Ireland. On that day everyone wears a shamrock or a green badge in honour of St. Patrick. The girls wear green ribbons on their hair. Unfortunately the shamrock has to be \"drowned\" on that day, by some. The Father of the family would blacken a Sally rod + mark the Sign of the Cross on his children's shoulders.\n\n\n\nAsh Wednesday is the first day of Lent. Everyone used to go to the Church on that day to get the blessed ashes. There was a great fasting done in this district long ago. The people used to drink the tea black and eat the bread dry.\n\n\n\nChalk Sunday was celebrated on the Sunday before Ash Wednesday. It was called Chalk Sunday because all the Bachelors were chalked. A group of people got together and decided on certain men whom they looked on as bachelors and they arranged to chalk their age on their backs.\n", "school_info": "School: St John of God Convent, Rathdowney", "metadata": [{"Location:": "Rathdowney, Co. Laois", "Teacher:": "\nThe Sisters\n"}, {"Language": "English"}]}, "4770049/4769205/5015032": {"title": "Ash Wednesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0837, Page 145", "Page 145"], "url": "https://www.duchas.ie/en/cbes/4770049/4769205/5015032", "text": "\nNo special meaning here.\n\n\n\nPancakes were generally made for the evening meal, plenty of buttter and eggs being used, as it was the last day of feasting before vigorous fast of Lent.\n\n\n\nNowadays barm-bracks containing rings  are bought from bakery for H - Eve. Children may play games with nuts and apples - ducking fro apple, snap-apple and the three saucers. Wheat is burned on bars of grate like the nuts; but many children now attending school here never saw nuts or wheat burned on bars of the grate. The  PUCA  is said to go about on this night destroying nuts, apples and berries. Children are warned never to touch fruit   on bushes after Nov. Day.No tricks are played as in other parts of midlands. Colcannon   is not made on Hallow Eve.\n\n\n\nUnnoticed\n\n\n\nSchool-girls wore Patrick's Crosses until about 40 years ago.    These were made of a circle of white paper    4\"  or 4 1/2\" in diameter. Narrow gaily coloured silk or satin ribbon was stitched across, star shaped design, ends finished off  with tiny bows. They also  wore great bows of green silk ribbon or hair (?). Men, women and little boys wore  bunches of shamrock. The men went to the nearest town to \"drown their shamrock\" having saved a few shillings specially for this purpose. Many indulged too freely in the cheap whiskey and bad porter, coming home much the worse of the day's wear.\n", "school_info": "School: Loughteague, Stradbally", "metadata": [{"Location:": "Loughteeog, Co. Laois", "Teacher:": "\nBrigid Keane, Brighid Ní Chatháin\n"}, {"Language": "English"}]}, "4922146/4856348/5016382": {"title": "Ash Wednesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0537, Page 183", "Page 183"], "url": "https://www.duchas.ie/en/cbes/4922146/4856348/5016382", "text": "\nAsh Wednesday is the first day in Lent.  There is mass on that morning at nine o'clock. The people don't eat much on that morning.  They only eat a cut of bread and drink a cup of tea.  They go to mass, go up to the altar and get the blessed ashes on their foreheads and the Priest says \"Dust thou art and into dust that shall return\".  All day the people eat very little.  There are no stories or expressions told about Ash Wednesday.\n", "school_info": "School: Cill na Naomh", "metadata": [{"Location:": "Kilnaneave, Co. Tipperary", "Teacher:": "\nMícheál Ó Flannagáin\n"}, {"Collector": "Seán O' h' Eochaidh", "Gender": "male"}, {"Language": "English"}]}, "5009219/4999080/5019805": {"title": "Festival Customs - Ash Wednesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0870, Page 349", "Page 349"], "url": "https://www.duchas.ie/en/cbes/5009219/4999080/5019805", "text": "\nAsh WednesdayAsh Wednesday is the beginning of the penitential season of Lent, in preparation for the great feast of Easter, which is regarded as one of the greatest fes feast of the year by the church.  On ash Wednesday the people go to the Church, and the blessed ashes is placed on the foreheads of the people by the Priest.The ashes are given to the people to remind them that they are but dust and ashes.  The day before is called Shrove Tuesday and the people make pan-cakes on that day.\n", "school_info": "School: Ballycullane", "metadata": [{"Location:": "Ballycullane, Co. Wexford", "Teacher:": "\nSeán Ó Dubhghaill\n"}, {"Collector": "Brigid Whelan", "Gender": "female"}, {"Language": "English"}]}, "5008837/4959868/5076771": {"title": "Lore Connected with Lent and Ash Wednesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0665, Page 203", "Page 203"], "url": "https://www.duchas.ie/en/cbes/5008837/4959868/5076771", "text": "\nAsh wednesday, spy wednesday and good friday were the three black fasts of the year.  The old people would not look at milk, butter or eggs on these days.  They would not even put milk on their tes, and they would sit with pains in their heads the whole day.  Shrove Tuesday was called also Runaway Tuesday and Pancake Night.  This was the last day for marriages and boys and girls used to runaway and get married without their parents knowledge.The old people always made pancakes and had them for tea on Shrove Tuesday, this is still the custom, they would also stay up this night and eat a terrible feed since they would have to fast for the next seven weeks.During lent some of the good old people would not touch food till mid-day.  Another great custom on each of the three black fasts was the following.  A pot of thin oaten porridge was boiled, and it was thickened with spices and nettles chopped up fine.  This was served with potatoes, and the origin of it was to set as a medicine, and to prevent pimples and other diseases from coming on the body during the year, nettles are good for cleaning out the blook.  This\n(continues on next page)\n", "school_info": "School: Louth (C.)", "metadata": [{"Location:": "Louth, Co. Louth", "Teacher:": "\nM. Ní Chasaide\n"}, {"Collector": "Eveline Byrne", "Gender": "female", "Address": "Chanonrock, Co. Louth"}, {"Language": "English"}]}, "5008886/4963853/5077951": {"title": "Ash Wednesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0680, Page 072", "Page 072"], "url": "https://www.duchas.ie/en/cbes/5008886/4963853/5077951", "text": "\nAsh Wednesday is the first day of Lent. Before the mass the priest blesses ashes and with them signs the people with a cross on the forehead saying remember man that thou art dust and into dust thou shalt return. Long ago the people used to drink their tea black and their bread dry on that day doing penances for their sins.\n", "school_info": "School: Naomh Pádhraic (C.), Droichead Átha", "metadata": [{"Location:": "Drogheda, Co. Louth", "Teacher:": "\nM. Bhreathnach, M. Ní Dhubhainn\n"}, {"Informant": "Mrs Leonard", "Gender": "female", "Address": "Greenbatter, Co. Louth"}, {"Language": "English"}]}, "5008892/4964428/5082147": {"title": "Festival Customs - Ash Wednesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0682, Page 084", "Page 084"], "url": "https://www.duchas.ie/en/cbes/5008892/4964428/5082147", "text": "\nIt was an old custom for everyone who possibly could to go to the Chapel  for Blessed Ashes on Ash Wednesday. They believed that their houses would not be burned if they got the Ashes. They used to bring water to have it blessed, and then they threw it on the land to prevent diseases.Patrick Lennon (Sgoláire)SheephouseDrogheda\n\n\n\nEaster SaturdayPeople used to bring butter, eggs, and salted cheese to have them blessed on Easter Saturday morning.Patrick Lennon (Scolaire)Got from: Mrs Margt. Kelly (76)Sheephouse,Drogheda\n\n\n\nEaster SundayEggs are eaten for breakfast and tea on Easter Sunday. (For several days before Easter children (and sometimes adults) go from house to house asking for their \"cludog” (eggs))\n", "school_info": "School: Donore", "metadata": [{"Location:": "Donore, Co. Meath", "Teacher:": "\nMaighréad Nic Eóin\n"}, {"Collector": "Patrick Lennon", "Gender": "male"}, {"Informant": "Mrs Margaret Kelly", "Gender": "female", "Age": "76", "Address": "Sheephouse, Co. Meath"}, {"Language": "English"}]}, "4922383/4876306/5083093": {"title": "Ash Wednesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0621, Page 415", "Page 415"], "url": "https://www.duchas.ie/en/cbes/4922383/4876306/5083093", "text": "\nIt is customary to go to mass on Ash Wednesday morning. During the mass the congregation goes up to the altar rails and the priest puts the Holy Ashes in their foreheads. Those who cannot attend mass have the ashes brought home to them by a member of the family.\n\n\n\nThis day is a day of prayer in every parish and the people visit the churches many times during the day to say the Stations of the Cross. Some make it customary to have them  said three times before 12 o'c. Before leaving the church, people go inside the rails to kiss the crucifix which is placed there for that purpose.\n", "school_info": "School: Lahinch", "metadata": [{"Location:": "Lehinch, Co. Clare", "Teacher:": "\nDónall Ó Ríordáin\n"}, {"Informant": "John O' Dwyer", "Gender": "male", "Age": "72", "Address": "Calluragh South, Co. Clare"}, {"Language": "English"}]}, "5044787/5038085/5084087": {"title": "Festival Customs - Ash Wednesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0963, Page 482", "Page 482"], "url": "https://www.duchas.ie/en/cbes/5044787/5038085/5084087", "text": "\nAsh Wednesday does not fall on the same date every year. Sometimes it is earlier than others. Many customs are carried on, on this day but long ago there was more. A custom is to go to the chapel and get blessed ashes put on your forehead.Another custom in this district is to take no milk that day, but now that custom is nearly wiped out. Long ago the people made a  kind of colouring for tea. It was made of oaten meal and water. The oaten meal was put into warm water and dissolved and then it was strained.Long ago on this day, people used to eat no white bread but only one meal which consisted of potatoes and herrings.A very old custom is not to get your hair cut on Ash Wednesday until the last Thursday in Lent which is called '' Crapen Thursday '' a custom now is to eat no eggs on this day because part of them is coloured white.It is on this day that people make promises of what penance they shall do during lent.Brigid McGovernDerryvahanDernacrieveKnowledge from, Edward McGovern\n", "school_info": "School: Tomena", "metadata": [{"Location:": "Gortullaghan, Co. Cavan", "Teacher:": "\nT. Mac Uidhir\n"}, {"Collector": "Brigid Mc Govern", "Gender": "female", "Address": "Derryvahan, Co. Cavan"}, {"Informant": "Edward Mc Govern", "Gender": "unknown"}, {"Language": "English"}]}, "5044793/5038720/5084428": {"title": "Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0965, Page 165", "Page 165"], "url": "https://www.duchas.ie/en/cbes/5044793/5038720/5084428", "text": "\nShrove Tuesday was the last day before Lent for people to get married long ago. People would wait for Shrove to get married or if not they would have to wait until after Lent. Shrove Tuesday the people long ago would go to chapel and go round the stations That night the used to have a big feast. They would have every kind of food ready to eat. Especially anything they were going to keep lent on, they would eat their fill of it that night as Lent was coming in next day.\n\n\n\nLong ago the people used to fast on the Ash Wednesday until one or two o'clock, and then if they wanted anything to eat they would make oat meal bread, but this must be wet with water, for if milk was used that time it was the same as meat. All the tea that was used had to be taken without any milk. The old people nowadays\n(continues on next page)\n", "school_info": "School: Tullycasson", "metadata": [{"Location:": "Ardvagh, Co. Cavan", "Teacher:": "\nname not given\n"}, {"Collector": "Rose Ann Mc Govern", "Gender": "female", "Address": "Tullynacross, Co. Cavan"}, {"Informant": "James Mc Govern", "Gender": "male", "Address": "Tullynacross, Co. Cavan"}, {"Language": "English"}]}, "5044793/5038722/5084443": {"title": "Smut Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0965, Page 167", "Page 167"], "url": "https://www.duchas.ie/en/cbes/5044793/5038722/5084443", "text": "\nLong ago the first Sunday of Lent was called Smutt-Sunday.  This is because any person who would not get married before Lent would wear a smutt the first Sunday of Lent.  The grown up boys generally recited verses such as-: \"When Shrove comes again, I will do my level best, to get a nice little girl in a low neck dress\".\n\n\n\nIf any person got married Shrove Tuesday, that night they had a big feast and they invited all their friends to the house.  The woman of the house generally began to make pancakes, and  they are the pancakes that would please you, if you could be pleased.\n\n\n\nThe old people had great belief in drinking black tea on Ash Wednesday.  They would not eat any food of any kind that day.  They also kept Lent on some thing that they were in the habit of taking.\n(continues on next page)\n", "school_info": "School: Tullycasson", "metadata": [{"Location:": "Ardvagh, Co. Cavan", "Teacher:": "\nname not given\n"}, {"Collector": "Mary M. Mc Grath", "Gender": "female", "Address": "Tullynacross, Co. Cavan"}, {"Informant": "Edward Fitzpatrick", "Gender": "male", "Address": "Moneensauran, Co. Cavan"}, {"Language": "English"}]}, "5070803/5065637/5097275": {"title": "Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1005, Page 197", "Page 197"], "url": "https://www.duchas.ie/en/cbes/5070803/5065637/5097275", "text": "\nShrove Tuesday is the day before Lent, and is usually called \"Pancake Day\" because it is a very old custom to make pancakes for that day - hence the name \"Pancake Day\". Hot-cross buns are generally made for tea also. Concerts and Danes are finished for the season on this day.\n\n\n\nAsh Wednesday is the first day of Lent and is a church holiday for some of our schools, and many people attend worship on that day . It is also a Fast Day and most people abstain from meat and milk. It is a day, however, on which people work.\n\n\n\nGood Friday is a National and Church Holiday, and also a Fast Day. People of every denomination usually attend their place of worship on that day. It is considered the saddest day in the year, and all amusements are abandoned.\n\n\n\nOn Easter Saturday preparations are being made for the Festival the following day. In olden days it was customary for the poorer people to collect eggs in this day, and on visiting the houses they asked for a \"Cludog\" - meaning eggs - which they were rarely refused.\n", "school_info": "School: Lisnagirl (1)", "metadata": [{"Location:": "Lismagiril, Co. Cavan", "Teacher:": "\nHarriett Kinkade\n"}, {"Collector": "H. Kinkade", "Gender": "female", "Occupation": "teacher"}, {"Language": "English"}]}, "5070833/5068691/5099468": {"title": "Ash Wednesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1014, Page 401", "Page 401"], "url": "https://www.duchas.ie/en/cbes/5070833/5068691/5099468", "text": "\nAsh Wednesday was on the 2nd of March this year. We sometimes tie paper on our teachers's back on that day. Some people get bags of ashes and pin them on the tails of men's coats.People used to tie peoples feet together. Once there was a man who had a bag tied to his coat and he was going about the whole day without knowing it.Maud Ferguson14 yearsLatseyCanningstownBailieboro\n", "school_info": "School: Latsey", "metadata": [{"Location:": "Latsey, Co. Cavan", "Teacher:": "\nJean Paul\n"}, {"Collector": "Maud Ferguson", "Gender": "female", "Age": "14", "Address": "Latsey, Co. Cavan"}, {"Language": "English"}]}, "5008929/4967443/5108430": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0691, Page 147", "Page 147"], "url": "https://www.duchas.ie/en/cbes/5008929/4967443/5108430", "text": "\n(continued from previous page)\nsaid he \"you can drown your shamrock\".\n\n\n\nThe people of this district go to Mass on Ash Wednesday. When the priest comes on to the altar all the people kneel down. Then the priest blesses the ashes. The people then kneel at the altar rails while the priest makes the sign of the cross on each person's head with the ashes.\n\n\n\nThe \"Wren Boys\" go round on St. Stephen's Day. They are dressed in\n(continues on next page)\n", "school_info": "School: Kilmessan (B.)", "metadata": [{"Location:": "Kilmessan, Co. Meath", "Teacher:": "\nBrian S. Pléimeann\n"}, {"Collector": "William Swan", "Gender": "male", "Address": "Ringlestown, Co. Meath"}, {"Language": "English"}]}, "5008955/4970588/5111096": {"title": "Ash Wednesday 1921", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0698, Page 445", "Page 445"], "url": "https://www.duchas.ie/en/cbes/5008955/4970588/5111096", "text": "\nAsh Wednesday: 1921 - February 9th.,Arrival of Military & R. I. C.Lorries arrive to search for arms etc.First house searched - General shop occupants - elderly woman - invalid daughers, son (Protestant family)Members of R. I. C. not taking part but acting as guides in district. /Second House: searched: Two members Black and Tans broke window pane in Teacher's residence while Teacher was in school. \"Searched\" quickly. No notice given to Teacher who on arrival after three o'clock missed pulloverses - shoes furs evening apparel couple of hens eggs etc.doctor wired to Dist Ins Navan - Claiming return of property - on following day notifid Commanding officer Trim\n(continues on next page)\n", "school_info": "School: Robinstown", "metadata": [{"Location:": "Robinstown, Co. Meath", "Teacher:": "\nTeresa Coyne\n"}, {"Language": "English"}]}, "5008974/4972515/5111634": {"title": "Feast Days - Ash Wednesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0704, Page 264", "Page 264"], "url": "https://www.duchas.ie/en/cbes/5008974/4972515/5111634", "text": "\nOn ash Wednesday the people go to the chapel and hear Mass and then ashes is put on their forehead to remind them that they will return to mother earth. They usually go to Mass and Communion on that morning.\n\n\n\nOn Holy Thursday a procession in held in the chapel. Boys and girls are dressed up very nicely and march in pairs round the church with a man carrying a cross at their heads. Then during the day the altar is lit up with candles and decorated with flowers and during the day mass servers are minding fearing anything would go on fire.\n", "school_info": "School: Kilskeer (B.)", "metadata": [{"Location:": "Kilskeer, Co. Meath", "Teacher:": "\nMáirtín Ó Loingsigh, R. Ó Fithcheallaigh\n"}, {"Language": "English"}]}, "5009008/4976621/5120891": {"title": "Ash Wednesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0714, Page 468", "Page 468"], "url": "https://www.duchas.ie/en/cbes/5009008/4976621/5120891", "text": "\nThe custom of attending at Mass on Ash Wednesday to receive blessed ashes from the priest is observed by almost everyone. For those who cannot attend Mass ashes are taken home.People say you shouldn't throw out ashes on Ash Wednesday.Sometimes children tie or pin paper bags of ashes on people's backs on the eve of Ash Wednesday.\n", "school_info": "School: Grangegeeth", "metadata": [{"Location:": "Grangegeeth, Co. Meath", "Teacher:": "\nSeósaimhín, Bean Uí Dhubhghaill\n"}, {"Language": "English"}]}, "5009126/4989167/5121421": {"title": "Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0747, Page 244", "Page 244"], "url": "https://www.duchas.ie/en/cbes/5009126/4989167/5121421", "text": "\nEaster Sunday is the end of Lent. People eat a lot of eggs on that day. Sometimes children buy Easter eggs. People get up very early on that morning to see the sun dancing as it is supposed to dance with joy.\n\n\n\nShrove Tuesday is the last day before Lent and we always have a great feast on that night. The mother makes a great big dish of pancakes and she puts a ring in the batter. Whoever gets the ring will be married first.\n\n\n\nChildren put a bit of a rag or a bit of paper behind on the coat of someone that is not looking so that everyone that sees that person would laugh at him. These are called ash bags.\n", "school_info": "School: Ballinacliffy", "metadata": [{"Location:": "Ballynacliffy, Co. Westmeath", "Teacher:": "\nA. Ní Dhubhthaigh\n"}, {"Informant": "John Reid", "Gender": "male", "Age": "13", "Address": "Muckanagh, Co. Westmeath"}, {"Language": "English"}]}, "5009108/4987356/5123465": {"title": "The Twelve Days of Christmas", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0742, Page 303", "Page 303"], "url": "https://www.duchas.ie/en/cbes/5009108/4987356/5123465", "text": "\n(continued from previous page)\nwill have a fruitful lucky year in Ireland. If it is an easterly wind the English will have all the prosperity. On twelfth day people take down all their Xmas decorations. They say water is changed into wine at midnight on Little Xmas night.\n\n\n\nShrove Tuesday is the day before Ash Wednesday. People make a lot of pancakes on that day. If there are any marriagable boys or girls out on that night they put a rope about them and drag them to be married. It is the last day that people have to get married on until Lent is over.\n\n\n\nOn Ash Wednesday we cannot use milk or butter at our meals. We have to eat brown bread and black tea at the breakfast and tea. We eat potatoes and fish at the dinner. In school we hang ash bags on each others backs.\n(continues on next page)\n", "school_info": "School: Loughanvally", "metadata": [{"Location:": "Loughanavally, Co. Westmeath", "Teacher:": "\nMrs. O'Connor\n"}, {"Language": "English"}]}, "5044758/5036605/5137912": {"title": "Unofficial Place Names", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0925, Page 116", "Page 116"], "url": "https://www.duchas.ie/en/cbes/5044758/5036605/5137912", "text": "\nPiper's Corner. Over half a century ago there was an old house here in which lived an old man called Peter the Piper. Miss Page.The Red Road. A road leading from the Main Avoca - Rathdrum road up to behind the Bell Rock. 2.13. Called this because of its colour from ochre in earth.\n\n\n\nColcannon is used for dinner on Ash Wednesday amongst some of the famlies but is not as frequently used as formerly\n\n\n\nMost of the older generation here think it unlucky and not right to kill \"piners\" or cattle who are sick and incurable.\n\n\n\nWhite calves and cattle do not fetch as high a price as those of any other colour - one reason given being that they look dirty or show up dirty too clearly.\n", "school_info": "School: Castlemacadam", "metadata": [{"Location:": "Castlemacadam, Co. Wicklow", "Teacher:": "\nWm. Ffell\n"}, {"Collector": "Miss Page", "Gender": "female"}, {"Language": "English"}]}, "5044700/5032941/5146146": {"title": "Halloween", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0911, Page 263", "Page 263"], "url": "https://www.duchas.ie/en/cbes/5044700/5032941/5146146", "text": "\n(continued from previous page)\n[-]\n\n\n\nIn olden times the people used kneel down and pray on Ash Wednesday on every cross road and when they would get the blessed ashes from the priest.When they would be coming home about four of them would kneel on every cross roads and say the rosary and they would make the sign of the cross on their foreheads. When they got home they got the breakfast ready. Before they began to eat they made the sign of the cross on their forehead with the blessed\n(continues on next page)\n", "school_info": "School: Kildavin, Ferns", "metadata": [{"Location:": "Kildavin, Co. Carlow", "Teacher:": "\nTadhg de Brí\n"}, {"Collector": "Luke Hayden", "Gender": "male"}, {"Informant": "Mr Hayden", "Gender": "male", "Age": "73", "Occupation": "farmer", "Address": "Crowsgrove, Co. Carlow"}, {"Language": "English"}]}, "5008944/4969038/5167508": {"title": "Old Festival Customs - St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0695, Page 247", "Page 247"], "url": "https://www.duchas.ie/en/cbes/5008944/4969038/5167508", "text": "\nThe 17th March is St. Patrick's Day. The people wear shamrock on that day. There is also Irish music, and Irish concerts that day.\n\n\n\nOn Shrove Tuesday all the people make some pan-cakes. There is a ring put in them and children have great fun trying to get the ring.\n\n\n\nOn St Brigid's  Day the children dress up the dash of a churn, and go from house to house with it. They dance with the dash in their hands. This is called the Brideóg. This custom is not carried out in my district at present.\n\n\n\nOn Ash Wednesday the people go to the Church to get Blessed ashes on their\n(continues on next page)\n", "school_info": "School: Cloncarneel", "metadata": [{"Location:": "Cloncarneel, Co. Meath", "Teacher:": "\nMáire, Bean Uí Bhreacáin\n"}, {"Language": "English"}]}, "5008945/4969144/5171102": {"title": "Customs - Ash Wednesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0695, Page 358", "Page 358"], "url": "https://www.duchas.ie/en/cbes/5008945/4969144/5171102", "text": "\nAsh WednesdayAsh- bags_ little bags filled with the ashes were pinned to the coat tails of old bachelors on Ash-Wednesday\n\n\n\nChildren went around from house to house gathering their \"cloodhog\" on Easter Saturday.\n\n\n\nValentines used to be sent on St Valentine's Day up to about forty years ago.\n\n\n\nMy mother told me she remembered one funeral at which she heard keening. THe funeral was going to Memker (?) Church, and as she was very young at the time, she could give no particulars but she thought the funeral had come a long distance.\n", "school_info": "School: Moyaugher", "metadata": [{"Location:": "Moyagher, Co. Meath", "Teacher:": "\nMáire, Bean Uí Choileáin\n"}, {"Collector": "Mary Collins", "Gender": "female", "Occupation": "múinteoir"}, {"Language": "English"}]}, "5177598/5172093/5185333": {"title": "Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0585, Page 060", "Page 060"], "url": "https://www.duchas.ie/en/cbes/5177598/5172093/5185333", "text": "\n(continued from previous page)\nand as marriages are not permitted during Lent it is a day of surprises and expectations  a great number of marriages are celebrated on that day and the strains of music can be heard from many cabins where the young married couple and their friends are celebrating the occasion.Country people look upon it as a day of surprises. Bashful men who have been \" paying respects \" to some young lady are inclined to summon all their courage on Pancake night and ask her for her hand in marriage. The astute girl is also inclined to give him encouragement, with profitable results. This leads to many marriages which the local people have not expected and consequently give much food for \"gossip\". What are locally known as \" runaways \" are quite common on Shrove Tuesday. When the consent of the parents is witheld the boy and girl often elope and this gives rise to the term \"runaway\".Marriagable  ladies whose prospects of procuring a husband are poor are much inclined to be in a state of frenzy on Shrove Tuesday.As a gesture of defiance to the fates which deprive her of a husband she smashes pots and delph and is often a danger to the general public.\n\n\n\nAsh Wednesday  is the first day of Lent. Long\n(continues on next page)\n", "school_info": "School: Clonlara", "metadata": [{"Location:": "Cloonlara, Co. Clare", "Teacher:": "\nDll. Ó Heoghanáin\n"}, {"Collector": "Josie Moloney", "Gender": "female", "Address": "Cloonlara, Co. Clare"}, {"Informant": "Tim Mc Inerney", "Gender": "male", "Age": "54", "Occupation": "labourer", "Address": "Mountcatherine, Co. Clare"}, {"Language": "English"}]}, "5215813/5214660/5221352": {"title": "Festival Customs - Ash Wednesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138D, Page 02_021", "Page 02_021"], "url": "https://www.duchas.ie/en/cbes/5215813/5214660/5221352", "text": "\nused take place on Shrove Tuesday. On Shrove Tuesday Night the people used eat a lot of meat because they used fast from meat all during lent.Shrove Tuesday night is called Pancake Night now because on that night every family have pancakes for their supper.Every family has pancakes.----------------------------------------------------Ash Wednesday----------------------------------------------------On Ash Wednesday the Palm Sur, since palm Sunday is burned and crosses are made with the ashes on the foreheads of\n(continues on next page)\n", "school_info": "School: St Bridget's", "metadata": [{"Location:": "Derrymore, Co. Mayo", "Teacher:": "\nMáire Uí hOistín\n"}, {"Collector": "Áine Ní Oistín", "Gender": "female", "Address": "Derrymore, Co. Mayo"}, {"Language": "English"}]}, "5215813/5215365/5239319": {"title": "St Stephen's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138D, Page 15_002", "Page 15_002"], "url": "https://www.duchas.ie/en/cbes/5215813/5215365/5239319", "text": "\n(continued from previous page)\nmoney and then we will be gone.\n\n\n\nIt is called Ash Wednesday because the people burn the palm of the year before and put it in the shape of a cross on their forheads on  that day.\n\n\n\nIt is called Palm Sunday because Palm is blessed on that day. The priest bring palm to the chapel and the people puts it up in their houses until the next year.\n", "school_info": "School: St Bridget's", "metadata": [{"Location:": "Derrymore, Co. Mayo", "Teacher:": "\nMáire Uí hOistín\n"}, {"Collector": "Caitlín Ní Oistín", "Gender": "female"}, {"Language": "English"}]}, "5260470/5256058/5262969": {"title": "Ash Wedensday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0776C, Page 10_038", "Page 10_038"], "url": "https://www.duchas.ie/en/cbes/5260470/5256058/5262969", "text": "\n11th MarchAsh Wednesday  My father told that long ago the people did not get any breakfast they did not get anything to eat until after 12 o'clock and they got potatoes and fish for their dinner.   They always drank red tea on that day.\n", "school_info": "School: Twomilehouse", "metadata": [{"Location:": "Twomilehouse, Co. Kildare", "Teacher:": "\nTomás Bineidh\n"}, {"Collector": "Peter Cooley", "Gender": "male", "Address": "Mullacash North, Co. Kildare"}, {"Language": "English"}]}, "5260488/5259306/5263191": {"title": "Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1054B, Page 04_031", "Page 04_031"], "url": "https://www.duchas.ie/en/cbes/5260488/5259306/5263191", "text": "\n(continued from previous page)\nThe people be eating a lot of eggs. The Bon fire night The people make a fire that night and they do be gathering materials a long while before it. They gather whins and heather\n\n\n\nThe people go over to the Chapel that day to get on ashes. It is old law going\n(continues on next page)\n", "school_info": "School: Mín a Ghabhann (Meenagowan)", "metadata": [{"Location:": "Meenagowan, Co. Donegal", "Teacher:": "\nSéamus Ó Glacáin\n"}, {"Collector": "Seán Ó Rusail", "Gender": "male", "Address": "Ranny, Co. Donegal"}, {"Language": "English"}]}, "5215784/5210117/5278463": {"title": "Ash Wednesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0095C, Page 06_035", "Page 06_035"], "url": "https://www.duchas.ie/en/cbes/5215784/5210117/5278463", "text": "\nAsh Wednesday comes once a year. It is the beginning of Lent.It is a day of fast and abstinence. There are six weeks in Lent and then Easter Sunday. Easter Sunday is a great day for feasting because it was on that day Our Lord rose from the dead.The children have fires out in the fields. They make tea and boil eggs and have lot of other nice things. If you get up very early on Easter Sunday\n(continues on next page)\n", "school_info": "School: Gleann an Dúin - Prison", "metadata": [{"Location:": "Prison East, Co. Mayo", "Teacher:": "\nMáire A. Ní Dhocartaigh\n"}, {"Collector": "Rita Corcoran", "Gender": "female", "Address": "Prison North, Co. Mayo"}, {"Informant": "Mrs Corcoran", "Gender": "female", "Age": "32", "Address": "Prison North, Co. Mayo"}, {"Language": "English"}]}}