{"4427850/4350553/4451171": {"title": "Good Friday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0098, Page 366", "Page 366"], "url": "https://www.duchas.ie/en/cbes/4427850/4350553/4451171", "text": "\nOn  Good Friday some people  cut a bit of their hair, for a sacrifice and people always try to sow crops on Good Friday because they never fail. It is very bad to cut your nails on Good Friday because they  will never grow. The old people  used to shave their horses that day.\n\n\n\nOn Easter Sunday morning some people look to the sun and they say  that it dances about six o clock. On Sunday morning also it is a custom to eat three or four eggs for your breakfast. Long ago when the people fasted all during lent they made a feast on Easter. They went outside with a big pot and boiled\n(continues on next page)\n", "school_info": "School: Cnocán Mhichíl Naofa (Clochar)", "metadata": [{"Location:": "Claremorris, Co. Mayo", "Teacher:": "\nSiúracha na Trócaire\n"}, {"Collector": "Mary Brown", "Gender": "female", "Address": "Garryduff Middle, Co. Mayo"}, {"Language": "mixed"}]}, "4428075/4375746/4454303": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0152, Page 416", "Page 416"], "url": "https://www.duchas.ie/en/cbes/4428075/4375746/4454303", "text": "\n(continued from previous page)\nyear. Long ago the people said that on New Year's morning if you had to go to the well for water for the breakfast you would have bad luck. Once a woman went for water New Years morning for the breakfast. On her way home she had to cross a stone ditch. As she was crossing, she slipped of the ditch and broke her foot The people said after that, that it was because it was not right to do that on New Years morning It is not right to leave your own house New Year's day, because you would be gone out of it for the whole year.\n\n\n\nLong ago every old person said on Good Friday, this is the prayer. On Good Friday morning our Saviour was crusified with a crown of\n(continues on next page)\n", "school_info": "School: Coill an Gharráin", "metadata": [{"Location:": "Killacorraun, Co. Mayo", "Teacher:": "\nMícheál Ó Riagáin\n"}, {"Language": "English"}]}, "4427931/4358470/4457731": {"title": "Good Friday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0117, Page 159", "Page 159"], "url": "https://www.duchas.ie/en/cbes/4427931/4358470/4457731", "text": "\nSome do not comb their hair until after three o'clock.  People like to do a lot of work on the farm on this day.  They always begin to stick the potatoes on this day- they say this is the luckiest day in the year to set anything.\n\n\n\nEvery person eats two eggs or more on Easter Sunday.  Long ago people used to have potatoes and eggs for breakfast.  The old people used to say if you get up early you would see the Sun dancing.\n\n\n\n[-]\n\n\n\nThe old people used to say  that no one should go near water on Whit Sunday as it is a Contrary day.  The same applies to Whit Saturday and Whit Monday.  If a person fell asleep and awoke with\n(continues on next page)\n", "school_info": "School: Páirc Íseal (C.)", "metadata": [{"Location:": "Lowpark, Co. Mayo", "Teacher:": "\nSorcha Ní Dhumhnaigh\n"}, {"Language": "English"}]}, "4428107/4378928/4460321": {"title": "Local Belief and Customs - 14th June, Feast of Sacred Heart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0640, Page 42", "Page 42"], "url": "https://www.duchas.ie/en/cbes/4428107/4378928/4460321", "text": "\n(continued from previous page)\n(Local Superstitions. Piscoga.The practice of witch craft must be rampant. On all sides can be heard stories and rumours of various ill-doings. The chief of these was the taking of butter.) [crossed out]walk as far as ten miles to it. It is recorded that a half-fool went to confession. The priest asked him where was God. He replied, everywhere. Then said the priest \"is He in your pocket.\" \"No\" answered the fool \"because I have no pocket.\" At this the priest struck him. The fool ran away but shouted back \"If there were a thousand of them (meaning Gods) I would not offer you one of them.\"\n\n\n\nIf lambs tails were cut on this day they would not bleed at all.\n\n\n\nFirst goose used be killed or you should draw some blood.\n", "school_info": "School: West Waterford Branch I.N.T.O", "metadata": [{"Location:": "Coshmore and Coshbride, Co. Waterford", "Teacher:": "\nJames Cashman\n"}, {"Collector": "James Cashman", "Gender": "male"}, {"Language": "English"}]}, "4428016/4368436/4471714": {"title": "Festival Customs - Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138, Page 108", "Page 108"], "url": "https://www.duchas.ie/en/cbes/4428016/4368436/4471714", "text": "\nPancakes are made in most homes on this night. The ring is put in the cake and the old superstition that whoever gets it will marry first is attached to the finding of the ring\n\n\n\nCrowds attend morning mass and get the holy ashes. They bring home some of it to those who have not been to mass. There is a pious belief that the ashes should not be rubbed off on any account until the day is over. Some farmers in this district like to sow their oats on this day.\n\n\n\nA great number attend Mass and visit the Blessed Sacrament during the day.\n\n\n\nGood Friday is observed something like a holiday. Very little work is done and almost everyone young and old go to the church and perform the Stations of the Cross\n\n\n\nEaster Sunday there is great rejoicing for the feast. The young children and some of the grown ups to rise very early to see the sun dancing.\n\n\n\nThe people believe that it is not lucky to bathe at Whitsuntide as it is a season of accidents.\n\n\n\nAll crops are supposed to be sown before this date. There is a tradition that no one should touch clay this day. The children erect\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire, Leac an Anfa, Cathair na Mart", "metadata": [{"Location:": "Leckanvy, Co. Mayo", "Teacher:": "\nAn tSr. Treasa\n"}, {"Language": "English"}]}, "4428266/4389833/4478186": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1031, Page 031", "Page 031"], "url": "https://www.duchas.ie/en/cbes/4428266/4389833/4478186", "text": "\n(continued from previous page)\nbut fish. One day when the man was out fishing some sort of an animal leaped up and pulled down the nets. He did not know what to do then for he knew if he went home his wife would be very angry with him when he had brought no fish home with him. Then he looked around and he saw a man coming along the road. He went up to him then and he told him his story. The man said to him. \"Then come along with me and we will see what I can do for you\". So he started and he made a net first. Then he put it into the sea and when he took it out it was full of fish. He knew then by that it was Our Lord that in it and he went home very pleased.\n\n\n\nPeople say that if potatoes were set on Good Friday that they were sure to grow. They say that if any one had the rose that Whit Monday\n(continues on next page)\n", "school_info": "School: Árd Bán", "metadata": [{"Location:": "Ardbane, Co. Donegal", "Teacher:": "\nBriain Ó hEarchaigh\n"}, {"Collector": "Grace Campbell", "Gender": "female", "Age": "10", "Address": "Meenawilderg, Co. Donegal"}, {"Informant": "Mrs Margaret Mc Groary", "Relation": "not a relative", "Gender": "female", "Age": "52", "Occupation": "farmer", "Address": "Meenawilderg, Co. Donegal"}, {"Language": "English"}]}, "4428352/4398467/4486103": {"title": "Aoine an Chéasta", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1054, Page 098", "Page 098"], "url": "https://www.duchas.ie/en/cbes/4428352/4398467/4486103", "text": "\n(I)Sé seo an Aoine dhorcha, bhrónachSé seo an Aoine thuirseach, deorachMé ag dul un t-sleibhe chur tuairisce in aon MhicThig na fuathdhaoine leobhtha é. Thug an Mhaighdean da na bonnaí bána, ghearr sí an aithghiorra treasna an fhasaigh.Go dtáinic sí san áit a rabh na gardaí da socrughadh.Eoin, a thaiscidh an bhfuil tú ar láimh liom.Cé suid thuas i gcrann na páise. Mise a MhathairNo nach n-aithnigheann tú mé.(II)Is doiligh damhsa m'aon Mhac aithne, tá a bhéal briste, tá a shrón gearrtha, agus tá an t-sráid seo uilig lán do chuid fola.Foighidh a Mhathair, agus na goill go cráidhte.Béidh clann na nGaedheal go luthgháireach i bPáras.Is minic an d'innis mé duit anois,agus an uair sinGurbh í seo an uair a bhí geallta do mo ghrádh-gheal.\n", "school_info": "School: Doire Thanaidhe", "metadata": [{"Location:": "Derryhenny, Co. Donegal", "Teacher:": "\nM. Ní Amhalaghaidh\n"}, {"Collector": "Máire Ní Duibheannaigh", "Gender": "female", "Address": "Derryleconnell Far, Co. Donegal"}, {"Language": "Irish"}]}, "4493697/4411923/4524747": {"title": "Stilpín Binide", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1094, Page 003", "Page 003"], "url": "https://www.duchas.ie/en/cbes/4493697/4411923/4524747", "text": "\n(continued from previous page)\n(Ó Anna Ní Laodóg (62 a aois)Baile Tomáis, An Clocán, Co. Dún-na-ngallDáta: 26.7.'34\n\n\n\nNí iosfadh daoine biadh ar bith go dtí ndiaidh an dó-dhéag - gheobhadh siad tae dubh agus arán cruaidh annsin.Préataí, sgadain agus brachan - réidh fá choinne an dinneara ag an cúig ó chlog.Sin uilig go maidin.\n\n\n\nBiadh an fhéasta:-  Brúitín agus é ar maois le im. Bocstaí agus tae 'na dhiaidh.\n", "school_info": "School: An Cuimín", "metadata": [{"Location:": "Commeen, Co. Donegal", "Teacher:": "\nPádraig Mac Aoidh\n"}, {"Informant": "Anna Ní Laodhóg", "Gender": "female", "Age": "62", "Address": "Cloghan, Co. Donegal"}, {"Language": "Irish"}]}, "4493699/4412344/4525842": {"title": "Aoine an Chéasta ins an Áit inar Tógadh mé", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1094, Page 410", "Page 410"], "url": "https://www.duchas.ie/en/cbes/4493699/4412344/4525842", "text": "\nTá cuimhne agam nuair a bhí mé mó  ghasúr agus ag dul gó dtí an Teach Phobal le m'uncal ar mhaidín Aoine an Chéasta.Bá mhór m'íontas ag amharc air ag dul go dtí an teach phobal cos-tarnacht agus bróga air achan lá eile sa bhlían. Ní raibh coiléar air agus ní raibh a aghaidh nighte.Dheanfadh sé seo  i gcómhnuidhe acan Céasta go raibh me 18 blían d'aois.Chuir mé ceis air Áoine Chéásta  amhain, mar nar chaith sé bróga, (?)Á a dubhairt sé. Theidhthe (?)\n(continues on next page)\n", "school_info": "School: An Árd Leathan", "metadata": [{"Location:": "Altlahan, Co. Donegal", "Teacher:": "\nPádraig Mac Ailin\n"}, {"Collector": "Pádraig Mac Ailin", "Gender": "male", "Occupation": "múinteoir"}, {"Language": "Irish"}]}, "4493706/4412957/4528674": {"title": "Weather-Lore", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1096, Page 328", "Page 328"], "url": "https://www.duchas.ie/en/cbes/4493706/4412957/4528674", "text": "", "school_info": "School: Dubhais", "metadata": [{"Location:": "Dooish, Co. Donegal", "Teacher:": "\n-\n"}, {"Language": "English"}]}, "4493771/4418739/4534300": {"title": "Runaway Monday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1114, Page 299", "Page 299"], "url": "https://www.duchas.ie/en/cbes/4493771/4418739/4534300", "text": "\n(continued from previous page)\na name for Pancake or Shrove Tuesday as young couples trotted off to the Church to get married before Lent.\n\n\n\nAlthough the Church permits the use of milk on this day it is still a custom for the people to take black tea and diminish the bread they were accustomed to.I was told of an old man of this district who would go out to pray at a Mass Rock with his hands outstretched and placed in the form of a cross. It is also a custom to have all their children to go barefooted on this day and they would not eat any eggs.\n\n\n\nIt is a custom for the children to go barefooted on this day also at the hour of three o'clock the\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire, Carn Domhnaigh", "metadata": [{"Location:": "Ballylosky, Co. Donegal", "Teacher:": "\nAn tSr. M. Beirín Ní Bhaoighill\n"}, {"Language": "English"}]}, "4583273/4575567/4591353": {"title": "Cures", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0040, Page 0248", "Page 0248"], "url": "https://www.duchas.ie/en/cbes/4583273/4575567/4591353", "text": "\nThere was a woman named Treacy in Lisaleen and she was able to make a plaster with herbs, this plaster cured burns. This woman used also give a white stocking to the people. There was a cure for the whooping cough in the stocking. Any one who put the stocking on would be cured, the woman never told what she had in the stocking though people often asked her.If a dog licked a sore it would be cured the next day.\n\n\n\nOn Good Friday the people who had any meat hanging up took it down and never hung it up again.Everybody cut a bit of his hair on Good Friday also.\n", "school_info": "School: Fearth Mór (Brooklawn)", "metadata": [{"Location:": "Fartamore, Co. Galway", "Teacher:": "\nTreasa, Bean Mhic Aonghusa\n"}, {"Collector": "Íde Ní Mhanghain", "Gender": "female"}, {"Informant": "James Mangan", "Gender": "male"}, {"Language": "English"}]}, "4622978/4619870/4629384": {"title": "Aoine Chéasta", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0074, Page 281", "Page 281"], "url": "https://www.duchas.ie/en/cbes/4622978/4619870/4629384", "text": "\nNí dheantar aon curaidheacht Aoine Céasta.Tógtar anuas gach ball éadaigh agus gach uile rud eile atá crochta suas agus fágtar ar an mbord nó ar an gcathaoir iad, mar deartar nach ceart aon rud a bheith crochta suas Aoine Céasta.\n\n\n\nDeirtear go dtugann an chuac an t-Samraidh léithi i gcomhnaidhe. Dá mbeadhthá sa leaba an céad uair a chloisfeá an chuach, bheadhthá sa leaba ar feadh na bliadhna.Deirtear go gcaillfeadh an chuach le bróid márach a chosa ghránna.\n(continues on next page)\n", "school_info": "School: Coill Maolacáin", "metadata": [{"Location:": "Kilmeelickin, Co. Galway", "Teacher:": "\nAnna M. Ní Loingsigh\n"}, {"Collector": "Máire Ní Stancáird", "Gender": "female", "Address": "Kilmeelickin, Co. Galway"}, {"Informant": "Éilis Ní Mháille", "Relation": "grandparent", "Gender": "female", "Address": "Kilmeelickin, Co. Galway"}, {"Language": "Irish"}]}, "4622991/4621533/4629434": {"title": "An Old Marriage Tale", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0077, Page 264", "Page 264"], "url": "https://www.duchas.ie/en/cbes/4622991/4621533/4629434", "text": "\n(continued from previous page)\nwas \"taken\" by the fairies.\n\n\n\nMy grandfather remembered the pot cake which was made from oat meal and bacon boiled together.\n\n\n\nThe people would not take milk in their tea and ate unleavened bread.\n\n\n\nGo out in the garden, dig nine worms throw the ninth one away, bring in eight, dry them on an old shovel, put them in a pipe and smoke them.\n", "school_info": "School: Naomh Seosamh, Baile an Ruadháin", "metadata": [{"Location:": "Ballinrooaun, Co. Galway", "Teacher:": "\nMrs Nora Lally\n"}, {"Collector": "Teresa Burke", "Gender": "female", "Address": "Ballinrooaun, Co. Galway"}, {"Informant": "Timothy Burke", "Relation": "grandparent", "Gender": "male", "Age": "80", "Occupation": "farmer", "Address": "Gorteen, Co. Galway"}, {"Language": "English"}]}, "4622985/4620890/4630611": {"title": "Aoine an Chéasta", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0076, Page 186", "Page 186"], "url": "https://www.duchas.ie/en/cbes/4622985/4620890/4630611", "text": "\nTagann Aoine an Chéásta chuile bliadhan ach ní thagann sé an dáta céadhna gach bhliadhan. Tugtar omós mó don lá sin mar sin é an lá a céasadh ár Slanuightheóir ar Sliabh Calvarí.Bíonn na daoine ag déanamh turas na croise an lá sin ó mhaidin go dtí an oidhche. Um trathnóna teigheann an sagairt thart ó phictuir go pictuir ag déanamh turas na croise. Annsin sgrudhatar na daoine go mór mhór nuair a cuimhneann siad ar an gcaoí a bhfuair ár Slánightheóir bás ar an gcrois.An lá sin bíonn an Altóir gléasta in dubh ar fad in onóir do Íosa Chríosta agus is iomdha duine a mbaineann sé gol as.\n(continues on next page)\n", "school_info": "School: Clochar ar an bhFáirche", "metadata": [{"Location:": "Clonbur, Co. Galway", "Teacher:": "\nSiúr Iarfhlaith Ní Mhóráin\n"}, {"Collector": "Áine Ní Shomacháin", "Gender": "female", "Address": "Kilbride, Co. Mayo"}, {"Informant": "Micheal Ó Shomacháin", "Gender": "male", "Address": "Kilbride, Co. Mayo"}, {"Language": "Irish"}]}, "4622985/4620896/4630616": {"title": "Domhnach Cásca", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0076, Page 192", "Page 192"], "url": "https://www.duchas.ie/en/cbes/4622985/4620896/4630616", "text": "\n(continued from previous page)\nTugann na daoine an omós don lá sin mar sin é an lá a d'eirigh Críost ón marbh.\n\n\n\nAoine an Chéasta  Tagann Aoine an Chéasta ar an Aoine deire den Charaghas acht ní lá saoire é. Tugann na daoine turas na croise ins an séipéal an lá sin, mar sin é an lá a céasadh Críosta agus sin é an fáth a tugann siad turas mar cuireann sé é gcuimhne dóibh an turas a thug Críost go Calbheara. Bíonn go leor daoine ins an séipéal freisin i rith an carghaois. Siad na nósa atá acu\n(continues on next page)\n", "school_info": "School: Clochar ar an bhFáirche", "metadata": [{"Location:": "Clonbur, Co. Galway", "Teacher:": "\nSiúr Iarfhlaith Ní Mhóráin\n"}, {"Collector": "Máire Nic Aodhagáin", "Gender": "female", "Address": "Kilbride, Co. Mayo"}, {"Informant": "Máirtín Mac Aodhagáin", "Gender": "male", "Address": "Kilbride, Co. Mayo"}, {"Language": "Irish"}]}, "4591084/4589010/4660576": {"title": "Aoine an Chéasta", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0011, Page 272", "Page 272"], "url": "https://www.duchas.ie/en/cbes/4591084/4589010/4660576", "text": "\nTagann Aoine Céásta ar an Aoine roime Domhnac Casg. Is  í n-oinóir don lá a fuair Iosa Criost bás a bíonn sé againn. Nil aon saoire ar an lá sin ach ón dó deag go dtí an trí. Nuair a bhíonn sé an dó deag sa lá stopann gac duine a bheith ag obair. Téigheann siad go léir go dtí teach an pbail agus deanann  siad toras an croise. Is  in oinóir don toras a tug Iosa Criost go dtí an sliab nuair a bhí sé ag dul dhá ceasadh. Ní bhíonn siad ag obair ón  dó deag go dtí an trí in onóir don trí uair a bhí Iosa Criost ag fághail bás. Bíonn cuid eile go na daoine agus ní labhrainn siad aon fhocal ar feadh  na trí uair sin. Nuair a bhíonn  sé an trí a clog  teigeann na daoine ag obair.Feichín Ó Flaithbheartaigh,Árdmór,Cárna,\n", "school_info": "School: Árd Mhór", "metadata": [{"Location:": "Ardmore, Co. Galway", "Teacher:": "\nPádhraic Ó Gleasáin\n"}, {"Collector": "Feichín Ó Fhlaithbheartaigh", "Gender": "female", "Address": "Ardmore, Co. Galway"}, {"Language": "Irish"}]}, "4666603/4665939/4668535": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0413, Page 365", "Page 365"], "url": "https://www.duchas.ie/en/cbes/4666603/4665939/4668535", "text": "\nMost people in this neighbourhood always manage to provide \" slavey \" or slabhacán and cook it for Good Friday. They drink and eat it on that day.\n\n\n\nMany years ago there was a public road across Horgan's hill in Cahernade, and coming out at Killahan.There was another road leading from Behans' across the country to William Dennehy's in Ballincloher.\n\n\n\nLong ago there was a man living in Cahernade, (Cahernead) who was called General Neid and it is supposed that the place is called after him.Others say that the name is \" Cathair Shinéid \" the city of Jane, but nobody has any idea of who Jane was.\n\n\n\nOliver Moran was the last gentleman who lived in Ballymacaquim Castle. He was landlord of Ahamore and Ballymacquim.\n", "school_info": "School: Killahan", "metadata": [{"Location:": "Killahan, Co. Kerry", "Teacher:": "\nBean Uí Ríoghbhardáin\n"}, {"Language": "English"}]}, "4666575/4663310/4683764": {"title": "Hidden Treasures", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0401, Page 106", "Page 106"], "url": "https://www.duchas.ie/en/cbes/4666575/4663310/4683764", "text": "\nOne night a few men from Ballyheigue village went in search of gold.  They were told it was hidden under a wall sorrouding the castle.  When they began to dig, a soldier appeared to them beside the hole and stopped them from taking the gold.  One of the men got angry and struck him.  The soldier told them that he was under vow to guard the gold in death as in life.  He then vanished for when the men struck him the spell was broken and they took the gold.\n\n\n\nNo one should go boating on Good Friday because the sea has a great craving for bodies on Good Friday.\n\n\n\nOnce every seven years a city appears between Raypoint and Beale - only one person can see it and he is dead before it appears again.\n", "school_info": "School: Lisselton (B.)", "metadata": [{"Location:": "Lisselton, Co. Kerry", "Teacher:": "\nLiam Brún\n"}, {"Collector": "Bill Hannon", "Gender": "male", "Address": "Beal Middle, Co. Kerry"}, {"Language": "English"}]}, "4687711/4686152/4688482": {"title": "Eachtra Uaill an Airm Dheirg Mac an Rí Onóraigh ó Éirinn", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0433, Page 122", "Page 122"], "url": "https://www.duchas.ie/en/cbes/4687711/4686152/4688482", "text": "\nNíor imthig aon treab fear ag iascach scadán riamh oidhche Satharn nár d'eir'óch an tonn go léir agus chaithfeadh siad a chur isteach i gcuan ó'n gála mór agus an fhairrge a thiocfadh ortha. Níor chuaidh aon duine riamh ag rith ar broc ( ag fiadhach )  oídhce Satarn mar a mbíodh gála mór a shéidheadh ortha agus barra buadh (adharcha ) á séideadh na dtimpeall agus gheobhadh sé ( it would get ) comh dorcha san d'imthigeadh a gcuid gadhar go léir i ndiaidh séideadh na mbarr buadh agus ní fhílleadh na gadhair ortha go lá agus b'éigean dóibh suidhe síos an áit a mbíodh siad, bíodh an áit cómh dorchadh san dá raghadh na dtrus ( journey ) i ndiaidh na ngadhar do raghadh siad síos le faill mór agus do bheadh siad marbh.\n(continues on next page)\n", "school_info": "School: Caladh na Feirsde", "metadata": [{"Location:": "Callanafersy West, Co. Kerry", "Teacher:": "\nSéamus Ó Luain\n"}, {"Collector": "Seamas Ó Luain", "Gender": "male", "Occupation": "múinteoir", "Address": "Callanafersy West, Co. Kerry"}, {"Informant": "Seamas Ó Máille", "Gender": "male", "Address": "Callanafersy West, Co. Kerry"}, {"Language": "Irish"}]}, "4687719/4687021/4708726": {"title": "Féilte na Bliana - Aoine an Chéasta", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0435, Page 398", "Page 398"], "url": "https://www.duchas.ie/en/cbes/4687719/4687021/4708726", "text": "\nDeiridís go bhíodh rath ar an arbhar a chuiridís Aoine an Chéásta agus mar sin bhíodh na feirmeóirí ag déanamh a ndhicheall chun an síol do bheith chuirtha aca roimnh Aoine an Chéasta i slighe is go mbeadh an síol aibidh Lá Peadar agus Pól.Do théigidís go dtí an Éaglais chun Turus na Cróise do dhéanamh agus na daoine ná féadfhaidís dul ann do chuiridís cipín ar an dteine agus do dhéinidís Cróis in a lámhaibh leis an cipín dubh sin.( Ainm an duine a bhfuaras an t -eolas uaidh:Seammus Ó'Connchubhair  (66)RínCill OrglanCiarraidheSeo sean fhocail i dtaobh an lá san:\"Aoine an Chéasta is mór an céasadh bainne d'ól\"\n(continues on next page)\n", "school_info": "School: Dubhghlas (C.)", "metadata": [{"Location:": "Douglas, Co. Kerry", "Teacher:": "\nEibhlín, Bean de Róiste\n"}, {"Collector": "Gobnait Ní Chonncubhair", "Gender": "female", "Address": "Reen, Co. Kerry"}, {"Informant": "Seamus Ó Connchubhair", "Gender": "male", "Age": "66", "Address": "Reen, Co. Kerry"}, {"Language": "Irish"}]}, "4701679/4692219/4726202": {"title": "Good Friday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0160, Page 158", "Page 158"], "url": "https://www.duchas.ie/en/cbes/4701679/4692219/4726202", "text": "\nGood Friday.All good Catholics keep silent for three hours on Good Friday, from noon until after 3 p.m. in memory of Our Lord's Passion and death.On Easter Sunday morning if you rise very early you will see the sun dancing with joy.The Robin got his redbreast from the blood of Our Lord when he tried to pull the nails out of His Sacred Hands.People never use the reed for thatching because it was\n(continues on next page)\n", "school_info": "School: Dunally", "metadata": [{"Location:": "Doonally, Co. Sligo", "Teacher:": "\nFlorence Egan\n"}, {"Collector": "Patricia Egan", "Gender": "female", "Age": "13", "Address": "Carrowlustia, Co. Sligo"}, {"Language": "English"}]}, "4713236/4710062/4728496": {"title": "Customs and Beliefs Regarding Eggs Laid on Good Friday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0451, Page 332", "Page 332"], "url": "https://www.duchas.ie/en/cbes/4713236/4710062/4728496", "text": "\nLong ago the people did not put milk in their tea, nor did they use butter or eggs on Good-Friday and if a person died on Holy Thursday he would not be buried until Easter Saturday. If seeds were planted on Good-Friday they were sure to grow. It was a custom not to draw any blood on Good-Friday, in honour of the Crucifixion of Our Lord.Children that are born on Good-Friday, and baptised on Easter Sunday, were supposed to be able to cure Farcy in horses. The eggs that are laid on Good-Friday are supposed to be able to cure certain diseases. The people had it as a custom to go to the church on that day to pay rounds. People who were far away from the church did the rounds in a grave-yard instead.\n", "school_info": "School: Gníomh go Leith (B.)", "metadata": [{"Location:": "Gneevgullia, Co. Kerry", "Teacher:": "\nCormac Ó Laoghaire\n"}, {"Collector": "Dan Collins", "Gender": "male", "Age": "15", "Address": "Knocknageeha, Co. Kerry"}, {"Informant": "Dan Crowley", "Gender": "male", "Age": "75", "Address": "Tooreennamult, Co. Kerry"}, {"Language": "English"}]}, "4713236/4710128/4744149": {"title": "Good Friday Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0451, Page 398", "Page 398"], "url": "https://www.duchas.ie/en/cbes/4713236/4710128/4744149", "text": "\nLong ago, on Good Friday all the people observed the black fast. They ate no meat, no eggs, or neither did they put any milk in their tea on that day. They provided themselves with a loaf of bread on that day, and dipped it in their tea, and in that way the people took their meals.No butcher or no other person would draw any blood on that day, or neither would they open any grave that day. On Good Friday also the people sowed the most of their crops.They always kept the eggs laid on Good Friday, because they believe there was a cure in them. The cure in the following manner, first the egg was broken into a saucer, a cloth was the dipped in the broken egg, and it was then rubbed to the diseased part. A person born on Good Friday and baptised on Easter Sunday was said to have a cure. People far away from the church, and near the graveyard paid\n(continues on next page)\n", "school_info": "School: Gníomh go Leith (B.)", "metadata": [{"Location:": "Gneevgullia, Co. Kerry", "Teacher:": "\nCormac Ó Laoghaire\n"}, {"Language": "English"}]}, "4742145/4740370/4780005": {"title": "Ubh Aoine an Chéasta", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0771, Page 002", "Page 002"], "url": "https://www.duchas.ie/en/cbes/4742145/4740370/4780005", "text": "\nLe linn a h-óige do tugtí ubh Aoine an Chéasta ar aon ubh a bheireadh cearc ar Aoine an Chéasta. Do chuireadh muinntir a tighe na h-uibhe sin i leath-taoibh go cúramach. Uair eigin taréis an mheadhon-oidhche ar maidin Domhnach Cásca d'eirigheadh muinntir a tighe agus bheirighdís na h-uibhe sin agus d'ithidís iad. Dá mba na beadh aca acht an t-aon ubh amháin do bheirighdis í agus do dheinidís í roinnt ar na daoine a bheadh i láthair. Dheineadh na h-uibhe sin maitheas anma agus cuirp do lucht a h-ithe. Níl tásc na tuairisc ar an sean-nós san anois. Nuair cailleadh a h-athair 's a máthair níor bhac an chlann den nós a thuille. Agus sé deir an t-sean-bhean so ná gur mór an truagh aon t-sean-nós a leigint chun báis.\n", "school_info": "School: Broadford, Moyvalley", "metadata": [{"Location:": "Broadford, Co. Kildare", "Teacher:": "\nDónall Ó Buachalla\n"}, {"Informant": "Bean Uí Mhongáin", "Gender": "female", "Age": "74", "Address": "Moyvally, Co. Kildare"}, {"Language": "Irish"}]}, "4742166/4741292/4783587": {"title": "Fairy Forts", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0774, Page 189", "Page 189"], "url": "https://www.duchas.ie/en/cbes/4742166/4741292/4783587", "text": "\n(continued from previous page)\nfairies are dancing in the fort every night. Sometimes they call them \"forts\" and sometimes they call them a \"rath\". They say if you went over to the fort at midnight you would see fairies running about the fields with lights. They say if you went to do anything with the fort the fairies would kill you.\n\n\n\nThe eggs that the hens lay on Good Friday and Holy Saturday, the people put crosses on them with soot.\n\n\n\nWhen the person that is milking has finished she\n(continues on next page)\n", "school_info": "School: Allenwood", "metadata": [{"Location:": "Allenwood, Co. Kildare", "Teacher:": "\nSeán Ó Clúmháin\n"}, {"Language": "English"}]}, "4798725/4793647/4926804": {"title": "Good Friday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0259, Page 025", "Page 025"], "url": "https://www.duchas.ie/en/cbes/4798725/4793647/4926804", "text": "\nGood Friday is the Friday before Easter Sunday. There is no mass on Good Friday. Some people say a thousand \"Hail Marys\" on that day in order to bring some soul from Purgatory to Heven. People do the Stations of the Cross on that day especially. Everyone should cut his finger nails and toe nails account of the five wounds of Our Lord. Some believe to cut their hair that day also.\n(continues on next page)\n", "school_info": "School: Cúl Seachtaine", "metadata": [{"Location:": "Coolshaghtena, Co. Roscommon", "Teacher:": "\nCaitlín Nic Dhonnchadha\n"}, {"Collector": "Mary Farrell", "Gender": "female", "Address": "Clooncashel More, Co. Roscommon"}, {"Informant": "Jessie Carroll", "Gender": "female", "Age": "23", "Address": "Clooncashel More, Co. Roscommon"}, {"Language": "English"}]}, "4921935/4911351/4932664": {"title": "Good Friday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0480, Page 368", "Page 368"], "url": "https://www.duchas.ie/en/cbes/4921935/4911351/4932664", "text": "\nGood FridayGood Friday is solemnly observed here.  In the morning all go the Mass of the pre-sanctified and without music the Pangua Lingua is solemnly sung by the local choir.  The \"kissing of the Cross\" follows.  Each person proceeds to the altar and the Parish Priest presents to him or her the Cross to kiss.The Crucifix is laid on the altar steps during the day until 7 o'clock when the public recital of the Way of the Cross concludes the day's religious ceremonies.A great many people believe that if you pick and eat anything on the strand that you will be free from sickness during the year.You would see crowds of children and adults on the strand when the tide goes out.  Some say it is all pishoges.\n", "school_info": "School: Glin (C.)", "metadata": [{"Location:": "Glin, Co. Limerick", "Teacher:": "\nBean Mhic Cárthaigh\n"}, {"Language": "English"}]}, "4723866/4720580/4940959": {"title": "Churning", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0953, Page 032", "Page 032"], "url": "https://www.duchas.ie/en/cbes/4723866/4720580/4940959", "text": "\n(continued from previous page)\na hand churn. If the woman of the house was churning and any one come in she would say take a brash and they would say God bless your work. It is always the woman of the house that churns the milk\n\n\n\nThe prayers I learned home were short prayers that people say going to bed. Some of them are. There are four corners on My bed There are four Angels at my head Mattew, Mark Luke and John God bless the bed that I lie on.Here I do lie down to sleep I pray to God my soul to keep and if I die before I wake pray to God my soul to take\n\n\n\nOn a Good Friday the people used make Lent Broth sometimes known as Ranty. This is how they made it. A pot of water put on the fire and when the water was boiling a bowl of oat-meal\n(continues on next page)\n", "school_info": "School: Tappa", "metadata": [{"Location:": "Tetoppa, Co. Monaghan", "Teacher:": "\nS. Ó Reachtaire\n"}, {"Language": "English"}]}, "4922085/4850910/4946457": {"title": "Pishogues", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0520, Page 208", "Page 208"], "url": "https://www.duchas.ie/en/cbes/4922085/4850910/4946457", "text": "\n(continued from previous page)\nby piseógs when that is done.An uncle of mine named Mr Keays, and another man stayed up one night to mind the cow which was going to calve.  The cow-house was near the house so they were in and out every five minutes to see the cow.  One time they went out and found a live calf behind the cow and a rotten sling at her head.\n\n\n\nEvery Good Friday some people in this district keep up a lot of old customs.  Some people never wash clothes, or wash anything else, others never put milk in their tea, or butter on their bread, and others would not let people get water from their pumps.   Also on that day boys and girls go gathering\n(continues on next page)\n", "school_info": "School: Cappamore (B.)", "metadata": [{"Location:": "Cappamore, Co. Limerick", "Teacher:": "\nJames McCarthy\n"}, {"Collector": "Patrick O' Connors", "Gender": "male", "Age": "12", "Address": "Cappamore, Co. Limerick"}, {"Language": "English"}]}, "4922085/4850912/4946460": {"title": "Good Friday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0520, Page 210", "Page 210"], "url": "https://www.duchas.ie/en/cbes/4922085/4850912/4946460", "text": "\nOn Good Friday when Our Lord was dying on the cross, there is an old story that a robin came to the cross and tried to pull out the nails from Our Lord's hands and feet.  When Our Lord was dead and brought down from the cross, there was one thorn left in his head which no one was able to pull out.   The robin perced on his head, and pulled out the thorn.   It is said that a drop of the sacred blood fell on the robin's breast.  So that is how the robin is supposed to have got the red breast.  Now when a robin is killed by anyone, people think it is a terrible thing.\n", "school_info": "School: Cappamore (B.)", "metadata": [{"Location:": "Cappamore, Co. Limerick", "Teacher:": "\nJames McCarthy\n"}, {"Collector": "Paddy O' Neill", "Gender": "male", "Age": "12", "Address": "Cappamore, Co. Limerick"}, {"Language": "English"}]}, "4922053/4847921/4955961": {"title": "A Prayer for Toothache", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0512, Page 128", "Page 128"], "url": "https://www.duchas.ie/en/cbes/4922053/4847921/4955961", "text": "\nSt Peter sat upon a marble stoneChrist Himself came to him aloneSaying \"Rise thou Peter and do thou healNot thyself but all mankindWhoever shall say this prayer all for my sakeNever shall be troubled with a toothache.\n\n\n\nGod bless Friday and Good Friday tooThe day Our Saviour was crucified.The crown of thorns fixed on his headThe Jews being passing by,They pierced His heart they pierced His handsHis Precious Blood flowingHis dear mother standing by with a tender           heart and a dismal crySaying anyone that says this prayer three times by dayAnd three times by night, never fear the seven deadly sinsOr enter the gates of hell.\n", "school_info": "School: Baile an Londraigh (C.)", "metadata": [{"Location:": "Ballylanders, Co. Limerick", "Teacher:": "\nEibhlís, Bean Uí Shíoda\n"}, {"Collector": "Eileen English", "Gender": "female", "Age": "13", "Address": "Cullane, Co. Limerick"}, {"Language": "English"}]}, "5009219/4999081/5019807": {"title": "Festival Customs - Good Friday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0870, Page 350", "Page 350"], "url": "https://www.duchas.ie/en/cbes/5009219/4999081/5019807", "text": "\nGood Friday is a moveable feast. This year it will be on the 7th of April. It is a very important feast. Because it was on that day Our Lord was Crucified. Our Lord's Passion was between one and three o'clock.Good Friday is kept very holy in Wexford. The members of some families do not speek to one another for the three hours of Our Lord's Passion. On Good Friday all the people make the Stations of the Cross. They kiss the Cross also. Long ago the people used fast on Good Friday, with a meal and a collation. They had to drink black tea with no sugar. They used eat fish for their dinner and gruel for their supper. Very few people fast on Good Friday now.\n", "school_info": "School: Ballycullane", "metadata": [{"Location:": "Ballycullane, Co. Wexford", "Teacher:": "\nSeán Ó Dubhghaill\n"}, {"Collector": "Mary Egan", "Gender": "female"}, {"Language": "English"}]}, "4922236/4863172/5053320": {"title": "May Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0560, Page 391", "Page 391"], "url": "https://www.duchas.ie/en/cbes/4922236/4863172/5053320", "text": "\nA person in Ballycullen whose butter was taken by having a well skimmed went to a smith who was known to remedy such trouble. The smith came and heated the coulter of a plough and some other parts. He put some parts of the plough into the churn and the others under it and brought the butter. He told them that the butter of that churning would not be fit for use. All future churns, however, were good. The smith then said he could bring the person who had taken their luck to the spot, but the woman of the house would not allow him to do so, as she said she would prefer not to know who had done them the injury.\n\n\n\nPeople keep Good Friday eggs to be eaten on Easter Sunday.\n\n\n\nWe go to the Church for the Easter Water  on Easter Saturday, then we sprinkle it on the four corners of the garden to invoke the blessing of God on our crops. Easter water is kept in the house, and is sprinkled on the seed when the crops are about to be sown.\n", "school_info": "School: Mullinahone (C.)", "metadata": [{"Location:": "Mullinahone, Co. Tipperary", "Teacher:": "\nMáire Ní Shéaghdha\n"}, {"Collector": "Mary Madden", "Gender": "female", "Address": "Clonagoose, Co. Tipperary"}, {"Informant": "Mrs Madden", "Gender": "female", "Age": "52", "Occupation": "labourer's wife", "Address": "Clonagoose, Co. Tipperary"}, {"Language": "English"}]}, "4922383/4876306/5083094": {"title": "Ash Wednesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0621, Page 415", "Page 415"], "url": "https://www.duchas.ie/en/cbes/4922383/4876306/5083094", "text": "\nIt is customary to go to mass on Ash Wednesday morning. During the mass the congregation goes up to the altar rails and the priest puts the Holy Ashes in their foreheads. Those who cannot attend mass have the ashes brought home to them by a member of the family.\n\n\n\nThis day is a day of prayer in every parish and the people visit the churches many times during the day to say the Stations of the Cross. Some make it customary to have them  said three times before 12 o'c. Before leaving the church, people go inside the rails to kiss the crucifix which is placed there for that purpose.\n", "school_info": "School: Lahinch", "metadata": [{"Location:": "Lehinch, Co. Clare", "Teacher:": "\nDónall Ó Ríordáin\n"}, {"Informant": "John O' Dwyer", "Gender": "male", "Age": "72", "Address": "Calluragh South, Co. Clare"}, {"Language": "English"}]}, "5044787/5038086/5084095": {"title": "Festival Customs - Good Friday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0963, Page 483", "Page 483"], "url": "https://www.duchas.ie/en/cbes/5044787/5038086/5084095", "text": "\nGood Friday is so called because on that day christ died in the cross for us. People go to the chapel for the adoration of the cross.Some years ago a black fast used to be observed on Good Friday. People fast all day on bread and water and others fast till twelve o clock.The latter custom is still common in this district.\n\n\n\nThere are no customs in this locality for Easter Saturday except the common Church custom of getting water and salt blessed in the chapel. Some of this is put in the cowhouse to bring God's blessing on the stock.It is still a belief here that the sun dances on Easter Sunday morning and many people rise at an early hour to see it.Breakfast time provides one of the big feasts of the year. Often there is a competition to see who would eat the greatest number of eggs. The eggs are boiled in a pot. Eggs were never eaten in Lent and that is probably the reason why so many are eaten in Easter.Easter Monday is another big day with the\n(continues on next page)\n", "school_info": "School: Tomena", "metadata": [{"Location:": "Gortullaghan, Co. Cavan", "Teacher:": "\nT. Mac Uidhir\n"}, {"Informant": "Phyllis Maguire", "Gender": "female", "Address": "Derrynacreeve, Co. Cavan"}, {"Language": "English"}]}, "5070753/5059845/5092684": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0990, Page 064", "Page 064"], "url": "https://www.duchas.ie/en/cbes/5070753/5059845/5092684", "text": "\nOn Good Friday when the first Jew came in, with the sharp spear in his hand. He struck the Blessed Virgin Mary pitifull Mother standing by with a sore heart and sorrowfull moan. Thoes that say those words three times by day and three days by night shall never die in the state of mortal sin.\n\n\n\nPrayers to be said when going to bed.O Mary my mother and my hopeI take refuge under thy mantleThere let me live and dieDeliver me from sin and grant me thy holy blessing.Heart of Jesus once in agony,Have pity on the dyingHeart of Jesus I adoreHeart of Mary I imploreHeart of Joseph pure and justIn those three hearts I put my trust.\n", "school_info": "School: Drom an Mhadaidh", "metadata": [{"Location:": "Drumavaddy, Co. Cavan", "Teacher:": "\nS. Ó Murchadha\n"}, {"Language": "English"}]}, "5070768/5060885/5094326": {"title": "Good Friday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0993, Page 349", "Page 349"], "url": "https://www.duchas.ie/en/cbes/5070768/5060885/5094326", "text": "\nOn Good Friday we celebrate the death of Our Lord who was crucified on a cross on Mount Calvary.Good Friday is the Friday before Easter Sunday and on that day there are processions in every Catholic Church all over Ireland.There was a procession in Crosserlough Chapel and I was at it.The Altar of Repose was beautifully decorated with flowers and lighted candles. The procession was attended by two priests Father Judge and Father Cahill and a number of clerks.After Mass of the Pre-Sanctified was celebrated, the two priests and clerks went out to the Altar of Repose and the procession began. One clerk came first carrying a cross, then came two clerks carrying lighted candles, and lastly came the two priests one of them carrying the Blessed Sacrement. They moved slowly along to the high altar and as they did so, the choir sang a beautiful hymn from the gallery.After this procession a sermon was preached by Father Cahill on the passion and death of Our Lord and with the adoration of the crucifix by the people, the ceremonies closed.\n", "school_info": "School: Crosserlough", "metadata": [{"Location:": "Crosserlough, Co. Cavan", "Teacher:": "\nL. Reilly\n"}, {"Language": "English"}]}, "5070791/5064194/5096108": {"title": "The Cross Day of the Year", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1001, Page 101", "Page 101"], "url": "https://www.duchas.ie/en/cbes/5070791/5064194/5096108", "text": "\nThere are various opinions about the Cross-day of the year. Our family holds St. Brigid's Day and St. Patrick's Day as the Cross-days of the year.\n\n\n\nWednesday and Friday are the two luckiest days in the week. Tuesday and Saturday are the two unluckiest days in the week. Wednesday and Friday are very lucky days on which to start any important business, such as ploughing or flitting from one house to another.\n\n\n\nThe people long ago had a lot of customs which they kept such as - They would not dive a nail in Good - Friday. There is not a man or a blacksmith who would put a nail in anything on Good Friday because Our Lord\n(continues on next page)\n", "school_info": "School: Virginia (B)", "metadata": [{"Location:": "Virginia, Co. Cavan", "Teacher:": "\nE. Ó Raghallaigh\n"}, {"Collector": "Brendan Mooney", "Gender": "male", "Address": "Ballaghanea, Co. Cavan"}, {"Informant": "Charles Mooney", "Gender": "male", "Address": "Ballaghanea, Co. Cavan"}, {"Language": "English"}]}, "5070803/5065637/5097276": {"title": "Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1005, Page 197", "Page 197"], "url": "https://www.duchas.ie/en/cbes/5070803/5065637/5097276", "text": "\nShrove Tuesday is the day before Lent, and is usually called \"Pancake Day\" because it is a very old custom to make pancakes for that day - hence the name \"Pancake Day\". Hot-cross buns are generally made for tea also. Concerts and Danes are finished for the season on this day.\n\n\n\nAsh Wednesday is the first day of Lent and is a church holiday for some of our schools, and many people attend worship on that day . It is also a Fast Day and most people abstain from meat and milk. It is a day, however, on which people work.\n\n\n\nGood Friday is a National and Church Holiday, and also a Fast Day. People of every denomination usually attend their place of worship on that day. It is considered the saddest day in the year, and all amusements are abandoned.\n\n\n\nOn Easter Saturday preparations are being made for the Festival the following day. In olden days it was customary for the poorer people to collect eggs in this day, and on visiting the houses they asked for a \"Cludog\" - meaning eggs - which they were rarely refused.\n", "school_info": "School: Lisnagirl (1)", "metadata": [{"Location:": "Lismagiril, Co. Cavan", "Teacher:": "\nHarriett Kinkade\n"}, {"Collector": "H. Kinkade", "Gender": "female", "Occupation": "teacher"}, {"Language": "English"}]}, "5009143/4991100/5100170": {"title": "Good Friday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0752, Page 109", "Page 109"], "url": "https://www.duchas.ie/en/cbes/5009143/4991100/5100170", "text": "\nOn that day we eat no butter and we spend three hours in silence from 12 o'clock until 3 o'clock. We wash our hair on that day and change into lighter clothes as it is said you do not get cold.It is a custom on that day to eat eggs for our dinner.\n", "school_info": "School: Mercy Convent, Baile Mathúna", "metadata": [{"Location:": "Ballymahon, Co. Longford", "Teacher:": "\nSr. M. Clement\n"}, {"Collector": "Angela O' Donohoe", "Gender": "female"}, {"Language": "English"}]}, "5008974/4972516/5111637": {"title": "Feast Days - Good Friday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0704, Page 265", "Page 265"], "url": "https://www.duchas.ie/en/cbes/5008974/4972516/5111637", "text": "\nYears ago the fasting regulations were very strict on good Friday as no milk was allowed in tea or coffee now it is allowed.In olden days our forefathers used to fast from meat, smoking & drinking for the whole of lent.\n\n\n\nOn Easter Saturday to commerate the end of the lent fast, little children would go to the neighouring houses with a can to get gifts of eggs to have plenty of the glorious feast of Easter, this is called their cludog.\n\n\n\nOn Easter Sunday people would boast how many eggs they were able to eat on that morning.\n", "school_info": "School: Kilskeer (B.)", "metadata": [{"Location:": "Kilskeer, Co. Meath", "Teacher:": "\nMáirtín Ó Loingsigh, R. Ó Fithcheallaigh\n"}, {"Language": "English"}]}, "5009008/4976622/5120892": {"title": "Holy Thursday and Good Friday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0714, Page 469", "Page 469"], "url": "https://www.duchas.ie/en/cbes/5009008/4976622/5120892", "text": "\nNo other customs are common to the above days, other than the usual religious ceremonies held in the Parish Church.Crowds flock to the Devotions on those days and take part in the Adoration of the Holy CrossAll cakes baked for Good Friday have a cross marked on them.\"Hot cross buns\" are baked on that day also.People are not to shed any blood on Good Friday e.g.  kill fowl etc.\n", "school_info": "School: Grangegeeth", "metadata": [{"Location:": "Grangegeeth, Co. Meath", "Teacher:": "\nSeósaimhín, Bean Uí Dhubhghaill\n"}, {"Language": "English"}]}, "5009108/4987357/5123473": {"title": "Ash Wednesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0742, Page 304", "Page 304"], "url": "https://www.duchas.ie/en/cbes/5009108/4987357/5123473", "text": "\n(continued from previous page)\nEveryone goes to Mass on that morning and the priest rubs blessed ashes on their foreheads with his finger and he makes a cross on the forehead.\n\n\n\nThe Sunday before lent is called chalk Sunday. On that day people mark the bachelors with chalk to distinguish them from married men.\n\n\n\nOur Lord died on Good Friday and everyone goes to make stations in the chapel at three o'clock, because if you do you will get any favour you ask for.\n(continues on next page)\n", "school_info": "School: Loughanvally", "metadata": [{"Location:": "Loughanavally, Co. Westmeath", "Teacher:": "\nMrs. O'Connor\n"}, {"Language": "English"}]}, "5044567/5022997/5142775": {"title": "Good Friday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0800, Page 052", "Page 052"], "url": "https://www.duchas.ie/en/cbes/5044567/5022997/5142775", "text": "\nOn Good Friday, Ash Wednesday & Spy Wednesday long ago the people used eat boiled turnips mashed up & mixed with Indian meal; also porridge made in water &  bread made of water instead of milk\n\n\n\nLong ago on Easter Sunday morning the man of the house used get up early & boil an egg - then put a bit on the lips of each member of the family. It was supposed to keep away sickness for the year.\n", "school_info": "School: Bracknagh (2)", "metadata": [{"Location:": "Bracknagh, Co. Offaly", "Teacher:": "\nS. Mac Giobúin\n"}, {"Informant": "William Donegan", "Gender": "male", "Age": "64", "Address": "Ballyshane, Co. Offaly"}, {"Language": "English"}]}, "5044567/5022997/5142779": {"title": "Good Friday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0800, Page 052", "Page 052"], "url": "https://www.duchas.ie/en/cbes/5044567/5022997/5142779", "text": "\nOn Good Friday, Ash Wednesday & Spy Wednesday long ago the people used eat boiled turnips mashed up & mixed with Indian meal; also porridge made in water &  bread made of water instead of milk\n\n\n\nLong ago on Easter Sunday morning the man of the house used get up early & boil an egg - then put a bit on the lips of each member of the family. It was supposed to keep away sickness for the year.\n", "school_info": "School: Bracknagh (2)", "metadata": [{"Location:": "Bracknagh, Co. Offaly", "Teacher:": "\nS. Mac Giobúin\n"}, {"Informant": "William Donegan", "Gender": "male", "Age": "64", "Address": "Ballyshane, Co. Offaly"}, {"Language": "English"}]}, "4798781/4798136/5151514": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0306, Page 152", "Page 152"], "url": "https://www.duchas.ie/en/cbes/4798781/4798136/5151514", "text": "\nGood Friday  Our Saviour was crucifiedThe Jews came with a sharp speak And pierced Our Saviour tender heartFrom his head to his toesHis blessed blood did flowHis Blessed Mother standing byWith a heavy heart, and a dismal crySaying God bless those that say these prayersThree times by night three times by dayNever shall die in mortal sinOr never shall enter the gates of Hell,For ever more,  Amen.\n", "school_info": "School: An Caipín, Inis Céin", "metadata": [{"Location:": "Cappeen, Co. Cork", "Teacher:": "\nLiam Ó Cruadhlaoich\n"}, {"Language": "English"}]}, "4921666/4888553/5151966": {"title": "Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0318, Page 088", "Page 088"], "url": "https://www.duchas.ie/en/cbes/4921666/4888553/5151966", "text": "\nPrevious to 50 years ago the peasants of this district in addition to observing the Lenten fast observed a self imposed fast on the afternoon of Saturday before Easter Sunday in order to be able to eat a great number of eggs on Easter morning. In addition to usual breakfast of the period all seemed to compete in the eating of the eggs - many ate up to 12, while some ate as much as 18. The number eaten by each person began to decline about 40 years ago. Children also had a feast during the day.\n\n\n\nThe usual fish and milk for dinner was displaced by \"Cnuasach\" gathered from certain strands. Poor peasants used this on other occasions also, to spare fish. Cnuasach is unobtainable now on almost all the rocks where it abounded 40 years ago.\n", "school_info": "School: Baile an Bhuitléirigh, Tigh Molaga", "metadata": [{"Location:": "Butlerstown, Co. Cork", "Teacher:": "\nMícheál Ó Muimhneacháin\n"}, {"Language": "English"}]}, "4921641/4887243/5152503": {"title": "Good Friday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0313, Page 037", "Page 037"], "url": "https://www.duchas.ie/en/cbes/4921641/4887243/5152503", "text": "\nGood Friday.1. Clothes must not be washed on that day.2. Milk should not be given away for free on that day.3. It is an old saying in this district that if a person falls sick on Good Friday he will not recover.\n\n\n\nShrove.1. Shrovetide begins on St. Stephen's Day and ends on Shrove Tuesday. This is a great time for matchmaking and marriages in country districts. 2. Pancakes are made for tea on Shrove Tuesday night.\n\n\n\nSt. Bridgid's Day.It is a custom to put a white cloth on a tree on that night.\n\n\n\n1.Everyone that can afford it has a \"November barm-brack\" for supper. Games are played with apples and nuts. A tub of water is placed in the middle of the floor. Some apples are put in\n(continues on next page)\n", "school_info": "School: Barr Liath, Droichead Banndan", "metadata": [{"Location:": "Baurleigh, Co. Cork", "Teacher:": "\nEibhlín Nic Gearailt\n"}, {"Language": "English"}]}, "4921780/4906632/5178229": {"title": "A Legend Connected with Good Friday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0362, Page 300", "Page 300"], "url": "https://www.duchas.ie/en/cbes/4921780/4906632/5178229", "text": "\nAn old lady named Mrs McAuliffe, who lived in Shanavoher, Glantane, Mallow, Co. Cork, and died about 40 years ago, aged about 72 years, told me the following story when I was a child:-\"I had a neighbour of mine ploughing ridges for the garden a good many years ago.  It happened to be Good Friday, and when he came to the dinner I said I was sorry I could not have a better dinner for him, that it was a pity he could not have something better than potatoes, herrings and water.He said he was working hard, and ordered me to put down two goose-eggs for him.Though I did not like to do it, I obeyed him.  When the eggs were boiled he broke one, but put it away as there was nothing in it but blood.  He opened the second one but found that it was just like the other.\"(The old lady had only a few acres of land and had to pay in cash or work for the ploughing of the garden).\n", "school_info": "School: An Gleantán, Lombardstown", "metadata": [{"Location:": "Glantane, Co. Cork", "Teacher:": "\nTomás Ó Colmáin\n"}, {"Collector": "T. Coleman", "Age": "60"}, {"Language": "English"}]}, "5215813/5214661/5221354": {"title": "Festival Customs - Ash Wednesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138D, Page 02_022", "Page 02_022"], "url": "https://www.duchas.ie/en/cbes/5215813/5214661/5221354", "text": "\n(continued from previous page)\nAll in the house.\n\n\n\nOn Good Friday the people do not eat anything till after twelve o'clock, or the men do not smoke.The men, women, and children go to the chapel and do stations.\n\n\n\nOn Easter Sunday if you get up before the sun rises, you will see the sun dancing three times.\n", "school_info": "School: St Bridget's", "metadata": [{"Location:": "Derrymore, Co. Mayo", "Teacher:": "\nMáire Uí hOistín\n"}, {"Collector": "Áine Ní Oistín", "Gender": "female", "Address": "Derrymore, Co. Mayo"}, {"Language": "English"}]}, "5215813/5215465/5240073": {"title": "Whit Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138D, Page 17_010", "Page 17_010"], "url": "https://www.duchas.ie/en/cbes/5215813/5215465/5240073", "text": "\nIt is said that it isn't right to dirty the water on Whit Sunday. On Whit Sunday people bring bottles of holy-water home and shakes it on their crops to make them grow better.\n\n\n\nOn Good Friday every people leave their work and go to the chapel to do stations. Some people never eat till after twelve oclock in the day and the men dont smoke till after twelve oclock either.\n", "school_info": "School: St Bridget's", "metadata": [{"Location:": "Derrymore, Co. Mayo", "Teacher:": "\nMáire Uí hOistín\n"}, {"Collector": "Máire Ní Raghallaigh", "Gender": "female"}, {"Language": "English"}]}}