{"4427840/4349350/4440217": {"title": "St Martin I", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0096, Page 649", "Page 649"], "url": "https://www.duchas.ie/en/cbes/4427840/4349350/4440217", "text": "\nOn the eve of St. Martin's Day it is customary to kill a fowl and sprinkle the four corners of the kitchen with its blood. They also make a cross on the door with its blood. It is said that machinery of any kind or mills should not be worked on that day as it is believed that St. Martin was ground in a mill.\n\n\n\nThis story is told in connection with St. Martin's Day.One day as the Blessed Virgin and St. Joseph were traveling they came to the house of a young gentleman and they asked the nights' lodging of him. He gave it to them and everything they asked. During the night the Blessed Virgin\n(continues on next page)\n", "school_info": "School: Baile an Daingin (C.)", "metadata": [{"Location:": "Ballindine, Co. Mayo", "Teacher:": "\nMáire de Staic\n"}, {"Collector": "Brigid Mc Manus", "Gender": "female", "Address": "Cloonmore, Co. Mayo"}, {"Informant": "Mrs Mc Manus", "Gender": "female", "Age": "53", "Address": "Cloonmore, Co. Mayo"}, {"Language": "English"}]}, "4427840/4349350/4440218": {"title": "St Martin I", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0096, Page 649", "Page 649"], "url": "https://www.duchas.ie/en/cbes/4427840/4349350/4440218", "text": "\nOn the eve of St. Martin's Day it is customary to kill a fowl and sprinkle the four corners of the kitchen with its blood. They also make a cross on the door with its blood. It is said that machinery of any kind or mills should not be worked on that day as it is believed that St. Martin was ground in a mill.\n\n\n\nThis story is told in connection with St. Martin's Day.One day as the Blessed Virgin and St. Joseph were traveling they came to the house of a young gentleman and they asked the nights' lodging of him. He gave it to them and everything they asked. During the night the Blessed Virgin\n(continues on next page)\n", "school_info": "School: Baile an Daingin (C.)", "metadata": [{"Location:": "Ballindine, Co. Mayo", "Teacher:": "\nMáire de Staic\n"}, {"Collector": "May Joyce", "Gender": "female"}, {"Informant": "Mrs Joyce", "Gender": "female", "Age": "48", "Address": "Ballyglass, Co. Mayo"}, {"Language": "English"}]}, "4427841/4349383/4440294": {"title": "Feast-Days - Saint Martin's", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0096, Page 678", "Page 678"], "url": "https://www.duchas.ie/en/cbes/4427841/4349383/4440294", "text": "\nFeast days. Saint Martin'sSaint Martin's day is on the eleventh of November. They used to kill a cock and a goose and they used to sprinkle the blood on the four corners of the house and on the door steps. That was the superstition they had. They thought that it would keep away evil and misfortune for the year. The old people used not spin wool or work a spinning wheel. They would not work a grinding mill because they said that when Saint Martin was killed he was grinded under a wheel.The old customs about Saint Martin's day are observed yet. They used to cooke the goose on Saint Martin's night. They used to cooke the cock on the evening of Saint Martin's day. That was the custom they had of cooking the fowl. Some people used not kill a goose for Saint Martin's day.Written by James Cleary, Cloonmore. Material from John Cleary, Cloonmore, aged 45 yrs.\n", "school_info": "School: Baile an Daingin (B)", "metadata": [{"Location:": "Ballindine, Co. Mayo", "Teacher:": "\nSéamus P. Ó Gríobhtha\n"}, {"Collector": "James Cleary", "Gender": "male", "Address": "Cloonmore, Co. Mayo"}, {"Informant": "John Cleary", "Gender": "male", "Age": "45", "Address": "Cloonmore, Co. Mayo"}, {"Language": "English"}]}, "4427899/4356085/4450305": {"title": "The Feast of Saint Martin", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0110, Page 363", "Page 363"], "url": "https://www.duchas.ie/en/cbes/4427899/4356085/4450305", "text": "\nIn the locality this is the way the feast of Saint Martin is observed.Some days before Saint Martin's day, which occurs on the eleventh of November, a fowl is killed and the blood is sprinkled in the four corners of the house.People believe in making this offering before the feast for they say that Saint Martin would not accept it after. People also believe that if they did not make this offering they would meet some terrible misfortune during the year. This spilling of blood is handed down to us from\n(continues on next page)\n", "school_info": "School: Baile an Bhile (C.)", "metadata": [{"Location:": "Ballinvilla Demesne, Co. Mayo", "Teacher:": "\nBríd Nic Giollachlaoin\n"}, {"Collector": "Tessie Glynn", "Gender": "female"}, {"Informant": "Patrick Glynn", "Gender": "male", "Address": "Cuiltycreaghan, Co. Mayo"}, {"Language": "English"}]}, "4428155/4382270/4451158": {"title": "St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0652, Page 187", "Page 187"], "url": "https://www.duchas.ie/en/cbes/4428155/4382270/4451158", "text": "\nThere is an old custom observed around the coasts of Waterford and Wexford in honour of St. Martin.Fishermen believe it is unlucky to go fishing on St. Martin's Day.  Therefore they never go.  Once this custom was broken with horrible results.  It happened thus: - A wonderful shoal of herrings came around the coasts.  The fishermen and their families stood out upon the beach and watched all day with wistful eyes the wealth they might not reach.  When the young fishermen saw all the fish they said they were going out to catch the fish that night.  The old men and women begged them not to go out fishing.  They young men only said they might never get a chance like it again.  The old men and women cried bitterly when they saw them leave the dock.  When the fishermen were gone out the people went to the priest and asked him to pray for them.  Just as the boats got\n(continues on next page)\n", "school_info": "School: An Pasáiste Thoir (B.), Port Láirge", "metadata": [{"Location:": "Passage East, Co. Waterford", "Teacher:": "\nProinnsias Ó Heachthigheirn\n"}, {"Collector": "Thomas Ryan", "Gender": "male"}, {"Informant": "James Mason", "Relation": "unknown", "Gender": "male", "Age": "65", "Address": "Passage East, Co. Waterford"}, {"Language": "English"}]}, "4428156/4382378/4451365": {"title": "St Martin's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0652, Page 284", "Page 284"], "url": "https://www.duchas.ie/en/cbes/4428156/4382378/4451365", "text": "\nIt is a custom in Ireland to kill a cock on Saint Martin's Night.There was a man who emigrated to America.  On St Martin's night he was very sad.  He was telling his friends that he would like to be home in Ireland, because if he were home he would kill a cock in honour of St. Martin.He went outside and he went down the street.  He met a man on a beautiful white horse.  The man asked him would he like to go home.  He said he was just wishing to be at home.  He told him to get up on the horse.  He did so and the next place he found himself was at his own door in Ireland.The man told him to come out at a certain hour.  He killed the cock and came out at the hour that he was told to do so.  The man was waiting for him at the door.  He got up on the horse and rode away.  It was said that it was St. Martin who brought him home.\n(continues on next page)\n", "school_info": "School: An Pasáiste Thoir (C.), Port Láirge", "metadata": [{"Location:": "Passage East, Co. Waterford", "Teacher:": "\nClare, Bean Uí Eachthigheirn\n"}, {"Collector": "Margaret Connors", "Gender": "female", "Address": "Passage East, Co. Waterford"}, {"Informant": "Mrs Maua Keating", "Relation": "unknown", "Gender": "female", "Age": "82", "Address": "Passage East, Co. Waterford"}, {"Language": "English"}]}, "4428156/4382388/4452318": {"title": "St Martin's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0652, Page 293", "Page 293"], "url": "https://www.duchas.ie/en/cbes/4428156/4382388/4452318", "text": "\nOn St Martin's Eve Patrick Kirby (the pilot-watch) was going home from the watch-house after keeping watch at half past eleven.  When he came near the fish house he saw three beautiful race-horses a brown one a white one and a black one.  They had very long bushy tails.  He flashed his light on them but they still remained walking.  He followed them around by the White Wall but immediately they vanished.  Patrick Kirby returned to the watch-house and remained there for the night.  At the time of the feast of St. Martin a white horse is actually seen.\n", "school_info": "School: An Pasáiste Thoir (C.), Port Láirge", "metadata": [{"Location:": "Passage East, Co. Waterford", "Teacher:": "\nClare, Bean Uí Eachthigheirn\n"}, {"Collector": "Ellen Gunnings", "Gender": "female", "Address": "Passage East, Co. Waterford"}, {"Informant": "Patrick Kirby", "Relation": "unknown", "Gender": "male", "Age": "72", "Address": "Passage East, Co. Waterford"}, {"Language": "English"}]}, "4428075/4375741/4454296": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0152, Page 411", "Page 411"], "url": "https://www.duchas.ie/en/cbes/4428075/4375741/4454296", "text": "\n(continued from previous page)\nSt Patricks well and to Croagh Patrick. They do stations at each place. It is a custom to take off your shoes when you are coming near the well. It is lucky to dig the new potatoes on Garland Sunday\n\n\n\nThe people celebrate 10th of November as Saint Martins feast day. Some people say it is not right to spin thread, or to card wool, or knit on that day, because it is unlucky, but it is lucky to cut a new suit of clothes. People beleve also that is is right to sprinkle the blood of a goose on the four corners of the house on that day. They do not sprinkle the blood like that nowaday, they only let it it stream down the floor. On that night some people go out after little birds trying to kill them. If they would kill them they would have great fun sprinkling the\n(continues on next page)\n", "school_info": "School: Coill an Gharráin", "metadata": [{"Location:": "Killacorraun, Co. Mayo", "Teacher:": "\nMícheál Ó Riagáin\n"}, {"Collector": "Eílís Ní Callacháin", "Gender": "female"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "female"}, {"Language": "English"}]}, "4428146/4381744/4457595": {"title": "St Martin's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0650, Page 149A", "Page 149A"], "url": "https://www.duchas.ie/en/cbes/4428146/4381744/4457595", "text": "\nSaint Martin's night falls on the tenth of November. There is an old Irish old saying \"naoi n-oidce agus oidhche gan áiream o oidche Shamhna go dtí oidche fheil Martan.A Martin is a delicate animal which people promise to kill and offer to saint Martin if it lives. On saint Martin's night the old people always killed some beast and offered it to the saint. The poor people that would not have large beast to kill, would kill a cock or a hen. If a farmer had a delicate animal he would promise to kill it on saint Martin's night if the animal lived. He was obliged to keep his promise. It is said that if he did not keep his promise that he would never have a days luck. My mother killed a hen last Saint Martin's night and kept the blood because it is supposed to be good for pains. Saint Martin was a very great saint. If you kept the bones of a Martin and wished for something it is said that your wish would be granted.\n(continues on next page)\n", "school_info": "School: An Chill, Dúngarbhán", "metadata": [{"Location:": "Kill, Co. Waterford", "Teacher:": "\nTomás Breathnach\n"}, {"Collector": "Sadie Mooney", "Gender": "female"}, {"Language": "English"}]}, "4428146/4381746/4457596": {"title": "Saint Martin's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0650, Page 149C", "Page 149C"], "url": "https://www.duchas.ie/en/cbes/4428146/4381746/4457596", "text": "\nSt Martin's night falls on the 10th of November. It is ten nights from amlais night. There are a great many old ceremonies carried on in some houses on that night. Next Thursday night will be Saint Martin's night. Many people kill a lamb and offer it to Saint Martin and on the door they make a cross with its blood. Other if they have a delicate cow cut the top off its ear on Saint Martin's night. When cutting it off they say that they cannot offer it up to the saint on that night. They promise that they will never sell it. but will offer it to the saint next Saint Martin's night. The beast is called a 'martin' and they deem it unlucky to sell it.My father told me he knew a man who took a 'martin' to the fair to sell. He was about to put the cow into the wagon of the train after selling her when she burst past the men who were putting her on the train. She fell on the railway line and broke her leg. The buyer said he would not then take her. The farmer took her home and\n(continues on next page)\n", "school_info": "School: An Chill, Dúngarbhán", "metadata": [{"Location:": "Kill, Co. Waterford", "Teacher:": "\nTomás Breathnach\n"}, {"Collector": "Thomas Mc Grath", "Gender": "male"}, {"Language": "English"}]}, "4427931/4358464/4457719": {"title": "St John's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0117, Page 153", "Page 153"], "url": "https://www.duchas.ie/en/cbes/4427931/4358464/4457719", "text": "\nA big bonfire is made in the evening on some hill or cross-roads. The boys and girls collect turf from the neighbouring reeks of turf or the bogs. A bone is put in the middle of the fire - (usually the bone of an animal who died during the year) The youngsters enjoy themselves dancing and singing. When leaving the bonfire each one takes a live coal home for luck. Some throw the coal into the potato field.There is a custom of jumping the bonfire, to keep diseases from the cattle during the year, others drive the cattle between two bonfires for the same reason.\n\n\n\nA cock is killed in every house and the blood spilled in the four-corners of the house and in the outshot in honour of St. Martin.This must be done between November (Night) Day and St. Martins Day.\n(continues on next page)\n", "school_info": "School: Páirc Íseal (C.)", "metadata": [{"Location:": "Lowpark, Co. Mayo", "Teacher:": "\nSorcha Ní Dhumhnaigh\n"}, {"Language": "English"}]}, "4428107/4378928/4460322": {"title": "Local Belief and Customs - 14th June, Feast of Sacred Heart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0640, Page 42", "Page 42"], "url": "https://www.duchas.ie/en/cbes/4428107/4378928/4460322", "text": "\n(continued from previous page)\n(Local Superstitions. Piscoga.The practice of witch craft must be rampant. On all sides can be heard stories and rumours of various ill-doings. The chief of these was the taking of butter.) [crossed out]walk as far as ten miles to it. It is recorded that a half-fool went to confession. The priest asked him where was God. He replied, everywhere. Then said the priest \"is He in your pocket.\" \"No\" answered the fool \"because I have no pocket.\" At this the priest struck him. The fool ran away but shouted back \"If there were a thousand of them (meaning Gods) I would not offer you one of them.\"\n\n\n\nIf lambs tails were cut on this day they would not bleed at all.\n\n\n\nFirst goose used be killed or you should draw some blood.\n", "school_info": "School: West Waterford Branch I.N.T.O", "metadata": [{"Location:": "Coshmore and Coshbride, Co. Waterford", "Teacher:": "\nJames Cashman\n"}, {"Collector": "James Cashman", "Gender": "male"}, {"Language": "English"}]}, "4428122/4380176/4463551": {"title": "Lá Fhéile Máirtín", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0644, Page 244", "Page 244"], "url": "https://www.duchas.ie/en/cbes/4428122/4380176/4463551", "text": "\nTiteann an féile seo ar an 11ú lá de Mhí Shamhna. Ba bheus coitianta ag an sean dream multachán do marbhughadh i gcóir na féile seo ach i nós go léir dá shórt, bhí an beus seo ag dul in éig de réir na mbliain.Ní bhíodh an feoil ró-fliúrseach fén dtuaidh an uair úd agus sainnt-chroí na ndaoine inti.Bhí feirmeoir áirithe agus fonn air an sean-nós do thréigint. Chuir a sheirbhísigh a gcinn i dteannta a chéile agus as san a chruthaigh cleas.Oíche nó dhó roimh an féile chuaidh duine des na cleasaidh seo an áirde ar shimné an fheirmeora seo ag teacht ar am an codlata.Bhíodar tar éis an Paidrín a rá, bhí an seirbhísig agus an feirmeoir agus iad ar an dtinteán ag caitheamh gal. nuair d'aiíodar an glór mí-shaolta, fadálach, ag túirling síos ón spéir tríd an t-simné, á rá ;Muna mharbhócidh tú an multachán dubhBeidh tú curtha fá bliain ó inniúBaineadh preab as an bhfeirmeoir go mór mhór ó leig an dream eile ortha nár d'airighdear dada.Cuireadh 'dá chois' an multachán bocht.\n", "school_info": "School: Coill Íseal, Ceapach Chuinn", "metadata": [{"Location:": "Killeeshal, Co. Waterford", "Teacher:": "\nSeán Ó Conaire\n"}, {"Collector": "Seán Ó Conaire", "Gender": "male"}, {"Language": "Irish"}]}, "4428117/4379803/4463623": {"title": "An Gobán Saor agus a Mhac", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0643, Page 004", "Page 004"], "url": "https://www.duchas.ie/en/cbes/4428117/4379803/4463623", "text": "\n(continued from previous page)\nBhí mac an Gobán Pósta agus nuair a tháinigh sé thar nais an dara lá, d'iarr a bhean de dé chúis ar chasadar. D'inis sé di conas mar a bhí. \"A Amadáin\" arsa sí \"Inis scéal nó ráiméis éigin dó. Sin é a theastaíonn uaidh\".An tríú lá chuireadar chun bóthair agus nuair a bhí tamall de'n bótharsiúlta aca. Dúirt an Gobán \"Giorraigh an bóthar a mhic\" agus thosnaigh an mac ag imirt sean-scéal éigin.D'imíodar leo ar an gcuma san gur shroiseadar áit a dtriall.\n\n\n\nDeirtear go raibh naoi n-oidhche agus oidhche gan áireamh ó oidhche Shamhna go dtí oidhche Fheil' Mhártain. Ba ghnáthach an t-am san go leór éisg a bheith á thógaint sa chuan i mBaile Mhic Códa agus comhairligh na h-iasgairí i dteannta a chéile gur b'é an feall leigeant don t-iasg dul le fán agus shocruigheadar as béal a chéile go gcaithfidís na líonta cé nár deineadh a leithéid le cuimhne aoinne riamh. B'é tuairim na ndaoine nár cheart dul ag iasgaireacht an oidhche sin. Le linn agus iad ag dul ins na báid tháinig fear ar dhrom chapaill bháin treasna na trágha agus dubhairt leó gan dul amach. Níor dhein sé acht an chainnt a rádh agus é ag gabhailt thórsta\n(continues on next page)\n", "school_info": "School: Áird Mhór,  Eóchaill", "metadata": [{"Location:": "Ardmore, Co. Waterford", "Teacher:": "\nRisteárd Neancól\n"}, {"Language": "Irish"}]}, "4428114/4379423/4464993": {"title": "Sprid", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0642, Page 205", "Page 205"], "url": "https://www.duchas.ie/en/cbes/4428114/4379423/4464993", "text": "\n(continued from previous page)\n[-]\n\n\n\nBhí bean ann fadó, agus bhí sí an naomhtha.  Gach oidhche bhíodh sí ag siubhal síos agus suas thar an roilig agus bhíodh paidrín 'na láimh aici.  Bhíodh sí gléasta in éadach dubh i gcómhnuidhe.  An oidhche seo, chuaidh sí go dtí an roilig, agus bhí sé thimcheall a t-aon bhuile déag.  Bhí fear ag teacht anuas an  Oidhche na Marbh ba eadh é.  Shíl an fear gur sprid a bhí ann, bhí guna aige agus lámhaidh sé an bhean.\n\n\n\nBhí fear ann fadó, agus bhí dúil mór aige in feoil.  Bhí 32 caoire aige, agus gach lá marbhuigeadh sé caoire agus d'itheadh sé é.  Annsan bhí gach caoire marbh acht ceann amháin agus ní leigeadh a máthair do é a marbhú.An oidhche seo chuaidh sé anáirde ar an lochta.  Oidhche Naomh Mártan ba eadh é.  Ní raibh fhios ag an máthair go raibh se anáirde ar an lochta, agus leig sé air gur Naomh Mhártan a bhí ann, 'sé an rud a dubhairt sé ná  Is misé Naomh Mártan atá annso anocht, agus muna leigidh tú dod mhach an caoire a mharbhú, geobhaidh tú bás seachtmhain\n(continues on next page)\n", "school_info": "School: Maol an Chóirne, An Rinn", "metadata": [{"Location:": "Mweelahorna, Co. Waterford", "Teacher:": "\nPilib Ó Foghlú\n"}, {"Collector": "Siobhán Ní Lonáin", "Gender": "female", "Age": "11", "Address": "Mweelahorna, Co. Waterford"}, {"Informant": "(name not given)", "Relation": "relative (other than parent or grandparent)", "Gender": "female", "Age": "58"}, {"Language": "Irish"}]}, "4428114/4379447/4465326": {"title": "Bád a Bádh", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0642, Page 227", "Page 227"], "url": "https://www.duchas.ie/en/cbes/4428114/4379447/4465326", "text": "\nD'airigh mé sgéal an oidhche fé dheire mar gheall ar bád a tháinig isteach in-aice le Baile na Gall. Maidin amháin bhí fear ag dul ag iascaireacht agus nuair a bhí sé a teacht gairid do'n mbád a bhí aige féin. Chonnaic sé rud mór amuigh sa bhfarraige. Nuair a bhí an taoide imthighthe amach tháinig sé arís agus chonnaic sé bean áluinn agus fáinní áluinne air a méireanna agus an bád timcheall míle uaite. Do bhí an bád lán de gual agus adhmad. Tógadar an bhean agus ghearradar na méireanna di chun na fáinní d'fhághailt. Bhriseadar an bád suas. Ní fheadar mé cad a dheineadh léi annsan.\n\n\n\nDo bhí féile oidhche fheil Mártan ann an oidhche fé deire. Gach oidhche Naomh Mártan mharbhuigheann na daoine rud éigint chu fuil a tharrainngt agus dá gcoimfeá an fuil sin nuair a bheadh tinneas ort agus chuid den fuil d'ól leighidfidhe tú. Ní théigheann aon báid ag iascaireacht oidhche Naomh Mártain. Bíonn oidhche Naomh Mártan againn ar an 10adh lá de Samhna. Naoi n-oidhche agus oidhche gan áireamh ó\n(continues on next page)\n", "school_info": "School: Maol an Chóirne, An Rinn", "metadata": [{"Location:": "Mweelahorna, Co. Waterford", "Teacher:": "\nPilib Ó Foghlú\n"}, {"Collector": "Máire Ní Churraoin", "Gender": "female", "Age": "13", "Address": "Ballynacourty South, Co. Waterford"}, {"Informant": "Michéal Currín", "Gender": "male", "Age": "50", "Address": "Ringville, Co. Waterford"}, {"Language": "Irish"}]}, "4427999/4366153/4467837": {"title": "Comharthaí na hAimsire - An Cnoc", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0133, Page 122", "Page 122"], "url": "https://www.duchas.ie/en/cbes/4427999/4366153/4467837", "text": "\n(continued from previous page)\n[/]\n\n\n\nDeirtear gur ceart ainmhidhe nó éan a mharbhú i gcóir Oidhche Fhéil Mártain. Marbhuigheann na daoine iad ionnus go mbeidh siad i n-ann an fhuil a dhóirteadh i gceithre coirnéil an tighe.Nuair a bhíonn siad ghá dhóirteadh deireann siad. \"Dóirtim an fhuil seo in onóir agus in umhailidheacht do Mhártan Míorúilteach.\"Bhí bean ann uair amháin agus ní raibh aon rud aici le marbhú acht bullán. D'éirigh tuile san abhainn agus ní raibh sí i n-ann\n(continues on next page)\n", "school_info": "School: Beannchor Iorrais", "metadata": [{"Location:": "Bangor, Co. Mayo", "Teacher:": "\nMícheál Mac Énrí\n"}, {"Collector": "Eibhlín Ní Mhaoilearca", "Gender": "female", "Address": "Cloontakilla, Co. Mayo"}, {"Informant": "Antoine Ó Maoilearca", "Relation": "unknown", "Gender": "male", "Address": "Cloontakilla, Co. Mayo"}, {"Language": "Irish"}]}, "4427999/4366156/4467843": {"title": "Oíche Shamhna", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0133, Page 125", "Page 125"], "url": "https://www.duchas.ie/en/cbes/4427999/4366156/4467843", "text": "\n(continued from previous page)\ntarraingeann gach duine tor cabaiste. Bíonn fear(?) an cabaiste ins an ngairdín agus buailfidh sé na fir. Teigheann siad amach ar an mbothar agus buaileann siad a chéile leo.\n\n\n\nTagann Lá Fhéil Mártain ar an deicheamhadh lá de mhí na Samhna. Tá go leor sean-ráidhte agus sean-nósaí ag na daoine i dtaobh an lá sin.Marbhuigthear ainmhidhe eicínt i gcóir Lá Fhéil Mártain. Deirtear gur ceart fuil a dhóirteadh i gceithre choirnéal an chistnigh. B'sin nos a bhí ag na sean-daoine le h-onoir a tabairt do Naomh Mártan. Leantar de'n nos sin ó shin.\n(continues on next page)\n", "school_info": "School: Beannchor Iorrais", "metadata": [{"Location:": "Bangor, Co. Mayo", "Teacher:": "\nMícheál Mac Énrí\n"}, {"Collector": "Máire Ní Shuibhne", "Gender": "female", "Address": "Attavally, Co. Mayo"}, {"Informant": "Antoine Mac Suibhne", "Relation": "unknown", "Gender": "male", "Address": "Attavally, Co. Mayo"}, {"Language": "Irish"}]}, "4427999/4366161/4467848": {"title": "Scéal", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0133, Page 130", "Page 130"], "url": "https://www.duchas.ie/en/cbes/4427999/4366161/4467848", "text": "\n(continued from previous page)\nTomás Ó MóráinÁit an BaileBeanncorr Iorrais\n\n\n\nTagann Lá Fhéil Martain ar an aonadh lá deag de Mí na Samhna. Marbhuíghtear éan no ainmhídhe i gcóir an laé sín. Dóirtear an fúil i gceithre cóirnéal an cistínígh in-onóir Naomh Mártan.Fadó ní óibrígtear na múilltí an lá sín in-onóir Naomh Martan mar is amhlaídh a marbhuígheadh é i muilleann agus seo sgeal a chúala mé í dtaobh sín.Bhí fear in-a chómhnuídhe i ngar do Baile Uí bFhiachain agus bhí muillean aige. D'óibrígh sé an\n(continues on next page)\n", "school_info": "School: Beannchor Iorrais", "metadata": [{"Location:": "Bangor, Co. Mayo", "Teacher:": "\nMícheál Mac Énrí\n"}, {"Collector": "Brighid Ní Gallchobair", "Gender": "female", "Address": "Darraragh, Co. Mayo"}, {"Informant": "Bean Uí Gallchobair", "Relation": "unknown", "Gender": "female", "Address": "Darraragh, Co. Mayo"}, {"Language": "Irish"}]}, "4427999/4366167/4467860": {"title": "Oíche Fhéile Bríde", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0133, Page 136", "Page 136"], "url": "https://www.duchas.ie/en/cbes/4427999/4366167/4467860", "text": "\n(continued from previous page)\nÁntoine Ó NearaighSh-raith-greadaigBeanncor IorraisFúair mé an t-eólas seo ó Máire Ní Nearaigh\n\n\n\nTagann Lá Fheil Martain ar an aonadh lá déag de Mí na Samhna. Marbhuíghtear éan no ainmídhe í gcóir an laé sín. Dóirtear an fhúil í gceithre coirnéal an cistínígh in-onóir Naomh Martan.Fadó ní óibríghtear na múilleanacha an lá sin in-onóir Naomh Martan mar is amhlaidh a marbhuígheadh é í muillean agus seo sgéal a chúala mé i dtaobh sín.Bhí\n(continues on next page)\n", "school_info": "School: Beannchor Iorrais", "metadata": [{"Location:": "Bangor, Co. Mayo", "Teacher:": "\nMícheál Mac Énrí\n"}, {"Collector": "Brighid Ni Gallchobhair", "Gender": "female", "Address": "Darraragh, Co. Mayo"}, {"Informant": "Bean Uí Gallachobhair", "Relation": "unknown", "Gender": "female", "Address": "Darraragh, Co. Mayo"}, {"Language": "Irish"}]}, "4428049/4372169/4468146": {"title": "St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0146, Page 144", "Page 144"], "url": "https://www.duchas.ie/en/cbes/4428049/4372169/4468146", "text": "\nSt Martins day is on Thursday the 11th November and there are many old customs and beliefs associated with this day.  The Irish people always kill a duck or a goose or a chicken.  The belief is that if they don't kill one of these birds and shed blood that the eldest one of the family will die before the year is out.  They sprinkle the blood upon the door post.  The reason why they do that we do not know.\n", "school_info": "School: Francis St., Ballina", "metadata": [{"Location:": "Ballina, Co. Mayo", "Teacher:": "\nJohn Mc Gee\n"}, {"Collector": "Eva Griffiths", "Gender": "female", "Age": "11", "Address": "Ballina, Co. Mayo"}, {"Language": "English"}]}, "4427989/4364557/4468261": {"title": "Teach Nua", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0130, Page 526", "Page 526"], "url": "https://www.duchas.ie/en/cbes/4427989/4364557/4468261", "text": "\nNuair a théigheann daoine isteach go teacah nuadh ní rachadh aoine isteach ar a chuairt chuca gan fód monadh a thabhairt isteach, agus é do chaitheamh sa teinne.Déanfaidh siad é seo cinnte gidh go raibh priontanas maith eile aca.\n\n\n\nMarbhuigheann chuile bean tighe sicín, nó coilleach oidhche Naoimh Mártan, agus craitheann sí cuid den bhfuil ar tháirsidhe an dorais, agus ar cheithre coirnéil an tighe.\n", "school_info": "School: Poll an tSómais", "metadata": [{"Location:": "Pollatomish, Co. Mayo", "Teacher:": "\nProinnsias Mac Gearailt\n"}, {"Language": "Irish"}]}, "4427982/4363704/4468789": {"title": "Oíche Mhártain", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0129, Page 225", "Page 225"], "url": "https://www.duchas.ie/en/cbes/4427982/4363704/4468789", "text": "\nOidhche MartainMarbhuigheann na duine rud eicint in onóir do Naomh Martain mar is ceart fuil do dortadh. Ní ceart aon roth a casadh an oidhche sin mar marbhuigheadh Naomh Martain i muileann.\n\n\n\nSgéalBhí fear agus bean ann fadó agus ní raibh aon clann aca acht páiste amháin. Tháinig oidhche Martain agus ní raibh tada aca a marbhú in a onóir acht an páiste agus mharbhuigh siad é.Chuir an bhean an páiste suas ins an seomra. Nuair a bhí sé tamall marbh thainic fear go dtí an doras. Bhuail sé ar an doras agus foscaileadh dó. Shiubhal sé suas chuig an teine agus d’iarr sé uirthi an raibh clann aici agus dubhairt sí nach raibh. D’iarr sé arís agus arís eile agus dubhairt an bhean nach raibh. Ar deireadh dubhairt sí go raibh acht gur marbhuigh sí in onóir do Naomh Martain é. Dubhairt an fear gurbh é féin Naomh Martain agus gur thainig sé go dtí an teach leis an páiste a dhéanamh slán aris. Nuair a fuaidh an bhean suas fuair sí an páiste beo insan seomra arís.\n", "school_info": "School: Droimslaod", "metadata": [{"Location:": "Drumsleed, Co. Mayo", "Teacher:": "\nMaire, Bean Mhic Suibhne\n"}, {"Collector": "Máire Ní Corragain", "Gender": "female"}, {"Informant": "(name not given)", "Relation": "grandparent", "Gender": "female", "Age": "92"}, {"Language": "Irish"}]}, "4427982/4363705/4468792": {"title": "Oíche Mhártain", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0129, Page 226", "Page 226"], "url": "https://www.duchas.ie/en/cbes/4427982/4363705/4468792", "text": "\nOidhche MhartainBhí fear ann fado agus ní raibh aige acht caora amháin. Thainic oidhche Mhartain agus ní raibh aige acht an chaora le marbhú. Mharbhuigh sé í agus ón lá sin go lá a bháis bhí cúpla cead caora aige.\n\n\n\nOidhche Martain bhí mart ramhar ag Martan. Bhí buachaill agus cailin aige. Fleasg sé agus roinn sé an goir agus thug sé leath don buachaill agus chuir sé faoi béal platai í. Ghoid an cailín an leat eile agus chuir sí faoi béal platai í.Thionntuigh sí pláta an buachalla agus tháinig bainne muca amac as. Thionntuigh sé pláta an chailín agus thainig luchóg amac as. Sin an fáth a bhfuil lucóga ann.\n\n\n\nOidhche NodlagBíonn coinnle lasta i gac teach oidhche Nodlag agus is é an duine is óga sa teach a lasann é. Ní itheann na daoine a t-suipéar go dtí a 12 oclock san oidhche agus ní cuireann siad na coinnle amac go dtéigheann siad as dóibh féin.\n\n\n\nLá’il Stiopáin – bíonn na buachailli beaga ag dul thart\n(continues on next page)\n", "school_info": "School: Droimslaod", "metadata": [{"Location:": "Drumsleed, Co. Mayo", "Teacher:": "\nMaire, Bean Mhic Suibhne\n"}, {"Collector": "Seamas O Dálaigh", "Gender": "male"}, {"Language": "Irish"}]}, "4427982/4363705/4468793": {"title": "Oíche Mhártain", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0129, Page 226", "Page 226"], "url": "https://www.duchas.ie/en/cbes/4427982/4363705/4468793", "text": "\nOidhche MhartainBhí fear ann fado agus ní raibh aige acht caora amháin. Thainic oidhche Mhartain agus ní raibh aige acht an chaora le marbhú. Mharbhuigh sé í agus ón lá sin go lá a bháis bhí cúpla cead caora aige.\n\n\n\nOidhche Martain bhí mart ramhar ag Martan. Bhí buachaill agus cailin aige. Fleasg sé agus roinn sé an goir agus thug sé leath don buachaill agus chuir sé faoi béal platai í. Ghoid an cailín an leat eile agus chuir sí faoi béal platai í.Thionntuigh sí pláta an buachalla agus tháinig bainne muca amac as. Thionntuigh sé pláta an chailín agus thainig luchóg amac as. Sin an fáth a bhfuil lucóga ann.\n\n\n\nOidhche NodlagBíonn coinnle lasta i gac teach oidhche Nodlag agus is é an duine is óga sa teach a lasann é. Ní itheann na daoine a t-suipéar go dtí a 12 oclock san oidhche agus ní cuireann siad na coinnle amac go dtéigheann siad as dóibh féin.\n\n\n\nLá’il Stiopáin – bíonn na buachailli beaga ag dul thart\n(continues on next page)\n", "school_info": "School: Droimslaod", "metadata": [{"Location:": "Drumsleed, Co. Mayo", "Teacher:": "\nMaire, Bean Mhic Suibhne\n"}, {"Collector": "Prionnsias Mac Manamon", "Gender": "male"}, {"Language": "Irish"}]}, "4428026/4369435/4475232": {"title": "St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0140, Page 143", "Page 143"], "url": "https://www.duchas.ie/en/cbes/4428026/4369435/4475232", "text": "\nThis falls on 10th November.A very old custom is still kept that of spilling blood for St Martin's to commerorate his martyrdom. This is done in every household before the 10th as there is an old belief that St Martin will accept the sacrifice before but not after the Eve of the 10th. It is considered that ill luck will those who do no properly observe this old custom.\n\n\n\nThis occurs at the Summer Solistice. This is called \"Bonfire Night\" each has put forth her best and most beautiful, and there is a spirit of thanksgiving in the hearts of the people.\n(continues on next page)\n", "school_info": "School: Ballycastle Boys'", "metadata": [{"Location:": "Ballycastle, Co. Mayo", "Teacher:": "\nMícheál de Búrca\n"}, {"Collector": "Dan Lenihan", "Gender": "male", "Address": "Ballycastle, Co. Mayo"}, {"Informant": "Mrs Polke", "Gender": "female", "Age": "63", "Address": "Ballinglen, Co. Mayo"}, {"Language": "English"}]}, "4480403/4365475/4480578": {"title": "Oíche Shain Mháirtín", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0131, Page 631", "Page 631"], "url": "https://www.duchas.ie/en/cbes/4480403/4365475/4480578", "text": "\nBíonn  féile Sain Mháirtín againn ar an aonmhadh lá déág de MhÍ na Samhna. Is  beag teach nach mbíonn feoil éanlaithe aca le nithe ag an suipéar ar an oidhche sin. I ngach teach tógann siad cearc nó lacha nó gé agus baintear an ceann dí agus doirtear an fhuil san ceithre cúinne de'n tighe. Fágtar an fhuil ann sin go dtí go  mbíonn sé tirm. Ithtear an fheoil oidhche Shain Mháirtín agus credieann na daoine go mbéadh an ráth ortha ar feadh na bliadhna.Ins an tsean-aimsir bhí Shain Mháirtín ag gabhail thart ar an oidhche sin agus bhí sé stiughtha leis an ocras. Sa deireadh chonnaich sé solus beag i dteach. D'imthigh sé isteach agus dhruid sé suas cois na teineadh. Thóg sé cathaoir agus shuidh sé síos. Taréis tamaill d'fhiafruigh sé biadh d'fhear an tighe agus dubhairt seisean ná raibh blas an bídh ins an dtigh.\n(continues on next page)\n", "school_info": "School: An tSraith", "metadata": [{"Location:": "Srah, Co. Mayo", "Teacher:": "\nSeán Ó Catháin\n"}, {"Collector": "Máire Ní Mhuilligh", "Gender": "female", "Address": "Srah, Co. Mayo"}, {"Informant": "Seán O Gionnachtaigh", "Gender": "male", "Address": "Bunawillin, Co. Mayo"}, {"Language": "Irish"}]}, "4562122/4561354/4569310": {"title": "Lá Fhéile Mártain", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0021, Page 0069", "Page 0069"], "url": "https://www.duchas.ie/en/cbes/4562122/4561354/4569310", "text": "\nBíonn lá Fhéile Mártain againn ar an aonadh lá déag de Mhí na Samhna. Marbhuightear gé nó lachan nó coileach nó caora. Is é coileach a marbhuightear timcheall na h-áite seo. Déantar cómhra na croise ar chúl d'en doras le cuid dá fhuil, agus sgaiptear an cuid eile in gach coirnéal de'n teach. Déantar sin in onóir na Féile.Bhí Naomh Mártan in a Easbóg sa Tours sa bhFrainnc. Bhí sé in a Easbóg nuair bhí Padraig an-óg. Ní castar na muilleann lá Mártan. Deirtear gurb é Mártan earlamh na muilneóirí.\n\n\n\nBhí long ag dul go dtí Americá uair amháin. Tháinic iasg mór millteach in a dhiaidh. Bhí faitchíos an domhain ar na daoine a bhí istigh. Chaitheadar bó amach dó. D'ith sé í. Níorbh fhada go raibh sé in a dhiaidh arís. Chaitheadar amach stól dó, agus slug sé síos é. Tháinic sé in a dhiaidh arís. Chaitheadar amach buicéad dó, agus slug sé síos é. Tháinic sé in a dhiaidh arís. Ní raibh aon rud eile aca, agus chaitheadar gasúr amach dó. Slug sé síos é. D'fhan sé in a dhiaidh go shroicheadar Americá. Chuaidh an t-iasg isteach sa talamh, agus fuair sé bás. D'fosgladar é agus chonnaiceadar an gasúr in a shuidhe ar an stól agus ag bleaghadh na bó isteach sa mbuicéad.\n", "school_info": "School: Currach", "metadata": [{"Location:": "Currylaur, Co. Galway", "Teacher:": "\nAn Bráthair Joachim\n"}, {"Collector": "Proinsias Ó Cearbhaill", "Gender": "male", "Address": "Corrofin, Co. Galway"}, {"Informant": "Seán Ó Cearbhaill", "Gender": "male", "Address": "Corrofin, Co. Galway"}, {"Language": "Irish"}]}, "4566073/4564572/4574290": {"title": "St Martin and St Michael", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0028, Page 0310", "Page 0310"], "url": "https://www.duchas.ie/en/cbes/4566073/4564572/4574290", "text": "\nSt Martin day falls on the 10th of November. There is a story told concerning him. St Martin was out walking one day and he passed by a farm-yard. He saw turkey-cocks fighting and tearing each other. He stood to see what was the cause and God revealed to him that they were possessed by evil spirits. St Martins banished the evil spirits from them and in gratitude (to Him) the people killed cocks.There was a man one time and when St Martin's night came he had nothing to eat. It was a custom to kill a cock but he had none, so instead he put\n(continues on next page)\n", "school_info": "School: Cill a' Lachtáin", "metadata": [{"Location:": "Killallaghtan, Co. Galway", "Teacher:": "\nSeosamh Ó hAllmhuráin\n"}, {"Collector": "Mary Murphy", "Gender": "female"}, {"Informant": "Mrs Julia Kelly", "Gender": "female", "Age": "70", "Address": "Ballyluoge, Co. Galway"}, {"Language": "English"}]}, "4583300/4577661/4585719": {"title": "Féile Naomh Máirtín - 11ú Lá de Mhí na Samhna", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0048, Page 0034", "Page 0034"], "url": "https://www.duchas.ie/en/cbes/4583300/4577661/4585719", "text": "\nMarbhuigheann na daoine coileach agus teigheann siad timcheall an tighe trí uaire chun an fola do dhóirteadh ar an tsráid.Marbuigheann na daoine lacha, coileach agus gé; agus itheann na daoine na trí cinn i n-aon lá amháin.Marrbhuigheann daoine eile caora i gcóir an féile.\n", "school_info": "School: Dubhras", "metadata": [{"Location:": "Doorus, Co. Galway", "Teacher:": "\nSeán Ó Mearacháin\n"}, {"Language": "Irish"}]}, "4583289/4576796/4587005": {"title": "St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0046, Page 0051", "Page 0051"], "url": "https://www.duchas.ie/en/cbes/4583289/4576796/4587005", "text": "\nSt. Martin's Day is celebrated about here on the 8th of Nov. On that day a fowl is killed and its blood spilled on the four corners of the house. On St. Martin's Day all corn mills are closed because St. Martin was ground in a corn mill.\n\n\n\nOn 23rd June there is a bone fire lighted each year. It is said why the fire is lighted is because on 22 June the Irish defeated the Danes and on the following night there was a fire lighted for joy.\n\n\n\nSt. John's Day falls on the 24th June and on the evening before a fire is lighted and a bone put into it. The young boys of a village get a bag of turf from each family and make a fire. At night a person from each house brings home a cole.\n", "school_info": "School: Gort na Gaoithe", "metadata": [{"Location:": "Windfield, Co. Galway", "Teacher:": "\nM. Ó Lócháin\n"}, {"Collector": "John Conlon", "Gender": "male", "Age": "14", "Address": "Ballinlass, Co. Galway"}, {"Language": "English"}]}, "4583330/4580201/4587638": {"title": "St Brigid's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0055, Page 0073", "Page 0073"], "url": "https://www.duchas.ie/en/cbes/4583330/4580201/4587638", "text": "\nSt Brigid's DayOn St Brigid's Day a sheaf of corn is divided in the shape of a cross. On one arm of the cross is placed a potato and on the other end you placed oats. When you are saving the potatoes you will sow this potato first and  when you are sowing the  oat you sow this first.Rita MurphyAbbeylandEyrecourtCo Galway\n\n\n\nSt Martin's DayOn St Martin's eve a cock is killed or else a goose if, there is no cock. When the cock or whatever it may be is killed the blood is sprinkled on the four corners of the out houses and on the threshold of the dwelling house. So that there may be good luck for the rest of the  year.\n\n\n\nSt. Brigid's DayOn St Brigids night a crowd of men dress up as various kinds of people and one of them dress as a woman and he carries a doll and stocking. The other men carries mouth organs, fiddles. They go around from house\n(continues on next page)\n", "school_info": "School: Cluain Fearta", "metadata": [{"Location:": "Clonfert, Co. Galway", "Teacher:": "\nC. Ó Ríoghbhardáin\n"}, {"Collector": "Eilish Reilly", "Gender": "female", "Address": "Clonfert, Co. Galway"}, {"Language": "English"}]}, "4583309/4578423/4587872": {"title": "The Tailor", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0050, Page 0185", "Page 0185"], "url": "https://www.duchas.ie/en/cbes/4583309/4578423/4587872", "text": "\n(continued from previous page)\nand nearly all knitted from home wool also. You would get home socks knitted from home spun thread also. There are four spinning wheels around this district yet, and they are used for spinning woll'                                  Marie Porter.              St Martin's DaySt Martin's day is on the 11th November. Every mill stops work until twelve o'clock on St Martins Day because St Martin was killed in a mill. In every house some fowl is killed and its blood is dashed on the doors of the out houses, and it is killed in the middle of the house. It was the custom long ago to wear high hard black hats. On St Martins day they killed a goose and keep the liver, it would cure some dicease.                       Kathleen AbbertonIt was said that the Wille Wagtail showed the jews where Our Lord was. It was the robins that picked the thorns out of Our Lords head.                        Mary Kemple.\n\n\n\nSt. Martin day is on the 11th November. Every mill stops work until twelve o'clock on St. Martins Day because St. Martin was killed in a mill. In every house some fowl is killed and its blood is dashed on the door's of the out houses, and it is killed in the middle of the house. It was the custom long ago to wear high hard black hats. On St. Martins day they killed a goose and keep the liver, it would cure some dicease.\n\n\n\nIt was said that the Willie Wagtail showed the jews where Our Lord was. It was the robin that picked the thorns our of Our Lord's head.\n", "school_info": "School: Sraith", "metadata": [{"Location:": "Srah, Co. Galway", "Teacher:": "\nSéamus E. Ó Dubhghaill\n"}, {"Collector": "Kathleen Abberton", "Gender": "female"}, {"Language": "English"}]}, "4583309/4578438/4587953": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0050, Page 0200", "Page 0200"], "url": "https://www.duchas.ie/en/cbes/4583309/4578438/4587953", "text": "\nOn St. Martins Day they do not work in the mill because St Martin was a miller. On St Martins Day some people kill a lamb and eat it. Long ago the men wore high, black hats. It was a custom long ago when a person would be dead to get four men of the same name to carry the coffin.\n\n\n\nLong ago candles were made from tallow. The tallow was made from the fat of the goat. They had a mould for making the candles in. They put a wick in the centre of the mould. They melted the tallow and left it to sit. They made mugs from timber. They called them nagans.\n(continues on next page)\n", "school_info": "School: Sraith", "metadata": [{"Location:": "Srah, Co. Galway", "Teacher:": "\nSéamus E. Ó Dubhghaill\n"}, {"Collector": "Mary Kemple", "Gender": "female"}, {"Language": "English"}]}, "4583338/4580890/4588178": {"title": "St Martin", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0057, Page 0057", "Page 0057"], "url": "https://www.duchas.ie/en/cbes/4583338/4580890/4588178", "text": "\nSt Martin's Day is on the 11th November. There are many customs done in honour of St. Martin. Everybody kills a cock or goose for St Martin's Day. If a person had a sick beast long ago it was a custom to cut his ear and kill him for St Martin's Day if he lived. A mill is never worked before twelve o'clock on St Martin's Day. Some people do not work horses before twelve o'clock also.Information from Mary MolloyAged 83 yrs 1938Born inGragakilleenPortumnaCo. Galway,21st - 11- 1938\n", "school_info": "School: Gort an Iomaire", "metadata": [{"Location:": "Gortanummera, Co. Galway", "Teacher:": "\nLiam Sabhaois\n"}, {"Collector": "Mary Molley", "Gender": "female", "Address": "Portumna, Co. Galway"}, {"Informant": "Mrs Molloy", "Gender": "female", "Age": "83", "Address": "Portumna, Co. Galway"}, {"Language": "English"}]}, "4583273/4575546/4591311": {"title": "St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0040, Page 0227", "Page 0227"], "url": "https://www.duchas.ie/en/cbes/4583273/4575546/4591311", "text": "\nFowl are killed before and on St Martin's day. This is done to honour him because on that day he died. The people say that a cock is the right thing to kill.Many stories are told about St Martin. Once when he was going to fight in the battle field, he met a man as he went in the gate. This man was hungry and badly clothed. St Martin stood talking to him and took pity on him to see that he was so badly clothed. He had nothing to give him, neither money nor a charity, so he took off his cloak and tore it in two halves and wrapped one half of it around the poor man. There were officers passing by and they did not pretend to see him.St Martin left the man and went in to the battle field and all the people were laughing about him to see what he had done to\n(continues on next page)\n", "school_info": "School: Fearth Mór (Brooklawn)", "metadata": [{"Location:": "Fartamore, Co. Galway", "Teacher:": "\nTreasa, Bean Mhic Aonghusa\n"}, {"Collector": "Máire Búrca", "Gender": "female"}, {"Informant": "Martin Burke", "Gender": "male", "Address": "Lehid, Co. Galway"}, {"Language": "English"}]}, "4583331/4580254/4591711": {"title": "Festival Customs - St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0055, Page 0126", "Page 0126"], "url": "https://www.duchas.ie/en/cbes/4583331/4580254/4591711", "text": "\nSt. Martin's dayIt is the custom to kill a cock for St. Martin's day and to shake the blood in the four corners of the house. People never thresh on the first half of St Martin's day as he was supposed to have been  killed by a threshing engine. The feast falls on November 11.\n", "school_info": "School: Baile Mór Síl Anmchadha (Laurencetown)", "metadata": [{"Location:": "Laurencetown, Co. Galway", "Teacher:": "\nSeán Ó Cogaidhín\n"}, {"Language": "English"}]}, "4591098/4590703/4593036": {"title": "St Martin's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0015, Page 279", "Page 279"], "url": "https://www.duchas.ie/en/cbes/4591098/4590703/4593036", "text": "\nIt is an old custom for the Irish people to kill a fowl and spill the blood in the four corners of the house in honour of St Martin. All the children look forward to the great feast.Some people light a blessed candle and set it in the centre of the table while they are eating the fowl and saying the Rosary afterwards to show light to any deceased member of the family who might be suffering in darkness.\n", "school_info": "School: Na Creaga", "metadata": [{"Location:": "Creggs, Co. Galway", "Teacher:": "\nLiam Ó Breandáin\n"}, {"Collector": "Kathleen Coen", "Gender": "female", "Address": "Millford, Co. Galway"}, {"Informant": "Mrs Coen", "Gender": "female", "Address": "Millford, Co. Galway"}, {"Language": "English"}]}, "4591098/4590707/4593040": {"title": "St Martin's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0015, Page 283", "Page 283"], "url": "https://www.duchas.ie/en/cbes/4591098/4590707/4593040", "text": "\nIt is a custom of the Irish people to kill something in honour of St Martin. Some people kill a fowl and sprinkle its blood in the four corners of the house. This blood is supposed to keep away all harm for twelve months.Then those who can afford it kill a sheep but anyting in this life will do providing you kill it in honour of St Martin. There is a story of St. Martin's goodness.Once and Irish man was put into prison for some small reason. It happened to be coming on to St Martin's night. Now this poor man felt very lonely in his prison cell especially when he thought of St Martin. So he asked the Warder of the would\n(continues on next page)\n", "school_info": "School: Na Creaga", "metadata": [{"Location:": "Creggs, Co. Galway", "Teacher:": "\nLiam Ó Breandáin\n"}, {"Collector": "Desmond Clifford", "Gender": "male", "Address": "Creggs, Co. Galway"}, {"Informant": "William Nicholson", "Gender": "male", "Address": "Creggs, Co. Galway"}, {"Language": "English"}]}, "4583350/4581983/4606184": {"title": "Story about St Martin", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0059, Page 0420", "Page 0420"], "url": "https://www.duchas.ie/en/cbes/4583350/4581983/4606184", "text": "\nWhen St. Martin lived on earth he was miller. He was a very holy man. One year no rain fell and the crops were dying. St Martin had large fields of corn which was withering without water. One day he and his men went out to water the corn. When he was out a holy man came in and asked the woman of the house for some bread. She was making a cake and she said she had no bread. He told her to give him a bit of the raw dough. She did so and he put the dough in the oven over the fire. The he disappeared. When she went to the oven to put in the cake she had been making, there was grass-corn growing up through the cake in the oven. She was much frightened and she sent for her husband. When he saw what had happened he said that it was not right to be putting water on the corn but to wait and God would sent rain. This man\n(continues on next page)\n", "school_info": "School: An Aill (Aille)", "metadata": [{"Location:": "Aille, Co. Galway", "Teacher:": "\nMaitiú Ó Críocháin\n"}, {"Collector": "Mary Dillon", "Gender": "female", "Address": "Kylebrack, Co. Galway"}, {"Informant": "Mrs Bridget Dillon", "Relation": "parent", "Gender": "female", "Age": "50", "Address": "Kylebrack, Co. Galway"}, {"Language": "English"}]}, "4602669/4594061/4614921": {"title": "Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0001, Page 432", "Page 432"], "url": "https://www.duchas.ie/en/cbes/4602669/4594061/4614921", "text": "\nPan-cakes are made that night.  Chalk-Sunday- (l) Bachelors are chalked on chalk-Sunday.May Day- Crops are supposed to be brought on a May morning.\n\n\n\nFowl are killed for St Martin and the blood is sprinkled in the four corners of the house.  St John's Day.  Bon-fires are lighted at every cross-roads.Halloween- People dive for apples and play games on Halloween.During the three big festivals of Christmas Candles are lighted on the windows.Twelve candles or \"Dips\" are lighted.\n(continues on next page)\n", "school_info": "School: Breac-chluain", "metadata": [{"Location:": "Brackloon, Co. Galway", "Teacher:": "\nLiam Ó Seachnasaigh\n"}, {"Collector": "Mary Hurley", "Gender": "female"}, {"Language": "English"}]}, "4613682/4608125/4623282": {"title": "Lá Fhéile Mártain", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0018, Page 247", "Page 247"], "url": "https://www.duchas.ie/en/cbes/4613682/4608125/4623282", "text": "\nNaoi n-oidhche, dhá oidhche gan aire (áireamh) ó oidhche Shamhna go oidhche Mártan. Marbhuight(h)ear éan in onóir ga’n Dhomhnach ‘s go Mhárt is go bhainríoghain naomhtha na mbolgaigh. Dóirteann siad an fhuil ar an urlár le gach galra is dochar a choinneál uatha i rith na bliadna atá ag teacht. Tugann an duine a mbeidh coileach aige ceann do’n té nach mbeidh ceann aige leis an fhuil a dhórtadh lá’l Mártan. Bhí bean ann uair amháin a raibh a fear caillte. Ní raibh éan aici le marbhú le h-aghaidh oidh’l Mártan. Ní raibh aici acht an leanbh a bhí sa gcliabhán agus bhí brón uirthi nuair nach raibh aon cheo aici le marbhú in onóir do Naomh Mártan. Chuimhnigh sí ar an leanbh agus dhóirt sí a chuid fola. Bhí an oiread sin grádh ag Dia di nuair a rinne sí sin gur thug Sé an páiste ar ais di agus rinne sé fear mór.\n", "school_info": "School: Leath-bhaile", "metadata": [{"Location:": "Levally, Co. Galway", "Teacher:": "\nSéamus Ó Maoldhomhnaigh\n"}, {"Collector": "Domhnall Pléamonn", "Gender": "male", "Address": "Cartron, Co. Galway"}, {"Informant": "Domhnall Pléamonn", "Relation": "grandparent", "Gender": "male", "Age": "80"}, {"Language": "Irish"}]}, "4583360/4583061/4623918": {"title": "Oíche Fhéile Mártain", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0062, Page 0134", "Page 0134"], "url": "https://www.duchas.ie/en/cbes/4583360/4583061/4623918", "text": "\nBa Naomh mór a bhí in Naomh Máirtín. As an bhFrainnc dó. Saighdiúr airm abhí ann i dtús a shaoghail acht ba saighdiúr le Críost abhí ann ar a dheireadh. Bhí sé 'na Easpog.Aon lá amháin bhí sé ag siubhal an bóthar agus casadh fear dhó agus ní raibh air ach giobail agus é ag creachadh leis an bhfuacht. Ghlac Máirtín an oiread de truaigh dhó is go ndeárna sé dhá leath dá chlóca is go dtug sé leath do'n bhochtán. Choinnigh an t-éadach sin an fuacht uaidh. An oidhche sin bhí Máirtín ag brionglóidí go bhfaca sé Ár Tighearna is an leath chlóca dhá a thug sé do'n fhear bocht air.Tugtar onóir mhór do Naomh Máirtín sa taobh tíre seo agus tarraingeann gach duine fuil in onóir dó. Is roimh an bhféile a tharraingeann gach duine an fhuil mar deirtear nach nglacann Máirtín le aon fhuil a tharrnuightear thar éis an fhéile Naomh Máirtín acht glacann sé lé gach nidh a mharbhuightear dhó roimh an bhféile. Is sean fhocal é \"Glacann Mártan chuile shórt roimhe Acht ní ghlacann le aon rud na dhiaidh.\".Marbhuigheann gach duine caora nó gé nó cearc nó lacha nó rud écint dhó Mhártain agus cuireann an té a mharbhuigheann an rud ar dtús crosóg ar a bhaithis leis an bhfuil is cuireann gach duine annsin den líon tighe crosóg air féin mar a gcéadhna agus deireann siad san am céadna:-\"Iarraim ar Mhártan Míorbhúilteach muid a thárrtháil is a chur ar ár leas, is go mbeirimíd beó ar Fhéil Mhártain aríst.\"\n", "school_info": "School: An Tulach", "metadata": [{"Location:": "Tully, Co. Galway", "Teacher:": "\nTadhg Ó Séaghdha, Máire, Bean Uí Dhuigneáin\n"}, {"Collector": "Áine Ní Fhágharta", "Gender": "female", "Age": "13", "Address": "Ballynahown, Co. Galway"}, {"Language": "Irish"}]}, "4613673/4607260/4624330": {"title": "Lá Fhéile Naomh Máirtín", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0016, Page 366", "Page 366"], "url": "https://www.duchas.ie/en/cbes/4613673/4607260/4624330", "text": "\nThuiteann Lá Fhéile Naoimh Mhairtín ar an deicmheadh lá dé mí na Shamna. Ar an lá sin bíonn féasta mór ag gach duine in onóir do Naomh Mhairtín mar an lá sin a fuair sé bás.Marbhuigheann gach aoinne coileach ar an lá sin agus doirtear fhuil i ngach cúinne den teach. Déantar crois ar an dhoras le fhuil ar choiligh cuirtear cean an choiligh suas i dtaobháin an tige.\n", "school_info": "School: Cill Cruain (C)", "metadata": [{"Location:": "Ballyglass South, Co. Galway", "Teacher:": "\nBrighid Ní Náradaigh, Cáit Bean Uí Standúin\n"}, {"Collector": "Cait Ní Gríobhtha", "Gender": "female", "Address": "Bracklagh, Co. Galway"}, {"Language": "Irish"}]}, "4613698/4609817/4625258": {"title": "Oíche Naomh Mártan", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0066, Page 005", "Page 005"], "url": "https://www.duchas.ie/en/cbes/4613698/4609817/4625258", "text": "\nOidhche, do bhí ann fadó, fadó ariamh, bhí fear ina chomhnuidhe I gComanara  agus bhí sé pósta agus bhí páistí aige. Bhí sé bocht agus ní raibh sé indon iad do thogáilt, acht séard do chuimhne sé air, capall a ghoid agus é do dhíol. Rugadh air, ag an aonach agus chuir siad an capall abhaile go dtí an athtornaigh chun é do chonbhghaile go dtí lá na cuirce.Oidhche do bhi ann agus d’éaluigh an athtornaigh go dtí teach an fhir agus thug sé an capall leis, agus dubhirt sé leis a rádh le na daoine lá na cuirte gur uaidh fein a ghoid sé é. Chuimhnigh sé ar rud nual eile, bháin sida crudh amháin d’en chapall agus sgríobh siad ainm an athtornaigh ar an gcrúdh. Thainig lá na céirce annsin agus thug siad an capall go dtí an chúirt an lá sin, ag docheistnuigheadar an fear. Do bhreathnúgheadar ar an gcapall\n(continues on next page)\n", "school_info": "School: An Léim", "metadata": [{"Location:": "Leam East, Co. Galway", "Teacher:": "\nM. Ó Dubhda\n"}, {"Collector": "Cáit Breathnach", "Gender": "female", "Age": "13", "Address": "Leam West, Co. Galway"}, {"Informant": "Bean an Bhreathnaigh", "Relation": "parent", "Gender": "female", "Occupation": "feirmeoir", "Address": "Leam West, Co. Galway"}, {"Language": "Irish"}]}, "4613703/4610380/4625339": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0067, Page 137", "Page 137"], "url": "https://www.duchas.ie/en/cbes/4613703/4610380/4625339", "text": "\nNuair a thagann Féil Mártan i Mí na Samhna, marbhuigheann bean an tighe coileach óg no dhá coileach. Go minic bíonn na coileacha sin gortha ó'n Márta roimhe sin agus tugtar coileacha Mártan ortha, mar gealtar go Naomh Maírtín iad. Dóirteann bean an tighe fuil na gcoileach i n-aice an dorais. Annsin tagann gach duine de mhuinntir an tighe agus cuireann siad a n-ordóg ins an bhfuil agus déanann siad comhartha na croise ar a mbaithis leis. Fágann siad annsin é no go n-imthigheann sé uaidh féin. Annsin glantar na coiligh agus baintear asta agus bruithtear iad i gcóir an t-suipéar, ithtar an fheóil agus óltar an t-an-bhruith.Ta sean-rád ann a deireann Tógfaidh Mairtín a chuid am    ar bith roimh an Féile acht ní thógfaidh sé ina dhiad sin é.Mícheál BreathnachGort-na-gCruachRoscathail\n", "school_info": "School: Ros Cathail (Buachaillí)", "metadata": [{"Location:": "Rosscahill, Co. Galway", "Teacher:": "\nMícheál Mac Donnchadha\n"}, {"Collector": "Mícheál Breathnach", "Gender": "male", "Address": "Gortnagroagh, Co. Galway"}, {"Language": "Irish"}]}, "4613695/4609538/4625987": {"title": "Origin of St Martin's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0065, Page 145", "Page 145"], "url": "https://www.duchas.ie/en/cbes/4613695/4609538/4625987", "text": "\nSt Martin and his mother and father lived in a small-thatched house on the side of a hill. His father died when he (St Martin) was three years old. After his father's death St Martin and his mother, used to pray for three hours every day and they loved our Lord. On the 11th November St Martin used to shed blood for our Lord. And when he was dying his last request was that everyone was to shed blood for him on the 11th November.\n\n\n\nThere as an English man who owned some mills in Ireland long ago. He was an awful tyrant and it was the custom in Ireland even at that time that no mill-wheel should be turned on St Martin's day. When the day came on he told all his hands to go to work; but they refused. They reminded him of the Irish custom, but they could not convince him so he ordered their dismissal or get to work.The went to work and in a few minutes the whole mill was on fire; so they all ran to the English man's office close by. The hens used to roost about his office. The caw flew down and perched on the English man's head and began to crow\n(continues on next page)\n", "school_info": "School: Inis Mac ón Tír", "metadata": [{"Location:": "Inishmicatreer, Co. Galway", "Teacher:": "\nMuireann Bean Uí Chuinneagáin\n"}, {"Collector": "Annie Faherty", "Gender": "female"}, {"Informant": "Maggie Faherty", "Relation": "relative (other than parent or grandparent)", "Gender": "female"}, {"Language": "English"}]}, "4613695/4609538/4625988": {"title": "Origin of St Martin's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0065, Page 145", "Page 145"], "url": "https://www.duchas.ie/en/cbes/4613695/4609538/4625988", "text": "\nSt Martin and his mother and father lived in a small-thatched house on the side of a hill. His father died when he (St Martin) was three years old. After his father's death St Martin and his mother, used to pray for three hours every day and they loved our Lord. On the 11th November St Martin used to shed blood for our Lord. And when he was dying his last request was that everyone was to shed blood for him on the 11th November.\n\n\n\nThere as an English man who owned some mills in Ireland long ago. He was an awful tyrant and it was the custom in Ireland even at that time that no mill-wheel should be turned on St Martin's day. When the day came on he told all his hands to go to work; but they refused. They reminded him of the Irish custom, but they could not convince him so he ordered their dismissal or get to work.The went to work and in a few minutes the whole mill was on fire; so they all ran to the English man's office close by. The hens used to roost about his office. The caw flew down and perched on the English man's head and began to crow\n(continues on next page)\n", "school_info": "School: Inis Mac ón Tír", "metadata": [{"Location:": "Inishmicatreer, Co. Galway", "Teacher:": "\nMuireann Bean Uí Chuinneagáin\n"}, {"Collector": "James Egan", "Gender": "male"}, {"Informant": "Thomas Egan", "Relation": "parent", "Gender": "male"}, {"Language": "English"}]}, "4613696/4609550/4626002": {"title": "Scéal", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0065, Page 156", "Page 156"], "url": "https://www.duchas.ie/en/cbes/4613696/4609550/4626002", "text": "\n(continued from previous page)\nmháighistir cáca dhó. Nuair a tháinig sé abhaile níor aithnigh a mhuinntir é agus d'innis sé dhóibh cér'bh é féin agus bhí fáilte mór aca roimhe. Thóg sé amach an cáca agus ghearr a mháthair é agus fuair sí an méid airgid a bhí saothruighthe aige astigh i lár an cáca. Nuair a fuair sí é níor dhubhairt sí tada ach choinnigh sí é. D'imthigh an fear arais go Americá aríst mar níor fhuair sé an t-airgead ó'n a mháthair agus níor tháinig sé arais aríst.\n\n\n\nSaint Martin's day is kept on the eleventh of November. The feast is kept in many ways. It is a custom with most of the people to kill fowl for that day, and to make the sign of (that) the Cross on their foreheads with the blood of the fowl.Another custom also is to sprinkle the blood of the fowl on the doors. Saint Martin's day is a holiday of Obligation in America and France but not in Ireland. He is called St. Martin of Tours.\n", "school_info": "School: Uachtar Árd", "metadata": [{"Location:": "Oughterard, Co. Galway", "Teacher:": "\nAn tSr M. S. Iognáid\n"}, {"Collector": "May Fahy", "Gender": "female", "Address": "Oughterard, Co. Galway"}, {"Language": "English"}]}, "4613696/4609551/4626003": {"title": "Saint Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0065, Page 157", "Page 157"], "url": "https://www.duchas.ie/en/cbes/4613696/4609551/4626003", "text": "\nSaint Martin's Day falls on the 10th of November.  On that day it is an old custom to kill a cock and to spill the blood of the cock on the step of the door. People also put it on their foreheads.We are told that on that day when a cock was boiling in the pot, he lifted the lid, jumped up on the floor and began to crow and said \"Mac na h-Óige slán.\"  On that account we celebrate that day.\n\n\n\nA StoryThere once lived a man who had a son called Thomas.  One evening his son got very sick and the father had to spend the night up minding him. Next day was market day here and he came up to sell his stock.  He sold them and got ready for home. When he was within a mile and half of his home he lost his way.  The donkey and cart went home and the man went the opposite way.  He wandered away until the reached\n(continues on next page)\n", "school_info": "School: Uachtar Árd", "metadata": [{"Location:": "Oughterard, Co. Galway", "Teacher:": "\nAn tSr M. S. Iognáid\n"}, {"Collector": "Treasa Ní Fhlannchadha", "Gender": "female", "Address": "Oughterard, Co. Galway"}, {"Language": "English"}]}, "4602726/4598694/4628472": {"title": "St Martin's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0190, Page 260", "Page 260"], "url": "https://www.duchas.ie/en/cbes/4602726/4598694/4628472", "text": "\nOn St. Martin's Night which falls on the            every year people kill some fowl. This custom is carried out because St. Martin was put to death for the Faith.Blood is spilled then to put us in mind of this Martyr. It is said if we did not kill some fowl some of our own cattle would die during the year.\n", "school_info": "School: Cloonty", "metadata": [{"Location:": "Cloonty, Co. Leitrim", "Teacher:": "\nMichael Mac Gowan\n"}, {"Collector": "Kate Gallagher", "Gender": "female", "Address": "Coolagraffy, Co. Sligo"}, {"Language": "English"}]}, "4622964/4617705/4628488": {"title": "Féilte - Lá Fhéile Mártan", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0069, Page 684", "Page 684"], "url": "https://www.duchas.ie/en/cbes/4622964/4617705/4628488", "text": "\nTagann Lá Fhéile Martán ar an 11adh de Samhan. Is iomdha nós ag baint leis an lá sin. Sa trathnóna cuireann na daoine teine mór síos. Marbhuightear rud éicin i ngach teach, cearc nó gé nó lacha agus cuireann chuile dhuine crois ar fhéin leis an bhfuil agus deirtear nach ceart an fhuil a chaitheamh amach an oidhche sin. Bíonn an fheol ithte sul dá mbíonn sé an dó dhéág.Duine ar bith a beirtear timcheall an ama sin Mártan an t-ainm a bhéas air.\n(continues on next page)\n", "school_info": "School: Ros Muc", "metadata": [{"Location:": "Rosmuck, Co. Galway", "Teacher:": "\nStiofán Ó hOisín\n"}, {"Collector": "Marcus Ó Conaire", "Gender": "male", "Address": "Roskeeda, Co. Galway"}, {"Informant": "Pádraig Ó Conaire", "Gender": "male", "Age": "50", "Address": "Roskeeda, Co. Galway"}, {"Language": "Irish"}]}, "4622964/4617713/4628506": {"title": "Lá Fhéile Mártain", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0069, Page 692", "Page 692"], "url": "https://www.duchas.ie/en/cbes/4622964/4617713/4628506", "text": "\nTagann lá Fhéile Mártan ar an 4adh Mí na Samhna. Tá cuid mhaith nósanna agus béasa ag baint leis an oidhche seo acht tá cuid mhaith aca básuighthe amach anois. Seo cuid de na nósanna a chleachtuigheann siad san gceanntar seo fós, marbhuigheann siad gé agus bárdal agus cuireann siad i mias é i lár an urláir agus faghann siad sguabh beag agus craitheann siad an fhuil ortha fhéin agus ar crúidhte chapaill.Bhíodh an nós seo aca fadó ach tá sé básuighthe amach anois ach ag corr dhuine ar fud na háite\n(continues on next page)\n", "school_info": "School: Ros Muc", "metadata": [{"Location:": "Rosmuck, Co. Galway", "Teacher:": "\nStiofán Ó hOisín\n"}, {"Collector": "Máire Ní Mháille", "Gender": "female"}, {"Informant": "Colm Ó Máille", "Gender": "male", "Age": "44", "Address": "Roskeeda, Co. Galway"}, {"Language": "Irish"}]}, "4622968/4618226/4628646": {"title": "Féilí na Bliana - Lá Fhéile Mártain", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0071, Page 053", "Page 053"], "url": "https://www.duchas.ie/en/cbes/4622968/4618226/4628646", "text": "\nMarbhuigheann chuile dhuine caora an oidhche sin. Cuireann siad crosóg ar a inbaithis(?) leis an bhfuil. Bhí Mac Dé agus   Naomh Peadar ag dul thart agus tháinig siad isteach i dteach bocht. Ní raibh aon bhlas aca le tabhairt dóibh. Dubhairt Naomh Peadar le Mac Dé rud eicínt a dhéanamh leis na daoine bochta. Blian ón lá sin bhí síad ag dul thart aríst. Bhí siopa agus deis agus beithidhigh aca. Bhí síad na ndaoine móra.  Bhí Mac Dé agus Naomh Peadar an stroiche agus bocht.  D'iarr síad braon tae. Ní bhfuigheadh siad é. Chuaidh an bhean ag breathnughadh ar an gcáca ach ní raibh aon cháca sa mbácús. Ní raibh a fhios aice céard a bhí sí a dhéanamh. Dubhairt sí le Mártan eirthige(?)  a chur ar na fir. Dubhairt Naomh Peadar    gurbh é Mac Dé a  bhí ann a rinne chomh maith sin íad. Nuair a chuala Martan sin chuir sé a chuid searbhónta amach  ag marbhughadh caora. Rinneadar féasta móir.  Bíonn féasta ag na daoine ariamh ó shoin in-onóir do Fhéile Mártan.\n", "school_info": "School: An Druim", "metadata": [{"Location:": "Drim, Co. Galway", "Teacher:": "\nMicheál Ó Concheanainn\n"}, {"Language": "Irish"}]}, "4622994/4621845/4628926": {"title": "St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0078, Page 048", "Page 048"], "url": "https://www.duchas.ie/en/cbes/4622994/4621845/4628926", "text": "\nSt Martin's Day  November 8th 1938Every St. Martin's day always falls on the 11th November. It is an old custom in this district that every one kills some sort of fowl for that day. When they kill the fowl they sprinkle the blood in the four corners of the kitchen and they also sprinkle the blood in the corners of the out-houses. They kill the fowl any day from the 2nd November until the 11th November. They women cookes a lot of meat for that day and everybody in the district have a feast on that day.Michael Keane,Castleblakeney,Co. Galway,\n", "school_info": "School: Gallach", "metadata": [{"Location:": "Gallagh, Co. Galway", "Teacher:": "\nBean Uí Mhaoiléidigh\n"}, {"Collector": "Michael Keane", "Gender": "male", "Address": "Castleblakeney, Co. Galway"}, {"Language": "English"}]}, "4622972/4618977/4629224": {"title": "Féilí na Bliana - Lá Fhéile Mártan", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0072, Page 242", "Page 242"], "url": "https://www.duchas.ie/en/cbes/4622972/4618977/4629224", "text": "\nLá le Mártan.1. Tagann lá le Mártan ar an 10adh de Mhí na Samhna. Ar an lá sin tarraingheann na daoine fuil in ónóir Mhártan agus cuireann gach duine san teach crois ar chlár a éadán leis an bhfuil an lá sin. Marbhuigheann na daoine gé nó lacha nó caora agus déanann siad saoire de lá le Mártan san áit seo.2. Bíonn lá le Mártan ann ar an 10adh de Mhí na Samhna. Marbhuigheann na daoine caoirig in ónóir do Naomh Mártán. Bhí bean ann fadó\n(continues on next page)\n", "school_info": "School: Tír an Fhiaidh", "metadata": [{"Location:": "Teeranea, Co. Galway", "Teacher:": "\nAn tSr. M Benín\n"}, {"Collector": "Nora Ní Maille", "Gender": "female"}, {"Informant": "Micheal Breathanach", "Gender": "male"}, {"Language": "Irish"}]}, "4602708/4597376/4631234": {"title": "Féile Mhártain", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0082, Page 224", "Page 224"], "url": "https://www.duchas.ie/en/cbes/4602708/4597376/4631234", "text": "\nM. de Búrca as Cruim-ghlinn do sgríobh.Naoí n-oidhche lá fhéil Mártan. Mártan mór  na Mart a tugtar ar Mártan.Bhí fear ann úair amháin agus bhí sé pósta. Bhí mac amháin aige. Cailleadh a bhean agus pós sé aríst. Bhí nós ag an bhfear seo muc a mharbhúghadh chuile bhliadhain i nonóir don fhéile ach ní thuíbhrfad an bean seo cead dó agus ní caitheadh sí go maith leis an leas-mhac. Tar éis tamaill bhí mac óg  aice fhéin. On Féil Mártan dár gcionn chúaidh an leas-mhac ag an doras dúnta agus bhúail sé air. Dfíofruígh an leas-mhátair cé bhí ann. Ar's an leas-mhac\"Is mise Mártan na mart,Agus ar mo shon ithtear feóil\"Agus muna marbóchaidh tú an mhuc mór bhreacMarbhótaídh mise Mártan Óg.Sgannruígheadh an leas-mháthair agus cuir sí fios ar a bhfear an muc a mharbhúghadh agus uaidh sin amach marbhuíghtí in n-onóir do'n fhéile.\n", "school_info": "School: Cromghlinn (B)", "metadata": [{"Location:": "Crumlin, Co. Galway", "Teacher:": "\nSeán Ó Donnchadha\n"}, {"Collector": "Micheál C. de Búrca", "Gender": "male", "Address": "Crumlin, Co. Galway"}, {"Language": "Irish"}]}, "4602714/4597894/4631715": {"title": "Féile Mártain", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0084, Page 054", "Page 054"], "url": "https://www.duchas.ie/en/cbes/4602714/4597894/4631715", "text": "", "school_info": "School: Ballygar (C)", "metadata": [{"Location:": "Ballygar, Co. Galway", "Teacher:": "\nEithne, Bean Uí Liatháin\n"}, {"Collector": "Eithne Bean Uí Liatháin", "Gender": "female"}, {"Language": "Irish"}]}, "4602740/4599984/4632821": {"title": "Festival Customs - St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0195, Page 057", "Page 057"], "url": "https://www.duchas.ie/en/cbes/4602740/4599984/4632821", "text": "\nSaint Martin's day is on 11th of November every year.  It is also called \"Old Hallowe'en.\"  It is a custom to kill a fowl on that night and throw the head of it across the roof, and while doing this bless yourself.On Saint Martin's night hang a head of cabbage from the ceiling and the first person who would come in, whatever his christian name is you would get married to the person with that name.\n", "school_info": "School: Coillte Clochair (C.)", "metadata": [{"Location:": "Kiltyclogher, Co. Leitrim", "Teacher:": "\nSorcha Ní Mhuireagáin\n"}, {"Collector": "Mary Dolan", "Gender": "female", "Address": "Kiltyclogher, Co. Leitrim"}, {"Informant": "Mr T. Mc Guinness", "Gender": "male", "Age": "75", "Address": "Kiltyclogher, Co. Leitrim"}, {"Language": "English"}]}, "4613725/4613176/4643701": {"title": "St Martin's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0409, Page 128", "Page 128"], "url": "https://www.duchas.ie/en/cbes/4613725/4613176/4643701", "text": "\nThere is a story told about a woman who went out to spill blood on St. Martin's night. She left the child sleeping in the cradle, and while she was out the child got burned and died. She stayed up on the hearth long side her child that\n(continues on next page)\n", "school_info": "School: Dromclough (C.),", "metadata": [{"Location:": "Kilcarra Beg, Co. Kerry", "Teacher:": "\n-\n"}, {"Language": "English"}]}, "4613717/4611917/4643926": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0406, Page 175", "Page 175"], "url": "https://www.duchas.ie/en/cbes/4613717/4611917/4643926", "text": "\n(continued from previous page)\nthe man out. The man said he would go across whatever would happen. The little man threw another clod at the man and it met him in the eye. The man went home. His sister was dead. A piece after himself got blind and he died not long after. They say it was the fairies that came for him.\n\n\n\nMartin King used kill a fowl every St Martin's night in honour of St Martin. One year Martin forgot it and when he awoke in the morning the floor from\n(continues on next page)\n", "school_info": "School: Cluain Meacan", "metadata": [{"Location:": "Cloonmackon, Co. Kerry", "Teacher:": "\nLiam Ó Catháin\n"}, {"Collector": "Eileen Donegan", "Gender": "female", "Address": "Knockane, Co. Kerry"}, {"Informant": "Joe Shanahan", "Gender": "male", "Address": "Dromin, Co. Kerry"}, {"Language": "English"}]}, "4605938/4604024/4645166": {"title": "St Martin's Eve - 11th November", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0204, Page 315", "Page 315"], "url": "https://www.duchas.ie/en/cbes/4605938/4604024/4645166", "text": "\nOn St Martin's eve the blood of some living thing is spilled. A goose is generally what is killed. St Martin was ground in a mill on the 11th November and that is why something is is killed on St Martin's eve\n\n\n\nOn St John's eve a bone-fire is lit on every hill. Some say it is in honour of St John. Others say that a while before the battle of Clontarf the Danes were scattered and they fled to neighbouring houses for safety. Brian sent out a secret message to tell all the people to kill the Dane and to light a bone-fire on a high-hill as a warning to him when the Dane was killed This the people did and in memory of this it is said people light bone fires.\n\n\n\nThe first person that comes in on New Year's day brings good luck or bad luck. A red haired girl is unlucky there will be bad luck in that house for twelve months. A black haired man is very lucky to come in on New Year's morning. If you give away anything New Year's day you will be giving away the whole year. If you break a mug or anything you will be breaking the whole year.\n", "school_info": "School: Kilmore", "metadata": [{"Location:": "Kilmore, Co. Leitrim", "Teacher:": "\nEilís, Bean Uí Cheallaigh\n"}, {"Collector": "Tessie Mc Loughlin", "Gender": "female", "Address": "Killadiskert, Co. Leitrim"}, {"Language": "English"}]}, "4591084/4588995/4660397": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0011, Page 257", "Page 257"], "url": "https://www.duchas.ie/en/cbes/4591084/4588995/4660397", "text": "\n(continued from previous page)\nins na fataí go mbheadh fataí maithe acú.Oidhche Fhéile Mhártan.Nuair a thághann Oidhche Feíle Martan doirteann chúile duine fuil. Marbuigheann siad cearc nó gé nó caora.Lá Feíle StiópainTágann lá Feile Stiópain ar an gcead lá in dhiaidh lá Nodlag. Bíonn átas mór ar na paistí nuair a tágann an lá sin mar bhíonn spraoí mor acú ag dul tart leis an dróilín. Téigeann siad tart ó teac go teac agus an dróilín agus craob cóillainn acú agus bhíonn siad ag cruinú airgidh. Bhíonn go leor buacailli ag dul tart agus bíonn siad ag ceol agus ag damhsa ins na tighthe. Oidhche Cionn Bliana.Tágann oidhche cionn bliana ar an oidhche deireanach den bliain. Bíodh na sean ndaoine ag rádh dá mbead rúidh maith acú an oidhche sin go mbheadh sé acú ar feadh na bliana go lear. Bíodh siad ag radh freisin duine ar bit a beadh ag troid go mbeadh sé ag troid ar feadh na bliana.\n\n\n\nTagann lá Féile Mártan ar an t-aonad lá déag de mí na Samhna. Is i n-onóir do Naomh Mártan a thagann sé. Marbhuigheann cuile duine ainimide\n(continues on next page)\n", "school_info": "School: Árd Mhór", "metadata": [{"Location:": "Ardmore, Co. Galway", "Teacher:": "\nPádhraic Ó Gleasáin\n"}, {"Collector": "Bríghid Ní Mhaoilchiaráin", "Gender": "female", "Address": "Callowfinish, Co. Galway"}, {"Language": "Irish"}]}, "4591084/4589004/4660526": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0011, Page 266", "Page 266"], "url": "https://www.duchas.ie/en/cbes/4591084/4589004/4660526", "text": "\n(continued from previous page)\nOidche ShamhnaFéile mór is sead oidhche Shamhna. Déirtear go mbíonn na sideóga ag atrughadh freisin an oidhche sin. Bhíonn feasta mór ag muinntir an tighe an oidche sin. Bhíonn na paistí ag imirt cleiseanna an oidhche sin agus bhíonn theach fe leith acha leis na cleasanna d' imirt ann. Bhíonn go leor cleasanna acha le n- imirt mar bhíonn siad ag cuimnugeadh orra an t-seachmhain roimhe sin\n\n\n\nTagann lá Fhéile Mhártan ar an t-aonú lá deag de mhí na Samhna cuile bliadhain. Marbhuigheann na daoine geabha, cearca, muca, agus caoirigh la nó cupla lá roimhe la Fhéile Mhártan agus iteann siad  iad lá Fhéile Mhártan. Bhí Iosa Criost lá ag siubhal. Ní lean Naomh Mhártan é cuile áit dá ndeacaidh sé. Bhí Iosa ag imteacht tríd driseacha agus trí coillte. Bhí Mhártan n-a diaid i gcomnaidhe. Bhí craiceann Iosa gearrtha ann mhór ag na driseaca agus bhí fuil ar a cuid éadaigh. Bhí craiceann Iosa gearrtha comh mhór sin is go raibh se andhon cuid de craiceanna bhaint de fhéin. Tóg sé piosa de'n craiceann de féin agus chuir sé faoí cloch ann mhór. D'iarr naomh Mártan cuid de'n craiceann ar Iosa. Thug Iosa dó e agus dubhairt sé leis é a cuir i bfolach faoi cloch mór agus gan aon duine a beith breathnu ar dhá cuir i bfolach.\n(continues on next page)\n", "school_info": "School: Árd Mhór", "metadata": [{"Location:": "Ardmore, Co. Galway", "Teacher:": "\nPádhraic Ó Gleasáin\n"}, {"Collector": "Nóra Ní Chúaláin", "Gender": "female", "Address": "Ardmore, Co. Galway"}, {"Language": "Irish"}]}, "4591084/4589005/4660534": {"title": "Lá Fhéile Mártain", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0011, Page 267", "Page 267"], "url": "https://www.duchas.ie/en/cbes/4591084/4589005/4660534", "text": "\n(continued from previous page)\nAgus go dtiocfaidh rud lucmhar éigin do na daoine as. Cuir Mártan an craiceann i bfolach. Acht bhí cailín ag breathnú air. Nuair a chuaid Mártan a bhaile goid an cailín cuid de craiceann. Agus cuir sí féin i bfolach é faoi cloch mhór. An t-am  a bhí ceaptha ag Martan dul ag breathnu ar gcraiceann. Nuair a thóg Mártan an cloch rith dhá muc amac as. Nuair a thóig an cailín an cloch rith da luch indiaidh na muca. Agus chait Mártan  ceann dhá láiminí leis na luchain. Rinne a  láimhin cat agus tosuigh an cat ag rith indiaidh an luch. Sin é a fath (?) go dtugtar gadadhe ar an luch agus bíonn an cat ag rith indiaidh an luch. Mar goid an cailín an craiceann a dtáinig na lucha as. D'orduigh Mártan da mbeadh tada le marbú é a marbú lá no cupla roimhe a lá féin. Ní raibh tada  le marbu ag na daoine an t-am sin. Bhí fear ann  uair (?) agus ní raibh tada le marbu ag na  a bean. Agus bí sé ag dul ag marbú a mhac le omás do Mártan. Naoid  n-oidhche  agus oidhche gan náire go la Fhéile Mártan.Nóra Ní ChúaláinÁrdmhór,Cárna\n\n\n\nBíonn lá Fhéile Mhártan againn cuile blian. Is in onóir do Naomh Mártan a bionns sé ann. Sin é an lá a baineadh an ceann  do Naomh Mártan. Agus dóireadh a cuid fola go léir.Bíonn na daoine ag marbadh caoire agus géabha agus muca an lá sin. Tá sé ráidte nach raibh Mártan in a caitilicheac cor ar bith ar\n(continues on next page)\n", "school_info": "School: Árd Mhór", "metadata": [{"Location:": "Ardmore, Co. Galway", "Teacher:": "\nPádhraic Ó Gleasáin\n"}, {"Collector": "Sorcha Ní Ceannabháin", "Gender": "female", "Address": "Ardmore, Co. Galway"}, {"Language": "Irish"}]}, "4678376/4673552/4679087": {"title": "St Martin and the Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0417, Page 144", "Page 144"], "url": "https://www.duchas.ie/en/cbes/4678376/4673552/4679087", "text": "\nA labourer named Paddy Sullivan lived in Caherulla about fifty years ago. On one occasion he got a pet bonham from a local farmer.The bonham throve with him and after a few months it had grown into a fine fat céis. Paddy watched with satisfaction his pig increasing in weight and he thought of the day when she would make a few pounds for him. But alas one morning when he went to the stye with her breakfast he found her very ill indeed. After trying several remedies recommened to him he found that the pig was daily getting worse. One day a neighbour told him to promise St Martin that he would kill the pig in his honour on November 10. He did so and the pig got as well\n(continues on next page)\n", "school_info": "School: Rathmorrel", "metadata": [{"Location:": "Rathmorrel, Co. Kerry", "Teacher:": "\nAnraoí Ó Conchobhair\n"}, {"Collector": "Simon Murphy", "Gender": "male", "Address": "Caherulla, Co. Kerry"}, {"Informant": "James Murphy", "Gender": "male", "Age": "57", "Address": "Caherulla, Co. Kerry"}, {"Language": "English"}]}, "4672110/4671113/4681858": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0171, Page 272", "Page 272"], "url": "https://www.duchas.ie/en/cbes/4672110/4671113/4681858", "text": "\nPeople kill something (ie a chicken) to shed blood for St. Martin believing \"he'll take before but not after\"??\n\n\n\nPeople believe it is unlucky to pay bills on Monday.\n\n\n\nIt is not right for two in one family to marry within a year.You should keep a white cock or your husband would die.\n\n\n\nThe seventh successive son in a family is called \"Doctor\" & is believed to have Cures.\n\n\n\nI am a shoemakerI make shoes without leather.Four elements mixed up togetherFire, water earth & airAnd every customer, takes two pair.A Blacksmith\n", "school_info": "School: Tobar an Choire (2)", "metadata": [{"Location:": "Tobercurry, Co. Sligo", "Teacher:": "\nEilís Caswall\n"}, {"Informant": "Mrs Matthews", "Gender": "female", "Address": "Ballyara (Knox), Co. Sligo"}, {"Language": "English"}]}, "4666609/4666427/4682400": {"title": "Story about St Martin's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0415, Page 158", "Page 158"], "url": "https://www.duchas.ie/en/cbes/4666609/4666427/4682400", "text": "\nIt is a very old custom in this part of the country, to draw the blood of some animal or fowl on St. Martin's Night, the 10th November. This blood is not supposed to be used for filling puddings or cooking in any way. The blood is often put on a piece of \"tow\" or a cloth and then used during the year to put up to a pain in the side or other pains in the body. It often happens around here, that a pig or a sow gets sick during the year, and the man or woman of the house cuts the ear of the sick animal, and offers it up to St. Martin. If this animal survives, it is usually killed on St. Martin's Night and the blood is allowed to flow around the farmyard.The following story is told by Daniel Flynn, Postman, Ballyduff who was present in the house, with five others when this happened.At the south end of the village of Ballyduff, there lived a poor old widow, who is dead for a good many years. It happened on St. Martin's Night that this poor woman had no blood to draw,\n(continues on next page)\n", "school_info": "School: Ballyduff B. N. School", "metadata": [{"Location:": "Ballyduff, Co. Kerry", "Teacher:": "\nTadhg Ó Leathlobhair\n"}, {"Informant": "Daniel Flynn", "Gender": "male", "Occupation": "postman", "Address": "Rahealy, Co. Kerry"}, {"Language": "English"}]}, "4666610/4666516/4682712": {"title": "On St Martin's Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0415, Page 249", "Page 249"], "url": "https://www.duchas.ie/en/cbes/4666610/4666516/4682712", "text": "\nLong ago the custom on Saint Martin's Eve was to kill an animal or any table-bird. The people did not keep the blood but let it go in honour of St. Martin and when a person got a pain this blood was rubbed to that person. There was no creamery held on that day, or any sort of a wheel was not turned for it was between wheels St. Martin was crushed. There was a woman living in this district and she had nothing to kill but a hen. She promised to kill the hen, but when the night came she thought it too great a loss and did not kill it, but before the year was out her hens went against her and all died.\n", "school_info": "School: Baile Dubh (C.)", "metadata": [{"Location:": "Ballyduff, Co. Kerry", "Teacher:": "\nBrighid, Bean Uí Leathlobhair\n"}, {"Collector": "Hanna Regan", "Gender": "female"}, {"Informant": "Mrs Dowling", "Gender": "female", "Address": "Bishopscourt North, Co. Kerry"}, {"Language": "English"}]}, "4678408/4678065/4688402": {"title": "Comhrá na mBithiúnach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0426, Page 295", "Page 295"], "url": "https://www.duchas.ie/en/cbes/4678408/4678065/4688402", "text": "\n(continued from previous page)\nRug an buachaill aimsire an t-airgad agus an scríobhnóireacht go dtís na bitheamhnaig, agus léig duine acu é. Thánadar ansan in éinfeacht leis an mbuachaill aimsire, chuadar ar a nglúinibh i láthair an tsagairt agus níor chreadhadar aoinne as san amach.\n\n\n\nIns an tsean aimsir bhíodh cartacha ag dul ó'n áit seo go Corcaig ag breith ualaighe leo agus ag tabhairt ualaighe abhaile. Bhí scata fear ó'n áit seo na suidhe cois teine i dtig lóisdín i gCorcaig oidhche, agus dubhairt duine díobh \"dá mbeinnse ag' baile anocht do mharbhóchainn cearc nó gé nó ainmhidhe éigin in onóir Naomh Mártain.\"Ó ars'n fear eile, 'tá  sé geallta agamsa faid a mhairfead fuil ainmhidhe éigin do dhortadh Oidhche 'le Mártain in onóir  do Naomh Mártain.' An dtabharfaidh sibh mo chapall agus ualach abhaile amáireach ars' é sin, agus imtheochadsa chun bóthair láithreach, pé am a sroisfead mo thig. Ghealladar go dtabharfaidís agus as go bráth leis.Níor bhfada ar an mbóthar é nuair a tháinig marcach suas leis. D'fiafruig sé dhe cá raibh a thriall, Ó ars' an fear, dubhrathas liom ó chíanaibh  i dtig lóisdín gurb' í anocht Oidhche 'le Mártan agus tá deabhadh abhaile anois orm\n(continues on next page)\n", "school_info": "School: Mín Árd", "metadata": [{"Location:": "Minard East, Co. Kerry", "Teacher:": "\nMl. Ó Caomháin\n"}, {"Language": "Irish"}]}, "4678408/4678066/4688405": {"title": "Naomh Mártain", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0426, Page 296", "Page 296"], "url": "https://www.duchas.ie/en/cbes/4678408/4678066/4688405", "text": "\n(continued from previous page)\nchun fuil ainmhidhe do dhortadh in onóir N. Mártain.\"Mise Naomh Mártain\", arsa an marcach agus \"tair ar mo chúlaibh agus bhéarfad abhaile tu. Níor mhór an mhoill a bhí ortha nuair a buaileadh an fear síos ag béal a dhorais féin ins an Leiriúg.'Ní chreidfidh aoinne mé' ars' an fear gurbh é Naomh Mártan a thug abhaile mé.\" 'Fágfadsa comhartha agat' ars' an marcach.D'iompuig sé an capall mórdtimcheall agus d'fhág sé rian chrú an chapaill ar an lic a bhí i mbéal an dorais, agus tá an rian san le feiscint go dtí an lá indiu.\n\n\n\nMícheál O Suilleabháin, feirmeóir, 95 bliana d'aois, Gleann na Mináirde, Liospóil 'Sé a thug na scéalta so leanas\"Is gnáthach le gach liontighe ainmhidhe nó éan éigin a mharbhú lá 'le Mártain agus  is é seo an fáth. Bhí fear darbh ainm Mártan i bpriosún uair agus nuair a tháinig oidhche 'le Mártain thosnuig sé ag gol is ag béicig. D'fiafruig ceannaire an phriosúin de cad chuige an dalladh go léir. Dubhairt an priosúnach dá mbeadh sé sa bhaile go mharbóchadh sé rud éigin anocht in onóir Naomh Mártain fá mar\n(continues on next page)\n", "school_info": "School: Mín Árd", "metadata": [{"Location:": "Minard East, Co. Kerry", "Teacher:": "\nMl. Ó Caomháin\n"}, {"Informant": "Mícheál Ó Súilleabháin", "Gender": "male", "Age": "95", "Occupation": "feirmeoir", "Address": "Glanminard, Co. Kerry"}, {"Language": "Irish"}]}, "4666577/4663454/4688490": {"title": "Festival Customs - St Brigid's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0401, Page 250", "Page 250"], "url": "https://www.duchas.ie/en/cbes/4666577/4663454/4688490", "text": "\n(continued from previous page)\nThis custom has died away very much.\n\n\n\nThe night of the eleventh of November is called St Martin's night. On that night the rich people kill a pig or a lamb. Those who can't afford that kill a goose, a hen or a cock. They get a piece of tow or linen and dip it in the blood. They let the rest of the blood go waste. Then they put that bit of cloth to keep and if any body in the house got a pain in their side to put that bit of cloth up to it would cure it.\n", "school_info": "School: An Chúil Árd", "metadata": [{"Location:": "Coolard, Co. Kerry", "Teacher:": "\nSeán Ó Duilleáin\n"}, {"Collector": "Michael Bunyan", "Gender": "male", "Address": "Knockenagh North, Co. Kerry"}, {"Informant": "Maurice Bunyan", "Gender": "male", "Age": "52", "Address": "Knockenagh North, Co. Kerry"}, {"Language": "English"}]}, "4687695/4684608/4688684": {"title": "Oíche Fhéile Mártan", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0429, Page 071", "Page 071"], "url": "https://www.duchas.ie/en/cbes/4687695/4684608/4688684", "text": "\nBhí fear ar an \"gCoill Móir\", i gCorca Duibhne fadó agus ní raibh ach aon bhó amháin. Lá amháin chuaidh sé go Corcaig ar theachtaireacht éicint, agus nuair a bhí sé a teacht abhaile do chuimhnig sé gur bí seo an oidhche roim Oidhche 'le Mártan. Bhí sé a' brostú air annsan go mbeadh sé ag baile in am. Do bhuail fear ar an mbóthar leis, agus d'fhiafruig sé dhe ca na thaobh go raibh an deabhadh go léir air. Dúbhairt sé go raibh sé ag brostú i gcás go mbeadh sé ag baile in am chun rud éicint do mharbhú i gcóir Naoimh Mártan. Nuair tháinig sé abhaile do mhairbh sé an bhó, agus seich mí na dhiaidh sin, bhí deich mba aige. Deirtear gur bé Naomh Mártan a bhuail leis a's a chuir an rath air. Eamon Ó Seaghdha  50 blian20 bl. ó shoin, ó n a athair nách mhaireann\n", "school_info": "School: Baile Uí Dhuibhne, Caisleán Ghriaire", "metadata": [{"Location:": "Ballyquin, Co. Kerry", "Teacher:": "\nSeán Ó Loingsigh\n"}, {"Informant": "Eamon Ó Seaghdha", "Gender": "male", "Age": "50"}, {"Language": "Irish"}]}, "4678399/4677078/4688909": {"title": "Lá Fhéile Bríde", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0424, Page 232", "Page 232"], "url": "https://www.duchas.ie/en/cbes/4678399/4677078/4688909", "text": "\nLá le BríghideTá mórán nósánna ag baint le  lá le Bríghide. Téigheann na cailíní  beaga tímcheall le Bríghid óg agus  tugann gac duine pingin nó ubh dóibh. Deirtear ná beadh an rath ar aoinne ná tabharfadh ubh dóibh toisc go raibh sí fhéin go maith chun déirc do thabairt . Téigheann na buacaillí beaga tímcheall leis acht ní thugann na daoine aon nídh dóibh.\n(continues on next page)\n\n\n\nLá Le Mártan:-Tá sean-fhocal mar geall ar sin. Sé     an tsean-fhochal é ná  \" Aon oidhche déág agus oidhche le h-áireamh ó oidhche lá Samhna go oidhche Lae Mártan. Tá sé ceart ag gac aoinne rud eígin do marbhú i gcóir an oidhche sin nó mar a ndeanfaidís ní bheadh an tádh leó.\n", "school_info": "School: Baile an Ghóilín (Scoil N. Finghín)", "metadata": [{"Location:": "Burnham East, Co. Kerry", "Teacher:": "\nDll. Ó Loingsigh\n"}, {"Collector": "Seán Ó Ghríbhthín", "Gender": "male", "Address": "Mullenaglemig, Co. Kerry"}, {"Informant": "Bríghid Ní Ghríbhthín", "Gender": "female", "Address": "Mullenaglemig, Co. Kerry"}, {"Language": "Irish"}]}, "4666578/4663616/4689225": {"title": "St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0401, Page 412", "Page 412"], "url": "https://www.duchas.ie/en/cbes/4666578/4663616/4689225", "text": "\nSt. Martin's day is held on the 11th of November. It is held as a feast day in honour of St. Martin The night before St. Martin's day people kill a goose or a chicken or some other kind of fowl, and they draw the blood and dip a piece of flax in it.They keep the piece of flax because it is said to be a cure for a pain in one's side.St. Martin was a saint who was ground in a mill for his faith.In olden times the mills used not work on that day The women in olden times used not workNo one would turn a wheel not even of a car.\n", "school_info": "School: An Chúil Árd (C.)", "metadata": [{"Location:": "Coolard, Co. Kerry", "Teacher:": "\nMáire Ní Liaghain\n"}, {"Collector": "Eliza Walsh", "Gender": "female", "Address": "Coolkeragh, Co. Kerry"}, {"Informant": "Mrs Walsh", "Gender": "female", "Age": "90", "Address": "Tullamore, Co. Kerry"}, {"Language": "English"}]}, "4687719/4687028/4708745": {"title": "Féilte na Bliana - Lá Fhéile Stiofáin", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0435, Page 405", "Page 405"], "url": "https://www.duchas.ie/en/cbes/4687719/4687028/4708745", "text": "\n(continued from previous page)\nNuair a bhídís críochnuighthe cuiridís píosa éadaig bán mór thímceall an dreóilín agus chuiridís i isteach i mbosca i mbosca beag. Annsan cuireadh duine acha an bosca ar a gualain agus leanadh na buacaillí eile é ar nós socraid. Chuiridís an bosca isteach in uaig beag agus dhúnaidís an uaig.\n\n\n\nGaol do Naomh Pádraig do b'eadh Naomh Mártain. Deireadh na sean-daoine gur ceart fola dhortadh an lá san. Marbhuighidís gé agus bó istig sa tig i dtreó is go mbíodh an fuil ar fuaid an urláir. Tá áth ag baint leis an nós so agus leanann na daoine é fós.Eibhlín Ní ChathaláinLeath-FhearranCill-Orglan\n", "school_info": "School: Dubhghlas (C.)", "metadata": [{"Location:": "Douglas, Co. Kerry", "Teacher:": "\nEibhlín, Bean de Róiste\n"}, {"Collector": "Eibhlín Ní Chathaláin", "Gender": "female", "Address": "Laharan, Co. Kerry"}, {"Informant": "Mícheál Ó Cathaláin", "Gender": "male", "Age": "57", "Address": "Laharan, Co. Kerry"}, {"Language": "Irish"}]}, "4687719/4687047/4708792": {"title": "Tórramh", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0435, Page 424", "Page 424"], "url": "https://www.duchas.ie/en/cbes/4687719/4687047/4708792", "text": "\n(continued from previous page)\nar feadh na h-oidhche mar fhánadh a lán daoine ag an tóramh go dtí an maidin.Gobnait ní Chonchubhair,RínCill OrglanCiarraidhe.\n\n\n\nBhíodh fhios ag na sean-daoine gur ceart fuil do scaoileadh mór timcheall cró na gcearc an oidhche san timcheall a h-aon a clogh san meadhon oidhche. Bhíodh fhios go mbeadh an féile san ann sa t-aonmadh lá déag de mhí na Samhna.Mharbuigheadh na daoine éan éigin ar nós gé, cearc no lachain fadó ach anois níl sé\n(continues on next page)\n", "school_info": "School: Dubhghlas (C.)", "metadata": [{"Location:": "Douglas, Co. Kerry", "Teacher:": "\nEibhlín, Bean de Róiste\n"}, {"Collector": "Bríd Ní Dhonnchadha", "Gender": "female", "Address": "Douglas, Co. Kerry"}, {"Informant": "Sean Ó Conncubhair", "Gender": "male", "Age": "75", "Address": "Douglas, Co. Kerry"}, {"Language": "Irish"}]}, "4687719/4687057/4708813": {"title": "Féilte na Bliana - Lá Fhéile Mártain", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0435, Page 434", "Page 434"], "url": "https://www.duchas.ie/en/cbes/4687719/4687057/4708813", "text": "\nDeiridís fadó go mbíodh brón mór ar na lachain a bhíodh timcheall trí bliana d'aois mar cuireadh na daoine chun báis iad Lá le Mártan. Timcheall meadhon lae thugaidís trí nó ceathar díobh isteach sa tig. B'ainidís na cleití díobh. Coimeaidís na cleití agus chuiridís isteach i mála agus dheinidís pilúr díobh. Annsan mharbhuighidís agus nighidís na lachan agus chuiridís ag beiriú nó ag rósta iad agus bíodh dinéir deas nó súpéir bféidir aca. D'ithidís le prátaí agus annlan bán agis bíodh siad go gleoidhte. Deireadh na sean daoine\n(continues on next page)\n", "school_info": "School: Dubhghlas (C.)", "metadata": [{"Location:": "Douglas, Co. Kerry", "Teacher:": "\nEibhlín, Bean de Róiste\n"}, {"Collector": "Siobhan Ní Mhuircheartaigh", "Gender": "female", "Address": "Tullig More, Co. Kerry"}, {"Informant": "Padraig Ó Mhuircheartaigh", "Gender": "male", "Age": "86", "Address": "Tullig More, Co. Kerry"}, {"Language": "Irish"}]}, "4701770/4701321/4727234": {"title": "Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0188, Page 088", "Page 088"], "url": "https://www.duchas.ie/en/cbes/4701770/4701321/4727234", "text": "\nUntil quite recently the young people use to build a little hut usually in the bog and cook eggs there on Easter Sunday. The young people still strive to see who will eat the most number of eggs on Easter Sunday. It is a firm local belief that the Sun dances on Easter Sunday morning and many who have got up at dawn to witness this phenomenon declare that such is the case.\n\n\n\nI can find no trace of any local customs for this feast.\n\n\n\nBonfires are still built in this area and coals from the dying fire brought and thrown into the tilled fields to bless the crops for the year.\n\n\n\nA fowl is killed and the blood spilled for St Martin to prevent sickness or death in the year. It is a believe that\n(continues on next page)\n", "school_info": "School: St. Michael's Clooncunny", "metadata": [{"Location:": "Clooncunny, Co. Sligo", "Teacher:": "\nÚna, Bean Uí Stondúin\n"}, {"Language": "English"}]}, "4701702/4694053/4728664": {"title": "St Martin's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0170, Page 0068", "Page 0068"], "url": "https://www.duchas.ie/en/cbes/4701702/4694053/4728664", "text": "\nThe Irish people had always great devotion to St. Martin of Tours who was a cousin of our own national apostle St. Patrick. His feast occurs on the eleventh of November and it was always the custom to kill some fowl and shed the blood in his honour. This had to be done within nine nights after \"Lá Samhna\" because the old people said he would accept the offering in his honour before the feast but not after. It was not enough to kill the fowl but the blood had actually to be scattered about.This custom was, and is, still strictly carried out in every home in this district.\n", "school_info": "School: Moylough (C.)", "metadata": [{"Location:": "Moylough, Co. Sligo", "Teacher:": "\nMargaret Devine\n"}, {"Collector": "Kathleen Gildea", "Gender": "female", "Address": "Moylough, Co. Sligo"}, {"Informant": "James Brennan", "Relation": "grandparent", "Gender": "male", "Address": "Moylough, Co. Sligo"}, {"Language": "English"}]}, "4701691/4693047/4744028": {"title": "St Martin's Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0163, Page 255", "Page 255"], "url": "https://www.duchas.ie/en/cbes/4701691/4693047/4744028", "text": "\nOn St Martin's Eve a fowl is killed and its blood is spilled inside the back door of the kitchen. It is said that if this is not done something will be found dead in the house the next morning. The blood is spilled in honour of St. Martin who died a martyr for the faith, and whose blood was scattered all over the place where he was put to death\n", "school_info": "School: Stuacán", "metadata": [{"Location:": "Muingwore, Co. Sligo", "Teacher:": "\nBríd Ní Mhiadhaigh\n"}, {"Collector": "Bridget Best", "Gender": "female", "Age": "14", "Address": "Tullylin or Ballyfeenaun, Co. Sligo"}, {"Informant": "Mrs M. Best", "Gender": "female", "Address": "Tullylin or Ballyfeenaun, Co. Sligo"}, {"Language": "English"}]}, "4758480/4747578/4762201": {"title": "Festival Customs - Halloween", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0840, Page 029", "Page 029"], "url": "https://www.duchas.ie/en/cbes/4758480/4747578/4762201", "text": "\n(continued from previous page)\nand very often the candles are caught instead of the apples.\n\n\n\nOn May Day it is an old custom to decorate a white thorn bush with flowers and coloured papers.  It is stuck down in the garden or in a manure heap.  In May people do not cut hedges, cut hair, or whitewash.  \"A swarm in May is worth a load of hay. A wet and windy May fills the haggard with corn and hay.\n\n\n\nOn St Brigid's the people leave out side a bottle of water, a ribbon and a straw.  it is said that St Brigid comes around on that night and blesses them.  In the morning the people bring them in and are keeped in the house  for the year.  Then all of them are burned.  If any one gets sick during the year, they give them the water to drink, and if any one has a pain in the head, they put the ribbon around the head.  They keep the straw to protect the house from burning.\n\n\n\nOn Saint Martins day the people spill some\n(continues on next page)\n", "school_info": "School: Clonmore, Piltown", "metadata": [{"Location:": "Clonmore, Co. Kilkenny", "Teacher:": "\nBríd Nic Aodhgáin\n"}, {"Language": "English"}]}, "4758451/4745145/4770175": {"title": "Old Customs in My District on St Martin's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0230, Page 256", "Page 256"], "url": "https://www.duchas.ie/en/cbes/4758451/4745145/4770175", "text": "\n256Old customs in my district on St. Martin's NightSt. Martin's night is celebrated on the 11th. November and numerous old religious customs are carried out on that night. Ages ago the old people practised many peculiar customs, but as time rolled on, these habits and customs became almost quite extinct, and at present the principal thing which is done in honor of St. Martin is: A fowl is killed and its blood is spilled on the threshold and then the Sign of the Cross is made thrice on the\n(continues on next page)\n", "school_info": "School: Cartrún", "metadata": [{"Location:": "Cartronavally, Co. Roscommon", "Teacher:": "\nCáit, Bean Uí Cheallaigh\n"}, {"Collector": "Patricia Mac Guire", "Gender": "female", "Address": "Cornagee, Co. Roscommon"}, {"Informant": "Mrs J. Mac Guire", "Relation": "parent", "Gender": "female", "Age": "49", "Address": "Cornagee, Co. Roscommon"}, {"Language": "English"}]}, "4706346/4704680/4780001": {"title": "Festival Customs - St John's Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0444, Page 457", "Page 457"], "url": "https://www.duchas.ie/en/cbes/4706346/4704680/4780001", "text": "\nAt Michaelmas & St Martin's Eve an animal wa killed. You had always a goose for St Martin's eve as \"blood had to be drawn\" on that day in honour of St Martin. If you hadn't a goose - a hen or chicken would do.\n\n\n\nAine Lynch says -\"My father told me that on New Year's Eve loaves were baked, and after supper - at which the children were told to eat enough as they wouldn't eat any more for another year - a clean sack was placed near the door. The loaf was struck 3 times on the door - against the inside of the front door while the young\n(continues on next page)\n", "school_info": "School: O'Brennan, Baile Mhic Ealgóid, Tráighlí", "metadata": [{"Location:": "Tonreagh Lower, Co. Kerry", "Teacher:": "\nPádraig Ó Loingsigh\n"}, {"Language": "English"}]}, "4758476/4747296/4780214": {"title": "St Martin's Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0250, Page 316", "Page 316"], "url": "https://www.duchas.ie/en/cbes/4758476/4747296/4780214", "text": "\nSt Martin's eveA fowl is killed and the blood sprinkled on each door and the Sign of the Cross made with blood. People never yoke horses on St Martins eve.\n\n\n\nMay BushesIn some parts children gather flowers and ties bunches of them on a tree on May eve.They also leave flowers outside the door of every house.People decorate the Virgin's statue with flowers, and light candles. The kneel and say the Rosary and continue it through the Month of May.\n", "school_info": "School: Cluain Uí Chuinn", "metadata": [{"Location:": "Cloonyquin, Co. Roscommon", "Teacher:": "\nMícheál Mac Floinn\n"}, {"Language": "English"}]}, "4770035/4768267/4815507": {"title": "Saint Martin's Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0834, Page 136", "Page 136"], "url": "https://www.duchas.ie/en/cbes/4770035/4768267/4815507", "text": "\nIn his early life Saint Martin was a pagan, and served in the Roman Army. He was converted through the example of a poor beggar, whom he befriended, and afterwards became Bishop of Tours.There are several strange customs connected  with his feast. In most homes in the country a fowl is killed and all the doorsteps sprinkled with the blood commencing with the dwelling house. This fowl is partaken of at dinner on the following day. All mills, threshing machines and, in some places, the ploughshare cease work.There is a story told that a certain man named Roberts, a Quaker, who owned the Mill at Castletown set his mill in motion on St. Martin's Day. The wheel and all the machinery went to bits, and the quaker cried out \"Martin, Martin, stop thy hand and I'll never grind on thy day again\". The mill\n(continues on next page)\n", "school_info": "School: St Brigid's Convent, Mountrath", "metadata": [{"Location:": "Mountrath, Co. Laois", "Teacher:": "\nSr. Aquinas\n"}, {"Collector": "Patsy Mooney", "Gender": "female", "Address": "Mountrath, Co. Laois"}, {"Informant": "Mrs Ellen Mooney", "Gender": "female", "Address": "Mountrath, Co. Laois"}, {"Language": "English"}]}, "4798657/4787570/4822667": {"title": "St Martin", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0234, Page 017", "Page 017"], "url": "https://www.duchas.ie/en/cbes/4798657/4787570/4822667", "text": "\nSt. Martin was drowned in a mill-race. For this reason no mills work on St Martins Day (11th November)About seventy years ago, at Ballisodare the flour mills were kept working by order of the foreman, who defied custom. The workmen refused to carry on, and he locked them in the mill. The mill took fire and the men could not escape, most of them jumped out of a window into the river. All the men, except one were lost by fire or drowning.\n", "school_info": "School: Clews' Memorial", "metadata": [{"Location:": "Boyle, Co. Roscommon", "Teacher:": "\nMáire Ní Néill\n"}, {"Language": "English"}]}, "4798699/4791225/4924540": {"title": "November Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0252, Page 310", "Page 310"], "url": "https://www.duchas.ie/en/cbes/4798699/4791225/4924540", "text": "\nIn olden times there were a lot of games played on November Night and stories told. Specially, one of the most favourite games that are played was ducking for apples in a tub of water and hanging apples out of the ceiling. The people also make a cake with a ring and nut and sloe. According to the peoples stories the nut is for an old maid, and the sloe is for a death, and the ring is for a marriage.\n\n\n\nThe Feast of St Martin is held on the 11th of November. The people kill a fowl. The blood is usually sprinkled on the back of the door and in the four corners of the house in honour of God and St Martin. It is said that there is a cure in it.\n", "school_info": "School: Cluain Fraoich", "metadata": [{"Location:": "Cloonfree, Co. Roscommon", "Teacher:": "\nSeán Ó Fiachra\n"}, {"Collector": "Mary Mac Cormack", "Gender": "female", "Address": "Nadnaveagh, Co. Roscommon"}, {"Language": "English"}]}, "4798725/4793645/4926803": {"title": "St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0259, Page 023", "Page 023"], "url": "https://www.duchas.ie/en/cbes/4798725/4793645/4926803", "text": "\nSt. Martins day falls on the 11th November.The woman of every house always kills a cock. The head is cut off and the blood is spilled some at each side of the fire some at the door. The blood is put in stable so that the horse does not get sick or die. The blood was put at each side of the fire so that no body would get burned in the fire. The blood was put at the door of the dwelling house for luck and so that no sickness would come to the house.\n(continues on next page)\n", "school_info": "School: Cúl Seachtaine", "metadata": [{"Location:": "Coolshaghtena, Co. Roscommon", "Teacher:": "\nCaitlín Nic Dhonnchadha\n"}, {"Collector": "William Connaughton", "Gender": "male", "Address": "Moneen, Co. Roscommon"}, {"Informant": "James Donohoe", "Gender": "male", "Age": "66", "Address": "Moneen, Co. Roscommon"}, {"Language": "English"}]}, "4798687/4790074/4927860": {"title": "St Martin's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0242, Page 118", "Page 118"], "url": "https://www.duchas.ie/en/cbes/4798687/4790074/4927860", "text": "\nSt. Martin's night is one of the great festivals amongst the old Irish people. On St. Martin's night there is usually fowl eaten in honour of St. Martin.On the eve of St. Martin's a fowl must be killed and its blood must be spilled at the four corners of the kitchen, also at the door-steps to keep away evil for the rest of the year. Each family must kill a fowl, or if they do not, they will have bad luck for the rest of the year.There is a very old way reckoning the date of St Martin's night which is - \"Nine nights and a night without counting from Halloween night to the night of St Martins.\"There is a very old story about St. Martin's - Away in the wilds of Mayo, there dwelt a poor man and his wife, who were so poor, as they had only one cow, and no fowl, or pigs, or horses. Halloween night came and the wife said:- \"Dear Tom St Martin's night will soon be here, and we have nothing to kill, but our cow, and if we dont kill her, we shall have bad luck for the rest of the year.\" The husband said - \"If we kill her we shall be poorer than ever.\" Mary said - \"Kill the cow what-ever about the poverty and trust in St. Martin At last they both consented to kill the cow.\"Early next morning the man asked some of his neighbours to help him kill the cow. They killed the cow\n(continues on next page)\n", "school_info": "School: Gort an Iubhair", "metadata": [{"Location:": "Gortanure, Co. Roscommon", "Teacher:": "\nDonncha Ó Fiachra\n"}, {"Collector": "Bea Agnes Cassidy", "Gender": "female", "Address": "Boghtaduff, Co. Roscommon"}, {"Informant": "Henry Quinn", "Gender": "male", "Address": "Gortanure, Co. Roscommon"}, {"Language": "English"}]}, "4811599/4800575/4929099": {"title": "St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0270, Page 211", "Page 211"], "url": "https://www.duchas.ie/en/cbes/4811599/4800575/4929099", "text": "\nThe day before the feast of St Martin, which falls on 11th Nov. it was customary formerly to kill a cock and sprinkle the blood in the four corners of the house. This was supposed to keep sickness away from the family.\n\n\n\nIt is the custom still, locally, to kill the Michaelmas goose in honour of St Michael, whose feast day occurs in September.\n", "school_info": "School: Cluain na Cille", "metadata": [{"Location:": "Cloonakille, Co. Roscommon", "Teacher:": "\nEithne , Bean Uí Fhallamhain\n"}, {"Language": "English"}]}, "4811599/4800575/4929100": {"title": "St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0270, Page 211", "Page 211"], "url": "https://www.duchas.ie/en/cbes/4811599/4800575/4929100", "text": "\nThe day before the feast of St Martin, which falls on 11th Nov. it was customary formerly to kill a cock and sprinkle the blood in the four corners of the house. This was supposed to keep sickness away from the family.\n\n\n\nIt is the custom still, locally, to kill the Michaelmas goose in honour of St Michael, whose feast day occurs in September.\n", "school_info": "School: Cluain na Cille", "metadata": [{"Location:": "Cloonakille, Co. Roscommon", "Teacher:": "\nEithne , Bean Uí Fhallamhain\n"}, {"Language": "English"}]}, "4921567/4880368/4930038": {"title": "St John's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0269, Page 150", "Page 150"], "url": "https://www.duchas.ie/en/cbes/4921567/4880368/4930038", "text": "\nOn the eve of St. John's day bonfires were and are still lighted. The practice of bringing a coal away has however been discontinued.\n\n\n\nSome fowl usually a cock or two were killed in honour of St Martin Blood has to be shed in any case. Formerly some one in a townland killed a calf or sheep & the neighbours bought portions of him.Should a beast be sick, it was very often offered up for St Martin I mean if a beast happend to be sick during the year. Then on the day the animal would be slaughtered Hi was not to be sold alive in any case. The poor people in former times looked upon fresh meat or fowl as a great luxury. Now-a-days although the people keep up the old custom of killing, there is not much notice taken.\n", "school_info": "School: Baile 'n tSléibhe (B.)", "metadata": [{"Location:": "Cornalee, Co. Roscommon", "Teacher:": "\nMáirtín Mac Conchradha\n"}, {"Language": "English"}]}, "4922323/4870111/4933147": {"title": "Superstitions and Customs Pertaining to St Martin's Feast Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0602, Page 011", "Page 011"], "url": "https://www.duchas.ie/en/cbes/4922323/4870111/4933147", "text": "\nI was told that in olden times people used kill an animal or a bird and sprinkle the blood around the floors and doors of their houses to keep away the fairies.I was also told when an animal used get sick they would mark it for St Martin's day by putting a cut in its ear and if they didnt kill it, it would die or one of the best of the herd would die instead.I was also told that if a young calf was born on that day, they would redden a knitting pin in the fire and hole its ear with it so that he would live and be lucky. On that day every house keeper in this district kills a goose or a cock and keeps a drop of their blood to cure a pain in the side. Long ago they used to take it in tow but now they have not the tow they keep it in wool or cotton instead and keep it for the year.I was also told that if St Martin's day fell on a Monday some people would not like to spill blood on that day, they would rather do it on Sunday or leave it 'till Tuesday.I was\n(continues on next page)\n", "school_info": "School: Lacken (C.), Cill Mhichíl", "metadata": [{"Location:": "Lacken, Co. Clare", "Teacher:": "\nBean Uí Mhaonaigh\n"}, {"Collector": "Margaret Brogan", "Gender": "female", "Address": "Kilmihil, Co. Clare"}, {"Informant": "Martin Lineen", "Gender": "male", "Age": "72", "Address": "Kilmihil, Co. Clare"}, {"Language": "English"}]}, "4922325/4870235/4933952": {"title": "St Martin's Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0602, Page 134", "Page 134"], "url": "https://www.duchas.ie/en/cbes/4922325/4870235/4933952", "text": "\nOn St. Martin's Eve (10th-Nov) people observe a great many customs. On the Eve of St. Martins Day a great many people kill a goose in  honour of St. Martin. They also kill a cock or a hen. If the people of the house own a horse they kill a cock, and if they own a mare they kill a hen. The blood is sprinkled on the doors and in the horse's stable. The blood is spilled at the front door, then it is  brought to the back door, then to the fire and then to the next corner.Some of blood is also spilled on a piece of tow or cotton wool and and it is kept in a careful place and if anybody gets a sudden pain St. Martin's blood will cure them. There is a story told of a man named Michael Fitzpatrick who had marked a pig for St. Martin but a few days before the 11th November. the man took the pig to the fair and sold him. His wife did not want him to do this but he did and he got £10 for the pig. When he took the money out of his pocket in the evening he found that the writing was gone off the paper.On St. Martins\n(continues on next page)\n", "school_info": "School: Cahermurphy, Cill Mhichíl", "metadata": [{"Location:": "Cahermurphy, Co. Clare", "Teacher:": "\nSéamus Ó Laoighléis\n"}, {"Collector": "Briget Hehir", "Gender": "female", "Address": "Kilmihil, Co. Clare"}, {"Language": "English"}]}, "4922325/4870266/4934339": {"title": "Saint Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0602, Page 165", "Page 165"], "url": "https://www.duchas.ie/en/cbes/4922325/4870266/4934339", "text": "\nSaint Martin's DaySaint Martin's day is on the 11th of November. All the people of the locality always kill a goose or a gander and also a chicken. If the people of the house own a horse, they kill a cock for him but if they own a mare they kill a hen. The people shake the blood of a chicken on the stable door and around the stable and the blood of the goose on the four corners of the house and a little on the door. They also keep some blood on cotton wool fearing a sudden pain may come on somebody. If you make the sign of the ross with the cotton wool where the pain is, it would go.On Saint Martin's day also, some of the people here do not turn a wheel because it is believed that some misfortune will fall upon whoever does so. We have many other instances\n(continues on next page)\n", "school_info": "School: Cahermurphy, Cill Mhichíl", "metadata": [{"Location:": "Cahermurphy, Co. Clare", "Teacher:": "\nSéamus Ó Laoighléis\n"}, {"Collector": "Caitlín Ní Chonchubhair", "Gender": "female", "Address": "Cahermurphy, Co. Clare"}, {"Language": "English"}]}, "4922019/4918994/4934548": {"title": "St Martin's Day - Ancient Custom", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0503, Page 164", "Page 164"], "url": "https://www.duchas.ie/en/cbes/4922019/4918994/4934548", "text": "\nIt was the custom in this locality formerly, and seems to have been pretty widespread, of drawing blood on St. Martin's Day. For this purpose it was the custom to kill an old goose or hen.In relation to this I have gathered the following legend. Formely, before either of the existing mills wer built, there was an old mill operating at the Spot, known as the \"The long pond\" on the river south of the Castle. It was a custom rigidly observed not to work or 'turn' the mill-wheels on St. Martin's Day. On St. Martin's Day a poor farmer came with some wheat to grind, but the miller refused. The poor farmer persisted, pointing out that he had no flour, but the miller retaliated by saying that even if he would, he had no help. Thereupon the miller's wife said she would help, taking pity on the farmer. The wheels had only just been put in motion, when the woman's skirt getting entangled in the machinery, she was mangled to death. Her name is given as Sheehan or Sheahan, and the old ruins of a house are pointed to on the bank of the river as being their dwelling house.\n", "school_info": "School: Easgéiphtine (B.)", "metadata": [{"Location:": "Askeaton, Co. Limerick", "Teacher:": "\nDonncha Mac Eoin\n"}, {"Language": "English"}]}, "4921960/4913598/4938607": {"title": "St Martin's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0487, Page 462", "Page 462"], "url": "https://www.duchas.ie/en/cbes/4921960/4913598/4938607", "text": "\nOn St Martins Night November 11th our ancestors used to kill a goose saturated tow  with its blood. This was kept during the following year. If any one in the house got a pain in his side this was put to it and he was cured. The belief was that when Our Lord was on earth. He went into a house where a man had a pain   in his side. Our Lord told him to use the blood of the goose as related above and immediately he was cured.It was a local belief that blood should be shed on St Martin's Eve. If the people had not any fowl or small animal such as a kid from which to draw the blood, they would prick some part of their bodies generally the finger and allow the blood to flow freely for some time.\n", "school_info": "School: Carrickerry, Árd-achadh", "metadata": [{"Location:": "Carrigkerry, Co. Limerick", "Teacher:": "\nCaitlín, Bean Uí Chonaill\n"}, {"Collector": "Ellie Scanlan", "Gender": "female"}, {"Language": "English"}]}, "4921960/4913611/4938642": {"title": "Saint Patrick", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0487, Page 475", "Page 475"], "url": "https://www.duchas.ie/en/cbes/4921960/4913611/4938642", "text": "\n(continued from previous page)\nFor his Mother kept a Sheebeen shop in the town of EnniskillenHe gave the snakes and toads that wished His beauty without paint O!Author: Mrs Bridget Fitzgearld ( R.I.P. ) 81 yrsGlensharroldArdaghCo Limerick\n\n\n\nIt was the custom about fifty years ago in this district for the people to prick their fingers and shed their blood on St Patricks Day. With the blood they painted the cardboard crosses which the men wore on their shoulders and the women on the left side of their coats or frocks.It was a local belief that blood should be shed on St.Martin's Eve.If the people hadn't any fowl or small animals such as a kid from which to draw blood on St. Martins's Eve they pricked some part of their bodies - generally a finger - and allowed the blood  to flow freely for some time.This custom was to told to me by John Scanlon formerly of Temple- Athea but now residing in Knockfinish, Athea. He is about 70 years of age.\n", "school_info": "School: Carrickerry, Árd-achadh", "metadata": [{"Location:": "Carrigkerry, Co. Limerick", "Teacher:": "\nCaitlín, Bean Uí Chonaill\n"}, {"Informant": "John Scanlon", "Gender": "male", "Age": "circa 70", "Address": "Knockfinnisk, Co. Limerick"}, {"Language": "English"}]}, "4811608/4801466/4941480": {"title": "Saint Martin's Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0275, Page 191", "Page 191"], "url": "https://www.duchas.ie/en/cbes/4811608/4801466/4941480", "text": "\nSaint Martin's Eve falls on the 10th of November. Long ago on that night in the year 1700 the people used to go out setting their nets. One night while they were setting their nets they saw a man rise up out of the water and he riding on a horse. He went towards them and while he was going towards them he waved his hand towards the land. The men of one of the boats say that they would cut their nets and they did. So they pulled away to the land. When they reached the land a storm arose. The crew of the other boat were lost. Some of the old men used not go out on that night ever since and the young people would stay inside on that night and the old people used to tell them to stay inside that something would happen to them. And it is\n(continues on next page)\n", "school_info": "School: Urhan (B.)", "metadata": [{"Location:": "Urhin, Co. Cork", "Teacher:": "\nSeán Ó Murchadha\n"}, {"Collector": "Diarmuid Ó Dubhgáin", "Gender": "male", "Address": "Kilcatherine, Co. Cork"}, {"Informant": "Séamus Ó Dubhgáin", "Relation": "parent", "Gender": "male", "Address": "Caherkeen, Co. Cork"}, {"Language": "English"}]}, "4922102/4852400/4948340": {"title": "Local Customs - Saint Martin's Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0525, Page 032", "Page 032"], "url": "https://www.duchas.ie/en/cbes/4922102/4852400/4948340", "text": "\nOn St. Martins Eve 10th of November the people kill some sort of fowl in order to honour St. Martin because it was said he was cast into a mill and that the mill stopped at once and would not work. It was also said that all machinery working on wheels would not be allowed to turn on that day.\n\n\n\nOn May Eve people in the country, especially farmers light bonfires and follow the cattle with blazing sticks as it is the belief that no harm would come to the cattle touched with a red hot brand, and again;People having Wells in their farms would not allow others to draw water from them on May Eve for whoever draws water on that day could have the fat of their land. A custom with young girls was to put out a vessel on the window sill on May Eve to collect the dew or rain to bathe their faces with on May Morning to preserve their youth and beauty.\n\n\n\nIt is the custom on St.Brigid's Eve to hang a ribbon out\n(continues on next page)\n", "school_info": "School: Roxboro, Luimneach", "metadata": [{"Location:": "Roxborough, Co. Limerick", "Teacher:": "\nMáire, Bean Uí Gheallagáin\n"}, {"Collector": "Willie Hartigan", "Gender": "male", "Address": "Roxborough, Co. Limerick"}, {"Language": "English"}]}, "4922028/4919921/4948589": {"title": "St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0505, Page 110", "Page 110"], "url": "https://www.duchas.ie/en/cbes/4922028/4919921/4948589", "text": "\nSt. Martin's Day.About two weeks ago when I was coming to school, I found the street very quiet and there were no creamery carts of any kind to be seen.  When I met my friend I enquired  why there was no creamery that morning.  She asked me if I knew the day I had.  I replied \"No\".  She then told me that it was Staint Martin's day.  I asked \"Why not have creamery that day?\".\"Because\", she said, \"St. Martin was killed on a mill by some wheel and on that account no wheel should turn that day\".Mary Allen, Adare, Co. Limerick.\n", "school_info": "School: Adare Convent", "metadata": [{"Location:": "Adare, Co. Limerick", "Teacher:": "\nAn tSr. Mechtildes\n"}, {"Collector": "Mary Allen", "Gender": "female", "Address": "Adare, Co. Limerick"}, {"Language": "English"}]}, "4922073/4849903/4948724": {"title": "Festival Customs - Halloween", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0517, Page 211", "Page 211"], "url": "https://www.duchas.ie/en/cbes/4922073/4849903/4948724", "text": "\n(continued from previous page)\nfirst. Whoever gets the thimble will be married to a tailor.The Fire. The hearth must be swept very clean a chair at each side of the hearth and the tongs at the right hand side and a bucket of spring water inside. This is all done for the poor souls.\n\n\n\n\"Nine nights and a night we won't speak of From Sulie-night to Night of Martin.\"St Martin fell into a mill on the 11th of November and was cut up in pieces. And since that day the mills are not working on that day in honour on his death. It is also said that there is a goose or some fowl killed on that night and a rag is dipped in the blood and kept for a cure for a headache.\n", "school_info": "School: Fedamore (B.)", "metadata": [{"Location:": "Fedamore, Co. Limerick", "Teacher:": "\nMartin Moloney\n"}, {"Collector": "Liam Mac Conmara", "Gender": "male"}, {"Collector": "Pádraig Mac Eochadha", "Gender": "male"}, {"Collector": "Seán Ó Maoldhomhnaigh", "Gender": "male"}, {"Collector": "Pádraig Ó Scanláin", "Gender": "male"}, {"Language": "English"}]}, "4922029/4920158/4948954": {"title": "Festival Customs - St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0506, Page 091", "Page 091"], "url": "https://www.duchas.ie/en/cbes/4922029/4920158/4948954", "text": "\nSt. Martin's Day.St. Martin's Day falls on 11th November.  it is in memory of St. Martin the Saint who once gave half his cloak to a beggar.In the district of Adare it was considered unlucky for a wheel to be turned on St. Martin's Day.Here is a story about a Protestant gentleman, who lived near Adare.  Who knew nothing about this Pisrog in connection with St. Martin's Day.This farmer ordered his men to start the threshing machine to thresh the corn, the day being St. Martin's Day the men were very reluctant to obey.  However they set the machine working, but as soon as the wheel revolved the belt of the machine broke and a man's arm was severely injured.  The men ran to the master to tell their tale of woe and the master ordered them to yoke the pony and go for the doctor. They yoked the pony but as soon as the wheel of the trap turned round the pony dropped dead, then the men told the master that it was unlucky for any wheel to be turned on St.\n(continues on next page)\n", "school_info": "School: Áth Dara (C.)", "metadata": [{"Location:": "Adare, Co. Limerick", "Teacher:": "\nMáire Boardman\n"}, {"Collector": "Kitty Alfred", "Gender": "female", "Age": "15", "Address": "Cummeen, Co. Limerick"}, {"Language": "English"}]}, "4758505/4749530/4951546": {"title": "Social - Food on Easter Sunday - Eggs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0846, Page 305", "Page 305"], "url": "https://www.duchas.ie/en/cbes/4758505/4749530/4951546", "text": "\nFood on Easter Sunday - Eggs2 at least for breakfast eggs for dinner and eggs for tea,Present of eggs given to children & called a \"Pruthóg\"On Christmas Eve - Currant Cake Turkey or Goose and Plum Pudding,On Shrove Tuesday called Shraft - PancakesOn Good Friday - no food taken until after mid-day: black fast then observed.On November Eve - whoever found Ring would be first to marry,On St Martin's Eve - fowl or domestic animal killed, and the blood spilled in honour of St Marten - saying while doing so\"in bnêir do Dia agus Do mhuire, agus mártún.\"\n\n\n\nYoung people often boasted of the number of fowl killed in their homes for St. Marten's night: they seemed to long for that feast for one saying was: \"St Marten will take (anything killed in his honour before his feast but he wont take after it\"\n(continues on next page)\n", "school_info": "School: Tullogher, Ros Mhic Treoin", "metadata": [{"Location:": "Tullagher, Co. Kilkenny", "Teacher:": "\nMrs Winnie Murphy\n"}, {"Collector": "(name not given)", "Occupation": "teacher"}, {"Language": "English"}]}, "4758505/4749533/4951547": {"title": "Legends of St Martin's", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0846, Page 308", "Page 308"], "url": "https://www.duchas.ie/en/cbes/4758505/4749533/4951547", "text": "\nSt Martin's (feast) should be held the eve (10th) and should consist of a meat supper. A man living in Lower Brownsford set out for Ross on 10th to bring home meat for the supper. He reached the town, bought the meat, putting it in a basket. However, meeting with friends, and having some treats the time slipped away too quickly, and it was nightfall when he set out home, and only then he began to regret that he didn't start home sooner, as he knew how disappointed his wife and children would be at having no meat for the supper. Just then a strange man on horseback overtook him and said: \"Hand me up that basket and I'll take a lift out of it for you.\" He did so and the horseman immediately leaped over the ditch and rode across the country and was soon out of sight. The man was then more troubled than ever at the thought of facing his wife and children empty-handed, and at the thought of having no meat cooked or uncooked for supper that night.But when he arrived home his wife had the meat just cooked, and she explained to him that a horseman\n(continues on next page)\n", "school_info": "School: Tullogher, Ros Mhic Treoin", "metadata": [{"Location:": "Tullagher, Co. Kilkenny", "Teacher:": "\nMrs Winnie Murphy\n"}, {"Collector": "(name not given)", "Occupation": "teacher"}, {"Language": "English"}]}, "4922036/4921089/4953576": {"title": "Lúidín", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0508, Page 43", "Page 43"], "url": "https://www.duchas.ie/en/cbes/4922036/4921089/4953576", "text": "\n(continued from previous page)\nsocks used be \"turned\" in this district up to forty years ago. (From J. Bennett, 85, blacksmith, Croom)\n\n\n\nSt. Martin's day is the 11th November. Except in very few homes in this district, the feast day and its eve pass unnoticed, but it is obvious from the tranditions that linger, that up to forty or at most fifty years, such was not the case. At that time and previously a male fowl was killed, a cock or a gander, on the doorstep, and the blood of the dying fowl was sprinkled on the door jamb and threshold. In Clare - Sixmilebridge district - it was sprinkled on the back of the door. In this area, it was also sprinkled at the entrance to the room doors and at the back door, if there\n(continues on next page)\n", "school_info": "School: Cromadh (B.)", "metadata": [{"Location:": "Croom, Co. Limerick", "Teacher:": "\nDáithí Ó Ceanntabhail\n"}, {"Language": "English"}]}, "4770004/4766027/4956443": {"title": "Month of May", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0828, Page 093", "Page 093"], "url": "https://www.duchas.ie/en/cbes/4770004/4766027/4956443", "text": "\n(continued from previous page)\nwould say the rosary in the home. In May a May bush was erected in the centre of a beautiful May altar in every home. He also said that the old people were filled with superstition, no woman would give away milk on May Day.\n\n\n\n10th November a fowl is killed on that day and the blood is spilled inside and outside the door step or else it is said all the fowl will die. No mills work on that day because it is said St. Martin was ground in a mill\n\n\n\nMichaelmas day is a special event on which a goose is cooked and eaten is called the Michaelmas goose.\n\n\n\nAll Souls night a candle is put in every window and left burning for the night.A good fire is put down   the hearth swept   and chairs put around it before people retire.\n", "school_info": "School: St John of God Convent, Rathdowney", "metadata": [{"Location:": "Rathdowney, Co. Laois", "Teacher:": "\nThe Sisters\n"}, {"Language": "English"}]}, "4758522/4751331/4956705": {"title": "St Martin's Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0851, Page 172", "Page 172"], "url": "https://www.duchas.ie/en/cbes/4758522/4751331/4956705", "text": "\nSt. Martin is much honoured in this country. Nearly every housewife kills a hen or a cock on St. Martin's Eve in honour of him. Then they get the blood of the hen and the back of the doords are sprinkled with it. The sign of the cross in made on the doors.St. Martin was ground in a mill. He was a martyr. A year after St. Martin's death every mill in the country was ordered not to be worked and the custom prevailed for many years. The mill in which St. Martin was ground was closed up\n(continues on next page)\n", "school_info": "School: Windgap (C.), Thomastown", "metadata": [{"Location:": "Windgap, Co. Kilkenny", "Teacher:": "\nBean Mhic Eóin\n"}, {"Collector": "Kathleen O Neill", "Gender": "female"}, {"Informant": "Mrs O' Shea", "Gender": "female"}, {"Language": "English"}]}, "4922109/4852942/5010941": {"title": "Paidir", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0527, Page 194", "Page 194"], "url": "https://www.duchas.ie/en/cbes/4922109/4852942/5010941", "text": "\nsome wheat in a saucepan. She then left to beg in other houses, but did not return. When St. Martin returned he found that the wheat had grown in the boiling water. This he saw was a sign of the anger of God. He threw himself into a mill. The mill stopped. Since then all mills are not worked on St. Martin's Day.\n(continues on next page)\n", "school_info": "School: Tobar Pádraig", "metadata": [{"Location:": "Patrickswell, Co. Limerick", "Teacher:": "\nAnraoi Ó Broin\n"}, {"Language": "English"}]}, "4922149/4856473/5011453": {"title": "St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0538, Page 003", "Page 003"], "url": "https://www.duchas.ie/en/cbes/4922149/4856473/5011453", "text": "\nSt Martin's day is on the 11th November and the day before it is St Martin's Eve. On this Eve it is the custom to kill a fowl of some kind and to spill its blood behid the door in honour of St. Martin. The blood is spilt while flowing from the wound on the fowl's neck.It was a custom in Ireland long ago that no wheels should be turning on St. Martin's day. Now that has died out but still no threshing is done.If a pig or any animal were sick the owner of it would offer it to St Martin and then it was supposed to get better. But it would have to be killed and its blood offered to St Martin on the next 10th November. Some people when the animal is all right, kill it, and use its blood, but in almost every case when this is done the meat would go bad. It was also a custom that the people would make the sign of the cross on the foreheads of the\n(continues on next page)\n", "school_info": "School: Port Ruadh, Aonach Úrmhumhan", "metadata": [{"Location:": "Portroe, Co. Tipperary", "Teacher:": "\nS.C. Ó Freathaille\n"}, {"Collector": "Maureen Seymour", "Gender": "female", "Address": "Castlelough, Co. Tipperary"}, {"Language": "English"}]}, "4922156/4856756/5012742": {"title": "St Martin's Day Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0538, Page 281", "Page 281"], "url": "https://www.duchas.ie/en/cbes/4922156/4856756/5012742", "text": "\nOn the 11th of November the Irish people keep the feast of St. Martin. They practise various customs on the 10th of November, the Eve of the feast. The following customs are practised in Boher :-The killing of the Bird.The people kill a cock or a duck or a goose on St. Martin's Eve. They cut the bird on the head and spill the blood at the threshold of the door and on the four corners of the kitchen floor in honour of St. Martin. Some people kill a pig in honour of St. Martin. I heard Mrs. Bray, Scragg telling a story of a family who lived in Portroe named Creamer. They promised a pig to St. Martin. On St. Martin's Eve they killed the pig. But they thought it a pity to spill the blood.\n(continues on next page)\n", "school_info": "School: Boher, Bushfield. Nenagh", "metadata": [{"Location:": "Boher, Co. Tipperary", "Teacher:": "\nMargaret A. Malone\n"}, {"Collector": "Paddy Mc Grath", "Gender": "male", "Address": "Curraghmore, Co. Tipperary"}, {"Informant": "Tom Mc Grath", "Gender": "male", "Address": "Curraghmore, Co. Tipperary"}, {"Language": "English"}]}, "4770049/4769204/5015028": {"title": "Cross-Road Dances", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0837, Page 144", "Page 144"], "url": "https://www.duchas.ie/en/cbes/4770049/4769204/5015028", "text": "\nCross-road dances were held in Timogue and Bauteogue up to 70 to 75 years ago. An old fiddler named Malachy used to play and all the young people gathered there to dance and play games like \"High-Gates\".A collection was made for the fiddler. As the hat was passed round and the pennies taken the giver was supposed to make a rhyme or say something amusing. Reference to the \"Pigeon on the Pier in Loughteague\"  (pigeons being kept at L. Ho.) \"the gravelled walks and bending boughs of Timogue\"   \"Here's to the high trees of  Arles\"\n\n\n\nYoung people used to dress up a churn-dash as an old woman and leave it against the door of a neighbour's house after nightfall on St. Brigid's Eve. Some of the players knocked on the door  then retreated swiftly. When the door opened the \"Brideog\" fell in on the kitchen floor to the great amusement of those inside as well as the hidden players. This was done only for fun.\n\n\n\nGreat fun \"making fools\" of others  - simple joking\n\n\n\nSt. Martin's Day or St Martin's Eve has no observance here. Very old people remember hearing of a cock being killed on St. M.'s Eve, blood being sprinkled on doors, stables, mangers, etc. to save the animals from sickness.Fuller information given in answer to Questionnaire.\n\n\n\nA nice green whitethorn bush is cut dressed with wild flowers (primroses, stitchworth etc ) egg-shells and gay ribbons and set before door in honour of Our Lady.\n", "school_info": "School: Loughteague, Stradbally", "metadata": [{"Location:": "Loughteeog, Co. Laois", "Teacher:": "\nBrigid Keane, Brighid Ní Chatháin\n"}, {"Language": "English"}]}, "4758545/4753433/5015185": {"title": "Care of the Feet", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0857, Page 231", "Page 231"], "url": "https://www.duchas.ie/en/cbes/4758545/4753433/5015185", "text": "\n(continued from previous page)\nKilkenny. He wanted ten shillings for them but would only get nine \"Be gobs\" said Jack \"don't let us fight over a bob.\" So he sold the five pair of boots for nine shillings.Whenever my Grandfather is making a bargain he often says \"be gobs don't let us fight over the bob.\" As Jack Bishop says.\n\n\n\nOn November 12th the feast of St Martin is always held. It is usual for the people to kill a chicken and spill the blood outside the door.Long ago when the blood was spilled it was the rule to give the chicken to some poor person.One time a woman\n(continues on next page)\n", "school_info": "School: St Fiachra's, Ullard, Borris, Co. Carlow", "metadata": [{"Location:": "Ullard, Co. Kilkenny", "Teacher:": "\nMáire Ní Ghuidhir\n"}, {"Collector": "Joan Mc Donald", "Gender": "female", "Address": "Ballyjohnboy, Co. Kilkenny"}, {"Language": "English"}]}, "4922210/4861022/5016193": {"title": "Saint Stephen's Day Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0553, Page 368", "Page 368"], "url": "https://www.duchas.ie/en/cbes/4922210/4861022/5016193", "text": "\n(continued from previous page)\ngirls of the district, and enjoyed a good night's fun. Nowadays, in most cases, the proceeds are divided amongst the band of wren boys.\n\n\n\nOn St Martin's day threshing engines do not  in this district work because on that day St Martin was ground up in a mill. It is thought that it would be very unlucky to thresh on this day, and that something unfortunate would happen to the workers.Joan O'KeefeParkstown\n\n\n\nHallow E'enHallow eve is an ancient festival the observances of which are fast dying out, but some of the old customs and games connected with it are still\n(continues on next page)\n", "school_info": "School: Moycarkey, Thurles", "metadata": [{"Location:": "Moycarky, Co. Tipperary", "Teacher:": "\nMichael Myers\n"}, {"Collector": "Joan O' Keeffe", "Gender": "female", "Address": "Parkstown, Co. Tipperary"}, {"Language": "English"}]}, "4922146/4856346/5016371": {"title": "St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0537, Page 181", "Page 181"], "url": "https://www.duchas.ie/en/cbes/4922146/4856346/5016371", "text": "\nSaint Martin's day is on the eleventh November. It is celebrated by killing a young duck or goose or a cock. The blood is spilled on the threshold of the door. People say it is unlucky if this is not done. My Mother always does and my Grandmother before her.\n\n\n\nHalloween is celebrated by several games. It is on the thiry first of October. Halloween is a very merry night. The neighbours gather into a certain house that night. They play games such as The three Saucers, the Snap Apple, diving for apples and other games. Some old people put money in a deep basin and the children fight to see who'll get it. After the games the young people sit by the fire and listen to the old people tell stories about the fairies. Young people are generally afraid to go out on Halloween as they say \"the Pooka and fairies are out\".\n", "school_info": "School: Cill na Naomh", "metadata": [{"Location:": "Kilnaneave, Co. Tipperary", "Teacher:": "\nMícheál Ó Flannagáin\n"}, {"Collector": "Mattais De Burca", "Gender": "male"}, {"Language": "English"}]}, "4922285/4867285/5022771": {"title": "Chalk Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0577, Page 119", "Page 119"], "url": "https://www.duchas.ie/en/cbes/4922285/4867285/5022771", "text": "\nChalk SundayIn this district the first Sunday of Lent is known as \"Chalk Sunday and there is an old custom associated with it which is still observed her. On that Sunday, which is the first after Shrovetide, those men who were eligible for Matrimony and who did not get married, are subjected to a good deal of annoyance. A group of boys armed with pieces of chalk wait out side the Church gates and when the congregation is leaving after Mass these boys make a raid on those who did not get married and draw streaks of chalk on the backs of their coats to the general amusement of the onlookers\n\n\n\nSt. Martin's night falls on the 11th November and there is an old custom associated with this night which is still observed here. On that night a goose is generally killed and her blood is spilled on the door step of the dwelling house and also on the door step of the horse's stable. As they spill the blood they say these\n(continues on next page)\n", "school_info": "School: Currach Púir (Curraghpoor), Dún na Sgíath", "metadata": [{"Location:": "Curraghpoor, Co. Tipperary", "Teacher:": "\nLiam Ó Duibhir\n"}, {"Language": "English"}]}, "4922309/4869022/5051620": {"title": "Bread", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0582, Page 232", "Page 232"], "url": "https://www.duchas.ie/en/cbes/4922309/4869022/5051620", "text": "\n(continued from previous page)\ngrated and put into a white cloth and squeezed then it was dried with flour and flattened out and baked on a pan with dripping underneath it. Before bread soda came into use the bread was made with \"Barm.\" This was made with boiled water allowed to cool and put into a wooden vessel. Into the water was put hops, boiled potatoes and salt it was then left near the fire.\n\n\n\nTea.Tea was first used in this district about fifty years ago. When it came into use first it was only drank on Christmas Day. Some times it was the leaves they ate. In those times only father, mother and youngest child got it to drink.\n\n\n\nRoads.The New Line which passes this school was made in the famine period and was a relief scheme. The Anglessie Line running to Hollyford was also a relief scheme.\n\n\n\nOn St. Martin's day each year a chicken is killed and the blood is sprinkled\n(continues on next page)\n", "school_info": "School: Coill an Easbuig (Bishopswood), Dundroma", "metadata": [{"Location:": "Bishopswood, Co. Tipperary", "Teacher:": "\nMícheál Mac Cárthaigh\n"}, {"Collector": "Josephine Ryan", "Gender": "female"}, {"Informant": "Mr Denis Ryan", "Gender": "male", "Address": "Bishopswood, Co. Tipperary"}, {"Language": "English"}]}, "4922282/4867111/5052467": {"title": "Saint Martin", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0576, Page 411", "Page 411"], "url": "https://www.duchas.ie/en/cbes/4922282/4867111/5052467", "text": "", "school_info": "School: Baile Thomáis, Gabhailín", "metadata": [{"Location:": "Thomastown, Co. Tipperary", "Teacher:": "\nÉamonn Ó Dubhlaine\n"}, {"Collector": "Patrick O' Dowd", "Gender": "male", "Address": "Moatquarter, Co. Tipperary"}, {"Informant": "Mrs O' Donnell", "Gender": "female", "Age": "76", "Address": "Moatquarter, Co. Tipperary"}, {"Language": "English"}]}, "4922236/4863168/5053279": {"title": "Song of Wren Boys", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0560, Page 387", "Page 387"], "url": "https://www.duchas.ie/en/cbes/4922236/4863168/5053279", "text": "\n\"The wren, the wren,The king of all birds.St Stephen's DayShe was caught in the furzeAlthough she is littleHer honour is greatGet up, great peopleAnd give us our treat\"\n\n\n\nThere is a tradition that it is unlucky to work mills on St. Martin's Day because St. Martin was ground up in a mill.\n\n\n\nMost people in this district used to kill a cock on St Martin's Day in former times. The cock was killed at the back door and was brought around the house, the blood being sprinkled on the four corners.\n\n\n\nIf blood of fowl were not spilled inside door on St. Martin's day people believed that all fowl would die.\n", "school_info": "School: Mullinahone (C.)", "metadata": [{"Location:": "Mullinahone, Co. Tipperary", "Teacher:": "\nMáire Ní Shéaghdha\n"}, {"Collector": "Marie O' Brien", "Gender": "female", "Address": "Compsey, Co. Tipperary"}, {"Informant": "Mrs O' Brien", "Gender": "female", "Age": "46", "Occupation": "farmer's wife", "Address": "Compsey, Co. Tipperary"}, {"Language": "English"}]}, "4922236/4863168/5053285": {"title": "Song of Wren Boys", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0560, Page 387", "Page 387"], "url": "https://www.duchas.ie/en/cbes/4922236/4863168/5053285", "text": "\n\"The wren, the wren,The king of all birds.St Stephen's DayShe was caught in the furzeAlthough she is littleHer honour is greatGet up, great peopleAnd give us our treat\"\n\n\n\nThere is a tradition that it is unlucky to work mills on St. Martin's Day because St. Martin was ground up in a mill.\n\n\n\nMost people in this district used to kill a cock on St Martin's Day in former times. The cock was killed at the back door and was brought around the house, the blood being sprinkled on the four corners.\n\n\n\nIf blood of fowl were not spilled inside door on St. Martin's day people believed that all fowl would die.\n", "school_info": "School: Mullinahone (C.)", "metadata": [{"Location:": "Mullinahone, Co. Tipperary", "Teacher:": "\nMáire Ní Shéaghdha\n"}, {"Collector": "Nellie O' Connell", "Address": "Mullinahone, Co. Tipperary"}, {"Informant": "Mrs O' Connell", "Gender": "female", "Age": "66", "Occupation": "shoemaker's wife", "Address": "Mullinahone, Co. Tipperary"}, {"Language": "English"}]}, "4922236/4863168/5053287": {"title": "Song of Wren Boys", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0560, Page 387", "Page 387"], "url": "https://www.duchas.ie/en/cbes/4922236/4863168/5053287", "text": "\n\"The wren, the wren,The king of all birds.St Stephen's DayShe was caught in the furzeAlthough she is littleHer honour is greatGet up, great peopleAnd give us our treat\"\n\n\n\nThere is a tradition that it is unlucky to work mills on St. Martin's Day because St. Martin was ground up in a mill.\n\n\n\nMost people in this district used to kill a cock on St Martin's Day in former times. The cock was killed at the back door and was brought around the house, the blood being sprinkled on the four corners.\n\n\n\nIf blood of fowl were not spilled inside door on St. Martin's day people believed that all fowl would die.\n", "school_info": "School: Mullinahone (C.)", "metadata": [{"Location:": "Mullinahone, Co. Tipperary", "Teacher:": "\nMáire Ní Shéaghdha\n"}, {"Informant": "John Norton", "Gender": "male", "Age": "73", "Occupation": "shopkeeper", "Address": "Mullinahone, Co. Tipperary"}, {"Language": "English"}]}, "4922277/4866676/5055809": {"title": "St Martin's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0575, Page 371", "Page 371"], "url": "https://www.duchas.ie/en/cbes/4922277/4866676/5055809", "text": "\nSt. Martin's NightLong ago it is said the only cow of a very poor woman fell sick. It happened to be St. Martin's night.The poor woman prayed to God through the intercession of St. Martin for the restoration of the cow and said that if it got better she would kill something else that was of less value.She killed a cock and sprinkled its blood around the door.  Ever since that night there is generally a cock killed and its blood spilled on the eve of St. Martin. This is done to invoke the blessing of St. Martin for the year.\n", "school_info": "School: Tankerstown", "metadata": [{"Location:": "Tankerstown, Co. Tipperary", "Teacher:": "\nThom. F. Meagher\n"}, {"Collector": "Mary Ryan", "Gender": "female", "Address": "Barnlough, Co. Tipperary"}, {"Informant": "Mrs Ryan", "Gender": "female", "Address": "Barnlough, Co. Tipperary"}, {"Language": "English"}]}, "5074437/4878334/5074439": {"title": "St Martin", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0627, Page 202", "Page 202"], "url": "https://www.duchas.ie/en/cbes/5074437/4878334/5074439", "text": "\nLong ago there lived in \"Rath An Uiste\" a protestant who had a big orchard and in the night time the people came and stole the apples. One day he came to St. Martin and told him that if he would catch one of the robbers he would believe in him. One night St. Martin was passing by the orchard and he saw a robber going over the wall bringing a bag of apples on his back. He commanded that he should be stuck to the wall. In the morning when the protestant looked out the window and saw him and he was converted.\n\n\n\nLong ago the people had no buckets but they had timber cans. They went around selling water from St. Senan's well out of these. One day a woman went to the well to get water and when she had the cans filled she could not lift them. A man came out of the well and lifted them for her. It is believed he was St. Senan.\n(continues on next page)\n", "school_info": "School: Cill Chaoi", "metadata": [{"Location:": "Kilkee, Co. Clare", "Teacher:": "\nAnraoi Ó Cathaláin\n"}, {"Collector": "Thomas Falvey", "Gender": "male"}, {"Informant": "Peter Falvey", "Gender": "male"}, {"Language": "English"}]}, "5074437/4878345/5074459": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0627, Page 213", "Page 213"], "url": "https://www.duchas.ie/en/cbes/5074437/4878345/5074459", "text": "\n(continued from previous page)\nOn one St Martins Eve the story is told of fishermen in Galway to whom he appeared when out fishing and told them to collect in their nets and return to the shore immediately. Some of them did but those who didnt were lost at sea that night.\n\n\n\nOnce there lived a man who offered a sheep in honour of St. Martin every St Martin's Eve. It came at last that he had no more sheep to offer and also that he had no more food food for his family. He went out to steal but he was caught and put into prison. When it came to St Martin's\n(continues on next page)\n", "school_info": "School: Cill Chaoi", "metadata": [{"Location:": "Kilkee, Co. Clare", "Teacher:": "\nAnraoi Ó Cathaláin\n"}, {"Collector": "Christie Hickie", "Gender": "male"}, {"Language": "English"}]}, "4922376/4875503/5078988": {"title": "Tomhaiseanna", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0620, Page 062", "Page 062"], "url": "https://www.duchas.ie/en/cbes/4922376/4875503/5078988", "text": "\n(continued from previous page)\n6212.Mo dheaidhe bocht ,isna maide faoi nocht  is e ag silt na ndeor ,cuile la fliuch .Fr:barr an dorais.13.Tá rud  ag gach duine ,rud nach bhfuiar dia is ní féidir leis é fágáil. Fr:maigistir.14.Ta rud ort,is níl aon blas do dho corp e is tá sé ort ina diaidh sin.Fr:t-ainm15.Dgha bhó bainne an taobh na gaoithe ,ceann bán oidhche is ceann sa ló is dá dtagadh siad sin lé chéile is gearr a beadh Éirinn beó .Fr:grian agus gealach.\n\n\n\nThe feast of St. Martin falls on the eleventh of November. In parts of Ireland fowl are killed and the blood spilt in different houses, the stable for the horse, in the cowhouse for the cow's and in the dwelling house. As the belief  was that the Saint protects the animals and people. Another belief was that if the blood was soaked in cotton wool and the wool kept safely and applied to affected parts when people\n(continues on next page)\n", "school_info": "School: Kilfenora (B.)", "metadata": [{"Location:": "Kilfenora, Co. Clare", "Teacher:": "\nP. Mag Fhloinn\n"}, {"Collector": "Séamus Ó Sealbhaigh", "Gender": "male"}, {"Language": "English"}]}, "4922376/4875504/5078990": {"title": "Lá Fhéile Naomh Máirtín", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0620, Page 063", "Page 063"], "url": "https://www.duchas.ie/en/cbes/4922376/4875504/5078990", "text": "\n(continued from previous page)\ngot pains. It was supposed to cure them.Some people also believe that it was not right to roll any sort of wheel's on that day.Séamus O'SealbhaighRang V\n\n\n\nIt is the custom in Ireland to spill blood in honour of St Martin in the firm belief that the house in which he is thus honoured its inhabitants shall be protected and their entrests guarded during the coming ___ by the saintThere was once a poor man who always honoured St Martin thus. One year he had no animal to kill for the St or no food for his large family. He tried every means but could obtain nothing so he resolved to kill his youngest child for St martin. The little child thinking it was a game laughed at his father who found it very hard to harm it. At last after a couple of attempts he resolved to put an end to the childs life when he heard a voice saying look behind you. On looking behind he saw a\n(continues on next page)\n", "school_info": "School: Kilfenora (B.)", "metadata": [{"Location:": "Kilfenora, Co. Clare", "Teacher:": "\nP. Mag Fhloinn\n"}, {"Collector": "Seán Ó Maolchaoine", "Gender": "male"}, {"Language": "English"}]}, "4922376/4875505/5078992": {"title": "Naomh Máirtín", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0620, Page 064", "Page 064"], "url": "https://www.duchas.ie/en/cbes/4922376/4875505/5078992", "text": "\n(continued from previous page)\nfine sheep on the floor. He killed the sheep gave the blood to St martin and had food for his wife and family. After all his endearous seemed to prosper and he lived very happy after.\n\n\n\nPeople kill three cocks on that day. One for the horses, one for the cattle and one for the sheep, in honour of St Martin. More dont put any cars on the road nor don't make any butter, nor dont work in the mills, because St Martin was ground in a mill. If you got a clean cloth, and rubbed it to the blood of what ever you killed, any sick animal you have, if you rubbed it to them, they would be cured. There was a man long ago, and he was crossing a river and he had a bag in his back. The bag fell into the river. The man prayed to St Martin to take up the bag for him and St Martin came and took up the bag for him.\n", "school_info": "School: Kilfenora (B.)", "metadata": [{"Location:": "Kilfenora, Co. Clare", "Teacher:": "\nP. Mag Fhloinn\n"}, {"Collector": "Pádraig Ó Deághdha", "Gender": "male"}, {"Language": "English"}]}, "4922378/4875720/5080371": {"title": "Naomh Máirtín", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0620, Page 307", "Page 307"], "url": "https://www.duchas.ie/en/cbes/4922378/4875720/5080371", "text": "\nBaineann a lán nósanna le oidhche Naomh Máirtín mar naomh breagh do b'eadh é agus thug sé a fhuil ar son an tSlánuightheora. Nuair a bhí sé ag múineadh na bPagánach do gortuigheadh é i muil agus fuair sé bás dá bhárr ar an t-aonmhadh lá déag de mhí na Samhna agus ón am san amach deintear a lán coilig óga do mharbhú in ónóir dó agus ní dheineann na muilte aon obair an lá san ach an oiread.Nuair a deintear an coileach do mharbhú doirtear an fuil ins an gcistean, ins an stábla, i gcró na mbó agus i gcró na muc mar ceaptar go gcoimeádann an fuil sin an bás ó na daoine is ó na hainmhithe. Gheibhtear píosa cadáis freisin agus cuirtear an fuil ann agus cuirtear i gcoimeád é.Tá sean-creideamhaint ag na daoine mar gheall ar Naomh Máirtín. Deirtear má thuiteann muc tinn agus má chuireann fear a' tighe marc áirithe ar an muc agus má deireann sé le na linn sin go ndoirtfeadh sé fuil na muice in ónóir do Naomh Máirtín go dtiocfaidh an muc slán arís ach má iompáileann sé a aigne agus má deireann sé go gcuirfidh sé an mhuc chun an mhargaidh chun í do dhíol gheobhaidh sí bás.Bhí fear ann uair amháin agus ní raibh ach aon mhac amháin aige. Tóne ab ainm dó agus do bhí árd-mheas ag an athair air. Thuit muc tinn air agus do gheall an fear go ndoirtfeadh sé fuil na muice in ónóir do Naomh Máirtín\n(continues on next page)\n", "school_info": "School: Cathair Seircín, Inis Tíomáin", "metadata": [{"Location:": "Cahersherkin, Co. Clare", "Teacher:": "\n-\n"}, {"Collector": "Bríghid Ní Orgáin", "Gender": "female"}, {"Informant": "Cáit Ní Chonóil", "Gender": "female", "Address": "Cahersherkin, Co. Clare"}, {"Language": "Irish"}]}, "4922368/4874901/5080731": {"title": "St Bridget's Crosses", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0617, Page 254", "Page 254"], "url": "https://www.duchas.ie/en/cbes/4922368/4874901/5080731", "text": "\n(continued from previous page)\nSt Bridgets night falls on the 1st February. It is the custom in most houses to make a cross and put it up on the rafters of the house.The crosses are made three different ways of rushes, straw, and of timber. It is the custom around here to make them of timber.\n\n\n\nST Martins night falls on the 11th of Nov. Everyone kills a cock and spills the blood in honour of the Saint. If a pig was choking you would cut her on the back and promise when you would be killing the pig you would spill the blood in honour of St Martin and the pig would be cured. A man met with some misfortune in his cattle once and would kill a lamb in honour of St Martin. When St\n(continues on next page)\n", "school_info": "School: Cill Seanaigh (B.), Inis", "metadata": [{"Location:": "Kilshanny, Co. Clare", "Teacher:": "\nMícheál Mac Craith\n"}, {"Collector": "Liam Ó Murchadha", "Gender": "male", "Address": "Kilshanny, Co. Clare"}, {"Informant": "Stephen Reynolds", "Gender": "male", "Address": "Kilshanny, Co. Clare"}, {"Language": "English"}]}, "4922383/4876309/5083147": {"title": "St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0621, Page 418", "Page 418"], "url": "https://www.duchas.ie/en/cbes/4922383/4876309/5083147", "text": "\nIn almost every house there is a \"cock\" killed and the blood spilled in some corner of the house.\n\n\n\nThis is  a jolly night in everyhome especially, with the youngsters. They look forward to a feed of apples nuts and beans divided out among them. They visit neighbours houses and play all kinds of games with apples and beans. Old tricks are played that will never die out. There is a big Halloween Cake placed on every table for the tea containing a article. - a ring for marriages, a bean for crossing water, and an old piece of rag for a coffin. There is great excitement at table among the family\n(continues on next page)\n", "school_info": "School: Lahinch", "metadata": [{"Location:": "Lehinch, Co. Clare", "Teacher:": "\nDónall Ó Ríordáin\n"}, {"Informant": "John O' Dwyer", "Gender": "male", "Age": "72", "Address": "Calluragh South, Co. Clare"}, {"Language": "English"}]}, "5087668/4878647/5087737": {"title": "St Martin's Blood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0628, Page 179", "Page 179"], "url": "https://www.duchas.ie/en/cbes/5087668/4878647/5087737", "text": "\nTo remove a birth mark.Rub the spot with cotton wool steeped in the blood spilled on St, Martin's eve.Spillin the Blood.The fowl killed in honour of St Martin must be killed on the flag of the fire. The blood is then spilled in the four corners of the house. It is next wiped up with a piece of cotton wool or tow. This is preseved during the year and is a cure for pains or birth marks\n", "school_info": "School: Maigh Sheasta", "metadata": [{"Location:": "Moyasta, Co. Clare", "Teacher:": "\nP. De Priondargas\n"}, {"Collector": "Lourde Haugn", "Address": "Einagh, Co. Clare"}, {"Informant": "Michael Mahony", "Gender": "male", "Age": "60", "Address": "Einagh, Co. Clare"}, {"Language": "English"}]}, "5070789/5063673/5094803": {"title": "Festival Customs - St Blaise's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1000, Page 140", "Page 140"], "url": "https://www.duchas.ie/en/cbes/5070789/5063673/5094803", "text": "\n(continued from previous page)\nthroats. On his day red flannel is blessed in the churches in Dublin.\n\n\n\nSt. Martin's Day falls on the 2nd of August. It is not kept as a holiday. No one observes the customs. Long ago the people said that it was unlucky to boil eggs on St. Martin's Day because you would be using water.\n\n\n\nSt. Patick's Day falls on the 17th march. This is a great festival and very much honoured in places like Dublin and other big places. On this day people wear shamrocks in honour of St. Patrick. They also send shamrocks to their friends\n(continues on next page)\n", "school_info": "School: Virginia (B)", "metadata": [{"Location:": "Virginia, Co. Cavan", "Teacher:": "\nE. O' Reilly\n"}, {"Collector": "Patrick Deal", "Gender": "male", "Address": "Ballaghanea, Co. Cavan"}, {"Language": "English"}]}, "5009126/4989163/5121349": {"title": "Weight-Throwing", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0747, Page 240", "Page 240"], "url": "https://www.duchas.ie/en/cbes/5009126/4989163/5121349", "text": "\n(continued from previous page)\nthe best as he could throw the heavy weight the farthest.  They also practised holding a weight up over their heads in their hight hands.  The man who could do this the greatest number of times won.\n\n\n\nEverybody kills a hen the night before Saint Martins day. They say that if you don't kill a hen for Saint Martin you wont have any luck with your hens.\n\n\n\nGirls go out on Hallow Eve night and pull a stalk of a cabbage of which the head is cut\n(continues on next page)\n", "school_info": "School: Ballinacliffy", "metadata": [{"Location:": "Ballynacliffy, Co. Westmeath", "Teacher:": "\nA. Ní Dhubhthaigh\n"}, {"Collector": "Pat Rushe", "Gender": "male", "Age": "12", "Address": "Tonagh, Co. Westmeath"}, {"Informant": "Mrs Rushe", "Gender": "female", "Age": "44", "Address": "Tonagh, Co. Westmeath"}, {"Language": "English"}]}, "5009116/4988227/5123057": {"title": "Festival Customs - Halloween", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0745, Page 037", "Page 037"], "url": "https://www.duchas.ie/en/cbes/5009116/4988227/5123057", "text": "\n(continued from previous page)\nan apple out of the ceiling. You hang an apple out of the ceiling by a strong twine. All hands are tied behind their back they all try to catch the apple in their mouth. Then in every house there is a black with a ring in it and it is cut up between all the members of the family and who ever gets the ring is the first to be married. Then you get a tub of water and throw a cuple of apples into it. Then each person dives and tries to take up the apples in their mouth.There are a lot of tricks played outside by the big people. They take away gates and cars and other things. They also tie doors outside.\n\n\n\nOn St. Martin's Day the people of this district kill a fowl and sprinkle its blood on the door. It is kept up in honour of one of the seven plagues which Moses brought upon the Egyptians when they had the Israelites in bondage.\n(continues on next page)\n", "school_info": "School: Ballinahowen", "metadata": [{"Location:": "Ballynahown, Co. Westmeath", "Teacher:": "\nT. Hanly\n"}, {"Collector": "Seamus O Cochláin", "Gender": "male"}, {"Language": "English"}]}, "5009251/5001598/5130702": {"title": "St Martin's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0880, Page 084", "Page 084"], "url": "https://www.duchas.ie/en/cbes/5009251/5001598/5130702", "text": "\nSaint Martin's night falls on the eleventh of November. Some years ago some fishermen went out to fish. In the night a storm arose and drowned most of the fishermen. What was left of the fishermen told the following story. When the storm was at its height they said they saw Saint Martin and he riding on a white horse. So ever after that night fishermen are afraid to go out on Saint Martin's night for fear of getting drowned.\n\n\n\nOn St. Martins night seven fishermen went out to fish. It was looking fine when they were going out. In the middle of the night a storm came on and five of the men were drowned. The two that were saved said they saw St. Martin riding on a horse in the night. No fishermen goes out to fish on St. Martin's night after that.\n", "school_info": "School: St. Brigid's (B.)", "metadata": [{"Location:": "Wexford, Co. Wexford", "Teacher:": "\nM. Gúld\n"}, {"Collector": "James Bright", "Gender": "male"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "male"}, {"Language": "English"}]}, "5009251/5001598/5130704": {"title": "St Martin's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0880, Page 084", "Page 084"], "url": "https://www.duchas.ie/en/cbes/5009251/5001598/5130704", "text": "\nSaint Martin's night falls on the eleventh of November. Some years ago some fishermen went out to fish. In the night a storm arose and drowned most of the fishermen. What was left of the fishermen told the following story. When the storm was at its height they said they saw Saint Martin and he riding on a white horse. So ever after that night fishermen are afraid to go out on Saint Martin's night for fear of getting drowned.\n\n\n\nOn St. Martins night seven fishermen went out to fish. It was looking fine when they were going out. In the middle of the night a storm came on and five of the men were drowned. The two that were saved said they saw St. Martin riding on a horse in the night. No fishermen goes out to fish on St. Martin's night after that.\n", "school_info": "School: St. Brigid's (B.)", "metadata": [{"Location:": "Wexford, Co. Wexford", "Teacher:": "\nM. Gúld\n"}, {"Collector": "Peter Crosbie", "Gender": "male"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "female"}, {"Language": "English"}]}, "5009256/5002071/5130801": {"title": "St Martin's Eve Disaster", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0881, Page 124", "Page 124"], "url": "https://www.duchas.ie/en/cbes/5009256/5002071/5130801", "text": "\nThe fishermen long ago, used fish day and night and would bring their dinner & supper with them The fishermen's wives used be out all day picking-up old bits of sticks for the fires. When the fishermen used come in with the fish, they would put them on the fire & have them for dinner.One night - St Martin's Night - they were out fishing. They never thought of the night that was in it. When they were out a while, they saw St Martin on a white horse & he pointed to them to go back. Some obeyed & some went on; so he told them three times to go back. They did not go, so he drafted them down to the bottom of the sea.\n(continues on next page)\n", "school_info": "School: Loch gCarman (Christian Bros.)", "metadata": [{"Location:": "Wexford, Co. Wexford", "Teacher:": "\nBr. Ó Héilighe\n"}, {"Collector": "(name not given)", "Gender": "male"}, {"Informant": "Mr Foley", "Relation": "parent", "Gender": "male", "Age": "56", "Address": "Wexford, Co. Wexford"}, {"Language": "Irish"}]}, "5009260/5002412/5130943": {"title": "Customs on Saint Martin's Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0882, Page 005", "Page 005"], "url": "https://www.duchas.ie/en/cbes/5009260/5002412/5130943", "text": "\nMany old customs are still held on Saint Martin's Eve.  Men dare not go out fishing that night because Saint Martin is said to be riding o'er the ocean.  It is believed that Saint Martin appears to the fishermen and commands them to return and if they refuse they are drowned.It is said the be lucky to kill and eat a (cock?) on Saint Martin's Eve and sprinkle its blood in the door post.My Grandfather told me that on Saint Martin's night sixty years ago two boatloads of men went out to fish.  They said that Saint Martin rode through the bay of Rosslare on a white horse.  When Saint Martin had passed through the bay a storm arose and one  boatload of men was washed upon the shore and six or seven were drowned, but the other boatload returned home safe.\n", "school_info": "School: Faythe", "metadata": [{"Location:": "The Faythe, Co. Wexford", "Teacher:": "\nAn tSr. Columcille\n"}, {"Language": "English"}]}, "5009266/5002981/5131265": {"title": "Scéal Oíche Mhártain", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0883, Page 003", "Page 003"], "url": "https://www.duchas.ie/en/cbes/5009266/5002981/5131265", "text": "\nBhí sé de nós ag iascairí Loch gCarman gan dul amach ag iascaireacht Oidhche Mártain mar níor mhaith leo beith ag obair Oidhche Féile a bPatrúin.Uair amháin amhthach, chuaidh mór-cuid de's na h-iascairí amach ina mbadáibh mar  oidhche breá gealaighe a bhí ann. Ní fada a sheoladar nuair a chonnacadar radharc iongantach. Chugadar fé ndeara marcach ag marcuigheacht ar mhuin  capaill liath ar an bhFairrge. Bhuail scannradh cuid aca agus d'fhilleadar abhaile. Amh bhí cuid eile aca ann go raibh sé dánaidheacht ortha dul ar aghaidh.D'eirigh anaithe go h-obann agus bádadh gach duine díobhtha-san a chuaidh ar aghaidh. Na fir a d'fhill abhaile sabháileadh iad agus ó shoin i leith ní théigheann iascairí Loch gCarman amach ag iascaireaccth an oidhche sin. Deir siad gurab é Naomh Mártan féin a chonnacthas an oidhche sin.(Scriobhtha ag Eilís Óg De Beanbhail, Sean-abhall, a chonnaic ar an bpáipéar é)\n", "school_info": "School: Caroreigh", "metadata": [{"Location:": "Carrowreagh, Co. Wexford", "Teacher:": "\nSéamas Ó Cellaigh\n"}, {"Collector": "Eilís Óg de Beanbhail", "Gender": "female", "Address": "Shanowle, Co. Wexford"}, {"Language": "English"}]}, "5009266/5002985/5131296": {"title": "St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0883, Page 007", "Page 007"], "url": "https://www.duchas.ie/en/cbes/5009266/5002985/5131296", "text": "\nSt. Martin's Day is on the eleventh of November. St. Martin was a great fisherman and he was ground up in a mill for his faith. None of the fishermen go out that night to fish in honour of him. In olden days they used to kill something and sprinkle the blood on the threshold outside the door. In olden times they used not turn the wheel of the mill on that day in honour of St. Martin or no one used to thresh on that day in honour of him\n\n\n\nOne evening on the tenth of November, a cock was boiling in a pot, on the fire. There was a lid on the pot, and all of a sudden, the lid flew off the pot. The cock got up on the edge of the pot, and crew three times. Then he got back into the pot again. People say that Saint Martin was ground in a mill next day, and after that, mill nor wheel worked on Saint Martin's Day. But one Saint Martin's Day, a man went out to plough, with a wheel plough, and a pair of horse's. He only went up and down the field, when the man, the horse's and the plough, were turned into big stones. They are still to be seen in Quigley's Mullachs in Robinstown, near Palace West\n", "school_info": "School: Caroreigh", "metadata": [{"Location:": "Carrowreagh, Co. Wexford", "Teacher:": "\nSéamas Ó Cellaigh\n"}, {"Collector": "Statia Gorman", "Gender": "female", "Address": "Carrowreagh, Co. Wexford"}, {"Informant": "John Gorman", "Gender": "male", "Address": "Carrowreagh, Co. Wexford"}, {"Language": "English"}]}, "5009266/5002985/5131302": {"title": "St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0883, Page 007", "Page 007"], "url": "https://www.duchas.ie/en/cbes/5009266/5002985/5131302", "text": "\nSt. Martin's Day is on the eleventh of November. St. Martin was a great fisherman and he was ground up in a mill for his faith. None of the fishermen go out that night to fish in honour of him. In olden days they used to kill something and sprinkle the blood on the threshold outside the door. In olden times they used not turn the wheel of the mill on that day in honour of St. Martin or no one used to thresh on that day in honour of him\n\n\n\nOne evening on the tenth of November, a cock was boiling in a pot, on the fire. There was a lid on the pot, and all of a sudden, the lid flew off the pot. The cock got up on the edge of the pot, and crew three times. Then he got back into the pot again. People say that Saint Martin was ground in a mill next day, and after that, mill nor wheel worked on Saint Martin's Day. But one Saint Martin's Day, a man went out to plough, with a wheel plough, and a pair of horse's. He only went up and down the field, when the man, the horse's and the plough, were turned into big stones. They are still to be seen in Quigley's Mullachs in Robinstown, near Palace West\n", "school_info": "School: Caroreigh", "metadata": [{"Location:": "Carrowreagh, Co. Wexford", "Teacher:": "\nSéamas Ó Cellaigh\n"}, {"Informant": "Mrs O' Leary", "Gender": "female", "Address": "Carrowreagh, Co. Wexford"}, {"Language": "English"}]}, "5009266/5002986/5131308": {"title": "St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0883, Page 008", "Page 008"], "url": "https://www.duchas.ie/en/cbes/5009266/5002986/5131308", "text": "\nOne St. Martin's Day a band of Wexford fishermen went out to fish. They were told not to go out but the heeded not this. About thirty boats went out, all of whom belonged to the town. After some time the sea became rough and the fishermen saw a man riding a white horse coming towards them, the horse seemed to be walking on the waves. This man told them to go back but none only one boat went back. Soon after this a great storm arose, and the fishermen lost hope. Upwards of seventy men were lost, and none were saved only those that went back. For years after that terrible disaster the fishermen never went to sea on St. Martins Day. Then after some years Rev. J. Roche blessed the harbour and permission was given to them to go out.\n", "school_info": "School: Caroreigh", "metadata": [{"Location:": "Carrowreagh, Co. Wexford", "Teacher:": "\nSéamas Ó Cellaigh\n"}, {"Collector": "Annie Ryan", "Gender": "female", "Address": "Mulmontry, Co. Wexford"}, {"Collector": "Mary Rochford", "Gender": "female", "Address": "Camaross, Co. Wexford"}, {"Informant": "Martin Ryan", "Gender": "male", "Address": "Mulmontry, Co. Wexford"}, {"Language": "English"}]}, "5009266/5003014/5131517": {"title": "Basket-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0883, Page 036", "Page 036"], "url": "https://www.duchas.ie/en/cbes/5009266/5003014/5131517", "text": "\nThere was once a man named Patrick Murphy.  He lived in a gate lodge in Bricketstown.He used to make baskets and beehives.  He made them with wheaten straw and strong briars and sallies and peel them and bind them around the straw.  He used to sow corn out of them in old times.  He used make beehives and armchairs.  He would bring to the market and get good price for them.\n\n\n\nSt Martins Day is on the eleventh of November.  St Martin was a great fisherman.None of the fishermen go out to fish on St Martins night.  St Martin was ground up in a mill.  In olden times Millers would not mill on St Martins Day.  People kill something on the eve of St Martins and sprinkle the blood out side the door in honour of St Martin.\n", "school_info": "School: Caroreigh", "metadata": [{"Location:": "Carrowreagh, Co. Wexford", "Teacher:": "\nSéamas Ó Cellaigh\n"}, {"Collector": "Mary Gorman", "Gender": "female", "Address": "Carrowreagh, Co. Wexford"}, {"Informant": "Mrs Gorman", "Gender": "female", "Address": "Carrowreagh, Co. Wexford"}, {"Language": "English"}]}, "5044588/5024047/5138527": {"title": "St Martin", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0804, Page 035", "Page 035"], "url": "https://www.duchas.ie/en/cbes/5044588/5024047/5138527", "text": "\nSt. Martin was a miller. It is said that he was ground up in a mill, and anyone who threshes on St. Martin's day will be killed or the mill will go on fire.\n\n\n\nSt. Brigid was living on the Curragh. One day she went to a rich farmer and asked him to give her a patch of grassland to feed a cow. He asked her how much she wanted. She said as much as her mantle would cover. She spread out her mantle and it covered a large tract of land which was called the Curragh. That is how the Curragh was formed.\n", "school_info": "School: Rahan", "metadata": [{"Location:": "Raheen, Co. Offaly", "Teacher:": "\nB. Nic Lochlainn\n"}, {"Language": "English"}]}, "5044617/5026390/5141355": {"title": "St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0812, Page 145", "Page 145"], "url": "https://www.duchas.ie/en/cbes/5044617/5026390/5141355", "text": "\nOn St Martin's Day the people used to kill a cock, and sprinkle the blood on the door-step for luck.On St Martin's Day, St Martin was ground in a mill. No mill grinds on St Martin's Day.On St Martin's Day the old people kill a hen, and sprinkle the blood on the door for luck.Long ago St Martin's Day was known as \"Old Hallow Eve\", and some of the old people have their Hallow Eve customs on this day.\n\n\n\n1. On St John's Day long ago the old people used to say Seven Rosarys to St John to bring a blessing down on the family.2. On the eve of St John's Day bonfires are lighted on the tops of high hills. All the people go to the nearest bonfire, and they sing and dance till the fire burns down.\n", "school_info": "School: Clonmacnoise", "metadata": [{"Location:": "Clonmacnoise, Co. Offaly", "Teacher:": "\nP. Ó Maolmhuaidh\n"}, {"Language": "English"}]}, "5044699/5032933/5146126": {"title": "St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0911, Page 255", "Page 255"], "url": "https://www.duchas.ie/en/cbes/5044699/5032933/5146126", "text": "\nIt is said that St. Martin was caught in a mill wheel and was killed. For that reason in many places up to the present time all mill wheels are stopped for a quarter of an hour on that day. Another custom is to kill a cock on the eve of St. Martin's day and sprinkle the blood on the doorstep. The first poor person who comes on St. Martin's day is given the cock.\n\n\n\nOn St. Martin's Day it was the custom with people to kill one of the fowl from the farmyard such as a hen or a duck or a goose or any kind of fowl. St Martin's day is on the eleventh of November. Some people say the fowl should be killed on the night of the tenth and others say that it should be killed on the night of the eleventh, but it is usually done on the night of the tenth of November.The people used to sprinkle\n(continues on next page)\n", "school_info": "School: Kildavin, Ferns", "metadata": [{"Location:": "Kildavin, Co. Carlow", "Teacher:": "\nTadhg de Brí\n"}, {"Collector": "Aidan Murphy", "Gender": "male"}, {"Informant": "Mr Kehoe", "Gender": "male", "Age": "74", "Occupation": "farmer", "Address": "Drumderry, Co. Wexford"}, {"Language": "English"}]}, "5044699/5032933/5146130": {"title": "St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0911, Page 255", "Page 255"], "url": "https://www.duchas.ie/en/cbes/5044699/5032933/5146130", "text": "\nIt is said that St. Martin was caught in a mill wheel and was killed. For that reason in many places up to the present time all mill wheels are stopped for a quarter of an hour on that day. Another custom is to kill a cock on the eve of St. Martin's day and sprinkle the blood on the doorstep. The first poor person who comes on St. Martin's day is given the cock.\n\n\n\nOn St. Martin's Day it was the custom with people to kill one of the fowl from the farmyard such as a hen or a duck or a goose or any kind of fowl. St Martin's day is on the eleventh of November. Some people say the fowl should be killed on the night of the tenth and others say that it should be killed on the night of the eleventh, but it is usually done on the night of the tenth of November.The people used to sprinkle\n(continues on next page)\n", "school_info": "School: Kildavin, Ferns", "metadata": [{"Location:": "Kildavin, Co. Carlow", "Teacher:": "\nTadhg de Brí\n"}, {"Collector": "Maggie Kavanagh", "Gender": "female"}, {"Informant": "Mrs J. Kavanagh", "Gender": "female", "Occupation": "farmer's wife", "Address": "Cranemore, Co. Carlow"}, {"Language": "English"}]}, "5044699/5032934/5146134": {"title": "St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0911, Page 256", "Page 256"], "url": "https://www.duchas.ie/en/cbes/5044699/5032934/5146134", "text": "\n(continued from previous page)\nthe blood of the fowl on the hinges of the door and on the doorstep because it is said that St. Martin was killed in a mill for grinding corn and that his blood was sprinkled around the door of the mill.In olden times every mill used to stop working on St. Martin's Day, but nowadays some mills keep working that day. It is said that once on the night of St. Martin's Day some fishermen went to fish and St. Martin appeared to them riding on a white horse and he told them to go back. Some of the men went back but others of them went on to fish. It is said that everyman who went to fish that night was drowned.\n\n\n\nSt. Martin's Day is on the 11th of November. It was an old custom in this district to kill some sort of fowl. It was generally a cock. The cock was killed and the blood drawn outside the door and let drop all round the farmyard if\n(continues on next page)\n", "school_info": "School: Kildavin, Ferns", "metadata": [{"Location:": "Kildavin, Co. Carlow", "Teacher:": "\nTadhg de Brí\n"}, {"Collector": "Eily Fennelly", "Gender": "female"}, {"Informant": "Mrs Nolan", "Gender": "female", "Age": "73", "Occupation": "shopkeeper", "Address": "Ballyshancarragh, Co. Carlow"}, {"Language": "English"}]}, "4921642/4887253/5152541": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0313, Page 106", "Page 106"], "url": "https://www.duchas.ie/en/cbes/4921642/4887253/5152541", "text": "\n(continued from previous page)\nhad to catch salmon. They used bring home the fish in bags and corn it in a tub. After a week or so they used take it out of the tub, hang it up and store it for the year. Nobody sold any of the fish in this locality but kept it for their own use. Courtmacsherry men used catch sprats also in nets.    They did most of the fishing in the summer, between 4 or 5 p.m. and midnight.\n\n\n\nNoone used to go out fishing on St Martin's Night in November. One night - date not known - the men were out fishing as usual. The neighbours; boats used be in groups and a stranger scarcely ever came in among them. This night as a group were fishing out beyond Barrel Rock a strange boat came up out of nowhere and pulled away between all the neighbours' boats which were anchored and fishing. As suddenly as it appeared it\n(continues on next page)\n", "school_info": "School: Boireann", "metadata": [{"Location:": "Burren, Co. Cork", "Teacher:": "\nEibhlín Ní Bhriain\n"}, {"Informant": "William O' Driscoll", "Gender": "male", "Age": "circa 65", "Address": "Burren, Co. Cork"}, {"Language": "English"}]}, "4921645/4887473/5153958": {"title": "Saint Martin's Day - November 22nd", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0313, Page 313", "Page 313"], "url": "https://www.duchas.ie/en/cbes/4921645/4887473/5153958", "text": "\nOn this day an annual fair was held in Killbrittain village. People came from places 15 and 20 miles away bringing turkeys, geese, pigs etc. And the line of carts stretched from the church at the top of the village to the post office at the other end. For days and weeks before hand the children saved and gathered pennies to buy sweets.\n", "school_info": "School: Cill Bhriotáin (C.)", "metadata": [{"Location:": "Kilbrittain, Co. Cork", "Teacher:": "\nCáit de Búrca\n"}, {"Language": "English"}]}, "5177638/5175075/5192100": {"title": "May Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0594, Page 199", "Page 199"], "url": "https://www.duchas.ie/en/cbes/5177638/5175075/5192100", "text": "\n(continued from previous page)\nto stir the white-thorn as during May, Those who bring in white thorn flowers will have not chickens.\n\n\n\nWe have a great many customs such as killing the cock and sprinkling the blood and hanging the cock behind the door for St Martin's Day.\n\n\n\nIf a red haired woman came on New Year's Day you would not have a bit of luck for the year. There is a Piseóg about \"Hansel Monday\", if you gave out money on that day you would be giving it out the whole year round.\n", "school_info": "School: Cnoc an Éin, Cuinche", "metadata": [{"Location:": "Knockanean, Co. Clare", "Teacher:": "\nMáire, Bean Uí Bhraonáin\n"}, {"Collector": "Mary Mangan", "Gender": "female", "Address": "Kilbreckan, Co. Clare"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "male", "Age": "65", "Address": "Kilbreckan, Co. Clare"}, {"Language": "English"}]}, "5177645/5176116/5199590": {"title": "St Martin's Day Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0597, Page 067", "Page 067"], "url": "https://www.duchas.ie/en/cbes/5177645/5176116/5199590", "text": "\nSt Martins Day falls on the eleventh of November each year. In this locality it is a custom that a fowl should be killed such as a hen or a chicken or a goose and the blood sprinkled in the four corners of the house.Another custom is to sprinkle some of the blood on a piece of cloth an keep it this is a cure for a head-ache.The cloth is used by tying it across the persons head who has the pain. It is also a custom that no mll wheel should turn on that day because St Martin was killed in a mill. A strange story is told about a Dutch-man who had an oil-mill in Bally-Liddane in the land of Dr Roche Kelly.The Dutch-man's name was Peace and one St Martin's eve when the working men were\n(continues on next page)\n", "school_info": "School: Creatlach (B.)", "metadata": [{"Location:": "Cratloe, Co. Clare", "Teacher:": "\nSeán Breathnach\n"}, {"Collector": "Michael Gleeson", "Gender": "male", "Age": "14", "Address": "Brickhill East, Co. Clare"}, {"Language": "English"}]}, "5177626/5173947/5199888": {"title": "November Eve 31st October", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0591, Page 332", "Page 332"], "url": "https://www.duchas.ie/en/cbes/5177626/5173947/5199888", "text": "\nYoung and old enjoy this.Games are played by the younger members.Friends are invited to tea where they have a Barm brack with a ring inside, whoever get the ring will be married first.Burning Beans and nuts is one form of amusement.The black beans represents a man - the white one a woman.  They are placed side by side after being named (to who are friendly or as they sometimes say pulling a string) if they stay together they will be married - if they flee they will not.Burning lead was another game.  Melt the lead and pour into cold water - shapes taken make fun.Stories are told.\n\n\n\nThe eve of feast is marked by killing a cow and sprinkling the blood at the door step and corners, also a goose, which are eaten.Next day 11th.People often kill pig this date too.This read is kept by everyone.  They have some fowl if possible for dinner.The name Martin is common and follows for generations in families.\n\n\n\nAll Soul's Day 2nd November is a day of great devotion here.  Every family is represented at mass.  An offering for masses is made by each family before mass.  This ensures masses a certain number from each priest during our(?) money\n", "school_info": "School: Lúbán Díge (Bodyke)", "metadata": [{"Location:": "Bodyke, Co. Clare", "Teacher:": "\nBríd, Bean Uí Chadhla\n"}, {"Language": "English"}]}, "5177649/5176757/5202238": {"title": "Féilí na Bliana - Lá Fhéile Mártain", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0598, Page 200", "Page 200"], "url": "https://www.duchas.ie/en/cbes/5177649/5176757/5202238", "text": "\nLá le MártainFowl killed, blood spilled on door posts.A piece of tow steeped in blood is preserved as a cure, some say as a cure for pain in side and some say as cure for a sudden pain.It was said that it was not right to work machinery of any sort on that day.\n\n\n\nOidhche Shamhna - eating apples nuts, beans.Barm bracks with ring in them for tea. Finder of ring first married.Burning beans. Two beans put beside fire on hearth. Named as boy & girl. If they remain beside one another - marriage.\n(continues on next page)\n", "school_info": "School: Meelick (B.)", "metadata": [{"Location:": "Meelick, Co. Clare", "Teacher:": "\nEoghan Ó Néill\n"}, {"Language": "English"}]}, "5009025/4978709/5216053": {"title": "Festival Customs - Halloween", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0719, Page 638", "Page 638"], "url": "https://www.duchas.ie/en/cbes/5009025/4978709/5216053", "text": "\n(continued from previous page)\nShe got such a fright that when it was coming near the date she fell sick and died of terror on the very date she saw on the coffin.\n\n\n\nSaint Martin's feast day falls on the 11th of November.  Saint Martin built a corn mill and when it was finished the man that helped to build it said, \"Now you have it built and there is no water to turn it.\"  The man got into the grinder and Saint Martin went over to a lake and when he was walking back the water flowed after him.  The mill wheel began turning and the man was ground up.  Long ago mills were never worked on Saint Martin's Eve.\n", "school_info": "School: Faughalstown", "metadata": [{"Location:": "Faughalstown, Co. Westmeath", "Teacher:": "\nBean Mhic Gabhann\n"}, {"Collector": "James Shaw", "Gender": "male"}, {"Informant": "Mr R. Shaw", "Gender": "male", "Address": "Tuitestown, Co. Westmeath"}, {"Language": "English"}]}, "5162135/5157252/5218484": {"title": "Saint Martin", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0603, Page 584", "Page 584"], "url": "https://www.duchas.ie/en/cbes/5162135/5157252/5218484", "text": "\nSaint Martin's day is celebrated on the 11th of November each year. There are not many old customs practised in this district.A fowl is killed and the blood spilt on the ground in honour of the saint. It a horse is working on a farm a cock is killed and the blood spilt at the stable door, but if it is a mare that is working on a farm a hen is killed.Long ago no mills were worked or no wheels turned because it is said Saint Martin was martyred by being ground in a mill.\n", "school_info": "School: Kilkerrin, Leaba Síoda", "metadata": [{"Location:": "Kilkerin, Co. Clare", "Teacher:": "\nSeán Mac Aindréis\n"}, {"Collector": "Teresa O' Connell", "Gender": "female", "Address": "Mountshannon East, Co. Clare"}, {"Informant": "Mrs O' Connell", "Relation": "parent", "Gender": "female", "Address": "Mountshannon East, Co. Clare"}, {"Language": "English"}]}, "5215799/5212064/5219928": {"title": "St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137B, Page 01_007", "Page 01_007"], "url": "https://www.duchas.ie/en/cbes/5215799/5212064/5219928", "text": "\nThe people always kill something a goose or some other animal in honour of St. Martin. When it is killed, they sprinkle part of the blood in each of the four corners of the house so that St. Martins blessing will be in the house for the year. Whatever you kill you can kill it any time between November night and St Martins night.Its not right to spin on St. Martins day\n(continues on next page)\n", "school_info": "School: Creganbane", "metadata": [{"Location:": "Cregganbaun, Co. Mayo", "Teacher:": "\nDáithí Mag Réill\n"}, {"Collector": "Ellie Grady", "Gender": "female"}, {"Language": "English"}]}, "5215799/5212147/5220032": {"title": "St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137B, Page 06_005", "Page 06_005"], "url": "https://www.duchas.ie/en/cbes/5215799/5212147/5220032", "text": "\nThe people kill something from the first of November to the 11th of November St. Martins day in honour of God and of St. Martin and they put blood on the four corners of the house and they make the sign of the cross on every ones foreheads with the blood. Whatever you kill for St. Martins you must kill it from the first of November to the 11th because St. Martin wont take anything after the 11th.It is not right for the waver to put round the rim of the loom on St. Martins night or on St. Martins day or it isnt right to stir the rim of the\n(continues on next page)\n", "school_info": "School: Creganbane", "metadata": [{"Location:": "Cregganbaun, Co. Mayo", "Teacher:": "\nDáithí Mag Réill\n"}, {"Collector": "Nellie Egan", "Gender": "female"}, {"Language": "English"}]}, "5215799/5212210/5220172": {"title": "St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137B, Page 08_005", "Page 08_005"], "url": "https://www.duchas.ie/en/cbes/5215799/5212210/5220172", "text": "\nIt is a old costom to kill a goose on St. Martins night in honour St Martins or if you have not a goose to kill any another sort of fowl will do as well. When you have the goose killed they say it is right to put some of her blood in the four corners of the house. Nine nights after November night the people has for killing the goose. It would not do to kill her on St. Martins night or on St. Martins day. St Martin will take nothing after him but all before him.\n(continues on next page)\n", "school_info": "School: Creganbane", "metadata": [{"Location:": "Cregganbaun, Co. Mayo", "Teacher:": "\nDáithí Mag Réill\n"}, {"Collector": "Bridgie Browne", "Gender": "female"}, {"Language": "English"}]}, "5215799/5212308/5220479": {"title": "St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137B, Page 10_005", "Page 10_005"], "url": "https://www.duchas.ie/en/cbes/5215799/5212308/5220479", "text": "\nEvery house kill a goose or some thing in honour of St. Martins. When it is killed it is right to sprinkle the blood in each of the four corners of the house and it is right to throw the last drop into the fire. By doing this you will have St. Martin s blessing in the house during the whole year.It is never right to turn the rim of the wheel on St Martins day because if you would the next time you would try to spin it would not turn.It is said that a\n(continues on next page)\n", "school_info": "School: Creganbane", "metadata": [{"Location:": "Cregganbaun, Co. Mayo", "Teacher:": "\nDáithí Mag Réill\n"}, {"Collector": "Nora Kitterick", "Gender": "female"}, {"Language": "English"}]}, "5215799/5212346/5220491": {"title": "St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137B, Page 12_003", "Page 12_003"], "url": "https://www.duchas.ie/en/cbes/5215799/5212346/5220491", "text": "\nIt is right to kill some thing for St Martins day a goose or a duck or a sheep or something. To put a drop of blood in the four corners of the house in honour of St Martin.It isnt right to go spinning on that day.CorrectionsIt is not right to go spinning on that day.\n", "school_info": "School: Creganbane", "metadata": [{"Location:": "Cregganbaun, Co. Mayo", "Teacher:": "\nDáithí Mag Réill\n"}, {"Collector": "Michael Kilcoyne", "Gender": "male"}, {"Language": "English"}]}, "5215799/5212401/5220514": {"title": "St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137B, Page 14_004", "Page 14_004"], "url": "https://www.duchas.ie/en/cbes/5215799/5212401/5220514", "text": "\nEverybody draws blood for St. Martins Night in honour of the Great St. You can kill it from November night untill St Martins day but not after. When the blood is drawn if you put a drop of bbood in each corner of the four corners of the house and St Martins blessing in the house for the year.It is not right to spin on St Martins night. You shouldent touch the spinning wheel at all on St Martins night.CorrectionsSt Martins Day\n(continues on next page)\n", "school_info": "School: Creganbane", "metadata": [{"Location:": "Cregganbaun, Co. Mayo", "Teacher:": "\nDáithí Mag Réill\n"}, {"Collector": "Tommie Duffy", "Gender": "male"}, {"Language": "English"}]}, "5215799/5212439/5220534": {"title": "St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137B, Page 16_002", "Page 16_002"], "url": "https://www.duchas.ie/en/cbes/5215799/5212439/5220534", "text": "\npeople say its not right to spin or to fish St. Martin's day.Long ago on St. Martins day three gangs of men in three boats said they would go out and in spite of anybody and that they would fish St. Martin himself if they met him. Out they went in there three boats and began to fish. When they had gone out a while on the sea a man appeared to them standing on the water and waved his hand towards the land. Only one boat went in and the other two boats were drowned.When you would kill anything for St. Martins\n", "school_info": "School: Creganbane", "metadata": [{"Location:": "Cregganbaun, Co. Mayo", "Teacher:": "\nDáithí Mag Réill\n"}, {"Collector": "Michael Corrigan", "Gender": "male"}, {"Language": "English"}]}, "5215799/5212491/5220675": {"title": "St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137B, Page 18_002", "Page 18_002"], "url": "https://www.duchas.ie/en/cbes/5215799/5212491/5220675", "text": "\nIt is right to kill something in honour of Saint Martin.It is not right to spin on saint Martin's dayWhen it is killed it is right to spill a drop of blood in the four courners of the house.CorrectionsIt is not right to spin on Saint Martins dayWhen it is killed it is right to spill a drop of blood in the four corners of the house.\n", "school_info": "School: Creganbane", "metadata": [{"Location:": "Cregganbaun, Co. Mayo", "Teacher:": "\nDáithí Mag Réill\n"}, {"Collector": "Martin Armstrong", "Gender": "male"}, {"Language": "English"}]}, "5215799/5212538/5220730": {"title": "St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137B, Page 20_006", "Page 20_006"], "url": "https://www.duchas.ie/en/cbes/5215799/5212538/5220730", "text": "\n\"When you are Killing a gose for St. Marten's night it is right to let a drop the blood in the four corners of the house.It is not right to put up the spinning wheel on St. Martin's night or to go near it. If you put up the spinning wheel on St Martin's night you will not be fit to put it up again on St. Martin's.CorrectionsSt. Martins night\n", "school_info": "School: Creganbane", "metadata": [{"Location:": "Cregganbaun, Co. Mayo", "Teacher:": "\nDáithí Mag Réill\n"}, {"Collector": "Martin Armstrong", "Gender": "male"}, {"Language": "English"}]}, "5215799/5212601/5221152": {"title": "St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137B, Page 22_003", "Page 22_003"], "url": "https://www.duchas.ie/en/cbes/5215799/5212601/5221152", "text": "\nWhen they kill a goose for St. Martins it is right to keep the blood and not to let it drop. It is not rigt to spin on St. Martins day.When they are going killing a goose for St Martins it right to bless yourself with the blood before you kill her.When they kill the goose it is right to spill the blood in the four corners of\n(continues on next page)\n", "school_info": "School: Creganbane", "metadata": [{"Location:": "Cregganbaun, Co. Mayo", "Teacher:": "\nDáithí Mag Réill\n"}, {"Collector": "Patrick Kilcoyne", "Gender": "male"}, {"Language": "English"}]}, "5215799/5212656/5221211": {"title": "St Martin's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137B, Page 24_005", "Page 24_005"], "url": "https://www.duchas.ie/en/cbes/5215799/5212656/5221211", "text": "\nThere is a custom on St. Martins Night of killing a goose and sprinkling the blood of the all around the floor of the house.The old people used say that it was not right to spin on St. Martins day or St. Martins night.\n", "school_info": "School: Creganbane", "metadata": [{"Location:": "Cregganbaun, Co. Mayo", "Teacher:": "\nDáithí Mag Réill\n"}, {"Collector": "Martin Grady", "Gender": "male"}, {"Language": "English"}]}, "5215799/5212780/5221267": {"title": "Saint Martin's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137B, Page 26_029", "Page 26_029"], "url": "https://www.duchas.ie/en/cbes/5215799/5212780/5221267", "text": "\nThere was once a woman who lived in Bunowen. She was spinning on St. Martins night and a knock came to her door. She opened it and in came ten women. They carried a small spinning wheel with them. They set it up beside the other womans wheel and began to spin. The woman of the house got afraid and she said she wanted to go out for a can of water. She went out but she had not gone far when one of the women followed her. She told her that the other women meant to kill her. The woman of the house thought of running away but she thought of her child in the cradle. The other woman told her\n(continues on next page)\n", "school_info": "School: Creganbane", "metadata": [{"Location:": "Cregganbaun, Co. Mayo", "Teacher:": "\nDáithí Mag Réill\n"}, {"Collector": "Pat Malley", "Gender": "male"}, {"Language": "mixed"}]}, "5215799/5212806/5221285": {"title": "St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137B, Page 28_005", "Page 28_005"], "url": "https://www.duchas.ie/en/cbes/5215799/5212806/5221285", "text": "\nThe people say that it is right to kill something in honour of St Martin or at least to draw some of it's blood and to let the first three drops fall to the ground in honour of St Martin.Some people say that there was an old woman long ago and she had noting put one hen and She did not like to kill her and what she done was to cut her círín and by that way she made her bleed.They say it is not right to spin or sow on St Martin night. They say there was once a woman sowing and that the cloth lighted in her hands and she was half\n(continues on next page)\n", "school_info": "School: Creganbane", "metadata": [{"Location:": "Cregganbaun, Co. Mayo", "Teacher:": "\nDáithí Mag Réill\n"}, {"Collector": "Anthony Wallace", "Gender": "male"}, {"Language": "English"}]}, "5215799/5212863/5221343": {"title": "St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137B, Page 30_004", "Page 30_004"], "url": "https://www.duchas.ie/en/cbes/5215799/5212863/5221343", "text": "\nIt is an old doing to kill a gosse sometimes between November night and St. Martin's night in honour of St. Martin. You must put a drop of the goose's blod in each of the four corners of the house and a drop in the fire.It is not right to leave a spinning wheel prepared for spinning on St. Martin's night and to go to bed. Because the fairies will be spinning all the night and it never will be any use after.\n(continues on next page)\n", "school_info": "School: Creganbane", "metadata": [{"Location:": "Cregganbaun, Co. Mayo", "Teacher:": "\nDáithí Mag Réill\n"}, {"Collector": "Katie Kilcoyne", "Gender": "female"}, {"Language": "English"}]}, "5215813/5214668/5221362": {"title": "Festival Customs - Hallow Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138D, Page 02_029", "Page 02_029"], "url": "https://www.duchas.ie/en/cbes/5215813/5214668/5221362", "text": "\n(continued from previous page)\nwith hers or his teeth. The boys or girls who bites the apple has it. They put money in a deep basin which is filled with water. Whoever is able to take the (water) money out of the water with his or her teeth they can keep it. Apples are roasted too on Hallow Eve.\n\n\n\nGeese, ducks, hens or sheep are killed in every house before St. Martin's Day. The animal must be slain\n(continues on next page)\n", "school_info": "School: St Bridget's", "metadata": [{"Location:": "Derrymore, Co. Mayo", "Teacher:": "\nMáire Uí hOistín\n"}, {"Collector": "Áine Ní Oistín", "Gender": "female", "Address": "Derrymore, Co. Mayo"}, {"Language": "English"}]}, "5215799/5212958/5221424": {"title": "St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137B, Page 32_004", "Page 32_004"], "url": "https://www.duchas.ie/en/cbes/5215799/5212958/5221424", "text": "\nIt is an old saying to kill something in honour of St. Martin. When the blood is drawn they put some of it in each of the four corners of the house so that Martins blessing will be on the house for the year.It is not right to go to bed on St Martins night leaving the spinning wheel prepared for spinning. It is thought that if the fairies get the wheel in working order the will go spinning on it.\n", "school_info": "School: Creganbane", "metadata": [{"Location:": "Cregganbaun, Co. Mayo", "Teacher:": "\nDáithí Mag Réill\n"}, {"Collector": "Thomas Kilcoyne", "Gender": "male"}, {"Language": "English"}]}, "5215813/5214896/5237483": {"title": "St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138D, Page 06_043", "Page 06_043"], "url": "https://www.duchas.ie/en/cbes/5215813/5214896/5237483", "text": "\nBefore St. Martin's Day in every house something is killed. Most people kill a goose. They spill some of the blood.\n\n\n\nOn November Night the fairies destroy the black-berries and from that out no one eats the black-berries. The boys of the village pull heads of cabbage and go around striking the doors with them.\n\n\n\nSt. Patrick told every man to drink a glass of whiskey to celebrate bun [?]\n(continues on next page)\n", "school_info": "School: St Bridget's", "metadata": [{"Location:": "Derrymore, Co. Mayo", "Teacher:": "\nMáire Uí hOistín\n"}, {"Collector": "Seán Máirtín Caoigín Ó hOistín", "Gender": "male"}, {"Language": "English"}]}, "5215813/5215016/5237870": {"title": "May Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138D, Page 09_006", "Page 09_006"], "url": "https://www.duchas.ie/en/cbes/5215813/5215016/5237870", "text": "\n(continued from previous page)\nany knot that would be put on a rope or a string.\n\n\n\nEvery one do have a bonfire of there own on St Johns night in honour of St John. The people do make there bon-fire on the Creagans so that every one would be able to see it. The people do stations around the bon-fire. When the old people are going om they take a few coals with them and put them in the meadows so that good crops of corn and hay will be expected.\n\n\n\nEvery one kill some-thing before St Martins Day in honour of St Martin. The people say that he will not\n(continues on next page)\n", "school_info": "School: St Bridget's", "metadata": [{"Location:": "Derrymore, Co. Mayo", "Teacher:": "\nMáire Uí hOistín\n"}, {"Collector": "Tomás Ó Tónra", "Gender": "male"}, {"Language": "English"}]}, "5215813/5215469/5240091": {"title": "St John's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138D, Page 17_014", "Page 17_014"], "url": "https://www.duchas.ie/en/cbes/5215813/5215469/5240091", "text": "\n(continued from previous page)\nsticks and oil put into it also. Then all the people gather together and say prayers around the fire. Where there is a house with itself that family makes a bonfire of their own. When the fire is worn, the people throw a coal into their crops to keep them from harm for the rest of the year.\n\n\n\nOn St Martins day it is right to kill something. Everyone that has gees kills one in honour of St Martin. People that has'nt geese\n(continues on next page)\n", "school_info": "School: St Bridget's", "metadata": [{"Location:": "Derrymore, Co. Mayo", "Teacher:": "\nMáire Uí hOistín\n"}, {"Collector": "Máire Ní Raghallaigh", "Gender": "female"}, {"Language": "English"}]}, "5215784/5209944/5278345": {"title": "St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0095C, Page 03_062", "Page 03_062"], "url": "https://www.duchas.ie/en/cbes/5215784/5209944/5278345", "text": "\nOn St. Martin's day we all kill a fowl and sprinkle the blood on the four corners of the house. Long ago a woman had nothing to kill for St.Martin's night and she was going to kill her only son whose name was Martin.A neighbour of hers came in and gave her a fowl to kill instead. That is why we always kill something for St.\n(continues on next page)\n", "school_info": "School: Gleann an Dúin - Prison", "metadata": [{"Location:": "Prison East, Co. Mayo", "Teacher:": "\nMáire A. Ní Dhocartaigh\n"}, {"Collector": "Annie M. Reilly", "Gender": "female"}, {"Informant": "Patrick Reilly", "Gender": "male", "Age": "87", "Address": "Prison North, Co. Mayo"}, {"Language": "English"}]}, "5215784/5210690/5279189": {"title": "St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0095C, Page 17_023", "Page 17_023"], "url": "https://www.duchas.ie/en/cbes/5215784/5210690/5279189", "text": "\nOn St Martin's day people draw the blood of a fowl and sprinkle it on the four cournes of the house.May dayOn May day nobody cleans out a cow-house or throws out ashes. Everyone would likes to make to make money, but [to] spend none [on that day]. They also churn on that day and there beliefe is there is more butter on the milk on that\n(continues on next page)\n", "school_info": "School: Gleann an Dúin - Prison", "metadata": [{"Location:": "Prison East, Co. Mayo", "Teacher:": "\nMáire A. Ní Dhocartaigh\n"}, {"Collector": "Margaret Kearns", "Gender": "female"}, {"Informant": "Mrs Kearns", "Gender": "female", "Age": "40", "Address": "Manulla, Co. Mayo"}, {"Language": "English"}]}}