{"4758606/4758288/4785796": {"title": "Rickets", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0952, Page 164", "Page 164"], "url": "https://www.duchas.ie/en/cbes/4758606/4758288/4785796", "text": "\nThe seventh son of a family has a cure for warts and rickets.\n\n\n\nA child who was born after his father's death has a cure for a child's dirthy mouth.\n\n\n\n1. A cabbage leaf warmed and put to the cheek.2. Put your head through the window and the pane (pain) will be gone.\n(continues on next page)\n", "school_info": "School: Nart", "metadata": [{"Location:": "Nart, Co. Monaghan", "Teacher:": "\nMrs Mc Adoo\n"}, {"Informant": "Mrs George Mc Adoo", "Gender": "female", "Address": "Lisnaveane, Co. Monaghan"}, {"Language": "English"}]}, "5070791/5064177/5095939": {"title": "Bird-Lore - The Kingfisher", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1001, Page 084", "Page 084"], "url": "https://www.duchas.ie/en/cbes/5070791/5064177/5095939", "text": "\nThe kingfisher is a wild bird. She generally stays around a lake or river. If one sat on the shore of a lake the watcher would see her diving down for fish. The kingfisher is about half the size of the robin. Her back is green and her underparts are brown. She has brown and white puffs where her ears ought to be. The most remarkable thing about the kingfisher is her long strong beak.\n\n\n\nA good cure for the rose is to get some \"chicken-weed\" and chop it up fine. Then pour boiling water on it, (and) make a poultice of it and put it on the swelling and the poultice will cure it.\n\n\n\nIf a child had \"the \"rickets\" go he would have to be brought to where the seven generations of blacksmiths worked\n(continues on next page)\n", "school_info": "School: Virginia (B)", "metadata": [{"Location:": "Virginia, Co. Cavan", "Teacher:": "\nE. Ó Raghallaigh\n"}, {"Collector": "Brendan Mooney", "Gender": "male", "Address": "Ballaghanea, Co. Cavan"}, {"Informant": "Charles Mooney", "Gender": "male", "Age": "64", "Address": "Ballaghanea, Co. Cavan"}, {"Language": "English"}]}, "5070852/5070325/5099527": {"title": "Local Cures", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1024, Page 084", "Page 084"], "url": "https://www.duchas.ie/en/cbes/5070852/5070325/5099527", "text": "\nLocal Cures.Mrs Mary Duffy of Enaugh, Lisnageer Cootehill has the cure of the jaundice. She got it from her late husband who in turn got it from his first wife. It is an herb that is dug out of the ground and she makes it any time of the year.\n\n\n\nCure for the Rickets.The child with rickets is brought on the morning of the first of May to a bog. It is thrown into a bog hole three times. Then it is placed in a blanket and carried home. If the child sweats it will recover. When the person is in the act of throwing the child into the hole he says \"In the name of the Father, Son a Holy Ghost. The child is taken out of the hole immediately after being thrown in. The sweating must take place as the child is being carried home in the blanket.\n(continues on next page)\n", "school_info": "School: Lios Áirne", "metadata": [{"Location:": "Lisarney, Co. Cavan", "Teacher:": "\nMicheál Ó Cinnéide\n"}, {"Language": "English"}]}, "5070847/5069910/5099611": {"title": "Old Irish Forts", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1022, Page 367", "Page 367"], "url": "https://www.duchas.ie/en/cbes/5070847/5069910/5099611", "text": "\n(continued from previous page)\nscallops for thatching. He went towards the fort and saw just what he wanted growing on the ring of the fort. He began to cut them, and as he cut them he threw them on the ground behind him. Finally when he thought he had sufficient cut, he was going to gather them up. To his surprise he could not get one of them. When he was going to the entrance, he beheld the scallops placed neatly and tied in two bundles, one on each side. He got such a fright that he ran home and told the old man. He told him he should not have cut them on the fort, and that it was the \"wee folk\" who took them.\n\n\n\nThere are many cures for rickets.Some of them are :-The child that has the rickets is brought to the forge of the man that has the cure. The child is set on the anvil and the man\n(continues on next page)\n", "school_info": "School: Drong (2)", "metadata": [{"Location:": "Drung, Co. Cavan", "Teacher:": "\nBean Uí Fháinín\n"}, {"Language": "English"}]}, "5008960/4971084/5110547": {"title": "Chilblains", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0700, Page 127", "Page 127"], "url": "https://www.duchas.ie/en/cbes/5008960/4971084/5110547", "text": "\nChilblains:- 1. Paraffin oil. C. Delaney2 Tops of crab trees + boil sleep finger in water T. Regan3 Steep in water in which parsnips were boiled4 Rub with cream of goat's milk5 Dip fingers affected in water collected on cows droppings in field - T Regan6 Rub with mutton suet7 Melt Pigs lard + mix with mustard8 Steep in water in which potatoes were boiled\n\n\n\nRing Worm. Blue stone and lard.Sting. BlueSting of Nettle:- Get a capog and rub it in saying \"Dalkin Dalkin in and out take the sting of the nettle out.\"Measles. \"Red nettle boiled in milk.\"Wart: Clay off heel of boot when moon is full.\n\n\n\nRickets:- Split a young ash + put child through opening\n", "school_info": "School: St Columba's Abbey, Navan", "metadata": [{"Location:": "Navan, Co. Meath", "Teacher:": "\nBr. Abban O' Donoghue\n"}, {"Informant": "J.O' Rourke", "Address": "Rathaldron, Co. Meath"}, {"Language": "English"}]}, "5008978/4972960/5111413": {"title": "Local Cures - Rickets", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0705, Page 164", "Page 164"], "url": "https://www.duchas.ie/en/cbes/5008978/4972960/5111413", "text": "\nA man named Edward Farrelly in the downland of Neagh has the cure of the rickets.  The child has to go three mornings to him fasting and he carries the child round the anvil three time saying In the name of the Father and of the Son and of the Holy Ghost each time.\n\n\n\nThe whitlow is a very common disease among the people.  It appears on the finger.  Mrs Peter Rogers Hermitage, Moynalty, Kells, Co. Meath has the cure of it.  She cures it with the herbs of the earth.Father and of son and of the holy ghost amen.  This is done with nine of the stones, the tenth is thrown away.  This is performed for them and then the person is cured.\n", "school_info": "School: Ughtyneill", "metadata": [{"Location:": "Ughtyneill, Co. Meath", "Teacher:": "\nMaighréad, Bean Uí Chinnéide\n"}, {"Language": "English"}]}, "5008978/4972962/5111437": {"title": "Local Cures - Rickets", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0705, Page 166", "Page 166"], "url": "https://www.duchas.ie/en/cbes/5008978/4972962/5111437", "text": "\nRicketsThere is a man in the town-land of Feagh called Edward Farrelly who has the cure of the Rickets.  He has the cure of this disease because he is the seventh generation of Blacksmiths.\n\n\n\nJaundiceThere are two men in the locality who have the cure of the Jaundice viz Thomas Pringle, Tierworker, Baileborough, Cavan, and Dan Dunne, Marlstown, Kilbeg. Co. Meath. The former has a charm which he tells to no one. The latter makes medicine which he gives to the person to drink in small quantities. This medicine consists of Foxes tongue, the three sisters, some herbs and a pint of Porter.\n\n\n\nRheumatismIf a person suffering from Rheum\n(continues on next page)\n", "school_info": "School: Ughtyneill", "metadata": [{"Location:": "Ughtyneill, Co. Meath", "Teacher:": "\nMaighréad, Bean Uí Chinnéide\n"}, {"Language": "English"}]}, "5162170/5160567/5164461": {"title": "To Cure Black Leg in Calf", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0947, Page 019", "Page 019"], "url": "https://www.duchas.ie/en/cbes/5162170/5160567/5164461", "text": "\n(continued from previous page)\nmakes the sign of the cross on the calfs side with them. He cannot take money from anybody for whom he cures a calf, if he does, he looses the power he has for curing. He says some prayer also when working at the irons.\n\n\n\nTake a tooth out of an old skull and put it to the sore tooth.\n\n\n\nPatrick Murray of Coolnacarte, Scotshouse, Clones, can cure a sprain, he rubs the sore spot and pulls it, in doing so he says a prayer. He is over seventy years of age. The person who attends him with this ailment must visit him three times.\n\n\n\nJames Boylan of Scotshouse can cure the rickets because he is the seven generation of blacksmiths.\n\n\n\n1. Monday for health, Tuesday for wealth, Wednesday the best day of all, Thursday for losses, Friday for crosses, and Saturday no day at all2. The bride should wear, something old\n(continues on next page)\n", "school_info": "School: Killyfargy", "metadata": [{"Location:": "Killyfargy, Co. Monaghan", "Teacher:": "\nB. Ó Mórdha\n"}, {"Language": "English"}]}, "5162170/5160573/5164469": {"title": "A Country Dance", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0947, Page 022", "Page 022"], "url": "https://www.duchas.ie/en/cbes/5162170/5160573/5164469", "text": "\n(continued from previous page)\nthough on a lesser scale, was continued down to the recent Dance Hall licensing act (1935) and is still surreptitiously practised at parties. The polka referred to above was introduced over sixty years ago in this district. Of Irish dances, step-dancing, the four-hand reel (the favourite), the round reel (or hooking reel), jigs, and eight -hand reel survived down to Gaelic Leage days.\n\n\n\nAs Peter sat on a tombstone,Jesus came to him all alone,'Peter, Peter why do you weep?''O! Lord I have the toothache'.Any one who says this prayer three times by day and three times by night never shall have the toothache\"\n\n\n\nThe seventh generation of blacksmiths has the cure of the rickets.  My father who is the seventh generation of blacksmiths has the cure.  He cures in the following way.  He gets water from a stream that runs south.  He says\n(continues on next page)\n", "school_info": "School: Killyfargy", "metadata": [{"Location:": "Killyfargy, Co. Monaghan", "Teacher:": "\nB. Ó Mórdha\n"}, {"Informant": "Éamon Boylan", "Gender": "male"}, {"Language": "English"}]}, "4921828/4909835/5182853": {"title": "The Local Forges", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0375, Page 101", "Page 101"], "url": "https://www.duchas.ie/en/cbes/4921828/4909835/5182853", "text": "\n(continued from previous page)\nother person that worked for the farmer was favoured with gifts, such as, ground to grow potatoes, a horse to cart these to his home or to bring coal and iron to his forge.   The blacksmith was also looked on as the strong man and usually performed with success at local patterns, especially in weight-throwing. The forge was the great centre to hear the latest news. In the country district the smith's hob was never without its Seanchaidhe.Collector: Patrick DwaneInformant: Mr. James Dwane\n\n\n\nThe local smiths were able to cure rickets in children by a certain charm.\n\n\n\nLong ago there was a forge on the lands of Mr. Michael Myers, Graigue, Kildorrery, Co. Cork, at Graigue Cross and afterwards\n(continues on next page)\n", "school_info": "School: Graigue, Cill Dairbhe", "metadata": [{"Location:": "Graigue, Co. Cork", "Teacher:": "\nMícheál Ó Lionacháin\n"}, {"Collector": "Elizabeth Mc Carthy", "Gender": "female", "Address": "Ballyshurdane, Co. Cork"}, {"Informant": "Mr Thomas Mc Carthy", "Gender": "male", "Age": "50", "Address": "Ballyshurdane, Co. Cork"}, {"Language": "English"}]}, "5162184/5161954/5191074": {"title": "Famine Times 1846-7", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1018, Page 147b", "Page 147b"], "url": "https://www.duchas.ie/en/cbes/5162184/5161954/5191074", "text": "\n(continued from previous page)\nThe people died in great numbers in the fields and along the roads. Sickness followed the Famine and in some place whole families were wiped out.Twp men  were appointed to go to Dundalk for the meal.Cures.Rickets:- A cure for rickets was to get a blacksmith to bath the child in  water taken fro a south-running stream and then to put it under an ass three times.Warts:- A cure for warts was to get a blacksmith to put the person suffering from it on an anvil and to hit it three times saying some words.\n\n\n\nIn olden times Blacksmiths were supposed to be able to cure a child with rickets They bathed the child in water taken from a south running stream and then put the child under an ass six times\n", "school_info": "School: Cootehill (B)", "metadata": [{"Location:": "Cootehill, Co. Cavan", "Teacher:": "\nW. Healy\n"}, {"Language": "English"}]}, "5162184/5161956/5191080": {"title": "Marriages", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1018, Page 149", "Page 149"], "url": "https://www.duchas.ie/en/cbes/5162184/5161956/5191080", "text": "\n(continued from previous page)\n[-]\n\n\n\nA child in this town (Cootehill) was suffering from  rickets. Doctors or no other person could cure it. It's parents took it to a blacksmith who lived beside the town of Clones. His name was BoylanHe got the cure handed down to him from seven generations of his family.He put the child on an anvil and covered it with a damp cloth and then tipped it on the back with a sledge three times saying some words while doing so. The parents took the child back to him three times. At the end of this time the child was cured.\n", "school_info": "School: Cootehill (B)", "metadata": [{"Location:": "Cootehill, Co. Cavan", "Teacher:": "\nW. Healy\n"}, {"Informant": "(name not given)", "Gender": "unknown"}, {"Language": "English"}]}}