{"4427869/4352244/4435990": {"title": "The Successive Principals of the School", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0103, Page 045", "Page 045"], "url": "https://www.duchas.ie/en/cbes/4427869/4352244/4435990", "text": "\n(continued from previous page)\nThe lease for the plot was granted by the parish priest Very Revd, John O'Malley to Stephen Heskin, Ballyrourke, Neale; Patrick Burke, Loughnagankey, Neale, and Patrick O'Connor, Neale Village, for a period of 900 yards.  The lease is dated 25th July 1883 and was forwarded on the 9th March 1888 to Most Reverend John MacEvilly. Archbishop of Tuam. The present trustees use The Archbishop of Tuam, Right Reverend Dean Dalton and Very Reverend Canon Healy P.P. (Kilmaine).\n\n\n\n43 - 46 - 46A.Cure for headache - measuring the head etc.\n\n\n\n47.Shrove - Pancake Night. St. John's Day - Bonfire.St. Martin's Day - Killing of a goose.Three tests for future lifeName-Chriatian name of future husband. (Cont.)\n", "school_info": "School: The Neale (B.)", "metadata": [{"Location:": "Neale, Co. Mayo", "Teacher:": "\nTomás Mac an Bháird\n"}, {"Language": "English"}]}, "4427873/4352629/4437289": {"title": "Marthain Phádraig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0104, Page 007", "Page 007"], "url": "https://www.duchas.ie/en/cbes/4427873/4352629/4437289", "text": "\n(continued from previous page)\nna trí fearsaigthe den rann go béarfadh  sé a anam saor as purgadóir.\"****Cures for headaches.Many years ago there lived an old woman near Balinrobe, Co. Mayo, who had a cure for a headache. Many people who travelled from far and near to this old woman to get rid of this terrible pain. The cure was:She had a tape for measuring and she would measure the person's head three times, Each time when measuring she would say: \"In the name of the father, and of the son, and of the Holy Ghost.\" This old woman would\n\n\n\nna trí fearsaigthe den rann go béardafh sé a anam saor as pudrgadóir.\"****************************Cures for HeadachesMany years ago there lived an old woman near Ballinrobe, Co. Mayo, who had a cure for a headache. Many people travelled from far and near to this old woman to get rid of this terrible pain.The cure was:She had a tape for measuring and would measure the persons head three times. Each time when measuring she would say: \"In the name of the father and the son, and of the Holy Ghost.\" This old woman would\n(continues on next page)\n", "school_info": "School: Baile na nGarraidhthe", "metadata": [{"Location:": "Ballygarries, Co. Mayo", "Teacher:": "\nT. Ó Tuairisc\n"}, {"Collector": "Kathleen Sheridan", "Gender": "female", "Address": "Knocknadrimna, Co. Mayo"}, {"Informant": "Mary Merrick", "Relation": "unknown", "Gender": "female", "Age": "80", "Address": "Hollymount Demesne, Co. Mayo"}, {"Language": "English"}]}, "4427853/4350818/4453503": {"title": "Snaidhm na Péisteoige", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0099, Page 121", "Page 121"], "url": "https://www.duchas.ie/en/cbes/4427853/4350818/4453503", "text": "\n(continued from previous page)\nthree times in a certain way over the calf's tail, the calf would be cured.\n\n\n\nIf a person had a head ache he should go to a person that could measure your head the person would get a tape, and measure your head.  When she would have the person's head measured the person that could measure would say some words.  The person would go three Mondays another day of the week would not do.  The old people believed that it would be cured when the person would go three Mondays.\n", "school_info": "School: Koilmore", "metadata": [{"Location:": "Cuilmore, Co. Mayo", "Teacher:": "\nSéamus Ó Murchadha\n"}, {"Informant": "John Nally", "Gender": "male", "Address": "Ballykinava, Co. Mayo"}, {"Language": "English"}]}, "4427923/4358002/4454117": {"title": "Tine Dhia", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0115, Page 448", "Page 448"], "url": "https://www.duchas.ie/en/cbes/4427923/4358002/4454117", "text": "\n(continued from previous page)\n(h) Beirbhightear searbhán in uisge guir ag a dó dhéag a clog san oidhche agus gach duine in a chodhladh. Ól siar an bhruith agus tiocfaidh feabhas ort gan mhoill.(i) Cuir ola lampa i gcupán ina raibh puitín agus cuimil an leacht de'n teine dhia. Is gearr go mbeidh sé go [?] arís.\n\n\n\n(h) Beirbhightear searbhán in uisge guir ag a dó dhéag a clog san oidhche agus gach duine in a chodhladh. Ól siar an bhruith agus tiocfaidh feabhas ort gan mhoill.(i) Cuir ola lampa i gcupán ina raibh puitín agus cuimil an leacht de'n teine dhia. Is gearr go mbeidh sé go [?] arís.Tinneas Cinn1. Dean an tlú do theitheadh go mbíonn sé dearg annsin cuir isteach i gcupán leamhnachta é agus ól siar an leamhnach. Imthigheann an pian ar ball.2. Ceangal ceirsiúr go dluth ar an gceann agus leigheasann sé an galar.3. Fáigh tubháile agus dean é do fhlincadh i bpota uisge. Má cheangluigheann tu é go dluth timpeall an chinn deanann sé an inteann do fuaradh agus imthigheann an pian.\n(continues on next page)\n", "school_info": "School: Leath-cheathrú", "metadata": [{"Location:": "Lecarrow, Co. Mayo", "Teacher:": "\nLiam Ó Maidín\n"}, {"Language": "Irish"}]}, "4427999/4366195/4468856": {"title": "Leigheasanna - Tinneas Cinn", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0133, Page 164", "Page 164"], "url": "https://www.duchas.ie/en/cbes/4427999/4366195/4468856", "text": "\nBhiodh go leor leigheasanna ag ná daoine fado ar Tinneas Cinn ceangailtí piosa tead thart air an ceann agus d'imtigeadh an tinneas cinn. Biodh leigeas eile aca cuireadh siad uiscefuar anuas air an gceann agus d'imtigeadh an pian annsin. Tomaistear an ceann le snáthaidh figeadora comh mait. Dhéanfad siad ortha thomhasiad siad an ceann, dearad siad paidreaca agus annsin d'imtigeadh an tinneas cinn.Ceangailtí píosa ribín thart ar an gceann. Binneog an t-ainm a bhiodh ar an bpiosa ribín sin. Uaireannta eile gheibhtí téad dubh agus tomhasiad siad an ceann agus cuirtí comhartha ná croise trí h-uaire ar an nghruaig agus d'imtigeadh an tinneas cinn.\n\n\n\nFaithne\n(continues on next page)\n", "school_info": "School: Beannchor Iorrais", "metadata": [{"Location:": "Bangor, Co. Mayo", "Teacher:": "\nMícheál Mac Énrí\n"}, {"Collector": "Eíbhlín Ní Gachain", "Gender": "female", "Address": "Bangor, Co. Mayo"}, {"Informant": "Eíbhlín Ní Gunáin", "Relation": "not a relative", "Gender": "female", "Address": "Bangor, Co. Mayo"}, {"Language": "Irish"}]}, "4427984/4363902/4469307": {"title": "Araid (ortha) in Aghaidh an Doigh-Fhiacail", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0129, Page 403", "Page 403"], "url": "https://www.duchas.ie/en/cbes/4427984/4363902/4469307", "text": "\n(continued from previous page)\ntrí paidir, trí Ábhé Maria, agus Cré i n-aghaidh an doigh fhiacail leighisfear é. Is ceart an araid a sgríobh síos agus a choinneáil in do phóca.\n", "school_info": "School: Gleann Caisil", "metadata": [{"Location:": "Glencastle, Co. Mayo", "Teacher:": "\nEoghan Ó Súilleabháin\n"}, {"Informant": "Pádraic Ó Tuathail", "Gender": "male", "Age": "75", "Address": "Doolough, Co. Mayo"}, {"Language": "Irish"}]}, "4428253/4388977/4476482": {"title": "Cure for Mumps", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1028, Page 46", "Page 46"], "url": "https://www.duchas.ie/en/cbes/4428253/4388977/4476482", "text": "\nEvery son and daughter has the cure for the mumps if they have a father and mother of the one name: I you get this person to lead you by a rope to water you will soon be cured.\n\n\n\nThere is a man named Johnson who has a cure for Itch. He lives near Donegal town.\n\n\n\nThere is a cure for chin cough by going under a donkey three times.\n\n\n\nThere is a cure for warts by getting a hole in a stone in which there is water a rub it on the wart but you must not be looking for it.\n\n\n\nThere is a well in the townland of Carrickboy in which there is a cure for a headache.\n", "school_info": "School: Seosamh Naomhtha", "metadata": [{"Location:": "Ballyshannon, Co. Donegal", "Teacher:": "\nAn Bráthair Naiti\n"}, {"Collector": "Michael Mac Grath", "Gender": "male", "Address": "Carrickboy, Co. Donegal"}, {"Informant": "Mrs Mc Grath", "Relation": "unknown", "Gender": "female", "Age": "circa 40", "Address": "Carrickboy, Co. Donegal"}, {"Language": "English"}]}, "4569059/4567891/4583387": {"title": "Cure for Worms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0037, Page 182", "Page 182"], "url": "https://www.duchas.ie/en/cbes/4569059/4567891/4583387", "text": "\n(continued from previous page)\ncrawling all over it. The child was cured.(P. O' Donavan)\n\n\n\nThe Claddagh man was also able to remove foreign matters from the eyes by means of a charm.  He used get the afflicted person to sit near a table on which he had placed a glass.  Then he mumbled his set of words.  When he was finished the offending matter was to be seen in the glass of water.\n\n\n\nThese were cured by a process known as \"Measuring the Head\". A weaver named Farragher from Cloonkeen, and a tailor named Burke of Carnaseer practised this charm. The sufferer visited them three times. The head was measured, and words used while doing so, on each occasion. Home-spun woollen thread was usually used in making the measurements.\n", "school_info": "School: Sean-Bhaile Mór", "metadata": [{"Location:": "Shanballymore, Co. Galway", "Teacher:": "\nPádraig Ó Donnabháin\n"}, {"Collector": "Patrick O' Donovan", "Gender": "male", "Occupation": "teacher", "Address": "Dunmore, Co. Galway"}, {"Language": "English"}]}, "4616628/4594779/4615565": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0004, Page 319", "Page 319"], "url": "https://www.duchas.ie/en/cbes/4616628/4594779/4615565", "text": "\n(continued from previous page)\nBurns: limewater mixed with the white of an egg and linseed oil.Hiccoughs: sip of cold water or a lump of sugar. Hold one nostril.Sore throats: to gargle with common salt and soda dissolved in warm water. Put hot bran or salt in a woll stocking and tie it round the neck.Influenza: A good cure at the beginning is to drink plenty of warm water with bread soda dissolved in it.Diapetes: Cabbage, spinach watercress lettuce and nuts.Heart disease: dandelion.Whooping cough: asses milk. Another old remedy is a gander to breathe into a childsmouth to cure thrush and to apply leeches to the surface for pleurisy. The juice of boiled nettles is a cure for nettle rash. Powder made from burned sally rods for styes. Goose grease for croup.\n\n\n\nHeadach: Drink very strong tea.Measles: The person that has them if he goes to a strange village for a while he will be cured.Chin-cough: Drink milk from an ass or a goat.Sprains: First cold water is spilled on the place if the swelling does not go then they make a plaster of herbs called chicken-weed.burns: Part of a seal is melted and the oil it\n(continues on next page)\n", "school_info": "School: Cloigeann", "metadata": [{"Location:": "Cleggan, Co. Galway", "Teacher:": "\nSeán Ó Fathaigh\n"}, {"Collector": "Ita O' Toole", "Gender": "female"}, {"Informant": "Mrs M. O' Toole", "Gender": "female", "Age": "50", "Address": "Claddaghduff, Co. Galway"}, {"Language": "English"}]}, "4613671/4607004/4623858": {"title": "The Famine", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0016, Page 110", "Page 110"], "url": "https://www.duchas.ie/en/cbes/4613671/4607004/4623858", "text": "\n(continued from previous page)\nand eat it.The people used not have have any help to bring a corpse to the grave yard. When they would get tired they would go into a house to see if there was anyone that could help them. When the people of the houses would see a funeral coming they would close the doors and put the blinds on the windows so that the people that would be carrying the corpse would not go in for anyone to help them. Even to this day the doors are shut and the blinds put on the windows while a funeral is passing.\n\n\n\nHugh tracy used to set a charm which would cure any one that had a head ache. He would say a prayer in his own mind. He would put a black band or garter around the forehead. This band must be left on the for a few day or a week.  His pay was a shilling or a bit of tobacco.\n", "school_info": "School: Gort na Díogha", "metadata": [{"Location:": "Gortnadeeve West, Co. Galway", "Teacher:": "\nSéamus Ó Dochartaigh, Bean Uí Dhochartaigh\n"}, {"Informant": "Thomas Brennan", "Gender": "male", "Age": "91", "Address": "Knockmascahill, Co. Galway"}, {"Language": "English"}]}, "4605947/4604892/4652217": {"title": "Cure for Headache", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0206, Page 490", "Page 490"], "url": "https://www.duchas.ie/en/cbes/4605947/4604892/4652217", "text": "\nBridget Darcy of Greaghnafarna, Parish of Ballinaglera, Co. Leitrim has a cure for headache.  Thsi cure was given to her by her father. She says some prayers and , while praying, she keeps her hands pressed on the patient's head. The cure must be \",made' by her nine times. She would not 'make' the cure on friday.Francis Rynn (pupil)(same address)16th January ? 1938Owen Rynn (farmer)45 yrs,Greaghnafarna,Dowra\n\n\n\nShrove Tuesday:  It was a custom (where there was a marriageable girl in the house who did not get married during Shrove) Seraft) to kill a hen for dinner on Shrove Tuesday.Whit Sunday: A person born on that day will be ostinate and bad-tempered. The old people would not let you near a river or a lake on Whit. Sunday for fear of a drowning.St. Martin's Day: Blood of some animal is spilled in honour of St. Martin.  The old people used kill a fowl (many still do) for the fest of St. Martins.\n(continues on next page)\n", "school_info": "School: Urbal", "metadata": [{"Location:": "Urbal, Co. Leitrim", "Teacher:": "\nGerald Kelliher\n"}, {"Collector": "Francis Rynn", "Gender": "male", "Address": "Greaghnafarna, Co. Leitrim"}, {"Informant": "Owen Rynn", "Gender": "male", "Age": "45", "Occupation": "farmer", "Address": "Greaghnafarna, Co. Leitrim"}, {"Language": "English"}]}, "4658454/4657283/4662390": {"title": "Cure of the Strain", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0226, Page 500", "Page 500"], "url": "https://www.duchas.ie/en/cbes/4658454/4657283/4662390", "text": "\nCure of the StrainAs Jesus was riding over moory hills and heathery mountain. His fore foot slipped. He put bone to bone, blood to blood and flesh to flesh. Put all together in the name of Jesus and say three Hail Marys in honour of God and the saint that cures the strain. This is done on Mondays and Thursdays before sunset.Mrs Quinn DrumdifferBallinamore\n\n\n\nCure for HeadacheKnot the bottom of two rushes toghether and then knot another rush to the end of one of them. The rush will be like this.Catch the end of the two side rushes and measure the head from the back of the ears to the top of the head then measure from under the chin to the top of the head while saying seven our fathers seven Hail Marys\n(continues on next page)\n", "school_info": "School: Kilmore", "metadata": [{"Location:": "Kilmore, Co. Leitrim", "Teacher:": "\nMáire, Bean Uí Shamhráin\n"}, {"Informant": "Mrs Quinn", "Gender": "female", "Address": "Drumdiffer, Co. Leitrim"}, {"Language": "English"}]}, "4672107/4670883/4672778": {"title": "Local Cures - Toothache", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0171, Page 043", "Page 043"], "url": "https://www.duchas.ie/en/cbes/4672107/4670883/4672778", "text": "\n(continued from previous page)\ntooth and tied it to the anvil. Then he blew the bellows and the sparks flew all over the forge. The man made one jump and left the tooth behind him.(Rita Davitt and M Johnston)\n\n\n\nHeadache (A.)  In nearly every area there used to be some old person that had a cure for headache.  One of these cures was to measures the person's head with a black ribbon and say certain prayers.  (B.) Some people have a cure for those who suffer from a severe pain in the head.  The cure has to be made on Mondays and Thursdays, else it would be of no avail.   When the person suffering from head ache comes to the one that had the cure the first thing he (or she) does is to measure the head around the fore-head and from the top of the head under the chin.  If both measurements do not correspond the person is supposed to have head-fever or the top of the opened.The one having the cure then presses the patient's head with both hands at the same time saying some words.   If the head\n(continues on next page)\n", "school_info": "School: Cloonacool", "metadata": [{"Location:": "Cloonacool, Co. Sligo", "Teacher:": "\nSeán Ó Blioscáin\n"}, {"Collector": "B. Johnston"}, {"Language": "English"}]}, "4672088/4669107/4678467": {"title": "A Charm for a Headache", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0164, Page 063", "Page 063"], "url": "https://www.duchas.ie/en/cbes/4672088/4669107/4678467", "text": "\nThere is a bad headache that people take called Head-Fever. It can be cured by a charm made by certain old people. There was a man in our district that was very good for making this charm. His name was Mr John Loftus. People used to come from all districts to him. He lived in [?].He would the head with a black silk tape, from the top of your chin to the top of your head, and again around your head to the top of your nose. Certain prayers were also attached. He does this on Mondays and Thursdays. The charm must be made three times to complete the cure.\n", "school_info": "School: Enniscrone (G.)", "metadata": [{"Location:": "Inishcrone, Co. Sligo", "Teacher:": "\nBean de Búrca\n"}, {"Collector": "Kathleen Hallinan", "Gender": "female", "Age": "13"}, {"Language": "English"}]}, "4687719/4686982/4708516": {"title": "Leigheasanna - Tinneas Cinn", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0435, Page 359", "Page 359"], "url": "https://www.duchas.ie/en/cbes/4687719/4686982/4708516", "text": "", "school_info": "School: Dubhghlas (C.)", "metadata": [{"Location:": "Douglas, Co. Kerry", "Teacher:": "\nEibhlín, Bean de Róiste\n"}, {"Collector": "Cáit Ní hEachthegeirn", "Gender": "female", "Address": "Tullig More, Co. Kerry"}, {"Informant": "Siobhán Ní Chorcardha", "Gender": "female", "Age": "70", "Address": "Tullig More, Co. Kerry"}, {"Language": "Irish"}]}, "4687719/4686991/4708603": {"title": "Leigheasanna - Faithne", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0435, Page 368", "Page 368"], "url": "https://www.duchas.ie/en/cbes/4687719/4686991/4708603", "text": "\n(continued from previous page)\n4. Cimil le sóid nígh é. Faigh ribín ar eaball na bó agus ceangal mór dtimhcheall ar an faithne. 5. Cimil le gainimh mín ar feadh naoi maidne.\n\n\n\nCeann Tinn1. Bailigh eidhneán agus dein caipín de, agus cuir ar taobh túachail anuas a an áit a bhfuiil tinn. 2. Ceannaigh arán bhán agus cuir ar bogadh in-uisce beirbhighthe é. Fáisg agus cuir isteach idir dhá phíosa éadaig é agus ceangal ar do cheann é. 3. Ól bainne in a bhfuil leach spuinneóg ruibhe.4. Measg ruibh le blonog nó im gan salann agus cimil go maith led' ceann é.Cáit Ní h-Eachthegeirn,TullachCill-Orglan, Ciarraidhe\n", "school_info": "School: Dubhghlas (C.)", "metadata": [{"Location:": "Douglas, Co. Kerry", "Teacher:": "\nEibhlín, Bean de Róiste\n"}, {"Collector": "Cáit Ní hEachthegeirn", "Gender": "female", "Address": "Tullig More, Co. Kerry"}, {"Informant": "Siobhán Ní Chorcardha", "Gender": "female", "Age": "70", "Address": "Tullig More, Co. Kerry"}, {"Language": "Irish"}]}, "4687719/4686992/4708614": {"title": "Leigheasanna - Tinneas Cinn", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0435, Page 369", "Page 369"], "url": "https://www.duchas.ie/en/cbes/4687719/4686992/4708614", "text": "\n1.Ainm an duine a bhfuaras an t-éolas uaidh:- Seamus Ó Conncubhair2. A Aois:-66 A Sheoladh:- Rín, Cill Orglan, CiaraidheLeighiseannaTinneas Cinn1. Croch bhinghre ar chéirsiúr agus ceangal mór timcheall ar éadán é. Nuair a triomaigheann an céirsúir le teas na h'éadain, croch a thuille bhingre air. 2. Faigh píosa éadaig bán cuir an croicean atá taobh istigh de sliogán uibhe air agus fill a éadach i leath, ceangal tímceall ar éadain é agus coimeád go daingean é. 3. Dein cupán tae lag agus ól ar fhaid is atá sé te.4. Coimeád do cheann in aice na teine go ceann tamaill. 5. Luigh siar ar chathaoir agus ná bí ag ciumhneamh ar an nidh. Fan mar sin i ceann tamaill agus imteócaidh an pian uait. 6. Sé an rud is fearr i gcóir tinneas cinn ná dul amach fe'n aer go dtí go mbeidh sé imhighthe. 7. Faigh píosa éadaigh agus ceangal mór dtímcheall t-eadainn é. 8. Faigh uisce fear agus tubháille agus\n(continues on next page)\n", "school_info": "School: Dubhghlas (C.)", "metadata": [{"Location:": "Douglas, Co. Kerry", "Teacher:": "\nEibhlín, Bean de Róiste\n"}, {"Collector": "Gobnait Ní Chonncubhair", "Gender": "female", "Address": "Reen, Co. Kerry"}, {"Informant": "Seamus Ó Conncubhair", "Gender": "male", "Age": "66", "Address": "Reen, Co. Kerry"}, {"Language": "Irish"}]}, "4701685/4692573/4728164": {"title": "Local Cures - Headache", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0161, Page 168", "Page 168"], "url": "https://www.duchas.ie/en/cbes/4701685/4692573/4728164", "text": "\n(a) Measure the head with a tape, and say some prayers.(b) Say three \"Hail Marys\" on your Rosary-beads in the morning.(c) Put heated salt in a stocking and tie it round your neck.\n\n\n\nTake a raw potato; run the dirt off with a damp cloth; cut it into thick slices and lay these on the forehead.\n\n\n\nTake three pinches of sugar or salt after each other.\n\n\n\nDandelion heartease.\n\n\n\nSwallow a cup of salt water very slowly.\n\n\n\nSpecial roots, which only some people can find.\n\n\n\n(a) The sufferer's cousin should drive him to three \"mairn[?]\" waters with an asse's halter round his neck; and drink of the three waters.(b) Put a horse's bridle on the sufferer's head and bring the patient to a spring well three times.(c) Put the patients neck in an ass's halter and walk him in and\n(continues on next page)\n", "school_info": "School: Scoil na mBráthar Sligeach (Sráid na Céibhe)", "metadata": [{"Location:": "Quay Street, Co. Sligo", "Teacher:": "\nAn Br. Ó Cearbhaill\n"}, {"Collector": "V. Boyle"}, {"Collector": "A. Moffat"}, {"Collector": "Fr. Devins"}, {"Language": "English"}]}, "4701685/4692573/4728165": {"title": "Local Cures - Headache", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0161, Page 168", "Page 168"], "url": "https://www.duchas.ie/en/cbes/4701685/4692573/4728165", "text": "\n(a) Measure the head with a tape, and say some prayers.(b) Say three \"Hail Marys\" on your Rosary-beads in the morning.(c) Put heated salt in a stocking and tie it round your neck.\n\n\n\nTake a raw potato; run the dirt off with a damp cloth; cut it into thick slices and lay these on the forehead.\n\n\n\nTake three pinches of sugar or salt after each other.\n\n\n\nDandelion heartease.\n\n\n\nSwallow a cup of salt water very slowly.\n\n\n\nSpecial roots, which only some people can find.\n\n\n\n(a) The sufferer's cousin should drive him to three \"mairn[?]\" waters with an asse's halter round his neck; and drink of the three waters.(b) Put a horse's bridle on the sufferer's head and bring the patient to a spring well three times.(c) Put the patients neck in an ass's halter and walk him in and\n(continues on next page)\n", "school_info": "School: Scoil na mBráthar Sligeach (Sráid na Céibhe)", "metadata": [{"Location:": "Quay Street, Co. Sligo", "Teacher:": "\nAn Br. Ó Cearbhaill\n"}, {"Collector": "Th. Harte"}, {"Language": "English"}]}, "4723815/4716033/4760404": {"title": "Leigheas an Leonta", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0934, Page 357", "Page 357"], "url": "https://www.duchas.ie/en/cbes/4723815/4716033/4760404", "text": "\nMá tá tú ag dul leonadh a léigheas tá ort breith ar an ghéig i n-a leonadh agus í a lúbradh agus a shíneadh amach gach re seal agus na focla seo leanas a rádh:An leonadh seo (lúbadh)Can éadh ach gortú. (síneadh amach)An gortú seo (lúbadh)Can eadh ach leonadh (síneadh amach)A' leonadh atá ins an mhóinTar a Mhuire is bain as é.Fuarthas é seo thuas ó Thomas Ó BeirnLios Dúnáin30 bliain ó shoin.Séamus Ó Muireadhaigh, Eanair 1939.\n\n\n\nMá tá tinneas cinn ort caithfidh tú dul amach agus do láimh a chur thart fá chrann tromáin agus do cheann do bhrúghadh go dlúth ar an chrann agus a rádh;\"Tinneas mo chroidhe-sa, a chrainn tromáin.\"Máire Bean MhathghamhnaLeacht an Albanaigh d'innisTá sí marbh le fiche bliain.Bhí togha Gaedhilge aici.Séamus Ó MuireadhaighSamhain 1938\n", "school_info": "School: Cor Críochach", "metadata": [{"Location:": "Corcreeghagh, Co. Monaghan", "Teacher:": "\nSs. Ó Muireadhaigh\n"}, {"Collector": "Séamus Ó Muireadhaigh", "Gender": "male"}, {"Informant": "Máire Bean Mhathghamhna", "Gender": "female", "Address": "Latinalbany, Co. Monaghan"}, {"Language": "Irish"}]}, "4742135/4739246/4760557": {"title": "Tinneas Cnámh is Ceannach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0477, Page 162", "Page 162"], "url": "https://www.duchas.ie/en/cbes/4742135/4739246/4760557", "text": "\n(continued from previous page)\nuair agus í leigint anuas ar an áit ceasna ar feadh trí maidin ní bheadh faic ort.\n\n\n\nTinneas Cinn :- Gealacán uibhe do chur ar do éasan\n\n\n\nFairthíní :- uisce a bhíonn ina stad i bpollaibh clocha, é cimilt des na fairthíní agus meathann siad\n\n\n\nNa Dathacha : Feamnacha dubha, no múir dubh go mbeadh oil ann, do cimilt leo\n\n\n\nCraos galair : Anál ganndail no leanbh na feiceadh a máthair Riamh\n", "school_info": "School: Achadh Tiobraid", "metadata": [{"Location:": "Aghatubrid, Co. Kerry", "Teacher:": "\nTomás Ó Muircheartaigh\n"}, {"Language": "Irish"}]}, "4769972/4763385/4785077": {"title": "Headache", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0780, Page 244", "Page 244"], "url": "https://www.duchas.ie/en/cbes/4769972/4763385/4785077", "text": "\nput a ribbon out on nov. night and bring it in before 12 o'clock and tie it round head.\n\n\n\nsteep brown paper or muslin in vinegar and then wrap it tightly round head.\n\n\n\nwrap a wet and cold cloth around forehead and leave it on for a few minutes.\n\n\n\ninhale the steam of hot water into which was put a few drops of vinegar.\n\n\n\napply a piece of ice to your forehead.\n\n\n\nafter a persons hair is cut if it is thrown into a fire that person will suffer from headaches. if it is thrown out for the birds to build their nests they will be preserved from headaches.\n", "school_info": "School: Kilcullen (Convent)", "metadata": [{"Location:": "Kilcullen, Co. Kildare", "Teacher:": "\nNa Siúracha\n"}, {"Collector": "Helen Power", "Gender": "female"}, {"Language": "English"}]}, "4769972/4763385/4785078": {"title": "Headache", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0780, Page 244", "Page 244"], "url": "https://www.duchas.ie/en/cbes/4769972/4763385/4785078", "text": "\nput a ribbon out on nov. night and bring it in before 12 o'clock and tie it round head.\n\n\n\nsteep brown paper or muslin in vinegar and then wrap it tightly round head.\n\n\n\nwrap a wet and cold cloth around forehead and leave it on for a few minutes.\n\n\n\ninhale the steam of hot water into which was put a few drops of vinegar.\n\n\n\napply a piece of ice to your forehead.\n\n\n\nafter a persons hair is cut if it is thrown into a fire that person will suffer from headaches. if it is thrown out for the birds to build their nests they will be preserved from headaches.\n", "school_info": "School: Kilcullen (Convent)", "metadata": [{"Location:": "Kilcullen, Co. Kildare", "Teacher:": "\nNa Siúracha\n"}, {"Collector": "B. Doyle", "Gender": "female"}, {"Language": "English"}]}, "4769972/4763385/4785079": {"title": "Headache", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0780, Page 244", "Page 244"], "url": "https://www.duchas.ie/en/cbes/4769972/4763385/4785079", "text": "\nput a ribbon out on nov. night and bring it in before 12 o'clock and tie it round head.\n\n\n\nsteep brown paper or muslin in vinegar and then wrap it tightly round head.\n\n\n\nwrap a wet and cold cloth around forehead and leave it on for a few minutes.\n\n\n\ninhale the steam of hot water into which was put a few drops of vinegar.\n\n\n\napply a piece of ice to your forehead.\n\n\n\nafter a persons hair is cut if it is thrown into a fire that person will suffer from headaches. if it is thrown out for the birds to build their nests they will be preserved from headaches.\n", "school_info": "School: Kilcullen (Convent)", "metadata": [{"Location:": "Kilcullen, Co. Kildare", "Teacher:": "\nNa Siúracha\n"}, {"Collector": "General "}, {"Language": "English"}]}, "4769972/4763385/4785080": {"title": "Headache", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0780, Page 244", "Page 244"], "url": "https://www.duchas.ie/en/cbes/4769972/4763385/4785080", "text": "\nput a ribbon out on nov. night and bring it in before 12 o'clock and tie it round head.\n\n\n\nsteep brown paper or muslin in vinegar and then wrap it tightly round head.\n\n\n\nwrap a wet and cold cloth around forehead and leave it on for a few minutes.\n\n\n\ninhale the steam of hot water into which was put a few drops of vinegar.\n\n\n\napply a piece of ice to your forehead.\n\n\n\nafter a persons hair is cut if it is thrown into a fire that person will suffer from headaches. if it is thrown out for the birds to build their nests they will be preserved from headaches.\n", "school_info": "School: Kilcullen (Convent)", "metadata": [{"Location:": "Kilcullen, Co. Kildare", "Teacher:": "\nNa Siúracha\n"}, {"Collector": "Patsy Dix", "Gender": "female"}, {"Language": "English"}]}, "4769972/4763385/4785081": {"title": "Headache", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0780, Page 244", "Page 244"], "url": "https://www.duchas.ie/en/cbes/4769972/4763385/4785081", "text": "\nput a ribbon out on nov. night and bring it in before 12 o'clock and tie it round head.\n\n\n\nsteep brown paper or muslin in vinegar and then wrap it tightly round head.\n\n\n\nwrap a wet and cold cloth around forehead and leave it on for a few minutes.\n\n\n\ninhale the steam of hot water into which was put a few drops of vinegar.\n\n\n\napply a piece of ice to your forehead.\n\n\n\nafter a persons hair is cut if it is thrown into a fire that person will suffer from headaches. if it is thrown out for the birds to build their nests they will be preserved from headaches.\n", "school_info": "School: Kilcullen (Convent)", "metadata": [{"Location:": "Kilcullen, Co. Kildare", "Teacher:": "\nNa Siúracha\n"}, {"Collector": "Helen Power", "Gender": "female"}, {"Language": "English"}]}, "4769972/4763385/4785082": {"title": "Headache", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0780, Page 244", "Page 244"], "url": "https://www.duchas.ie/en/cbes/4769972/4763385/4785082", "text": "\nput a ribbon out on nov. night and bring it in before 12 o'clock and tie it round head.\n\n\n\nsteep brown paper or muslin in vinegar and then wrap it tightly round head.\n\n\n\nwrap a wet and cold cloth around forehead and leave it on for a few minutes.\n\n\n\ninhale the steam of hot water into which was put a few drops of vinegar.\n\n\n\napply a piece of ice to your forehead.\n\n\n\nafter a persons hair is cut if it is thrown into a fire that person will suffer from headaches. if it is thrown out for the birds to build their nests they will be preserved from headaches.\n", "school_info": "School: Kilcullen (Convent)", "metadata": [{"Location:": "Kilcullen, Co. Kildare", "Teacher:": "\nNa Siúracha\n"}, {"Collector": "Mona Christie", "Gender": "female"}, {"Language": "English"}]}, "4742167/4741522/4785203": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0775, Page 002", "Page 002"], "url": "https://www.duchas.ie/en/cbes/4742167/4741522/4785203", "text": "\nTo cure warts make a bag like purse with... fill up with small stones .... someone will kick it to see if it contains money and that person will \"take\" the warts. To cure warts put a snail on wart and then stick the snail on  a thorn  and leave it there \"till it withers\".\n\n\n\nTo cure ringworm. Find an old widow woman not related to sufferer. Rub her gold ring on affected part.\n\n\n\nAss shoe or horse shoe over the door is a sign of good luck.\n\n\n\nPádraig Mc Cárthaig, Ballyteague, Kilmeague, Naas, cures headache by tying cloth around head. Seósain Ó Conaill of Annsburo, Robertstown, Co. Kildare cures toothache by putting his hand on affected jaw. Séan Ó Nórsa of baile .... is a kidney doctor and stirs up some concoction with a stick. Séamus ó Braonách of Grangeclare West makes medicine of herbs. Bean Uí Liaáin of Red Hills is a relative of the famous \"Moll Anthony\" and cures paralysis. Miss Mon Brereton  of Allenwood cures the beast by making  beast ointment from hearts. Awoman called Cloíeín Seary choked herself at Plackestown Bridge. She haunted the bridge and choked a preist. Some preist locked her up in a cave.\n", "school_info": "School: Allenwood, Robertstown", "metadata": [{"Location:": "Allenwood, Co. Kildare", "Teacher:": "\nSeán Ó Clúmháin\n"}, {"Language": "English"}]}, "4798675/4789330/4892115": {"title": "Local Cures - Headache", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0240, Page 153", "Page 153"], "url": "https://www.duchas.ie/en/cbes/4798675/4789330/4892115", "text": "\nPeople who suffer frequently from severe headache and who find that the different tablets prescribed by doctors do not give a permanent cure go to the head doctor or the man in this district who can give the lasting cure.For several miles around here people who suffer from bad headaches come to a man who lives in Corloonmore, Ballaghadarreen, Cp. Roscommon. His name is Michael Flynn. He is about 75 years of age now and has been curing people for over 40 years since his mother, who had the cure before\n(continues on next page)\n", "school_info": "School: Don", "metadata": [{"Location:": "Cartron More, Co. Roscommon", "Teacher:": "\nPádhraic Ó Tiomáin\n"}, {"Collector": "P. Timon", "Gender": "unknown", "Address": "Ballaghaderreen, Co. Roscommon"}, {"Language": "English"}]}, "4798708/4792044/4924319": {"title": "Cures - Headache", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0254, Page 153", "Page 153"], "url": "https://www.duchas.ie/en/cbes/4798708/4792044/4924319", "text": "\nCures.Head acheIn olden times there were no doctors. Many people believed that Head ache or Head fever could be cured. There were plenty of people who professed to have the charm. To effect the cure a black band was used. With this the head was measured first from the crown of the head to the tip of the nose, and then from the chin to the top of the head. In a normally shaped head these were and are supposed to be the same. If the latter was greater than the former the person was supposed to have Head fever.Then the person having the cure would recite some prayers suitable to the occasion such as five Paters Aves and a Gloria with some others. The patient then was to wear the black band round the head three nights in succession sprinkle it with Holy Water and say five Our Fathers five Hail Marys and a Gloria. This should be begun on a Monday and repeated the following Thursday and Monday. These were supposed to be the lucky days of the week. The person who effected the cure could take no money. But the patients gave some little present as a thanksgiving. In many cases people have been cured in this way of very violent head aches. There are people still living having this\n(continues on next page)\n", "school_info": "School: Kilmore", "metadata": [{"Location:": "Kilmore, Co. Roscommon", "Teacher:": "\nMáiréad, Bean Mhic Giolla Críost\n"}, {"Collector": "Joseph Rhatigan", "Gender": "male"}, {"Informant": "(name not given)", "Relation": "grandparent", "Gender": "male", "Age": "88"}, {"Language": "English"}]}, "4687715/4686653/4926777": {"title": "Paidir a Déarfá nuair a Rachfá isteach sa Séipéal", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0434, Page 336", "Page 336"], "url": "https://www.duchas.ie/en/cbes/4687715/4686653/4926777", "text": "\nPaidir adéarfá nuair a raghfá isteach ‘san séipéal:“Beannuighim dhuit, a Chrois  Crann an duilleabhair ghlais  An Crann (o) ar céasadh Críost  Beannuighim dhuit arís, a Chrois  Beannuighim dhuit Uan Dílis Dé,  Scaoilim mé féin ar scáthán mo dhá ghlúinCuirim mo faoistin agus mo pheacaí uilig síos dhuitA Mhuire Mháthair Naomhtha, faigh ó’d leanbhDéirc a thrócaire a thabhairt dom’ anam.”Ar Dhul amach duit ón’ séipéal:-“Fillim ort a Mhuire  Agus cuimhnighim ort a Íosa  Agus cumaróchaidh m’anam oraibh  Go gcasadh arís oraibh.”Oradh do Thinneas Cinn:-Shuidh N. Brighid agus N. Phádraic ar chlochán cloch.  D’fhiafruigh Brighid de Phádruig- “Cadé an an déth sin ort?” “Tá” arsa Pádruig “Tinneas cinn diocrach agus fiabhras docht.”  “Cuirfeadh-sa triúr ‘á scaipeadh” adeir Brighid- “Muire agus a Mac, Brighid is a brat á scaipeadh\n", "school_info": "School: Killorglin (B.)", "metadata": [{"Location:": "Killorglin, Co. Kerry", "Teacher:": "\nMl Ó Donnchadha\n"}, {"Collector": "Caitlín Ní Donnchadha", "Gender": "female", "Age": "17", "Address": "Glannagilliagh, Co. Kerry"}, {"Informant": "Máire Bean Uí Rathallaigh", "Gender": "female", "Age": "70", "Address": "Glannagilliagh, Co. Kerry"}, {"Language": "Irish"}]}, "4769976/4763651/4929007": {"title": "Ailments and Cures - Toothache", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0781, Page 202", "Page 202"], "url": "https://www.duchas.ie/en/cbes/4769976/4763651/4929007", "text": "\nThe cure for a tooth ache is to fill your mouth with cold water and stand with your back to the fire until the water gets hot.Then swallow it and the tooth ache will get better.Another cure for a tooth ache is to say three Hail Marys every time you sneeze and the tooth ache will go away.My Aunt told me the first cure and my Mother told me the second cure.\n\n\n\nIf you have a pain in your head get a piece of brown paper and wet it with vinegar and put it upon your forehead three times.\n(continues on next page)\n", "school_info": "School: Skerries, Athy", "metadata": [{"Location:": "Skerries North, Co. Kildare", "Teacher:": "\nE. Tansey\n"}, {"Collector": "Lizzie Redmond", "Gender": "female", "Address": "Ardnagross, Co. Kildare"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "female", "Address": "Ardnagross, Co. Kildare"}, {"Language": "English"}]}, "4769987/4764376/4933445": {"title": "Cures - Old Cure for Nettle Sting", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0823, Page 481", "Page 481"], "url": "https://www.duchas.ie/en/cbes/4769987/4764376/4933445", "text": "\nOld cure for Nettle sting;The juice of a dandelion rubbed on the sting of nettle is said to cure it.\n\n\n\nOld cures for Head-Ache;The leaves of marsh marrow are boiled and if the juice be drank it is said to cure a head ache. Another cure is to get elder berries, and to boil them and drink the juice.\n", "school_info": "School: Mountmellick (B.)", "metadata": [{"Location:": "Mountmellick, Co. Laois", "Teacher:": "\nDll. Binéad\n"}, {"Language": "English"}]}, "4758587/4756841/4936317": {"title": "A Prayer to Ease Pain in the Head", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0931, Page 280", "Page 280"], "url": "https://www.duchas.ie/en/cbes/4758587/4756841/4936317", "text": "\nI got this Prayer or charm from Mrs McMahon  of Dian in the year 1936.Órtha thainig as RoimhOrtha Íosa agus ortha  (?)Triúr a bhí siubhal a' bórdNaomh Peadar agus PolÓ a Dhia mhóir a ghrádhAgus a n-arthaí bheóAmen a Thighearna.arthaí =  move;   beó = head or lifeMake the sign of the cross on the head. Put one hand on forehead and one behind. Do this three times. Put hands, one on each side of the head (Three times also)\n", "school_info": "School: Taplach", "metadata": [{"Location:": "Taplagh, Co. Monaghan", "Teacher:": "\nP. Ó Dubhthaigh\n"}, {"Informant": "Mrs Mc Mahon", "Gender": "female", "Address": "Dian, Co. Monaghan"}, {"Language": "mixed"}]}, "4922085/4850896/4946407": {"title": "Local Cures - Cure for Headache or a Pain in the Stomach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0520, Page 194", "Page 194"], "url": "https://www.duchas.ie/en/cbes/4922085/4850896/4946407", "text": "\nLocal Cures (Cont'd)Cure for Headach or a pain in the stomach.there was a well in Mr. Pat O'Malley's field in Towerhill called Saint Brigid's well.  One morning a woman who was milking cows washed her hands in it and the well removed itself and is now under John Devane's house in Towerhill.  If you had a headach or a pain in your stomach and if you took a sup of its water, before sunrise your pain is gone.(Pat Mc Carthy)\n\n\n\nCure for a mad DogThe best cure for a mad dog is lamp oil(Michael Conroy)18th March\n", "school_info": "School: Cappamore (B.)", "metadata": [{"Location:": "Cappamore, Co. Limerick", "Teacher:": "\nJames McCarthy\n"}, {"Collector": "Pat Mc Carthy", "Gender": "male"}]}, "4922096/4852121/4946779": {"title": "Cures for Headaches", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0524, Page 030", "Page 030"], "url": "https://www.duchas.ie/en/cbes/4922096/4852121/4946779", "text": "\n1 To hang out a ribbon and measure it on St. Bridget's Eve and leave it out all night and bring it in, in the morning and measure it again, and if it got longer it was supposed to cure a headache, then the woman of the house would roll it up and keep it, until it is wanted. 2 To get a black wide band and put it around the head and it was a cure for a headache also. 3 There is a kind of plant growing wild on some meadows it is called Wild Thyme and ho a very pungent smell. If plucked fresh and smelled by a person having a headache and it cures it. Theses were got from my GrandmotherMrs. DoyleAnnaghMurroe.\n", "school_info": "School: Ahane (C.) Lisnagry", "metadata": [{"Location:": "Ahane, Co. Limerick", "Teacher:": "\nL. T. Walsh\n"}, {"Collector": "Bridget Doyle", "Gender": "female", "Address": "Annagh, Co. Limerick"}, {"Informant": "Mrs Doyle", "Relation": "grandparent", "Gender": "female", "Address": "Annagh, Co. Limerick"}, {"Language": "English"}]}, "4921951/4912773/4947074": {"title": "Local Cures", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0485, Page 141", "Page 141"], "url": "https://www.duchas.ie/en/cbes/4921951/4912773/4947074", "text": "\n(continued from previous page)\nto cure the yellow jaundice about sixty years ago the person that had the disease had to go to his house for nine mornings and each morning he would throw a cake again at the wind and hide a bottle of water and the disease was supposed to be completely gone on the ninth day. In Fitzgeralds farm Glensharold there is a big rock in which water lodges in a hallow in the middle of it and is said if the water is rubbed to warts seven mornings it will cure them.\n\n\n\nRichard Woulfe Knocknagorna suffered from headache very often some time ago. He paid visits to the Blessed Virgin's Well and he got cured. Patrick Woulfe Knocknagorna had sore eyes and he visited a Holy Well in Barragone Co Lumerick and he got cured. He used to go round the the Well three times and each time say a round of his beads and he got cured. There is a holy well in CO Cork and a rock near it and it is said that if a person went through that rock he would get cured of any disease.\n", "school_info": "School: Clais, Athea", "metadata": [{"Location:": "Keale, Co. Limerick", "Teacher:": "\nLiam Ó Súilleabháin\n"}, {"Collector": "Josie Woulfe", "Gender": "female"}, {"Informant": "Mrs Moran", "Gender": "female", "Age": "85", "Address": "Clash North, Co. Limerick"}, {"Language": "English"}]}, "4770004/4766051/4956512": {"title": "Cures in Olden Times - Burns", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0828, Page 117", "Page 117"], "url": "https://www.duchas.ie/en/cbes/4770004/4766051/4956512", "text": "\nAn egg was broken, and the skin which lies beside the shell was put on burns. A cabbage leaf was roasted on an iron pot lid, this leaf was put on burns also.Laurel leaves fried with lard and put on burns was though a great cure.\n\n\n\nBrown paper was steeped in vinegar, and placed upon the head for a headache.Duck weed reduces information, and St Anthony's Fire. The fresh herb applied to the forehead relieves headaches.\n\n\n\nFor an earache:- an onion was roasted, and past of it put into the ear.\n\n\n\nFor a child suffering with worms: - three drops of turpentine were put on a lump sugar, this was given to the child to eat.\n\n\n\nFor a child smothering :- a tallow candle was melted and rubbed into the child's chest.\n\n\n\nButtermilk and breadsoda were brought to a paste, and rubbled into hives.\n", "school_info": "School: St John of God Convent, Rathdowney", "metadata": [{"Location:": "Rathdowney, Co. Laois", "Teacher:": "\nThe Sisters\n"}, {"Language": "English"}]}, "4922210/4860882/5015979": {"title": "Home Cures - Jaundice", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0553, Page 228", "Page 228"], "url": "https://www.duchas.ie/en/cbes/4922210/4860882/5015979", "text": "\n(continued from previous page)\nmorning and before sunrise. No salt meat, grease or milk showed to be used until the patient is well. 2. A few sprays of an herb called Cranesbill are brewed in a cupful of milk, and then strained. A half  cupful is taken twice a day until the patient is cured.3. Archangel weed found growing in Tullags fields\n\n\n\n(1) (a) Lift the Goban Saor's cap three times on to your head, or (b) lift the same cap on to your head and walk round the Goban Saor's island three times.This cap is a round stone shaped like a cap and is to be found at the Goban's grave on the Goban Saor's island in the townland of Lurgoe, parish of Killenaule, Barony - Eliogarty.(2) Moisten well a small sheet of brown paper with vinegar, and apply it to the forehead, and bandage tightly.(3) Collect a number of ribbons on St Brigid's night and say five Our Fathers and five Hail Marys over them. One of those ribbons rubbed to the patient's head will relieve the pain.\n", "school_info": "School: Moycarkey, Thurles", "metadata": [{"Location:": "Moycarky, Co. Tipperary", "Teacher:": "\nMichael Myers\n"}, {"Language": "English"}]}, "5008958/4970663/5109045": {"title": "Headaches", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0699, Page 073", "Page 073"], "url": "https://www.duchas.ie/en/cbes/5008958/4970663/5109045", "text": "\nThe black string put out on a bush on St. Brigid's Eve is the cure for a headache when tied round the forehead.\n", "school_info": "School: Clochar Loreto, An Uaimh", "metadata": [{"Location:": "Navan, Co. Meath", "Teacher:": "\nAn tSr. M. Colm\n"}, {"Collector": "Josephine Mallon", "Gender": "female", "Address": "Castlemartin, Co. Meath"}, {"Informant": "An tSiúr Ciarán", "Gender": "female", "Address": "Navan, Co. Meath"}, {"Language": "English"}]}, "5008960/4971077/5109429": {"title": "Cure For Sore Breast or Back", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0700, Page 120", "Page 120"], "url": "https://www.duchas.ie/en/cbes/5008960/4971077/5109429", "text": "\n(continued from previous page)\nwith water in which the Oak bark has been boiled.\n\n\n\nTwo local women Mrs Cantwell Flower Hill and Miss Connell Railway Street have the cure for \"Thrush.\" They make a special ointment from herbs and doctors are very anxious to find out these herbs.\n\n\n\nA very good cure for a sore throat is to get a fox glove and make it into a broth and use it as a medicine. 2. To get a stocking and fill it with salt. Then tie it round your neck and go to bed and when the morning you will be cured.3. Tie a wet silk scarf round your neck.\n\n\n\nThis cure for a head ache is well known in this district. Bathe your forehead with vinegar and rest for a while in a dark room.2. Strong tea.\n\n\n\nRub mustard and salt on your gums.2. Rinse your mouth with whiskey.3. Lick back of frog.\n", "school_info": "School: St Columba's Abbey, Navan", "metadata": [{"Location:": "Navan, Co. Meath", "Teacher:": "\nBr. Abban O' Donoghue\n"}, {"Language": "English"}]}, "5070818/5067276/5110563": {"title": "A Cut", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1010, Page 407", "Page 407"], "url": "https://www.duchas.ie/en/cbes/5070818/5067276/5110563", "text": "\nGet a dog to lick the cut and it is supposed to cure it.\n\n\n\nTake black tea without milk and with very little or no sugar and in about an hour the headache will be gone.\n\n\n\nThere was a disease common in olden days among married women in their last days of pregnancy. It was called by the women \"the longing way\". It was supposed that the child in the mother  commenced putting out its tongue producing a state of lassitude and weakness with a tired feeling in the mother. Any small portion of a cooked eel eaten cured the disease immediately.\n\n\n\nCures for whitlow, ringworm, jaundice, heart-fever, sprain and the cure of the  (?) are all called secret cures and are handed down from generation to generation. Like the famous cure for\n(continues on next page)\n", "school_info": "School: The Vale (An Gleann)", "metadata": [{"Location:": "Leiter, Co. Cavan", "Teacher:": "\nS. Ó Brolcháin\n"}, {"Language": "English"}]}, "5008962/4971267/5110951": {"title": "Convulsions", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0700, Page 310", "Page 310"], "url": "https://www.duchas.ie/en/cbes/5008962/4971267/5110951", "text": "\n(continued from previous page)\nto his head and he will be cured.\n\n\n\nIf a person has a headache very badly, sometimes it is his eyes that causes it. I know a person that was ill like this and got glasses and never had it again.\n\n\n\nIf a person who had a wart on his hand or any where else were going through a field and saw a snail and rubbed him on the wart, it would be cured in a few days. If a person looked for a snail it is no good. He must just find one by chance in his path.\n\n\n\nThe cure for a burn is to boil a cabbage leaf in white lard and strain it. When cold apply the ointment to the burn.\n\n\n\nSprained Ankle\n(continues on next page)\n", "school_info": "School: Flower Hill", "metadata": [{"Location:": "Flower Hill, Co. Meath", "Teacher:": "\nIsabel Mc Quade\n"}, {"Informant": "Mrs Mc Allen", "Gender": "female", "Address": "Navan, Co. Meath"}, {"Language": "English"}]}, "5044586/5024015/5138443": {"title": "How Father Langley Cured the Headache", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0804, Page 003", "Page 003"], "url": "https://www.duchas.ie/en/cbes/5044586/5024015/5138443", "text": "\nLong ago there lived in Geashill a cross, but saintly priest named Fr. Langley. He was very good for curing all manner of disease.There lived also in Geashill a man who was terribly subject to a headache. He was advised by a woman to go to the priest and to ask him to cure his headache.The man went to the priest and asked him to cure his disease. The priest gave him a blow on the head and told him to go home. The man ran as quickly as ever he could. He met the same woman and she asked him how did he get on. He answered, I was bad before I went but I was near being finished when I went there. Then he told her all. She said, I will go back with you. So the two of them went back to the priest's house. The man was afraid to go in, and he stayed outside. The woman told the priest the whole story. He went to the man, and when he saw him coming he fell down on the ground with fear. The priest put his foot on the man's head, and rolled him along the sand. From that day until he died he never had another headache.\n", "school_info": "School: Geashill (1)", "metadata": [{"Location:": "Geashill, Co. Offaly", "Teacher:": "\nS. de Bláca\n"}, {"Collector": "Joe Daly", "Gender": "male", "Age": "14", "Address": "Geashill, Co. Offaly"}, {"Informant": "James Daly", "Relation": "parent", "Gender": "male", "Age": "45", "Occupation": "postman", "Address": "Geashill, Co. Offaly"}, {"Language": "English"}]}, "5044582/5023892/5140417": {"title": "Local Cures - Burns", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0803, Page 211", "Page 211"], "url": "https://www.duchas.ie/en/cbes/5044582/5023892/5140417", "text": "\n(6) A cure for a burn is to licked a DarkieLucker's belly three times and make the sign of the cross while licking it.\n\n\n\n(7) Bread soda is put on a burn to cure it.(8) When a person gets a burn at first they should hold it near the fire for a couple of minutes and then put it in water.\n\n\n\n(9) A cure for a burn is butter milk and sweet oil.(10) Another cure for a burn is to rub paraffin oil on it.\n\n\n\n(1) A cure for a headache is to bathe your forehead in cold water.(2) Another cure is to drink a cup of very strong tea.(3) It is also a good thing to drink a cup of hot water\n\n\n\n(4) There is a headache stone in Mr. Hodgen's field in Rahugh, Kilbeggan, Co. Westmeath. There is a little hole down in the stone and the people put their heads down in the hole and say prayers. They have to go three times before they get cured.\n\n\n\n(5) If anyone has a headache they should\n(continues on next page)\n", "school_info": "School: Kilmurry", "metadata": [{"Location:": "Kilmurry, Co. Offaly", "Teacher:": "\nA. de Búrca\n"}, {"Collector": "Thomas Scally", "Gender": "male", "Age": "13", "Address": "Ballyteige Little, Co. Offaly"}, {"Informant": "Joseph Scally", "Gender": "male", "Age": "53", "Address": "Ballyteige Little, Co. Offaly"}, {"Language": "English"}]}, "5044582/5023892/5140420": {"title": "Local Cures - Burns", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0803, Page 211", "Page 211"], "url": "https://www.duchas.ie/en/cbes/5044582/5023892/5140420", "text": "\n(6) A cure for a burn is to licked a DarkieLucker's belly three times and make the sign of the cross while licking it.\n\n\n\n(7) Bread soda is put on a burn to cure it.(8) When a person gets a burn at first they should hold it near the fire for a couple of minutes and then put it in water.\n\n\n\n(9) A cure for a burn is butter milk and sweet oil.(10) Another cure for a burn is to rub paraffin oil on it.\n\n\n\n(1) A cure for a headache is to bathe your forehead in cold water.(2) Another cure is to drink a cup of very strong tea.(3) It is also a good thing to drink a cup of hot water\n\n\n\n(4) There is a headache stone in Mr. Hodgen's field in Rahugh, Kilbeggan, Co. Westmeath. There is a little hole down in the stone and the people put their heads down in the hole and say prayers. They have to go three times before they get cured.\n\n\n\n(5) If anyone has a headache they should\n(continues on next page)\n", "school_info": "School: Kilmurry", "metadata": [{"Location:": "Kilmurry, Co. Offaly", "Teacher:": "\nA. de Búrca\n"}, {"Collector": "Celia Dalton", "Gender": "female", "Age": "12", "Address": "Bracklin Little, Co. Offaly"}, {"Informant": "Thomas Dalton", "Relation": "parent", "Gender": "male", "Age": "51", "Address": "Bracklin Little, Co. Offaly"}, {"Language": "English"}]}, "5044582/5023892/5140423": {"title": "Local Cures - Burns", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0803, Page 211", "Page 211"], "url": "https://www.duchas.ie/en/cbes/5044582/5023892/5140423", "text": "\n(6) A cure for a burn is to licked a DarkieLucker's belly three times and make the sign of the cross while licking it.\n\n\n\n(7) Bread soda is put on a burn to cure it.(8) When a person gets a burn at first they should hold it near the fire for a couple of minutes and then put it in water.\n\n\n\n(9) A cure for a burn is butter milk and sweet oil.(10) Another cure for a burn is to rub paraffin oil on it.\n\n\n\n(1) A cure for a headache is to bathe your forehead in cold water.(2) Another cure is to drink a cup of very strong tea.(3) It is also a good thing to drink a cup of hot water\n\n\n\n(4) There is a headache stone in Mr. Hodgen's field in Rahugh, Kilbeggan, Co. Westmeath. There is a little hole down in the stone and the people put their heads down in the hole and say prayers. They have to go three times before they get cured.\n\n\n\n(5) If anyone has a headache they should\n(continues on next page)\n", "school_info": "School: Kilmurry", "metadata": [{"Location:": "Kilmurry, Co. Offaly", "Teacher:": "\nA. de Búrca\n"}, {"Collector": "Alice Daly", "Gender": "female", "Address": "Ballyteige Little, Co. Offaly"}, {"Informant": "Joseph Scally", "Gender": "male", "Age": "53", "Address": "Ballyteige Little, Co. Offaly"}, {"Language": "English"}]}, "5044582/5023893/5140436": {"title": "Local Cures - Headache", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0803, Page 212", "Page 212"], "url": "https://www.duchas.ie/en/cbes/5044582/5023893/5140436", "text": "\n(continued from previous page)\n(5) drink a cup of hot milk and it will remove the pain immediately\n\n\n\n(6) To cure a headache people used drink black tea without milk or sugar\n\n\n\n(7) Long ago people used drink scorna [?]. It is made like tea. It has a wide leaf like privette leaf\n\n\n\nThere is a family in croghan, Daingeam named Gilligan who cures caner. This cure was handed down from generation to generation. People come from all over Ireland and even from foreign countries to get cured. The cure is ointment and there is a secret in this ointment which i known to none but themselves. Doctors would give them any money for the secret but they would not sell it\n\n\n\n(1)People used to swallow live frogs as a cure for a stomachache. Raw eggs are also a cure for a stomachache.\n", "school_info": "School: Kilmurry", "metadata": [{"Location:": "Kilmurry, Co. Offaly", "Teacher:": "\nA. de Búrca\n"}, {"Collector": "Rose Bracken", "Gender": "female", "Age": "13", "Address": "Bracklin Little, Co. Offaly"}, {"Informant": "Mary Kate Bracken", "Relation": "parent", "Gender": "female", "Age": "49", "Address": "Bracklin Little, Co. Offaly"}, {"Language": "English"}]}, "5044582/5023893/5140512": {"title": "Local Cures - Headache", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0803, Page 212", "Page 212"], "url": "https://www.duchas.ie/en/cbes/5044582/5023893/5140512", "text": "\n(continued from previous page)\n(5) drink a cup of hot milk and it will remove the pain immediately\n\n\n\n(6) To cure a headache people used drink black tea without milk or sugar\n\n\n\n(7) Long ago people used drink scorna [?]. It is made like tea. It has a wide leaf like privette leaf\n\n\n\nThere is a family in croghan, Daingeam named Gilligan who cures caner. This cure was handed down from generation to generation. People come from all over Ireland and even from foreign countries to get cured. The cure is ointment and there is a secret in this ointment which i known to none but themselves. Doctors would give them any money for the secret but they would not sell it\n\n\n\n(1)People used to swallow live frogs as a cure for a stomachache. Raw eggs are also a cure for a stomachache.\n", "school_info": "School: Kilmurry", "metadata": [{"Location:": "Kilmurry, Co. Offaly", "Teacher:": "\nA. de Búrca\n"}, {"Collector": "Brigid Egan", "Gender": "female", "Age": "13", "Address": "Ballycommon, Co. Offaly"}, {"Informant": "Thomas Egan", "Relation": "parent", "Gender": "male", "Age": "67", "Address": "Ballycommon, Co. Offaly"}, {"Language": "English"}]}, "5044568/5023102/5143453": {"title": "Local Cures - Toothache", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0800, Page 157", "Page 157"], "url": "https://www.duchas.ie/en/cbes/5044568/5023102/5143453", "text": "\n156Toothache:- Visit the \"Priests Bush\" and rub the tooth with the leaves of the bush three nights running.The juice of the bark of the \"quick berry bush\" put into the tooth. If you were in the habit of shaving on Sunday and gave it up it would cure you.They would go to Father Moore's grave in Cloncrane and get apiece of gravel off the grave and put it to the tooth.\n\n\n\nSore eyes:- pointing a gooseberry thorn at them.\n\n\n\nMumps:- Roasted potatoes are good for them.\n\n\n\n\"Wild Fire\" or Fever:- Hang holly over the door\n\n\n\nNettle Sting:- Rub with dock leaf.\n\n\n\nHeadache:- Some people do not comb their hair during Holy Week to get better of headaches.\n\n\n\nBellyache:- The would rub goose grease on themselves night and morning.\n", "school_info": "School: Clonbullogue", "metadata": [{"Location:": "Clonbulloge, Co. Offaly", "Teacher:": "\nA. Fitzgerald\n"}, {"Language": "English"}]}, "5044653/5029156/5145663": {"title": "Local Cures - Warts", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0821, Page 107", "Page 107"], "url": "https://www.duchas.ie/en/cbes/5044653/5029156/5145663", "text": "\nLocal CuresWartsBury a piece of fat in the ground and when the fat rots the wart will rot.Get a piece of chicken weed and rub on the wart every morning for nine mornings.John O Brien, 6 Eden Road, Birr, Offaly.\n\n\n\nHeadacheGet some vinegar and drop it on the place where you have the pain and the ache will go.Get a piece of cloth and steep it in whiskey and rub it on the head.\n(continues on next page)\n", "school_info": "School: St. Brendan's, Birr", "metadata": [{"Location:": "Birr or Parsonstown, Co. Offaly", "Teacher:": "\nBr O' Boyle\n"}, {"Collector": "Willie Dunne", "Gender": "male", "Address": "Birr or Parsonstown, Co. Offaly"}, {"Informant": "John O' Brien", "Gender": "male", "Age": "circa 60", "Address": "Birr or Parsonstown, Co. Offaly"}, {"Language": "English"}]}, "5044699/5032887/5146010": {"title": "Diseases and Cures - Toothache", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0911, Page 209", "Page 209"], "url": "https://www.duchas.ie/en/cbes/5044699/5032887/5146010", "text": "\n(continued from previous page)\nLeave it in your mouth for a couple of minutes and you are supposed never to have a tooth - ache again.\n\n\n\nToothache or Neuralgia that is when all the teeth are paining is very common.Some cures for toothache are to boil some nettles and put them in a poultice on the tooth. To steep red flannel in hot water and wrap it around your head and tie a stocking around that.\n\n\n\nVery often people get a headache. A cure for it is Glauber salts before your breakfast in the morning  Another cure for it is vinegar and brown paper. Put the vinegar on the paper and put it around your head. There is another\n(continues on next page)\n", "school_info": "School: Kildavin, Ferns", "metadata": [{"Location:": "Kildavin, Co. Carlow", "Teacher:": "\nTadhg de Brí\n"}, {"Collector": "Lillie Murphy", "Gender": "female"}, {"Informant": "Mr D. Murphy", "Gender": "male", "Age": "61", "Occupation": "farmer", "Address": "Cranemore, Co. Carlow"}, {"Language": "English"}]}, "5162159/5160092/5164022": {"title": "Cure of Headache", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0939, Page 142", "Page 142"], "url": "https://www.duchas.ie/en/cbes/5162159/5160092/5164022", "text": "\n4.  Cure of headache.In olden times the  material for a shroud was bought by one of the deceased's relations. It was then blessed by the priest and afterwards made into a loose garment. any little pieces which remained were kept and when a person had a headache a piece was tied on the head.  (Still continued in Donaghmoyne parish)\n\n\n\n5.  A burn.A man got a \"man-creeper\" (like a frog but much thinner and having a tail) He licked it and then killed it. It was believed he could then cure a burn by going on his knees, blessing himself and licking the burn. (Done in Donaghmoyne parish 15 years ago)\n\n\n\n6.  Cure of Sprain.    How it originated.When Jesus was one day riding on his donkey the donkey fell while he was going up a mountain. He sprained his foot but Our Lord at once rubbed it and it was cured. When making the cure people rub the sprained part and say:-  \"as I said it the Lord healeth so be it. In the name of hte Father, Son and Holy Ghost Amen\".\n", "school_info": "School: Láithreach", "metadata": [{"Location:": "Laragh, Co. Monaghan", "Teacher:": "\nMrs Duffy\n"}, {"Collector": "Brighid Ní Leannáin", "Gender": "female"}, {"Informant": "Michael Lennon", "Relation": "parent", "Gender": "male"}, {"Language": "English"}]}, "4921728/4894102/5187665": {"title": "Cures for Certain Diseases - Headache", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0350, Page 069", "Page 069"], "url": "https://www.duchas.ie/en/cbes/4921728/4894102/5187665", "text": "\nHeadache is often relieved or banished by taking a cup of strongly made tea.\n\n\n\nSore Eyes. If bathed with cold tea sore eyes are often relieved. The tea is such as would be left in the tea-pot after a meal. Thus there would be no milk or sugar.Sore eyes are also cured by making the Sign of the Cross on them with fasting spittle. This cure is always applied for Cré vour (?)The Sign of the Cross made with a Marriage Ring (Gold) will also cure a Cré vour (?) It would appear that some such rings are blessed for this purpose.Another cure for sore eyes is to bathe them with one's own urine.\n\n\n\nBleeding from the Nose is usually by laying flat on back. Another method is the reverse of this that is to bend the head forward when in a sitting posture. The blood will flow freely for a little while but will shortly form a clot which will prevent the flow in a short time. This method is much preferred by some as undoubtedly by the first method some blood must find its way into the stomach.\n(continues on next page)\n", "school_info": "School: Maoilinn (B.), Áth Treasna", "metadata": [{"Location:": "Meelin, Co. Cork", "Teacher:": "\nDiarmuid de Brún\n"}, {"Language": "English"}]}, "5177641/5175629/5196729": {"title": "Cures - Earache", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0596, Page 064", "Page 064"], "url": "https://www.duchas.ie/en/cbes/5177641/5175629/5196729", "text": "\n64 31- V : 38  Ear -ache.To apply a roasted onion as hot as it can be to the ear.To hole the head over a jug of boiling water allowing the steam to enter ear.To heat olive oil and pour it into the ear.The natural oil of the wool is supposed to have curative properties .\n\n\n\nA backache.To drink a drop or two of turpentine .To drink the water in which young nettles is boiled.To drink 'celery tea' or 'parsley tea'.\n\n\n\nHead aches.To drink hot tea without sugar.To rub the leaves of the Daisy to the forehead.To rest quietly in a darkened room.\n\n\n\nWildfire .To apply some drops of the blood of  person named Walshe.\n(continues on next page)\n", "school_info": "School: An Daingean, Cuinche", "metadata": [{"Location:": "Dangan, Co. Clare", "Teacher:": "\nStiofán Mac Clúin, Treasa Ní Chonmara\n"}, {"Language": "English"}]}, "5162105/5154784/5200568": {"title": "Old Irish Cures", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0246, Page 033", "Page 033"], "url": "https://www.duchas.ie/en/cbes/5162105/5154784/5200568", "text": "\nThe seventh son that is born, if there are no daughters between is called a \"doctor\", or the seventh daughter, born without a son between is also called \"a doctor\". If you have ring-worm and get the seventh son or daughter to leave his or her hand on the spot where the worm is it will die and the person gets quite cured.\n\n\n\nFor a a sore throat, white wine vinegar with candy dissolved in it was used as a gargle, and was considered a good cure.\n\n\n\nTo cure a headache, rub vinegar on both temples and tie a brown paper across the forehead and the headache will go after a few hours.\n", "school_info": "School: Enfield", "metadata": [{"Location:": "Enfield, Co. Roscommon", "Teacher:": "\nMáiréad, Bean Uí Dhomhnaill\n"}, {"Collector": "John Farrell", "Gender": "male", "Age": "13", "Address": "Knockalaghta (Wills), Co. Roscommon"}, {"Informant": "James Farrell", "Relation": "parent", "Gender": "male", "Age": "68", "Address": "Knockalaghta (Wills), Co. Roscommon"}, {"Informant": "John Callaghan", "Gender": "male", "Age": "68", "Address": "Bohagh, Co. Roscommon"}, {"Language": "English"}]}, "5177649/5176661/5202122": {"title": "Leigheasanna - Ringworm", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0598, Page 104", "Page 104"], "url": "https://www.duchas.ie/en/cbes/5177649/5176661/5202122", "text": "\nrub ink around the border of it.\n\n\n\ndip head in water in any stone in a graveyard.\n\n\n\nlay up to stomach for a short time a piece of flannel with a good application of turpentine.\n\n\n\nput under spout of cold water.Charm - used to chew slánlus & let juice drop on injury, saying some\n(continues on next page)\n", "school_info": "School: Meelick (B.)", "metadata": [{"Location:": "Meelick, Co. Clare", "Teacher:": "\nEoghan Ó Néill\n"}, {"Language": "English"}]}, "5215813/5215496/5240211": {"title": "Wildfire", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138D, Page 18_023", "Page 18_023"], "url": "https://www.duchas.ie/en/cbes/5215813/5215496/5240211", "text": "\nA cure for wildfire is to get a black cat and cut a bit of his tail and to get blood out of it and to rub it on the Wildfire. Another cure for wildfire is to rub gold on it\n\n\n\nIt is a cure for ringworm to get salt and soot and dip and mix them and to rub the mixture on the ringworm.\n\n\n\nHeadache\n(continues on next page)\n", "school_info": "School: St Bridget's", "metadata": [{"Location:": "Derrymore, Co. Mayo", "Teacher:": "\nMáire Uí hOistín\n"}, {"Collector": "Bríghid Ní Chonmacháin", "Gender": "female"}, {"Language": "English"}]}}