{"4706340/4704191/4783961": {"title": "The Palatine's Daughter", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0443, Page 122", "Page 122"], "url": "https://www.duchas.ie/en/cbes/4706340/4704191/4783961", "text": "\nThe Palatins Daughter“The Palatins Daughter” is supposed to have been written by a native of Ballyseedy. His name was James Whitston of Liosardbula. His descendants are still living there. It is said he was a poet but there is not any other tidings of any poetry he composed. Long ago there was a market for hiring men. A man named James Curran hired a man and this man had to go\n(continues on next page)\n", "school_info": "School: An Clochar, Baile Mhic Ealgóid, Tráighlí", "metadata": [{"Location:": "Ballymacelligott, Co. Kerry", "Teacher:": "\nSs. Ó Conchobhair\n"}, {"Informant": "Michael Connor", "Gender": "male", "Age": "55", "Address": "Ballyseedy, Co. Kerry"}, {"Language": "English"}]}, "4921974/4914649/4938388": {"title": "The Palatine's Prayer", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0491, Page 291", "Page 291"], "url": "https://www.duchas.ie/en/cbes/4921974/4914649/4938388", "text": "\nThe Palatine’s PrayerThe following is told of a family of Palatines who settled in Co Limerick many years ago.In this particular household there were an old man and his wife, their son and the son’s wife, and an Irish Catholic servant boy.Every night before retiring they recited prayers and the old man always concluded by saying aloud“God bless me and my wife.Son and his wifeWe four and no more.”For a long time the servant boy listened patiently. But at last one evening he showed his displeasure. Just as the old man was about to repeat the usual ending. The boy faced him and said“The Devil sweep you and your wife,Sam and his wife,You four and no more.”\n", "school_info": "School: Móin na nGé (C.), An Caisleán Nua", "metadata": [{"Location:": "Rahanagh, Co. Limerick", "Teacher:": "\nMáire, Bean Uí Eachtigheirn\n"}, {"Language": "English"}]}, "4922011/4918102/4942188": {"title": "District of Ballingrane", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0501, Page 102", "Page 102"], "url": "https://www.duchas.ie/en/cbes/4922011/4918102/4942188", "text": "\nDistrict of BallingraneI live in the townland of Ballingrane, in the parish of Nantenan, and in the barony of Lower Connelloe. About thirty families and one hundred and thirty people live in Ballingrane. Ruttle and Shier are the two names most common in the district. These, and most of the people in Ballingrane are descendants of the Palatines who came over in the year 1709. Owing to the ravages of the French in the Palatinate of the Rhine a large number of Germans sought shelter in Great Britain. Lord Southwell Brown, who was then settled here, brought over a number of these refugees and settled them on his estate to work for him. Their headquarters are in Rathkeale and Ballingrane.The houses in the district are mostly slated and are two storey high, with odd small thatched ones here and there. There are only two people living in Ballingrane who are over seventy years of age. Their names are, Mr. David Hennessy – Rosemount, and Miss. Stokes – Railway Cottage, Ballingrane.These tell stories in English but can speak no Irish.\n(continues on next page)\n", "school_info": "School: Ráth gCaola (2)", "metadata": [{"Location:": "Rathkeale, Co. Limerick", "Teacher:": "\nSinéad Ní Chnuic\n"}, {"Collector": "Rene Baker", "Gender": "female", "Address": "Ballingarrane, Co. Limerick"}, {"Language": "English"}]}, "4948484/4849861/4948517": {"title": "The Palatines", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0517, Page 155", "Page 155"], "url": "https://www.duchas.ie/en/cbes/4948484/4849861/4948517", "text": "\nThe PalatinesA number of Germans sought shelter in Great Britain. In the year 1709 Queen Anne brought seven thousand to England. Some went to America. Lord Southwell brought over a number of them to his estate in County Limerick. They were allowed eight acres of land. The Government paid their rent five shillings for twenty acres. They are to be found round Rathkeale, Ballingrane, Askeaton, Kilfinane and Ballyorgan. They are Protesent people most industrious and self supporting and their neighbours were expected to profit by this example.John Wesley, the famous preacher spent some time amongst the Palatines in County Limerick.\n", "school_info": "School: Carnán (C.), Fedamore", "metadata": [{"Location:": "Carnane, Co. Limerick", "Teacher:": "\nMáire, Bean Uí Bhriain\n"}, {"Language": "English"}]}}