{"4428271/4390351/4435982": {"title": "The Big Tide at Mullinasole", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1032, Page 061", "Page 061"], "url": "https://www.duchas.ie/en/cbes/4428271/4390351/4435982", "text": "\nMullinasole is a little hamlet nestling in a cove at the entrance to the channel that leads up to the town of Donegal. Many years ago this little harbour war a very busy place. Little trading vessels called here regularly with their cargoes of grain for the many mills, which were then scattered over the parish of Drumholm. It was also a good fishing centre and could boast of a village of some thirty six houses, whose inmates were able to wrestle a fairly comfortable living from the deep. In the year 1882 this village was almost completely washed away. It was in the month of August that disaster fell on the place. Without why cause whatever the tide began to rise and rise. Soon it\n(continues on next page)\n", "school_info": "School: Lathaigh (Laghey)", "metadata": [{"Location:": "Laghy, Co. Donegal", "Teacher:": "\nProinsias Mac Pháidín\n"}, {"Collector": "Lena Connolly", "Gender": "female", "Address": "Mullanasole, Co. Donegal"}, {"Informant": "Mrs Ellen Likely", "Gender": "female", "Age": "over 70", "Address": "Mullanasole, Co. Donegal"}, {"Language": "English"}, {"Location": "Mullanasole"}]}, "4427816/4346813/4459987": {"title": "Sruthán Paddy", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0091, Page 568", "Page 568"], "url": "https://www.duchas.ie/en/cbes/4427816/4346813/4459987", "text": "\n(continued from previous page)\nbláth corcra ar an bfraoch.\n\n\n\nLá ámhain bordail is triocha bliain ó soin tosuig an lá a' baistigh. Baisteach eadtrom a bhí sé a deanamh tart ar an mbhaile seo. Bhí sé ag baistigh go trom ins na snuich, agus ba ghearr go dtainich tuile sléibe.Lion súl an droicid. Tainich an tuile aniar an botar, agus isteach i dteach Mary Anne b'eigin doibh dul amac as an teach, bhí na potaí, agus gach rud a bhí ar fud an tighe a snam, Níor fachtas a leithead de tuille ariamh san abhainn seo Tarla an tuile seo i mí na tugan sa Sa mblian 1908. Beigin don mnaoi seo Máire Ní Liodeán an teach fagail\n", "school_info": "School: Doire", "metadata": [{"Location:": "Derry, Co. Mayo", "Teacher:": "\nSéamus Ó Cathain\n"}, {"Collector": "Martan Ua Burca", "Gender": "male", "Address": "Derrypark, Co. Mayo"}, {"Language": "Irish"}]}, "4427943/4359981/4462710": {"title": "Severe Weather - Rainstorm", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0120, Page 47", "Page 47"], "url": "https://www.duchas.ie/en/cbes/4427943/4359981/4462710", "text": "\nThe month of January 1834 was a very wet month.  There was a terrible rainstorm during the second week.  There was constant rain from Tuesday morning until Thursday evening, when a storm arose and lasted nearly all night.  The country looked very miserable, nothing but flooded fields could be seen, where rivers had overflown their banks.  The roads were flooded in low lying parts.  The river Moy at Ballylahan Bridge was like a large lake.  No traffic would cross the bridge for several days.\n", "school_info": "School: Loughkeeren", "metadata": [{"Location:": "Knockatemple, Co. Mayo", "Teacher:": "\nAnna M. Warde\n"}, {"Collector": "Maureen Mulloy", "Gender": "female"}, {"Informant": "Michael Mc Keown", "Gender": "male"}, {"Language": "English"}]}, "4427943/4359982/4462711": {"title": "Severe Weather - Rainstorm", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0120, Page 48", "Page 48"], "url": "https://www.duchas.ie/en/cbes/4427943/4359982/4462711", "text": "\nAbout the year 1895 in the month of March, rain fell heavily one night.  It continued raining all the following day till about 2 p.m.  The mountain streams of this locality became roaring torrents, they over flowed their banks, swept stock with them, entered houses on level ground and swept cradles, kettles, pigs, etc. with them.  In places, great lakes occupied the place of green fields.  No very great damage was done and the flood had receded a good deal before bed time.  No lives were lost.\n", "school_info": "School: Loughkeeren", "metadata": [{"Location:": "Knockatemple, Co. Mayo", "Teacher:": "\nAnna M. Warde\n"}, {"Collector": "Celine Warde", "Gender": "female", "Address": "Bellavary, Co. Mayo"}, {"Informant": "(name not given)", "Relation": "relative (other than parent or grandparent)", "Gender": "female"}, {"Language": "English"}]}, "4428278/4391112/4462768": {"title": "The Big Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1034, Page 231", "Page 231"], "url": "https://www.duchas.ie/en/cbes/4428278/4391112/4462768", "text": "\nCharles Doherties house was lowand into it the flood did flowSiad Charlie to himself “I'm brave and bigI'll do all I can to save my pig”He gave three (year) roars and 'twas no wonderHe frightened the wife of mr. HunterRun boys, run boys, run away [above text: chorus.]For your life's in danger this very dayIIDan Mac Collion's eyes did kindleWhen he saw the tide[?] come over the fennelSaid Mary to Dan it might do some harmSo they took a child in every armRun boys, run boys, etc.,IIIOld Mac Clure sat at his dinnerWith a gooses heart, and a gander's liver With that the tide came up the floor“O faith I'm done” said “old Mac Clure”\n(continues on next page)\n", "school_info": "School: Aodh Rua, Dún na nGall", "metadata": [{"Location:": "Donegal, Co. Donegal", "Teacher:": "\nSéamus Mag Shamhráin\n"}, {"Language": "English"}]}, "4427966/4361876/4466886": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0125, Page 425", "Page 425"], "url": "https://www.duchas.ie/en/cbes/4427966/4361876/4466886", "text": "\n(continued from previous page)\nlet her and they got all the milk back again.\n\n\n\nThe Lammas Floods are usually talked about by the people of this district. They expect it to occur some time about August 15th and the farmers make preparations for them. They cut  and save the hay in low lying places and bring it on to higher ground. There is a tract of land along the River Moy between Cloongee and Foxford called the big meadow and in it  there are at least a hundred acres. Meadow grows here for hundreds of years and it was often destroyed by the floods and sometimes swept away the cocks. This is supposed to be the best hay for fattening cattle in the County and people come from distant places to buy some of this meadow.\n\n\n\nThe moon and the cropsThe people of this district say that the potatoes are not ripe to dig until the first harvest moons full. Sometimes it happens the harvest moon is late and does not be full\n(continues on next page)\n", "school_info": "School: Clún na Gaoithe", "metadata": [{"Location:": "Cloongee, Co. Mayo", "Teacher:": "\nPádraig Ó Héaráin\n"}, {"Language": "English"}]}, "4428033/4370269/4475481": {"title": "Báisteach Throm agus Tuilte", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0141, Page 399", "Page 399"], "url": "https://www.duchas.ie/en/cbes/4428033/4370269/4475481", "text": "\nOn the night of the 14th of August, 1927, there came a great flood. There is a river running behind our house, and it burst its banks and flowed everywhere; it flowed almost into our house. Barrels, pots, big stones and trees were carried down by it.The lawn which is quite close to Heathfield House was covered with big rocks of stones, and thousands of trout were lying dead all over it. The people going to Mass on the morning of the 15th of August had to return home, as the road was covered with water. Crops round this place were destroyed with the flood and the gravel which it brought in\n(continues on next page)\n", "school_info": "School: Gort an Tuair", "metadata": [{"Location:": "Gortatoor, Co. Mayo", "Teacher:": "\nÁine Nic Oirealla\n"}, {"Collector": "Annie O' Hara", "Gender": "female", "Address": "Gortatoor, Co. Mayo"}, {"Informant": "Mrs Eileen O' Hara", "Relation": "parent", "Gender": "female", "Address": "Gortatoor, Co. Mayo"}, {"Language": "English"}]}, "4428268/4390064/4478838": {"title": "A Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1031, Page 260", "Page 260"], "url": "https://www.duchas.ie/en/cbes/4428268/4390064/4478838", "text": "", "school_info": "School: Baile Mhic Dáibhid (Ballydevitte)", "metadata": [{"Location:": "Ballydevitt Beg, Co. Donegal", "Teacher:": "\nCathal Mac  an Luain\n"}, {"Collector": "Una Begley", "Gender": "female", "Age": "14", "Address": "Donegal, Co. Donegal"}, {"Informant": "Pádraig Mac Cailín", "Relation": "unknown", "Gender": "male", "Age": "58", "Occupation": "ceannaí", "Address": "Donegal, Co. Donegal"}, {"Language": "English"}]}, "4428268/4390143/4478935": {"title": "The Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1031, Page 339", "Page 339"], "url": "https://www.duchas.ie/en/cbes/4428268/4390143/4478935", "text": "", "school_info": "School: Baile Mhic Dáibhid (Ballydevitte)", "metadata": [{"Location:": "Ballydevitt Beg, Co. Donegal", "Teacher:": "\nCathal Mac  an Luain\n"}, {"Collector": "Una Begley", "Gender": "female", "Age": "14", "Address": "Donegal, Co. Donegal"}, {"Informant": "Bean Uí Closcaidh", "Relation": "unknown", "Gender": "female", "Age": "65", "Occupation": "bean phósta", "Address": "Donegal, Co. Donegal"}, {"Language": "English"}]}, "4428296/4392263/4480238": {"title": "The Big Flood in Gurtains", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1037, Page 163", "Page 163"], "url": "https://www.duchas.ie/en/cbes/4428296/4392263/4480238", "text": "\nLast night my Uncle told me a lovely story. It was all about a flood that came a long time ago in the Gurtain area about a half-mile from this school. He told me that the inhabitants from the townland had to get boats and every means they could to prevent themselves from being swept away by the flood. After some time floating about in this fashion there came a ship which took them on board.When they were ready to sail away the water disappeared all at once and everybody got back to where they left only to find all their belongings swept away. Then they went back to the ship but it was unable to sail for want of water\n(continues on next page)\n", "school_info": "School: Leitir Mhór", "metadata": [{"Location:": "Lettermore, Co. Donegal", "Teacher:": "\nEilís Ní Bhaoghaill\n"}, {"Collector": "Mary Mohan", "Gender": "female", "Address": "Tullycumber, Co. Donegal"}, {"Informant": "Mr John Mohan", "Relation": "relative (other than parent or grandparent)", "Gender": "male", "Age": "76", "Address": "Tullycumber, Co. Donegal"}, {"Language": "English"}]}, "4428387/4402955/4501794": {"title": "Tuile Thí an Phobail", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1067, Page 26", "Page 26"], "url": "https://www.duchas.ie/en/cbes/4428387/4402955/4501794", "text": "\nTuile Thoighe an Phobhail.\n(continues on next page)\n", "school_info": "School: Doire Beag (B.)", "metadata": [{"Location:": "Derrybeg, Co. Donegal", "Teacher:": "\nLiam Mac Giolla Chomhghaill\n"}, {"Language": "Irish"}]}, "4498043/4345630/4503155": {"title": "A Big Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0089, Page 081", "Page 081"], "url": "https://www.duchas.ie/en/cbes/4498043/4345630/4503155", "text": "\nAbout one hundred years ago a great flood raged through Burren and the surrounding villages. It was caused by a cloud burst in the hills near Burrenmore. When it was coming near Burren Bridge which then had two arches it swept a barn with it and it over[?] stirred a stone in the barn till it ended it in on one of the arches and closed it. The other arch was not big enought to take the water so the flood swept the whole bridge with it. When they were building a new bridge they put a tremendous arch on it. That is the reason why the Burren bridge is so high.\n", "school_info": "School: Eaglais", "metadata": [{"Location:": "Burren, Co. Mayo", "Teacher:": "\nS. Ó Mongaigh\n"}, {"Collector": "Pat O Malley", "Gender": "male"}, {"Informant": "John Malley", "Gender": "male", "Age": "75", "Address": "Ardvarney, Co. Mayo"}, {"Language": "English"}]}, "4428167/4383243/4506985": {"title": "Great Floods", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0783, Page 198", "Page 198"], "url": "https://www.duchas.ie/en/cbes/4428167/4383243/4506985", "text": "\nThere are many low lying parts around Balscadden and when heavy rain falls for a time, many places become flooded and sometimes the people cannot travel over fields or roads. The old people remember many such floodings but the worst in memory occurred about forty years ago. It rained constantly for forty-eight hours, and as the rivers and ditches were full at the time the rain water spred  over the fields and roads for miles. It happen n the month of January and the floods did not recede for about six weeks. Many people had great difficulty in getting to the town for food. It was very dangerous to cross the fields as there was the danger of walking into the deep ditches and being drowned. Long poles were used to test the depth of the water in places and even little flat bottomed boats were used to carry home the food. People lost great numbers of cattle, sheep and fowl. And the land could not be ploughed until late in March.\n", "school_info": "School: Balscadden", "metadata": [{"Location:": "Balscaddan, Co. Dublin", "Teacher:": "\nP. Ó Séaghdha, Francis Shaw\n"}, {"Collector": "Julia Mac Fadden", "Gender": "female"}, {"Language": "English"}]}, "4428387/4402935/4511003": {"title": "Lá na Tuileadh", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1067, Page 181", "Page 181"], "url": "https://www.duchas.ie/en/cbes/4428387/4402935/4511003", "text": "\nI mí Lughnasa sa bhliadhain 1880 thuit bailc throm fearthanna agus cloch sneachta ar thaobh an chnoic comhgarach de bhaile Dhoirebeag. Dia Domhnaigh a bhí ann agus bhí poball an Aifrinn cruinn i dteach an phobaill. Anuas an sruthan a bhí deas do thig an phobaill tig an tuile. Ca bith mar druideadh cúrsa an uisge, bhris an tuile isteach sa teach. Thug na daoine iarraidh ar imthigheacht go maith is thainic leo. Bhí an té a bhí láidir ag cuideadh leis an an lag. Bhí teann na tuileadh mór agus sciobadh go leor ar shiubhal. Ba mhiorbhuilte nar cailleadh tuilleadh. Bhí an gleann amach go dtí an fhairrge mar loch ann. Nuair a thraigh an tuille bhí an áit strocthe, sualta? agus é uilig faoi lában.Cuireadh eagar ar an áit na dhiaidh sin san dóigh nach baoghal de thuile briseadh isteach níos mó.\n", "school_info": "School: Doire Beag (B.)", "metadata": [{"Location:": "Derrybeg, Co. Donegal", "Teacher:": "\nLiam Mac Giolla Chomhghaill\n"}, {"Language": "Irish"}]}, "4428395/4403968/4512408": {"title": "Tuilteacha", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1070, Page 157", "Page 157"], "url": "https://www.duchas.ie/en/cbes/4428395/4403968/4512408", "text": "\nIns an bhliadhain 1880 ar an 15adh Lughnasa, Lá Fhéile Mhuire Mór sa'n Fhóghmhair bhí tuile mór i nGaoth Dobhair.Ar maidin an lae sin bhí sé comh bréagh agus d'iarrfeadh dó bhéal a bheith agus chuaidh muinntear na h-áite 'un an Aifrinn mar ba ghnáthach. Nuair a bhí na daoine istigh ag an Aifreann, rinne sé báisteach iongantach trom thuas fá na sléibhte. Thainig an tuile anuas an abhainn agus thaiig turtóga agus glár? anuas leis an tuile agus chruinnigh sé ag béal na h-abhna. Bhí an abhainn 'na reith le taobh thig an phobaill ins an am seo agus d'éirigh tuile ins an abhainn. Thainig an t-uisge isteach ar urlár thig an phobail agus b'éigean dó na daoine dhul suas ar na staighrí agusa. dhul amach ar na fuinneoga. B'éigin dóbhtha rópaí a fhághail agus rinneadar a ndícheall gach duine a shábhail ach cailleadh cúigear duine.Ins an bhliadhain 1889 marbhuigheadh an Máirtíneach ag Teach-Phobail Dhoire Beag fosta ar an 3adh Feabhra a tharla seo. Bhí cogadh na Talmhan ar siubhal ins an am. Thug na péas iarraidh ar an Saghart 'Ac Pháidín a ghábhadh, mar gur\n(continues on next page)\n", "school_info": "School: Gort an Choirce", "metadata": [{"Location:": "Gortahork, Co. Donegal", "Teacher:": "\nSéamus Mac Giolla Easboic\n"}, {"Language": "Irish"}]}, "4493653/4407827/4519735": {"title": "A Great Rainstorm", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1081, Page 185", "Page 185"], "url": "https://www.duchas.ie/en/cbes/4493653/4407827/4519735", "text": "\nIn the month of July about forty-five years ago there was a severe rain storm. It lasted about three days and the people were all frightened. It swept the potatoes out of the drills, destroyed corn and dug up trenches in the roads. It also swept away turf, and the rabbits were lying in heaps at the mouth of every river.A great thunder storm.On the 23 rd. of June about 40 years ago there was a severe thunder storm. It lasted from eight o'clock in the morning until five o'clock in the evening. There were two men coming from the fair of Milford and on their way home they went under a tree for shelter and they were both killed. During the same storm there was a horse killed in the stable. There were also cattle and fowls killed on the same day and there were bushes burned.A great snow storm.In the month of April about 19 years ago there was a terrible snow storm. It lasted from the 6th. until the 20th. of April, and in some places it was four feet deep. There were people lost coming from the fair of Letterkenny. Around the towns the people were out with shovels trying to clear the way.Drought period.In the year 1927 there was a great drought period.\n(continues on next page)\n", "school_info": "School: Ednacarnon", "metadata": [{"Location:": "Edenacarnan South, Co. Donegal", "Teacher:": "\nMáire, Bean Staráid\n"}, {"Collector": "Mary Hannigan", "Gender": "female", "Address": "Gortnacorrib, Co. Donegal"}, {"Informant": "Mr Tom Black", "Gender": "male", "Age": "68", "Address": "Edenacarnan South, Co. Donegal"}, {"Language": "English"}]}, "4493653/4407829/4519745": {"title": "A Great Rainstorm", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1081, Page 187", "Page 187"], "url": "https://www.duchas.ie/en/cbes/4493653/4407829/4519745", "text": "\nOn the 23rd May 1902, there was a great rain storm. There was a lot of bridges tumbled. There is a little river running through Mr. James Gailey's farm. This river was stopped by the stones and the mud carried down by the water. The water turned across a field and made another river. This place is still to be seen.\n\n\n\nOn the 9th. April, 1915, there was a great snowstorm. In some glens the snow was twenty feet deep. It lay in glens and on hills for six weeks. Lots of cattle died as there could be no food got for them.\n\n\n\nIn the summer of 1918, there was a great drought period. All streams and wells went dry. Some people had to go with carts for water to give to cattle, and they had to go nearly a mile.\n", "school_info": "School: Ednacarnon", "metadata": [{"Location:": "Edenacarnan South, Co. Donegal", "Teacher:": "\nMáire, Bean Staráid\n"}, {"Collector": "Eliza Elliott", "Gender": "female", "Address": "Rathdonnell, Co. Donegal"}, {"Informant": "Mr William Mc Callum", "Gender": "male", "Age": "60", "Address": "Rathdonnell, Co. Donegal"}, {"Language": "English"}]}, "4493653/4407831/4519757": {"title": "A Great Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1081, Page 189", "Page 189"], "url": "https://www.duchas.ie/en/cbes/4493653/4407831/4519757", "text": "\nIn the year 1877 there was a great flood and it lasted for about a month. The land was flooded and some houses were flooded.\n\n\n\nThere was a great snow-storm in the year 1920. It lasted about two months. The snow was very deep, and it was so deep that the children could not go to school and the people had to shovel the snow off the road, and pile it into piles at the side of the road.\n\n\n\nThere was a great thunderstorm in 1917. A man named William Elliott, on his way home from winnowing turf, was knccked down by lightning, but he was not injured.\n", "school_info": "School: Ednacarnon", "metadata": [{"Location:": "Edenacarnan South, Co. Donegal", "Teacher:": "\nMáire, Bean Staráid\n"}, {"Collector": "Sarah Mc Geever", "Gender": "female", "Address": "Garrowcarry, Co. Donegal"}, {"Informant": "John Mc Geever", "Gender": "male", "Age": "50", "Address": "Garrowcarry, Co. Donegal"}, {"Language": "English"}]}, "4493710/4413267/4526380": {"title": "The Big Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1097, Page 179", "Page 179"], "url": "https://www.duchas.ie/en/cbes/4493710/4413267/4526380", "text": "\nThe Big FloodAye, I remember the Big Flood well.  There was a smaller one since that but it didn't do near so much damage.  I was at school at the Crossroads the day it came.  The old school was that time in the graveyard where the old stable is now.  Master Brady teached there at that time & the Sergeant at The Cross used to come up often and help him to teach.  He was up that day too.  It was a lovely summer day and not a breeze stirring.  Suddenly, the sky darkened & there came a terrific flash of lightening.  All I remember happening then was the youngsters gathering round the master & the sergeant like\n(continues on next page)\n", "school_info": "School: Druim Mór", "metadata": [{"Location:": "Dromore, Co. Donegal", "Teacher:": "\nJohn Noonan\n"}, {"Collector": "John Noonan", "Gender": "male", "Occupation": "múinteoir"}, {"Informant": "Patrick Mc Fadden", "Gender": "male", "Address": "Ballynaman, Co. Donegal"}, {"Language": "English"}]}, "4493711/4413441/4526395": {"title": "The Big Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1098, Page 17", "Page 17"], "url": "https://www.duchas.ie/en/cbes/4493711/4413441/4526395", "text": "", "school_info": "School: Druim Mór", "metadata": [{"Location:": "Dromore, Co. Donegal", "Teacher:": "\nJohn Noonan\n"}, {"Collector": "Isabel Bonner", "Gender": "female"}, {"Language": "English"}]}, "4493722/4414134/4527829": {"title": "Severe Weather", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1100, Page 184", "Page 184"], "url": "https://www.duchas.ie/en/cbes/4493722/4414134/4527829", "text": "\nA couple of weeks before Christmas 1937. First we had very bad weather. Then there was a very heavy fall of snow; the ground froze over the snow and it was very slippery. People could hardly get out of their houses. There were many people hurted, but there were no lives lost.\n\n\n\nThree years ago, there was a great flood on the River Foyle. It had been raining heavily for a fortnight before, and the water rose right over the cement wall that is on the right-hand side of the river (The Mourne). The houses that were built near the river were flooded. The people had to stay upstairs all the time and food was sent up to them. Much damage was caused to the furniture of these houses.\n", "school_info": "School: Hansard School, Lifford", "metadata": [{"Location:": "Lifford, Co. Donegal", "Teacher:": "\nMairéad Bairéad\n"}, {"Language": "English"}]}, "4493760/4417650/4531166": {"title": "Local Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1112, Page 105", "Page 105"], "url": "https://www.duchas.ie/en/cbes/4493760/4417650/4531166", "text": "\nLong ago there people ate potatoes in the Winter and Indian porridge in the Summer.  They ate three meals every day.  Long ago the people would catch fish in the shore and eat them to the potatoes.  They ate potatoes for their supper at night.  They (ate) bread they ate was made out of potatoes.  It was called fadge.  The potatoes were pounded and were put on the fire to harden.  In the summer time they would work two of three hours before the would get their breakfast.  Then they would get porridge.  Sometimes they would get potatoes.  The first tea came to this place when a priest gave it to a girl in Shangore to make McGrory.  She put all the tea threw out tea and kept the leaves.\n", "school_info": "School: Naomh Aicnidh", "metadata": [{"Location:": "Buncrana, Co. Donegal", "Teacher:": "\nRistéard Ó hAoláin\n"}, {"Collector": "Philip Doherty", "Gender": "male", "Age": "14", "Address": "1419857"}, {"Informant": "John Doherty", "Gender": "male", "Age": "84", "Address": "Gortleck, Co. Donegal"}, {"Language": "English"}]}, "4493762/4417833/4532366": {"title": "A Great Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1112, Page 462", "Page 462"], "url": "https://www.duchas.ie/en/cbes/4493762/4417833/4532366", "text": "\nA great flood 10/1/1938On the 21st August 1930 a number of people from the Illies went to the fair at Carndonagh. Sometime in the afternoon it began to rain and it rained in torrents until late at night. Is is said that there was a cloud-burst  on Slieve Snaght. The floods were so big that the horses and carts coming home from the fair had almost to swim in places on the roads.Ned Doherty and his wife Mary Anne were coming from the fair in their cart and when near home, the flood had covered the road to a depth of several feet in one place, and as the horse was making his way through the flood he stepped off the road (as there was nothing to show where the road was) and horse, cart and all in it were swept down the raging river.Next morning the dead bodies of Ned and his wife were found stuck in bushes that were growing along the river, about a mile below where they fell in. The horse broke loose fro the cart and was found alive in a garden nearby, and the cart was found broken in bits about two miles down the river.The hay, oats and potatoes along the river were all swept away, and there was considerable damage down to houses along the river's banks.\n", "school_info": "School: St. Joseph's, Illies", "metadata": [{"Location:": "Illies, Co. Donegal", "Teacher:": "\nF. Loughlin\n"}, {"Language": "English"}]}, "4493804/4422376/4538357": {"title": "Black Bess", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1123, Page 130", "Page 130"], "url": "https://www.duchas.ie/en/cbes/4493804/4422376/4538357", "text": "\n(continued from previous page)\nsleeping soundly and turning round she said \"I thank your worship I got full value for that £1 but I did not for the first £1.\n\n\n\nA Big Flood (1908 a.d.)This story was heard by: - Romey CassidyCloncha, CuldaffCo Donegalfrom: - Joe Mooney, (65yrs)Cloncha, CuldaffCo DonegalOnce upon a time about thirty years ago in this parish there lived in Cloncha a man named McSheffery.  He sold lime; one day he was away with a load of lime and it began to rain; it rained so heavy that it flooded the rivers.  On his way home he had to cross a bridge.  As he was going across the bridge the flood took him and the horse and cart down the river: he was drowned and the horse was saved.  Before he went away he said to his neighbours that when he would go to bed at night, that nine\n(continues on next page)\n", "school_info": "School: St Boden's, Culdaff", "metadata": [{"Location:": "Culdaff, Co. Donegal", "Teacher:": "\nDoiminic Ó Duibhne\n"}, {"Collector": "Romey Cassidy", "Gender": "female", "Address": "Clonca, Co. Donegal"}, {"Informant": "Joe Mooney", "Gender": "male", "Age": "65", "Address": "Clonca, Co. Donegal"}, {"Language": "English"}]}, "4493718/4413905/4548306": {"title": "The Big Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1099, Page 293", "Page 293"], "url": "https://www.duchas.ie/en/cbes/4493718/4413905/4548306", "text": "\nThis is a story of a terrible flood which took place in the year 1857, the year after Drumavish school was built in the month of July.   James Johnston, the landlord had an auction of bog-wood in a place they call Sallywood. It is about a mile from our house.   During the auction the thunder and lightning began. It was worse than the day Montgomery was hung. The men that bought the bog wood went home for carts to take it away. It was two days before some of them got home. Every road they went the bridges were swept away.   When Robert Denniston and George Gillespie, grandfathers of two boys\n(continues on next page)\n", "school_info": "School: Killygordon", "metadata": [{"Location:": "Killygordon, Co. Donegal", "Teacher:": "\nM. Eibhlín Ní Loinsigh\n"}, {"Collector": "Agnes Bates", "Gender": "female", "Address": "Drumevish, Co. Donegal"}, {"Informant": "Robert Bates", "Relation": "parent", "Gender": "male", "Age": "70", "Occupation": "farmer", "Address": "Drumevish, Co. Donegal"}, {"Language": "English"}]}, "4566058/4563213/4569696": {"title": "Floods", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0025, Page 0026", "Page 0026"], "url": "https://www.duchas.ie/en/cbes/4566058/4563213/4569696", "text": "\nIn the winter of 1921 a terrible flood arose by night in the village of Glenrevough. All the people were aware of it however but one man who was fast asleep. When he awoke he was surprised to find his house flooded. He managed to get out and the only means he had of entering was to get a tub and to go down into it. He continued in this manner for a week until the flood abated.\n", "school_info": "School: Caisleán  hAicéid", "metadata": [{"Location:": "Castlehacket, Co. Galway", "Teacher:": "\nS. Ó Floinn\n"}, {"Collector": "Nellie Hogan", "Gender": "female", "Address": "Biggera More, Co. Galway"}, {"Informant": "John Hogan", "Gender": "male", "Age": "71", "Address": "Biggera More, Co. Galway"}, {"Language": "English"}]}, "4566057/4562979/4570657": {"title": "Tuile Mór", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0024, Page 0514", "Page 0514"], "url": "https://www.duchas.ie/en/cbes/4566057/4562979/4570657", "text": "", "school_info": "School: Corr an Droma", "metadata": [{"Location:": "Corrandrum, Co. Galway", "Teacher:": "\nBreandán Ó Míodhcháin\n"}, {"Collector": "Eibhlín Ní Gráinne", "Gender": "female", "Address": "Kilgill, Co. Galway"}, {"Informant": "Seán Ó Gráinne", "Gender": "male", "Age": "61", "Address": "Kilgill, Co. Galway"}, {"Language": "Irish"}]}, "4566058/4563276/4570809": {"title": "Heavy Rain", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0025, Page 0089", "Page 0089"], "url": "https://www.duchas.ie/en/cbes/4566058/4563276/4570809", "text": "\nThere was an awful rainfall on the 1st May '32. It continued raining from eight o'clock that morning until nine o'clock that night.When it stopped raining there was a foot of water in every hollow in the road. THe water was to be seen running down the sides of the hills. Two families had to leave their houses in the village of Cave, Caherlistrane, Co. Galway. They were, John Flannaghan and John Monoghan.\n", "school_info": "School: Caisleán  hAicéid", "metadata": [{"Location:": "Castlehacket, Co. Galway", "Teacher:": "\nS. Ó Floinn\n"}, {"Collector": "Stephen Keane", "Gender": "male", "Address": "Kilcurriv Eighter, Co. Galway"}, {"Informant": "Mrs Keane", "Gender": "female", "Age": "50", "Address": "Kilcurriv Eighter, Co. Galway"}, {"Language": "English"}]}, "4583351/4582117/4606328": {"title": "A Fire", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0059, Page 0554", "Page 0554"], "url": "https://www.duchas.ie/en/cbes/4583351/4582117/4606328", "text": "\nA Fire.  Mick Diviney, Ballycahalan, Gort.A man named Seánín Ó Conaire was living in a thatched house with no one with him only a big hound when one night as he was in bed the house took fire and himself and the hound were burned.  Bones were found later and it wasn't known whether they were belonging to the dog or the man.A FloodA woman named Mrs. Kearns was coming home from Gort on a horse and cart one evening and as it was getting very late she thought it too late to go around the road so she crossed a river.  There was a great flood in the river that evening and when she was just out in the middle of it the flood brought herself and the horse and cart with it.  It is said that she said a little aspiration as she went along and it was it that saved her.  Not long after, she clung on to a branch which was leaning out over the river and she started to baul so loudly that she was heard in Peterswell.  A great crowd gathered to her and Martin McCarty was the only man who would go out for her.  A rope was tied around his waist and he brought her in safely.  He was later awarded a leather medal for his courage.\n\n\n\nA woman named Mrs. Kearns was coming home from Gort on a horse and cart one evening and as it was getting very late she thought it too late to go around the road so she crossed a river. There was a great flood in the river that evening and when she was just out in the middle of it the flood brought herself and the horse and cart with it. It is said that she said a little aspiration as she went along and that it was it that saved her. Not long after, she clung on to a branch which was leaning out over the river and she started to baul so loudly that she was heard in Peterswell. A great crowd gathered to her and Martin McCarty was the only man who would go out for her. A rope was tied around his waist and he brought her in safely. He was later awarded a leather medal for his courage.\n", "school_info": "School: Tobar Pheadair", "metadata": [{"Location:": "Peterswell, Co. Galway", "Teacher:": "\nP.S. Ó Muireadhaigh\n"}, {"Language": "English"}]}, "4602739/4599962/4632776": {"title": "A Big Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0195, Page 035", "Page 035"], "url": "https://www.duchas.ie/en/cbes/4602739/4599962/4632776", "text": "\nAbout fourteen years ago there was a big flood in this district.  It was in the month of July and the people were not expecting it.  It came very suddenly.It was about seven oclock one evening when it came and it flooded all the lands around the rivers.  It flooded James Gallagher's land and it came into the house.  At that time a miller lived beside them and when he saw their house about to be swept away by the flood he went in and bored holes in the walls to let the flood out.  If he did not the house would have been swept away.  The Gallaghers were out on a hill nearby.Two years ago there came a big flood down Corranmore.  It destroyed before it.  It swept away John McSharrys potatoes and his corn.  It brought down a big stone perhaps fifteen tons weight and left it in front of Terrence Kerrigan's house.  The people in Terry Kerrigans were standing on stools.\n", "school_info": "School: Coillte Clochair (B.)", "metadata": [{"Location:": "Kiltyclogher, Co. Leitrim", "Teacher:": "\nDomhnall Ó Gallchobhair\n"}, {"Collector": "Michael Bennett", "Gender": "male"}, {"Informant": "Patrick Bennett", "Gender": "male", "Age": "50", "Address": "Kiltyclogher, Co. Leitrim"}, {"Language": "English"}]}, "4602736/4599712/4632868": {"title": "Weather", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0193, Page 235", "Page 235"], "url": "https://www.duchas.ie/en/cbes/4602736/4599712/4632868", "text": "\nWestern wind brings most rain. When the cat washes her face it is a sure sign of rain. When she scratches the leg of a chair or table it is a sure sign of big wind. When the flying pismires are swarming in the road it is a sign of rain. A rainbow in the morning is the shepherd's warning a rainbow at night is the shepherd's delight. If both ends of rainbow are in the same townland someone will die soon in that land.\n\n\n\nA fellow named Flanagan was so swift he used to catch hares. When he died the people opened him. They found a pair of little wings on each side of his heart. That was the secret of his speed.\n\n\n\nIn 1897 a rainstorm lasted three hours. All local rivers overflowed their banks. Bridges were tossed\n", "school_info": "School: Gleann an Chairthe", "metadata": [{"Location:": "Glencar, Co. Leitrim", "Teacher:": "\nSeán Mag Ualghairg\n"}, {"Collector": "Margaret Mary Gilligan", "Gender": "female", "Age": "13", "Address": "Fenagh, Co. Leitrim"}, {"Informant": "Thomas Kelly", "Gender": "male", "Age": "65", "Address": "Drumdillure, Co. Leitrim"}, {"Language": "English"}]}, "4602737/4599805/4634245": {"title": "Floods", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0193, Page 358", "Page 358"], "url": "https://www.duchas.ie/en/cbes/4602737/4599805/4634245", "text": "\nOn the last Saturday in July 1897, a cloudburst occurred over Thur Mountain. A nightly mounting flood swept down My husband's father and mother were away at a market in Blacklion. The bridge near the house became chocked with water and ducks, geese  packs of flour and other things were floating in the water. At last the bridge burst and carried away the water. The lowlands became like a lake. A cow belonging to Pat. Meehan of Carrum Kiltyclogher was carried by the flood down to Kiltyclogher.\n\n\n\nBefore the Sligo Leitrim railway was made, the people around Kiltyclogher had to go for their needs to Ballyshannon, Co Donegal. The shop keepers got their meal and flour etc from Derry on carts. I heard a story about two women Mrs. Mulligan and Mrs. McGuinness, both of whom lived in Silverhill, Kiltyclogher.  In the bad times, these two women started off one morning early to Ballyhannon for Indian meal. Those who remained at home promised to have the pot boiling to make the porridge about the time that they should be back. When they reached Ballyshannon, they took some liquid refreshments they didn't do with a little. They spent the money they had for the meal. It took them a long time to come home as they were \"bringing the two sides of the road with them\"\n(continues on next page)\n", "school_info": "School: Corra Cluana", "metadata": [{"Location:": "Corracloona, Co. Leitrim", "Teacher:": "\nPádraig Ó Caomháin\n"}, {"Informant": "Mrs B. Mc Morrow", "Gender": "female", "Occupation": "teacher"}, {"Language": "English"}]}, "4605946/4604763/4651573": {"title": "Severe Weather - Cyclone", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0206, Page 261", "Page 261"], "url": "https://www.duchas.ie/en/cbes/4605946/4604763/4651573", "text": "\n(continued from previous page)\nSevere Weather (Contd)and houses. It lasted for about an hour.{Margaret Mc Gourty from her grandfather, James Mc Gourty, of Slievenakilla, Ballinaglera, Co. Leitrim}\n\n\n\nWind-storms:There was a great wind storm about 1918. It swept thatch off houses and nearly tossed them. The people had to prop the houses. It also tossed corn stacks and ricks of hay.There was another windstorm about 90 years ago. It tossed byres and stripped some houses. If it lasted any longer it would kill all animals.\n\n\n\nThunderstorms:There was a great thunderstorm about 1897.  It killed horses and cattle and threw down houses.  It dug a hole in the ground and it sent pieces of the earth yards away from it.  The lightning struck trees and tossed them down.\n\n\n\nRainstorms:About fifty years ago there came a great rainstorm.  It flooded a good deal of land and swept some away.  It flowed into houses and the people had to leave them.  There were no lives lost.\n\n\n\nSnowstorms:About sixty years ago there came a great snowstorm. It was six feet deep.  The people used to walk down Drumristan Rock on the top of the snow with turf on their backs.  The snow was fifty feet deep on the mountains.  All the sheep that were on the mountains were lost under the \"rays\" of snow.\n(continues on next page)\n", "school_info": "School: Sliabh na Cille", "metadata": [{"Location:": "Slievenakilla, Co. Leitrim", "Teacher:": "\nPeadar Mac Fhlannchadha\n"}, {"Language": "English"}]}, "4605946/4604764/4651578": {"title": "Snowstorms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0206, Page 262", "Page 262"], "url": "https://www.duchas.ie/en/cbes/4605946/4604764/4651578", "text": "\n(continued from previous page)\nOn the 12th of May about fifty years ago there came a heavy snowfall.  Sheep and cattle and horses were on the mountains.  It was continually snowing for a day and all that were on the mountain were lost.{Mary Mc Gourty from her grandmother, Maria Mc Gourty of Aughrim, Co. Leitrim.}\n\n\n\nThere was a great flood   one time in the Yellow River about 75 or 76  years ago.There was a crowd of young people playing on the bank of the Yellow River at James McPartlan's of Slievenakilla. The flood swept a girl called Rose McPartlan. It brought her about a quarter of a mile. She was put out on the bank at Pat. McParttan's land and she was safe.There was a large flood in the Yellow River in 1927. The people living along the river had to leave their homes. This flood swept the Slievenakilla bridge, that is, the small wooden bridge and also Aughrim Bridge, that is, the Bridge between Aughrim and Corralubber.\n\n\n\nThere was a great snowfall about 60 years ago.  It was about 6 feet deep.  It lasted about seven weeks.  The \"allt\" between Slievenakilla and Carntulla was full of snow.  It was about forty feet deep there.  Every \"allt \" and hollow was full.  The people suffered terribly.  They were almost perished to death.  They could not get turf or food.  They had to clear the snow with\n(continues on next page)\n", "school_info": "School: Sliabh na Cille", "metadata": [{"Location:": "Slievenakilla, Co. Leitrim", "Teacher:": "\nPeadar Mac Fhlannchadha\n"}, {"Language": "English"}]}, "4649691/4647612/4652243": {"title": "Severe Weather - Storm", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0211, Page 178", "Page 178"], "url": "https://www.duchas.ie/en/cbes/4649691/4647612/4652243", "text": "\n(continued from previous page)\nIt blew off boards off a wooden bridge in Sheafield.\n\n\n\nIn January 1839 there was a great wind which blew a bridge and houses down and uprooted trees in Sheafield. It blew the hay out of my townland as far as Newbrook, a distance of one mile.\n\n\n\nA great snow storm raged in eighteen hundred and fifty. Peter Dunne of Sheafield was lost in a drift. He was nearly dead when found.\n\n\n\nIn the year eighteen eighty two a very severe storm occurred in our district. It lasted one day and caused extensive damage. The roof was swept off John Floyd's dwelling house. About a half a rick of hay was blown out of John Beirne's garden (Garvagh). Two trees were knocked at James Horan's, Scrabagh.\n\n\n\nSeventy years ago a flood arose in our locality. Three links of turf\n(continues on next page)\n", "school_info": "School: Coill Chláir", "metadata": [{"Location:": "Kilclare, Co. Leitrim", "Teacher:": "\nTreasa Ní Oibeacáin\n"}, {"Collector": "Annie Pagnam", "Gender": "female", "Address": "Seltan (McDonald), Co. Leitrim"}, {"Informant": "James Curran", "Gender": "male", "Age": "65", "Address": "Seltan (McDonald), Co. Leitrim"}, {"Language": "English"}]}, "4666570/4662799/4666875": {"title": "Potato Crops", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0399, Page 046", "Page 046"], "url": "https://www.duchas.ie/en/cbes/4666570/4662799/4666875", "text": "\n(continued from previous page)\nof potatoes such as Aranbanner, Keirpinks, and Champions. When the potatoes are fully gown they are dug with a spade or a common plough or a potato digger and they are stored in a pit for the winter.\n\n\n\nThere was a very severe flood the night of the thunderstorm. When the people woke that morning in many places they found that the water entered their houses. There was a great flood near Mulvihill of Lensechane. There was a motor car going the road from Beale to Ballybunion and it stopped in the middle of the water and the driver could not get it going he took shelter in a cottage nearby. When the flood abated he got his car going and he went away. Mulvihill house was also flooded. The water flowed down the hill near our school and it got stopped near the school gate and it flowed on over the steps at the gate and it flowed into the door and it nearly flooded the school. In Lixnaw it did a great deal of damage to the potato crop and oats belonging to a farmer named Timothy Horgan. It flooded two\n(continues on next page)\n", "school_info": "School: Beale (1)", "metadata": [{"Location:": "Beal, Co. Kerry", "Teacher:": "\nMartin Beasley\n"}, {"Collector": "Patrick Mulvihill", "Gender": "male", "Address": "Leansaghane, Co. Kerry"}, {"Language": "English"}]}, "4666580/4663703/4666963": {"title": "A Local Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0402, Page 063", "Page 063"], "url": "https://www.duchas.ie/en/cbes/4666580/4663703/4666963", "text": "\nThere was a great flood in this district about seventy one years ago. About the year 1870 a bog ran in the townland of Ahanagran, about two miles from Ballylongford, and it went out into the Atlantic Ocean.In the month of November in the year 1869, the bog moved for the first time, about two hundred yards. In the month of February 1870 it moved for the second time. It knocked houses, and did a great amount of harm in its rush towards the sea.There were people named Moriartys living near the bog,\n(continues on next page)\n", "school_info": "School: Ballylongford (C.)", "metadata": [{"Location:": "Ballylongford, Co. Kerry", "Teacher:": "\nCáit, Bean Uí Bheoláin\n"}, {"Collector": "Sarah Dee", "Gender": "female", "Address": "Aghanagran Middle, Co. Kerry"}, {"Informant": "Jeremiah Dee", "Relation": "parent", "Gender": "male", "Address": "Aghanagran Middle, Co. Kerry"}, {"Language": "English"}]}, "4666602/4665803/4667730": {"title": "A Storm", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0413, Page 178", "Page 178"], "url": "https://www.duchas.ie/en/cbes/4666602/4665803/4667730", "text": "\n(continued from previous page)\nit turned north it was travelling at a rate of from sixty to seventy miles an hour. The people took little notice of the storm until ten o'clock. Then it rolled faster and faster and the people got greatly alarmed. Many of their homes were shaken and the thatch blown away. Hay barns and cow sheds were blown away.  from Mike Dunne Ballyheigue.\n\n\n\nA storm and rain took place in October 1880. At that time there lived a weaver who originally belonged to Killahan, His name was Mick Shea. When he had his trade learned he left and set up for him selfs a work shop on the bank of Gale river, between Listowel and Liselton in a timber house and was married. At that time he got an order from one of his customers to weave a linen towel one night fora private Mass next morning. He was a long part of the night weaving in his loom and expecting the neighbour to come for the towel.\n(continues on next page)\n", "school_info": "School: Killahan (B.)", "metadata": [{"Location:": "Killahan, Co. Kerry", "Teacher:": "\nLiam Ó Leathlobhair\n"}, {"Language": "English"}]}, "4672096/4669611/4672796": {"title": "A Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0166, Page 228", "Page 228"], "url": "https://www.duchas.ie/en/cbes/4672096/4669611/4672796", "text": "\nAbout twenty years ago there came a grate flood in Dooneil River. It rained all night and in the morning the rived [?] overflowed. The flood sept a wooden bridge off the river at Owen Mc Donagh's and brought it to the sea. It threw a stable in McDonagh's yard and scattered the sones all over his land. It went to Somerville's hen-house and drowned many hens. It also brought away a bridge from Somerville's.\n", "school_info": "School: Druim Mór", "metadata": [{"Location:": "Dromore, Co. Sligo", "Teacher:": "\nSeosamh Ó Catháin\n"}, {"Collector": "Michael Burke", "Gender": "male"}, {"Informant": "Pat Killawee", "Gender": "male", "Age": "72", "Address": "Dromore West, Co. Sligo"}, {"Language": "English"}]}, "4672096/4669612/4672800": {"title": "A Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0166, Page 229", "Page 229"], "url": "https://www.duchas.ie/en/cbes/4672096/4669612/4672800", "text": "", "school_info": "School: Druim Mór", "metadata": [{"Location:": "Dromore, Co. Sligo", "Teacher:": "\nSeosamh Ó Catháin\n"}, {"Collector": "Michael Burke", "Gender": "male"}, {"Informant": "William Mc Hugh", "Gender": "male", "Age": "61", "Address": "Dunneill, Co. Sligo"}, {"Language": "English"}]}, "4672096/4669615/4672807": {"title": "A Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0166, Page 232", "Page 232"], "url": "https://www.duchas.ie/en/cbes/4672096/4669615/4672807", "text": "\nA FloodAbout forty eight years ago there was a great flood in this district. It occurred in the month of November. There was light rain during the day and the night was still worse. When daybreak came the whole landscape resembled a sea.At this time there dwelt in a little cottage in the townland of Belville a woman named 'Nora Finian'. The flood crossed the road and surrounded Nora's cottage. Her neighbours were all sure she was drowned. During the whole night a light was seen going round the house. A neighbour of Nora's named 'Jack Colleary' worked in Ormsby's and he had business to Belville in the morning. When he saw how Nora was surrounded with the flood he thought she was surely drowned. He met Owen Gilroy and they both caught hands\n(continues on next page)\n", "school_info": "School: Druim Mór", "metadata": [{"Location:": "Dromore, Co. Sligo", "Teacher:": "\nSeosamh Ó Catháin\n"}, {"Collector": "Annie Mc Hugh", "Gender": "female"}, {"Informant": "Peter Colleary", "Gender": "male", "Age": "70", "Address": "Dunneill, Co. Sligo"}, {"Language": "English"}]}, "4672096/4669617/4672820": {"title": "A Big Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0166, Page 234", "Page 234"], "url": "https://www.duchas.ie/en/cbes/4672096/4669617/4672820", "text": "", "school_info": "School: Druim Mór", "metadata": [{"Location:": "Dromore, Co. Sligo", "Teacher:": "\nSeosamh Ó Catháin\n"}, {"Collector": "E. Judge", "Gender": "unknown"}, {"Informant": "Henry Judge", "Gender": "male", "Age": "65", "Address": "Crowagh or Dunneill Mountain, Co. Sligo"}, {"Language": "English"}]}, "4672096/4669620/4672822": {"title": "A Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0166, Page 237", "Page 237"], "url": "https://www.duchas.ie/en/cbes/4672096/4669620/4672822", "text": "\nAbout the year 188 in the month of August there was a very big flood in this district. The morning was fine up till about one of two o clock. Then there came very heavy drownpours that felt plenty of high floods.The hehannow- river over flowed and covered acres of land. There was a man named ellr. Burrows living in Lehannow, where ellr. Joyce resides now. In the evening he went for his cows to milk them. When he was bringing them across a wooden bridge, one of the cows missed her footing and slid into the river. She was carried off by the force of the water to the bridge at elloshand, and was held there in the eye of the bridge. When she was taken out she was dead.\n", "school_info": "School: Druim Mór", "metadata": [{"Location:": "Dromore, Co. Sligo", "Teacher:": "\nSeosamh Ó Catháin\n"}, {"Collector": "M.K. Kenny", "Gender": "female"}, {"Informant": "M.J. Kenny", "Gender": "unknown", "Age": "53"}, {"Language": "English"}]}, "4672096/4669621/4672827": {"title": "A Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0166, Page 238", "Page 238"], "url": "https://www.duchas.ie/en/cbes/4672096/4669621/4672827", "text": "", "school_info": "School: Druim Mór", "metadata": [{"Location:": "Dromore, Co. Sligo", "Teacher:": "\nSeosamh Ó Catháin\n"}, {"Collector": "Claire Culkin", "Gender": "female"}, {"Informant": "Larry Culkin", "Gender": "male", "Age": "50", "Address": "Dromore West, Co. Sligo"}, {"Language": "English"}]}, "4672096/4669623/4672848": {"title": "A Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0166, Page 240", "Page 240"], "url": "https://www.duchas.ie/en/cbes/4672096/4669623/4672848", "text": "", "school_info": "School: Druim Mór", "metadata": [{"Location:": "Dromore, Co. Sligo", "Teacher:": "\nSeosamh Ó Catháin\n"}, {"Collector": "Sara Browne", "Gender": "female", "Address": "Portaghbradagh, Co. Sligo"}, {"Informant": "Pat Culkin", "Gender": "male", "Age": "58", "Address": "Portaghbradagh, Co. Sligo"}, {"Language": "English"}]}, "4672096/4669624/4672851": {"title": "A Great Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0166, Page 241", "Page 241"], "url": "https://www.duchas.ie/en/cbes/4672096/4669624/4672851", "text": "", "school_info": "School: Druim Mór", "metadata": [{"Location:": "Dromore, Co. Sligo", "Teacher:": "\nSeosamh Ó Catháin\n"}, {"Collector": "Joe Cleary", "Gender": "male"}, {"Informant": "Pat Cleary", "Gender": "male", "Age": "40"}, {"Language": "English"}]}, "4678385/4674568/4683745": {"title": "An Doineann - Toirneach agus Tintreach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0419, Page 266", "Page 266"], "url": "https://www.duchas.ie/en/cbes/4678385/4674568/4683745", "text": "\n(continued from previous page)\nDaingean sa bhliain 1897. Bhí sé féin agus a mhadra ag dul thar claidhe agus marbhuigheadh é.Leag splannc an binn dhá uair i dtigh Rólainn Ó Muirchearta i Ráth Rhionáin fiche bliain ó shoin. Dóigh splannc tig cinn tuigthe i gCill Chuáin 25 bliain ó shoin. Dóigh splannc cuid do's na leitreachain Oifig an Phuist i mBaile  'n' nGall sa bhliain 1910.\n\n\n\nTóg an tuille capall agus fear a bhí na 'diaidh sa bhliain 1918. Lean an bháisteach sa bhliain 1918. Lean an bháisteach ar feadh lae is oidhche.Bhí sochraidh ó Árd na Chainche ag teacht go dtí'n séipéal agus tógadh an chomhartha do guailnibh na bhfear thíos ar an\n(continues on next page)\n", "school_info": "School: Baile 'n Fhirtéaraigh (B.)", "metadata": [{"Location:": "Ballyferriter, Co. Kerry", "Teacher:": "\nMichael Ó Conchobhair\n"}, {"Collector": "Liam Bhúdhlaeir", "Gender": "male", "Address": "Ballyferriter, Co. Kerry"}, {"Informant": "Diarmuid Ó Curráin", "Gender": "male", "Address": "Ballinrannig, Co. Kerry"}, {"Language": "Irish"}]}, "4687695/4684548/4688554": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0429, Page 011", "Page 011"], "url": "https://www.duchas.ie/en/cbes/4687695/4684548/4688554", "text": "\n11/168  An fear céadna - do Phea[i]dí Ceallacháin ‘s dá mhnaoí “Cit leandí” - a bhí a troid le na chéile lá. Bhí eagal ar “Cit” roim[h] Pheaidí, agus theith sí uaidh an lá so. Níor tháinig sí abhaile an oidhche sin, ná amáireach, ná a’monathar [?]; agus do bhris ar an bhfoig[h]ne ag Peaidí ar deire ‘s chuaidh sé á lorg. Nuair chualaidh “Micí” an Scéal, chum sé an rann beag so dhóibh:Do chuarduig sé an Ceapaig Cluain Searrach\t‘S tuatha na TíorachTighthe an lisín, ‘s as san go dtí an Srón‘S nuair tháinig sé abhaile cá mbeadh sí\tach sínte‘s í a lorg a tíghisig ar an gCarraig Fé Bhrón.[Ainmeacha bailtí atá ar an gceanntar so, iad so go léir.]\n\n\n\n***Báisteach:Spéir dhearg thoir, go luath ar maidin, ana chómhartha báistidhe.\t\tS. Mac Gearailt\n\n\n\n***Creideamh:Fadó nuair bhí cainnt ag na h-ainmhidht[h]e, deireadh na Muca gur dath dearg a bhí ar an ngaoith.\t\tS. Mac Gearailt\n", "school_info": "School: Baile Uí Dhuibhne, Caisleán Ghriaire", "metadata": [{"Location:": "Ballyquin, Co. Kerry", "Teacher:": "\nSeán Ó Loingsigh\n"}, {"Informant": "S. Mac Gearailt"}, {"Language": "Irish"}]}, "4687695/4684549/4688562": {"title": "Cúpla Véarsa do Chum Mici do Bhaile an Ché", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0429, Page 012", "Page 012"], "url": "https://www.duchas.ie/en/cbes/4687695/4684549/4688562", "text": "\nBáisteach ‘s aimsir:Má bhíonn deábrain báistidhe ar an lá agus mara dtuiteann sí, ar lag-trágha nó ar leath-lán, ní bheidh báisteach annsan go barra taoide. (S. Mac Gearailt, 84 bl.)\n", "school_info": "School: Baile Uí Dhuibhne, Caisleán Ghriaire", "metadata": [{"Location:": "Ballyquin, Co. Kerry", "Teacher:": "\nSeán Ó Loingsigh\n"}, {"Informant": "S. Mac Gearailt", "Age": "84"}, {"Language": "Irish"}]}, "4687722/4687403/4690043": {"title": "Stoirm", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0437, Page 037", "Page 037"], "url": "https://www.duchas.ie/en/cbes/4687722/4687403/4690043", "text": "\n(continued from previous page)\ncruacaí fear agus sean-tighthe acht níor gortuigheach aoinne. Níor cuimhin leis na sean-daoine leithéid a gála de chéad bliain. Cúpla lá in a dhiaidh san léigheamair ins an páipéar go mairbhuigheach fear an phuist i gCondae Phort-Láirge.Ní fuaireadh riamh a corp. Bhí muirghin mór aige. Ba mór an náire d'aoinne do dheanamh. Chaitheadh ar bliain ag lorg agus ní fuaireadh riamh a chorp. Bhí an t-Easbog ar buille nar gheall ar an sgéal.D'eithigh sé cun teacht cun na leanbhaí a chur fé lámh easbuigh acht do tháinig sé na dhiaidh san le thruagh des na leanbhaí.\n\n\n\nBáisteach TromTimcheall cúig bliain ó shion tainigh báisteach trom ins an Mhí Lughnasa. Dhein sé mórán díobháil timcheall caisleán na maine mar bhí\n(continues on next page)\n", "school_info": "School: Cromán (B.)", "metadata": [{"Location:": "Cromane, Co. Kerry", "Teacher:": "\nStiophán Ó Cobhthaigh\n"}, {"Collector": "Caomhán Ó Éaluighthe", "Gender": "male"}, {"Informant": "Tadhg Mac Lochlainn", "Gender": "male", "Age": "65", "Address": "Cromane Upper, Co. Kerry"}, {"Language": "Irish"}]}, "4687708/4686023/4708565": {"title": "Old Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0432, Page 414", "Page 414"], "url": "https://www.duchas.ie/en/cbes/4687708/4686023/4708565", "text": "\n(continued from previous page)\nSt Patrick.\n", "school_info": "School: Fadhbach, Caisleán na Mainge", "metadata": [{"Location:": "Fybagh, Co. Kerry", "Teacher:": "\nMl. Ó Tíodhcháin\n"}, {"Collector": "Mary Clifford", "Gender": "female", "Address": "Gortaleen, Co. Kerry"}, {"Informant": "Kate Clifford", "Relation": "parent", "Gender": "female", "Address": "Gortaleen, Co. Kerry"}, {"Language": "English"}]}, "4701691/4693095/4744253": {"title": "The Big Flood of 1898", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0163, Page 303", "Page 303"], "url": "https://www.duchas.ie/en/cbes/4701691/4693095/4744253", "text": "\nAbout 15th July 1898 a terrible flood rose in Glenree river and it swept away the new Glenree bridge. Considerable damage was done to the oats and potato crops and this left the farmers in very poor circumstances. The morning was bright and calm. Towards mid-day a stiff breeze arose from the east, black clouds darkened the sky at 2.30, the thunder came half an hour afterwards and vivid flashes of lightning followed. Farmers working in the bogs near Glenree were terrorised, and when the\n(continues on next page)\n", "school_info": "School: Stuacán", "metadata": [{"Location:": "Muingwore, Co. Sligo", "Teacher:": "\nBríd Ní Mhiadhaigh\n"}, {"Collector": "Mary Sweeney", "Gender": "female", "Age": "14", "Address": "Muingwore, Co. Sligo"}, {"Informant": "Mrs A. Jordan", "Gender": "female", "Address": "Carrowleagh, Co. Mayo"}, {"Language": "English"}]}, "4742077/4733276/4770332": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0461, Page 362", "Page 362"], "url": "https://www.duchas.ie/en/cbes/4742077/4733276/4770332", "text": "\n(continued from previous page)\nplás na sepathac, rios, pluais, plás na bhfuilíní, cúm a chích, meardhon- between higher mountain lands and lowlands. About seven years ago the owner found here in a bog a quantity of bog-butter and a curious wooden pail or basket. The latter is preserved in the National Museum.Maighread Ní DhonnchadhaLá breithe 2-5-1900\n\n\n\nIn Glenflesk the old people used to tell about the Claydagh flood. This event must have taken place more than one hundred years ago. This is how I have heard it told. A tailor was working in a house far up on the hill. He was seated on the table at his work and on glancing through the window he was astonished to see a raging torrent washing down the hill in the direction of the house. I believe it was a fine day which made his astonishment all the greater. He ran to save himself calling to the people of the house to do likewise but they did not believe him. Before\n(continues on next page)\n", "school_info": "School: An Clochar, Neidín", "metadata": [{"Location:": "Kenmare, Co. Kerry", "Teacher:": "\nBrighid Ní Lochlainn\n"}, {"Collector": "Maighread Ní Dhonnchadha", "Gender": "female", "Address": "Annagh More, Co. Kerry"}, {"Language": "English"}]}, "4713232/4709673/4778230": {"title": "The Great Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0450, Page 192", "Page 192"], "url": "https://www.duchas.ie/en/cbes/4713232/4709673/4778230", "text": "\nOn the 20th of September 1858 there was a flood in the Feale. A man living in Kilmanihan was surrounded by the flood and he went up a tree and the tree was uprooted and he was drowned and was found in an inch near Abbeyfeale. There was a cock of hay in his yard and the flood brought it out and landed it at the crossroads a hundred yards away.  Hay and straw and cattle got caught in the eye of the Fealebridge and the water went over it and knocked it. There was a pig fair in Abbeyfeale and the Baron of the fair, William Broderick had to hire fifty men to make passages across the river in about three miles of it for the people to cross. There were a row of houses near Fealebridge and the flood swept them.\n", "school_info": "School: Cnoc Breac", "metadata": [{"Location:": "Knockbrack, Co. Kerry", "Teacher:": "\nSéamus Ó Conchubhair\n"}, {"Collector": "Paddy Leahy", "Gender": "male"}, {"Informant": "Ned Leahy", "Relation": "unknown", "Gender": "male", "Address": "Ballinacartin, Co. Kerry"}, {"Language": "English"}]}, "4713260/4712624/4779439": {"title": "The Clydagh Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0457, Page 762", "Page 762"], "url": "https://www.duchas.ie/en/cbes/4713260/4712624/4779439", "text": "\nThe river Fleisg flowed long ago. It rose between Clydagh and Millstreet. There was a little glaise in a marshy place. There was a couple of bunches of rushes and it was out of this the river fleisk rose. The place where the bunch of rushes were it became a mass of water. It flowed on and on until it came to Clydagh. There were some houses on its track and it swept them all away. On its course several small rivers joined it namely Abhann ní Cree there are some others which I cannot tell the names of. The Flesk is a very dangerous river as it nearly always over-flowed its banks. It joins the Killarney lakes. It is a very long river.A man by the name of Lucey came from Ballyvourney and grabbed a farm where Donncadh Tomás Aodh now lives. He boasted that he would \"put his back to Killaha which meant that he would grab all the ODonoghue's of the glens, lands in Glenflesk. He met the Parish Curate one day and he boasted that he would do to the ODonoghues. The\n(continues on next page)\n", "school_info": "School: Gleann Fleisge", "metadata": [{"Location:": "Glenflesk, Co. Kerry", "Teacher:": "\nDonnchadh Ó Spiolláin\n"}, {"Informant": "Flor P. Donoghue", "Gender": "female", "Age": "60", "Address": "Shronaboy, Co. Kerry"}, {"Language": "English"}]}, "4706346/4704624/4779495": {"title": "Severe Weather - Thunder and Lightning", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0444, Page 401", "Page 401"], "url": "https://www.duchas.ie/en/cbes/4706346/4704624/4779495", "text": "", "school_info": "School: O'Brennan, Baile Mhic Ealgóid, Tráighlí", "metadata": [{"Location:": "Tonreagh Lower, Co. Kerry", "Teacher:": "\nPádraig Ó Loingsigh\n"}, {"Collector": "Maureen Brosnan", "Gender": "female"}, {"Language": "English"}]}, "4706346/4704624/4779500": {"title": "Severe Weather - Thunder and Lightning", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0444, Page 401", "Page 401"], "url": "https://www.duchas.ie/en/cbes/4706346/4704624/4779500", "text": "", "school_info": "School: O'Brennan, Baile Mhic Ealgóid, Tráighlí", "metadata": [{"Location:": "Tonreagh Lower, Co. Kerry", "Teacher:": "\nPádraig Ó Loingsigh\n"}, {"Collector": "Donal Leen", "Gender": "male", "Address": "Ballincollig, Co. Kerry"}, {"Language": "English"}]}, "4706346/4704625/4779502": {"title": "Severe Weather - Floods", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0444, Page 402", "Page 402"], "url": "https://www.duchas.ie/en/cbes/4706346/4704625/4779502", "text": "\n(continued from previous page)\nknown as the \"Quarry Lodge\" the whole house + family were swept away + were never seen again after that night.  A poem was also composed about the event.\n\n\n\nEily Rose Leen (Ballincollig) says:A great flood occured in this district in January 1925.  The bridge of Potally was broken + was not able to carry the water so the flood broke out over the surrounding land, + came into the house of Mr Patrick Lynch N.T, rising to a height of about 2 feet within.  No damage was done as it was newly built + they were not living in it.\n", "school_info": "School: O'Brennan, Baile Mhic Ealgóid, Tráighlí", "metadata": [{"Location:": "Tonreagh Lower, Co. Kerry", "Teacher:": "\nPádraig Ó Loingsigh\n"}, {"Informant": "Eily Rose Leen", "Gender": "female", "Address": "Ballincollig, Co. Kerry"}, {"Language": "English"}]}, "4742156/4740704/4782922": {"title": "The Flood of 1923", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0772, Page 087", "Page 087"], "url": "https://www.duchas.ie/en/cbes/4742156/4740704/4782922", "text": "\nLate in the year 1923, the Tony which is a tributary of the river Liffey, overflowed its banks during the late hours of Saturday night and as it happened at such an unusual hour, the people living near it were unaware of the fact, until they awakened on the following morning, which unfortunately happened to be Sunday.The Main Street was flooded from top to bottom and the depth of the water was 2 1/2 feet. As it is 14 years, since this occurred motor-cars were not so plentiful as they are nowadays and the people were thankful to have any kind of Vehicle, which would convey them as far as the Church so as to fulfil the Obligation.Even the \"Parish...\n(continues on next page)\n", "school_info": "School: St. Brigid's Convent, Kildraught", "metadata": [{"Location:": "Celbridge, Co. Kildare", "Teacher:": "\nSr. Donatus\n"}, {"Collector": "Rosie Mulligan", "Gender": "female", "Address": "Celbridge, Co. Kildare"}, {"Informant": "Mr Mullins", "Gender": "male"}, {"Language": "English"}]}, "4742131/4738655/4786162": {"title": "An Doineann", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0476, Page 072", "Page 072"], "url": "https://www.duchas.ie/en/cbes/4742131/4738655/4786162", "text": "", "school_info": "School: Na Cealla (Kells)", "metadata": [{"Location:": "Kells, Co. Kerry", "Teacher:": "\nPádraig Ó Fiannachta\n"}, {"Collector": "Tomás Ó Muircheartaigh", "Gender": "male", "Age": "14", "Address": "Kells, Co. Kerry"}, {"Informant": "Míceál Ó Muircheartaigh", "Gender": "male", "Age": "56", "Address": "Kells, Co. Kerry"}, {"Informant": "Síghle Ní Mhuircheartaigh", "Gender": "female", "Address": "Kells, Co. Kerry"}, {"Language": "Irish"}]}, "4742069/4732371/4786795": {"title": "Severe Weather", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0460, Page 027", "Page 027"], "url": "https://www.duchas.ie/en/cbes/4742069/4732371/4786795", "text": "\nSevere Weather1.  In January 1889 there was a great snowstorm.  The snow fell so heavily that in some hollows along the road it was fifteen feet in depth.  In some of these hollows the snow didn't melt until mid - June.It was such a blizzard that it went in between the slates in the houses where the rain did not go.  Many lives were lost in the Kerry and Wicklow Hills, searching for sheep.  Flocks of sheep were lost also.  Animals and people were dying from January until June.\n\n\n\nDuring the winter of 1916  there were great floods which caused much damage to roads and bridges.  The bridge near Farranfore Post Office  was knocked down by one of these floods.  It was rebuilt the following year.  Austin Stack was the first man to cross over the bridge  after it being rebuilt.  He was returning home after a term of imprisonment.  the bridge was afterwards called Stack's Bridge.\n", "school_info": "School: Cnoc an Doire (B.)", "metadata": [{"Location:": "Knockaderry, Co. Kerry", "Teacher:": "\nDomhnall Ó Seaghdha\n"}, {"Collector": "John Walsh", "Gender": "male", "Address": "Clountubrid, Co. Kerry"}, {"Informant": "Patrick Walsh", "Gender": "male", "Address": "Clountubrid, Co. Kerry"}, {"Language": "English"}]}, "4742069/4732372/4786800": {"title": "Great Floods", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0460, Page 028", "Page 028"], "url": "https://www.duchas.ie/en/cbes/4742069/4732372/4786800", "text": "\nGreat Floods3.  In the month of August 1915 there was a great flood.  The River Maine overflowed its banks.  All the land from Conigar to Castlemaine was flooded.A mare and colt, the property of Michael Daly, Tralia, were marooned on top of a fence about three hundred yards from dry land.  They stood there for nearly a whole day  and as the flood was still rising it was feared that they would be lost.Michael Daly, Dromreagh, an ex.  RIC man (he now lives at Knockanish, Tralee) came on the scene.  He was a powerful swimmer and he resolved that he would save the horses.  He took a rope with him and swam out to where the animals were.  He put the rope around the mare's neck  and she swam in after him.  The colt followed and all three were none the worse for the experience.(Writer)  Domhnall Ó SéaghdhaScoil na mbuachaillíCnoc A' DoireFearann FuarCo. Ciarraidhe.\n", "school_info": "School: Cnoc an Doire (B.)", "metadata": [{"Location:": "Knockaderry, Co. Kerry", "Teacher:": "\nDomhnall Ó Seaghdha\n"}, {"Collector": "Domhnall Ó Séaghdha", "Gender": "male"}, {"Language": "English"}]}, "4742143/4740244/4816092": {"title": "Tuile", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0479, Page 118", "Page 118"], "url": "https://www.duchas.ie/en/cbes/4742143/4740244/4816092", "text": "\nBhí bean darab ainm Cáit Ní Dhonnchadha 'na cómhnaidhe i mBaile an tSéipéil, agus bhí sí 'na tigh féin 'na aonar le hais abhann na Caoile mar bhí a céille agus a mhac tar éis báis d’fághailt.Gach uair a bhíodh tuille san abhainn bhíodh tuille 'na tigh leis, agus annsan gach uair a chloiseadh sí an abha ag deunamh glóir le tuille bhíodh eagla uirthe agus ritheadh sí go tigh eile agus d’fanadh sí ann go dtí go mbíodh an tuille imthighthe.Fuair Cáit bás agus ní raibh sí marbh ach cúpla lá nuair a bhí tuille ann, do tháinig sé agus do sgiob sé an tigh go léir agus níor leigeadh ann ach fothrach chun a theaspáint go raibh tigh ann.Deireadh na comharsain gur mhaith an bhail uirthe í bheith imthighthe mar go mbrisfeadh a croidhe nuair a chídhfeadh sí a tigh beag sgiobtha leis an dtuille agus deireadh daoine go mbéidir go mbeadh sí ‘na codhladh nuair a thiochfadh an tuille agus go mbeadh sí báidhte mar bhí sí ana aosta agus is minic a bhíodh sí ‘na codhladh i rith an lae.\n", "school_info": "School: Baile an Tighearna (Ballyhearnay)", "metadata": [{"Location:": "Ballyhearny West, Co. Kerry", "Teacher:": "\nPartolan Ó Gríbhthín\n"}, {"Collector": "Eibhlís Ní Loingsig", "Gender": "female", "Address": "Coarha More, Co. Kerry"}, {"Informant": "Máire Ní Loingsigh", "Gender": "female", "Age": "50", "Occupation": "feirmeoir", "Address": "Coarha More, Co. Kerry"}, {"Language": "Irish"}]}, "4742143/4740245/4816093": {"title": "Tuile", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0479, Page 119", "Page 119"], "url": "https://www.duchas.ie/en/cbes/4742143/4740245/4816093", "text": "\nOidhche amháin tímhpeall chéad blian ó thoin thánaig gala gála mór agus taréis tamaill thosnuig sé ag cur baistí go trom agus annsan do chiúinig an gála.Bhí an oidhche ana dhorchadha agus bhí daoine ag iasgaireacht agus ní rabhadar ábalta ar theacht abhaile agus do bhádhadh iad. Bhí na chómharsain á lorg ar maidin agus ní rabhadar ábalta ar iad d’fághailt ach fuaireadar na báid ins na chuanta.An oidhche céadna san bhí fear na chómhnaidhe i bhFiadhach Meadhon agus bhí sé ins an leabaidh breóidhte. Bhí sé ina aonar san dtigh agus thánaig an t-uisge anuas ó’n gcnoc agus chuaidh sé isteach san seómra mar ní raibh aige acht bóthán beag.Ar maidin thánaig ceann des na chómharsanaibh agus leig sé an uisge amach as an dtigh. Do dhein an stoirm céadhna mórán díobhála do bhóithre ahus  ní raibh aoinne ábalta ar siubhal ortha mar bhíodar réabtha agus briste taréis na h-oidhche.\n", "school_info": "School: Baile an Tighearna (Ballyhearnay)", "metadata": [{"Location:": "Ballyhearny West, Co. Kerry", "Teacher:": "\nPartolan Ó Gríbhthín\n"}, {"Collector": "Sorcha Ní Chúiféir", "Gender": "female", "Address": "Tinnies Lower East, Co. Kerry"}, {"Informant": "Máire Ní Shéagdha", "Gender": "female", "Age": "73", "Occupation": "pinsinéir", "Address": "Coarha Beg, Co. Kerry"}, {"Language": "Irish"}]}, "4742098/4735672/4924302": {"title": "Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0468, Page 081", "Page 081"], "url": "https://www.duchas.ie/en/cbes/4742098/4735672/4924302", "text": "\n(continued from previous page)\nblue colour. Two days after this the tailor died, and [\"after\" struck out] a few weeks after this the tailor's [\"ghost\" interlined with carat] was seen around the place again. Mrs. Hussey Gerah. SneemMrs. J. Hussey. The Village Sneem +Mr. D. Cronin The Cottages, Sneem.\n\n\n\nIn eighteen-sixty-nine there was a terrible storm here. A great many trees, plants, old houses and other things were knocked down in it. It blew nearly everybody's hay away and hardly anyone had hay during that year. One boy coming to school was killed by  a falling tree near Lomanagh. Several old houses were knocked and one thatched old house was knocked and the man who was in it was found dead.Before a storm a circle around the moon is a sign of it and before that bad storm it was seen by some people. Bad thunder and lightning often came. Lightning often came and killed people. It killed a girl going for water with a gallon in her hand in this place. Another time some boy was putting away a little special manure after the setting of the garden. He was in a thatched house when the lightning came and broke down through the\n(continues on next page)\n", "school_info": "School: Snaidhm (C.)", "metadata": [{"Location:": "Sneem, Co. Kerry", "Teacher:": "\nMrs Palmer\n"}, {"Informant": "Denis Cronin", "Gender": "male", "Address": "Sneem, Co. Kerry"}, {"Informant": "Mrs Hussey", "Gender": "female", "Address": "Sneem, Co. Kerry"}, {"Language": "English"}]}, "4758551/4754059/4928849": {"title": "Great Floods", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0859, Page 134", "Page 134"], "url": "https://www.duchas.ie/en/cbes/4758551/4754059/4928849", "text": "\nAbout the year 1933 there was a great flood in the Nore. There was a great amount of damage done as it rose to a great height. In Thomastown it came over the quay and swept through the streets. In one draper's store, the waters burst through the back door and windows and out through the front doors and windows and damaged a great amount of goods as well as sweeping a great amount more. It covered the streets in many places and traffic was held up in many places for a couple of days.\n\n\n\nIn November 1900 there was a great flood. It swept awat stock, goods from shops, and\n(continues on next page)\n", "school_info": "School: Inistioge (B.)", "metadata": [{"Location:": "Inistioge, Co. Kilkenny", "Teacher:": "\nMáirtín Breathnach\n"}, {"Collector": "Edward Cody", "Gender": "male", "Address": "Inistioge, Co. Kilkenny"}, {"Informant": "Mr M. Cody", "Gender": "male", "Age": "43", "Address": "Inistioge, Co. Kilkenny"}, {"Language": "English"}]}, "4922197/4859962/4941430": {"title": "Severe Weather - Thunder-Storm", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0550, Page 231", "Page 231"], "url": "https://www.duchas.ie/en/cbes/4922197/4859962/4941430", "text": "\nAbout the year 1907 a very severe thunderstorm took place. It took place in the middle of August in the year 1907. The evening was very dark and the thunderstorm commenced at nightfall, and lasted through the night. It killed a good many cattle and horses in the neighbourhood. There were many remarkable stories told about it. One of them is, two little children were sitting at the fire playing with a lamb, when a flash of lightening passed and killed the lamb. The two little children were saved.\n\n\n\nThe rainstorm of November 1925 is one which, owing to its severeness is kept still in the minds of the people. On the evening of November the 26th rain fell continuously and all during that night so that on the following morning the countryside was covered with water. Floods collected on roads\n(continues on next page)\n", "school_info": "School: An Drom (Drom Thurles)", "metadata": [{"Location:": "Drom, Co. Tipperary", "Teacher:": "\nPilib Ó Ó Muireadhaigh, Pádraig Ó Cléirigh\n"}, {"Collector": "Margaret Troy", "Gender": "female", "Address": "Drom, Co. Tipperary"}, {"Informant": "Tobias Troy", "Gender": "male", "Address": "Drom, Co. Tipperary"}, {"Language": "English"}]}, "4922197/4859964/4941489": {"title": "Severe Weather - Big Wind", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0550, Page 233", "Page 233"], "url": "https://www.duchas.ie/en/cbes/4922197/4859964/4941489", "text": "\n(continued from previous page)\ntrees and slates falling off houses. This wind was the last \"Big Wind\".\n\n\n\nOn the night of the 26th November 1920, it rained very heavily. It kept raining all the next day. The rain overflowed many rivers and a great deal of cattle were lost. Houses in hollow places were swamped but no lives were lost. Matt Ryan, Lough Isle, the townland of Lough Isle, parish of Toomevara, Co. Tipperary, when going to the fair of Bossisoleigh, Co. Tipperary, had to stand on the sides of the car and let the horse swim. Several people going that way turned back and tried to go other roads but were stopped.\n\n\n\nForty four years ago there was a heavy\n(continues on next page)\n", "school_info": "School: An Drom (Drom Thurles)", "metadata": [{"Location:": "Drom, Co. Tipperary", "Teacher:": "\nPilib Ó Ó Muireadhaigh, Pádraig Ó Cléirigh\n"}, {"Collector": "Mary Ryan", "Gender": "female", "Address": "Kilvilcorris, Co. Tipperary"}, {"Informant": "Matt Ryan", "Gender": "male", "Address": "Kilvilcorris, Co. Tipperary"}, {"Language": "English"}]}, "4922084/4850752/4942974": {"title": "Big Floods", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0520, Page 050", "Page 050"], "url": "https://www.duchas.ie/en/cbes/4922084/4850752/4942974", "text": "\nUp to 60 years ago big floods used to occur in the Mulcair river & the water often rose 15' high.One particular bad flood reached a house owned by Mulcahy. There were hens imprisoned in the house and when a local lad swam to their assistance he fed them on top of the dresser where they had to take refuge as the water was 9' feet high.Dromalty bog was often like a lake and probably got its name from the fact - The ridge of the flocks. Wild birds of course were perched on the water.It is comparatively dry now but gets flooded after heavy rain.\n", "school_info": "School: Tinateriffe, Cappamore", "metadata": [{"Location:": "Tinnatarriff, Co. Limerick", "Teacher:": "\nEibhlin, Bean Uí Riain\n"}, {"Informant": "Michael Lundon", "Gender": "male", "Age": "70", "Address": "Pallasbeg, Co. Limerick"}, {"Language": "English"}]}, "4922085/4850848/4943211": {"title": "A Story on Card Playing", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0520, Page 146", "Page 146"], "url": "https://www.duchas.ie/en/cbes/4922085/4850848/4943211", "text": "\n(continued from previous page)\nplayed cards or stayed in the house till midnight for ever after.\n\n\n\nThe largest flood that was ever in the Mulkear River occurred in the Summer of 1906.  There was intense heat in the early part of the day but towards evening a cloud burst and caused a great flood.The children of Bilboa School were about to cross the Bilboa Bridge going homefrom school,when a woman ran after them to takethem into her house from the rain.  They were only going in the door when they heard a crash like thunder.  They\n(continues on next page)\n", "school_info": "School: Cappamore (B.)", "metadata": [{"Location:": "Cappamore, Co. Limerick", "Teacher:": "\nJames McCarthy\n"}, {"Collector": "Paddy O' Neill", "Gender": "male", "Age": "12", "Address": "Cappamore, Co. Limerick"}, {"Language": "English"}]}, "4921985/4915465/4943621": {"title": "The Big Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0494, Page 165", "Page 165"], "url": "https://www.duchas.ie/en/cbes/4921985/4915465/4943621", "text": "", "school_info": "School: Mín na Cille, Mainistir na Féile", "metadata": [{"Location:": "Meenkilly, Co. Limerick", "Teacher:": "\nAindrias Ó Dúnadhuighe\n"}, {"Collector": "Tadhg Mac Carthaigh", "Gender": "male", "Address": "Caher (Lane), Co. Limerick"}, {"Informant": "(name not given)", "Relation": "grandparent", "Gender": "female"}, {"Language": "English"}]}, "4922200/4860211/4945346": {"title": "Travelling People", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0551, Page 110", "Page 110"], "url": "https://www.duchas.ie/en/cbes/4922200/4860211/4945346", "text": "\n(continued from previous page)\n[-]\n\n\n\nThere was a great flood in this district thirty years ago. It did a lot of harm. It came out on the land in the night time and the people had to swim in to get out their cattle and horses in the morning some of them were drowned. It came out very far on the land. The peoples stock were almost all drowned. The rain started on Monday morning and it stayed raining until Tuesday morning. It was a regular downpour during all the time.\n(continues on next page)\n", "school_info": "School: Loughmoe (C.), An Teampoll Mór", "metadata": [{"Location:": "Loughmoe, Co. Tipperary", "Teacher:": "\nCaitlín Ní Riain\n"}, {"Collector": "Mona Connell", "Gender": "female", "Address": "Loughmoe, Co. Tipperary"}, {"Informant": "John Connell", "Gender": "male", "Address": "Loughmoe, Co. Tipperary"}, {"Language": "English"}]}, "4921989/4915757/4945769": {"title": "Big Flood on the Feale 1858", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0495, Page 095", "Page 095"], "url": "https://www.duchas.ie/en/cbes/4921989/4915757/4945769", "text": "\nThe Feale which is a tributary of the lordly Shannon flows right in front of our school. It has its source in Cnocán Bán in Co. Cork & its course is through beautiful although [?] lofty hills.It derived its name from a Milleshain woman named Fial. One day she was swimming in the (fial) Feale & she noticed a man proceeding in her direction. Being ashamed she put her head under the water and drowned.Although being itself a tributary of the Shannon it also has many tributaries which add greatly to its length & breadth such as the Abha Beag, the Ualach & the Uallachán. It has some deep pools which always abound in fish. In the Summer of 1858 previous to a great fall of rain, came heavy thunder & lightening. About the beginning of Autumn\n(continues on next page)\n", "school_info": "School: Radharc na Féile", "metadata": [{"Location:": "Abbeyfeale West, Co. Limerick", "Teacher:": "\nTadhg Mac Coitir\n"}, {"Collector": "Willie Cotter", "Gender": "male", "Address": "Kilkinlea Lower, Co. Limerick"}, {"Language": "English"}]}, "4922204/4860395/4946396": {"title": "Severe Weather", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0552, Page 065", "Page 065"], "url": "https://www.duchas.ie/en/cbes/4922204/4860395/4946396", "text": "\nThe biggest storm experienced in Thurles that ever occured in the year 1903. It did the most damage in Two-Mile Borris and it was the cause of many deaths. There was a man going out to the fields near the Castle in Tow-Mile-Borris when it started. It was threatening all the evening and now it came. It blew off a piece of the Castle. The man was coming back from the field when a rock falling off the Caslte killed him.\n\n\n\nIn the year 1900 there was a flood in Turraheen which will be forgotten by the people. The flood started on a Saturday night at eleven o' clock. When the people were going to Mass the next morning & they were\n(continues on next page)\n", "school_info": "School: Scoil na mBráthar, Dúrlas Éile", "metadata": [{"Location:": "Thurles, Co. Tipperary", "Teacher:": "\nBr. T. S. Ó Maoilchiaráin\n"}, {"Collector": "Padruig Delahunty", "Gender": "male", "Address": "Fianna Road, Co. Tipperary"}, {"Informant": "Mr Tim Ryan", "Gender": "male", "Occupation": "teacher", "Address": "Turraheen Upper, Co. Tipperary"}, {"Language": "English"}]}, "4921993/4916203/4947050": {"title": "A Great Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0496, Page 283", "Page 283"], "url": "https://www.duchas.ie/en/cbes/4921993/4916203/4947050", "text": "\nWe are glad that no downfall of rain occurred in our district since 1896.  In that year some people were marooned in their homes, as a result of one of the most severe floods Ireland has experienced for many years.  Several people were missing, owing to that flood.  Industry was seriously hampered in Ireland by that deluge.  Many people were confined to their homes then because the water had risen to such a high point, that they could not go out.  A big gale accompanied the flood, and we are told that the shape of a fish appeared in the sky as a warning for the people before hand.  Many old houses were swept away at that time and several poor people, it is said, were left homeless.\n", "school_info": "School: Cill Mhíde (C.), Caisleán Nua", "metadata": [{"Location:": "Kilmeedy, Co. Limerick", "Teacher:": "\nEibhlín Ní Bhraonáin\n"}, {"Collector": "May Geary", "Gender": "female", "Address": "Ballinruane, Co. Limerick"}, {"Language": "English"}]}, "4922060/4848674/5010202": {"title": "Heavy Rain 1922", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0513, Page 489", "Page 489"], "url": "https://www.duchas.ie/en/cbes/4922060/4848674/5010202", "text": "\n1922 was on the whole a very wet year.  The summer was no exception.  The potatoes were very small and scarce, and blackened in the ground.\n", "school_info": "School: Anglesboro (C.), Baile Mhistéala", "metadata": [{"Location:": "Anglesborough, Co. Limerick", "Teacher:": "\nBean Uí Dhonnchadha\n"}, {"Informant": "Patrick Hogan", "Gender": "male", "Age": "87", "Occupation": "farmer", "Address": "Inchacoomb, Co. Limerick"}, {"Language": "English"}]}, "4922061/4848716/5010254": {"title": "A Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0513, Page 530", "Page 530"], "url": "https://www.duchas.ie/en/cbes/4922061/4848716/5010254", "text": "\nI have often heard the story being told about the time the Funcheon overflowed. It was in the month of October about seventeen years ago, that there came a great storm and the river Funcheon overflowed.The river became so flooded that the water was flowing over the bridges at each side of the road. There was not a piece of land or a bridge to be seen from the Funcheon to the lower end of Kilbehenny village.It flowed down the boreen until it joined the flood in the well. It flowed into a house and the people of the house had to live upstairs for two or three days. It flowed into a yard at the lower end of the village and the doors of the house had to be blocked with bags of sand to keep the flood from getting in.There were pigs in\n(continues on next page)\n", "school_info": "School: Coill Bheithne, Baile Mhistéala", "metadata": [{"Location:": "Kilbeheny, Co. Limerick", "Teacher:": "\nMicheál Ó Cathasaigh\n"}, {"Collector": "Lily Connolly", "Gender": "female", "Age": "16", "Address": "Kilbeheny, Co. Limerick"}, {"Informant": "John Connolly", "Gender": "male", "Age": "84", "Address": "Kilbeheny, Co. Limerick"}, {"Language": "English"}]}, "4758539/4752906/5013751": {"title": "A Story of a Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0855, Page 405", "Page 405"], "url": "https://www.duchas.ie/en/cbes/4758539/4752906/5013751", "text": "\nA Story of a FloodAbout twenty years ago there was a great flood in the river at Clashacrow and a woman by the name of Mrs Dooley of Sart was drowned. She went to mid-night Mass and returned with a number of other people. They parted with her before they came to the river which she had to cross. While she was crossing her foot slipped and she fell from the plank into the river and the flood carried her down. When she was not returning her people became worried and set out to look for her. They continued their search for two more days and at the end of that time they found her on a heap of sand.\n(continues on next page)\n", "school_info": "School: Kilkenny Convent", "metadata": [{"Location:": "Kilkenny, Co. Kilkenny", "Teacher:": "\nAn tSr. Borgin\n"}, {"Informant": "Cathleen Hickey", "Gender": "female"}, {"Language": "English"}]}, "4922162/4857376/5016889": {"title": "Severe Weather - Rainstorms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0540, Page 271", "Page 271"], "url": "https://www.duchas.ie/en/cbes/4922162/4857376/5016889", "text": "\nOn the 12th June 1913, the greatest flood was ever seen that my grandfather remembers. It swept away Gloshue bridge, in the townland of Gloshue, in the parish of Cappamore, Co Limerick. A man named Thomas Hickey, Croughlahan, Cappamore , Co Limerick, tied his ass and car to the bridge and went into  Ryan's public house in Gloshue for a drink and to avoid the rain. When he came out to go home the rain had ceased. His ass and car and bridge were gone off with the flood, but fortunately he was swept into a field and was unhurt.\n\n\n\nIn the year 1907 there was a great flood every place about the 12th June. The rain went into houses and took away firkins of butter that had been stored up. Also horses and cars were taken away and cattle were drowned. Every road was torn up and no car could travel until the roads were fixed again.\n", "school_info": "School: Rear Cross, Newport", "metadata": [{"Location:": "Rear Cross, Co. Tipperary", "Teacher:": "\nPilib Ó Muireadhaigh\n"}, {"Collector": "Joseph Carey", "Gender": "male", "Address": "Shanballyedmond, Co. Tipperary"}, {"Informant": "James Carey", "Gender": "male", "Address": "Shanballyedmond, Co. Tipperary"}, {"Language": "English"}]}, "4922162/4857376/5016899": {"title": "Severe Weather - Rainstorms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0540, Page 271", "Page 271"], "url": "https://www.duchas.ie/en/cbes/4922162/4857376/5016899", "text": "\nOn the 12th June 1913, the greatest flood was ever seen that my grandfather remembers. It swept away Gloshue bridge, in the townland of Gloshue, in the parish of Cappamore, Co Limerick. A man named Thomas Hickey, Croughlahan, Cappamore , Co Limerick, tied his ass and car to the bridge and went into  Ryan's public house in Gloshue for a drink and to avoid the rain. When he came out to go home the rain had ceased. His ass and car and bridge were gone off with the flood, but fortunately he was swept into a field and was unhurt.\n\n\n\nIn the year 1907 there was a great flood every place about the 12th June. The rain went into houses and took away firkins of butter that had been stored up. Also horses and cars were taken away and cattle were drowned. Every road was torn up and no car could travel until the roads were fixed again.\n", "school_info": "School: Rear Cross, Newport", "metadata": [{"Location:": "Rear Cross, Co. Tipperary", "Teacher:": "\nPilib Ó Muireadhaigh\n"}, {"Collector": "Kathleen Quigley", "Gender": "male", "Address": "Baurnadomeeny, Co. Tipperary"}, {"Informant": "Michael Mackey", "Gender": "male", "Address": "Shanbally, Co. Tipperary"}, {"Language": "English"}]}, "4922162/4857377/5016900": {"title": "Severe Weather - Rainstorms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0540, Page 272", "Page 272"], "url": "https://www.duchas.ie/en/cbes/4922162/4857377/5016900", "text": "\nWe had a flood in this part of Tipperary and a part of Limerick about the year 1906 in the month of June. Great damage was done. Roads were torn up. A bridge on the Bilboa road was swept away. land was flooded destroying crops and meadows but no lives were lost. Some had a narrow escape. About the following year there was another landslide on Keeper mountain. Cattle and pigs were swept away. Meadows and crops were damaged.\n\n\n\nOn the 2nd of June in 1902, one of the greatest of floods on record took place in this locality. The morning of that day was very fine, but at noon it changed and darkened, then thunder and lightning began and the  rain fell in torrents and continued raining until evening, turning the streams into little rivers and the rivers became so large that the bridges were not able to carry the water that rushed through and several were destroyed. It also caused considerable damage to crops especially in low land districts, for the rivers overflowed their banks and carried away pieces of soil and ditches.\n(continues on next page)\n", "school_info": "School: Rear Cross, Newport", "metadata": [{"Location:": "Rear Cross, Co. Tipperary", "Teacher:": "\nPilib Ó Muireadhaigh\n"}, {"Collector": "Willie Carey", "Gender": "male", "Address": "Baurnadomeeny, Co. Tipperary"}, {"Informant": "James Carey", "Gender": "male", "Address": "Baurnadomeeny, Co. Tipperary"}, {"Language": "English"}]}, "4922162/4857377/5016901": {"title": "Severe Weather - Rainstorms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0540, Page 272", "Page 272"], "url": "https://www.duchas.ie/en/cbes/4922162/4857377/5016901", "text": "\nWe had a flood in this part of Tipperary and a part of Limerick about the year 1906 in the month of June. Great damage was done. Roads were torn up. A bridge on the Bilboa road was swept away. land was flooded destroying crops and meadows but no lives were lost. Some had a narrow escape. About the following year there was another landslide on Keeper mountain. Cattle and pigs were swept away. Meadows and crops were damaged.\n\n\n\nOn the 2nd of June in 1902, one of the greatest of floods on record took place in this locality. The morning of that day was very fine, but at noon it changed and darkened, then thunder and lightning began and the  rain fell in torrents and continued raining until evening, turning the streams into little rivers and the rivers became so large that the bridges were not able to carry the water that rushed through and several were destroyed. It also caused considerable damage to crops especially in low land districts, for the rivers overflowed their banks and carried away pieces of soil and ditches.\n(continues on next page)\n", "school_info": "School: Rear Cross, Newport", "metadata": [{"Location:": "Rear Cross, Co. Tipperary", "Teacher:": "\nPilib Ó Muireadhaigh\n"}, {"Collector": "John Keogh", "Gender": "male", "Address": "Rear Cross, Co. Tipperary"}, {"Informant": "George Russell", "Gender": "male", "Address": "Rear Cross, Co. Tipperary"}, {"Language": "English"}]}, "4922177/4858550/5020037": {"title": "Severe Weather", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0544, Page 339", "Page 339"], "url": "https://www.duchas.ie/en/cbes/4922177/4858550/5020037", "text": "\n(continued from previous page)\ntrees tumbled by the stom. I did not hear if any lives were lost in it or not. They were thunder about five years ago and there was a lot of horses and cattle and sheep killed.\n\n\n\nAbout a tear ago there was a very severe rain storm and it lasted for over to days and all the roads and fields were flooded. I did not hear of any houses in my locality or not. Five years ago they were a very heavy snowstorm and they were very bad drifts in it and the people had great shortage of water in it.\n\n\n\nThere was a terrible storm of wind 38 year ago all the trees (were) and hay shed were tumbled, and all the crows of the world was killed and it lasted for one day. Along time ago they were terrible heavy thunder storm and lightening, the lightening the lightening was so heavy it burned a lot of hay. They were very heavy rain on the 27  of September all the roads were like rivers. They were a very heavy snow storm it was in the 22 February and year of 1932\n(continues on next page)\n", "school_info": "School: Borrisoleigh, Glenkeen", "metadata": [{"Location:": "Borrisoleigh, Co. Tipperary", "Teacher:": "\nTomás de Búrca\n"}, {"Collector": "Harry Cummins", "Gender": "male", "Address": "Cronavone, Co. Tipperary"}, {"Informant": "Mrs Ryan", "Gender": "female", "Age": "78", "Address": "Cronavone, Co. Tipperary"}, {"Language": "English"}]}, "4922260/4865116/5022531": {"title": "A Great Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0571, Page 266", "Page 266"], "url": "https://www.duchas.ie/en/cbes/4922260/4865116/5022531", "text": "\nA Great FloodIn the year 1900 , about Christmas time, there was a great flood in Ardfinnan, owing to the water coming down from the mountains, and the river Suir overflowing its banks, after a very heavy fall of rain.The people living at the east side of the village were not able to cross the bridge to get to the Church for Mass, so they knelt on the factory hill and said the Rosary.About the same time also,- 1900 there was a terrible thunder storm; thirty sheep were killed on Lord Massey's land, at Ardfinnan House. It also killed a horse belonging to a poor farmer in an adjoining district, and which was the only one he had.\n", "school_info": "School: Árd Fhionáin (B.)", "metadata": [{"Location:": "Ardfinnan, Co. Tipperary", "Teacher:": "\nÁine Ní Fhoghludha\n"}, {"Language": "English"}]}, "5008807/4957880/5055091": {"title": "Local Storms - A Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0658, Page 076", "Page 076"], "url": "https://www.duchas.ie/en/cbes/5008807/4957880/5055091", "text": "\nA FloodIn the month of October in the year eighteen hundred and eighty eight, a great storm occurred in this district. The Ardaghy River became flooded, and large stones and river banks were swept away. Man fields in the district were entirely covered with sand and stones after the flood. The potatoes, which had not been dug, were carried off, and the Lislea road was so badly damaged, that in many places large holes were to be seen.Collected by:Mary Mc Quaid (13 yrs)Ardaghy,OmeathCo. Louth.From:Sarah Mc Quaid (74 yrs)Same address.25-11-37\n", "school_info": "School: Ardaghy, Omeath", "metadata": [{"Location:": "Ardaghy, Co. Louth", "Teacher:": "\nB. Mac Craith\n"}, {"Collector": "Mary Mc Quaid", "Gender": "female", "Age": "13", "Address": "Ardaghy, Co. Louth"}, {"Informant": "Sarah Mc Quaid", "Gender": "female", "Age": "74", "Address": "Ardaghy, Co. Louth"}, {"Language": "English"}]}, "5008807/4957881/5055093": {"title": "Local Storms - A Rainstorm", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0658, Page 077", "Page 077"], "url": "https://www.duchas.ie/en/cbes/5008807/4957881/5055093", "text": "\nA rainstormNine or ten years ago there was a big rainstorm in Omeath. It occurred in the month of August. The morning of the day, on which the storm took place was fine, but as the day advanced, the clouds closed in and densely overspread the sky, which was then very dark. The wind rose and gradually increased in intensity. Sweeping gusts of rain came up before the storm like showers of steel. This continued for some time until at length Tulla river became flooded and swept away Tulla bridge. The flood caused considerable damage throughout Omeath and the Long Woman's Grave was cut six feet deep in places by the floods. The Land Commission expended a large sum of money in repairing the damage caused by the floods along Tulla river.Collected by: Rosie Sloan (13 yrs.)Bavan,Omeath,Co. LouthFrom:Peter Sloane (50 yrs.)Same Address23-11-37\n", "school_info": "School: Ardaghy, Omeath", "metadata": [{"Location:": "Ardaghy, Co. Louth", "Teacher:": "\nB. Mac Craith\n"}, {"Collector": "Rosie Sloane", "Gender": "male", "Age": "13", "Address": "Bavan, Co. Louth"}, {"Informant": "Peter Sloane", "Gender": "male", "Age": "50", "Address": "Bavan, Co. Louth"}, {"Language": "English"}]}, "5008807/4957882/5055094": {"title": "Local Storms - A Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0658, Page 078", "Page 078"], "url": "https://www.duchas.ie/en/cbes/5008807/4957882/5055094", "text": "\nA FloodThe greatest flood which occurred in this district in recent years happened in the month of August. Nineteen hundred and twenty nine. It came in a thunderbolt. A cloud burst on the Cairn of Corrakitt mountain, and the rushing waters swept over the countryside.A bridge between the townland of Tulla and Bavan was swept away, and even the potatoes growing in the fields were carried off. A huge oak tree, hundreds of years old was uprooted, and the tree is still to be seen lying in the meadow.Collected by: Maureen Mc Court (14 yrs.)Bavan,Omeath,Co. LouthFrom:Peter Mc Court (51 yrs.)Same Address24-11-37\n", "school_info": "School: Ardaghy, Omeath", "metadata": [{"Location:": "Ardaghy, Co. Louth", "Teacher:": "\nB. Mac Craith\n"}, {"Collector": "Maureen Mc Court", "Gender": "female", "Age": "14", "Address": "Bavan, Co. Louth"}, {"Informant": "Peter Mc Court", "Gender": "male", "Age": "51", "Address": "Bavan, Co. Louth"}, {"Language": "English"}]}, "5008807/4957885/5055104": {"title": "Local Storms - A Big Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0658, Page 081", "Page 081"], "url": "https://www.duchas.ie/en/cbes/5008807/4957885/5055104", "text": "\nA Big FloodIn the month of September eighteen hundred and ninety seven a terrible flood occurred in this district. A cloud burst over Cornamuckla mountain and caused the river, dividing the townlands of Lislea and Cornamuckla, to overflow. Near to the river bank, on the Lislea side, lived a man named Stephen O'Hanlon. Between Stephen's house and the river was a shed containing a cow and more than six dozen of fowl. In its path, the rushing river swept the shed away, and carried it off over the fields. The fowl were swept into Carlingford Lough, and were never seen again. The cow was luckier than they, as she was discovered in a field about half a mile from the owner's house.Collected by: Patrick Fearon (14)Lislea,Omeath,Co. LouthFrom:Mrs. A Fearon (70 yrs.)Same Address23-11-37\n", "school_info": "School: Ardaghy, Omeath", "metadata": [{"Location:": "Ardaghy, Co. Louth", "Teacher:": "\nB. Mac Craith\n"}, {"Collector": "Patrick Fearon", "Gender": "male", "Age": "14", "Address": "Lislea, Co. Louth"}, {"Informant": "Mrs A. Fearon", "Gender": "female", "Age": "70", "Address": "Lislea, Co. Louth"}, {"Language": "English"}]}, "4922334/4871070/5056224": {"title": "Tuile Mhór", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0606, Page 131", "Page 131"], "url": "https://www.duchas.ie/en/cbes/4922334/4871070/5056224", "text": "\nIn the Autumn of the year 1875 a great rainstorm swept over the country. All the h-Ínsí and low-lying fields beside the Abhann Sliabh were covered over with water, and great havoc was caused otherwise.A man named John Griffin - son of the James Griffin who was rescued from the Ship Edmund in Kilkee perished in this great flood.In the evening he went out to save some sheep who were in danger of being drowned.The flood was so high that at the turn of the river between Brownes place and Quinlivans place it did not keep its course but swept straight down across the land, and just at that time Griffin was saving the sheep which were just beside the river.The flood came behind him and threw him into the river and swept him across to the other side. He caught hold of a bush and two men - Lot Keane and Martin Moran who were in the neighbouring\n(continues on next page)\n", "school_info": "School: Pitfield, Inis", "metadata": [{"Location:": "Cloondrinagh, Co. Clare", "Teacher:": "\nTomás Ó Maonaigh\n"}, {"Collector": "Susan Browne", "Gender": "female", "Address": "Cappanageeragh, Co. Clare"}, {"Language": "mixed"}]}, "5008844/4960493/5074910": {"title": "A Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0667, Page 259", "Page 259"], "url": "https://www.duchas.ie/en/cbes/5008844/4960493/5074910", "text": "\nA Flood A great flood took place about the year 1859, it lasted for three months. It destroyed all the peoples potatoes and especially down in Tully. There was a man by the name of Kelly who was nearly lost in it he went out for turf in a box through the water and when he was returning, the box turned over and he fell into the water and remained there until help cameAfterwards there was a song made about him Written by Annie Mohan on 2nd Dec 1937Told by Michael Mohan on 1st December 1937Aclin\n\n\n\nThunder storm In the year 1867 there was a great storm of thunder,i it was in the months of June and it lasted for a day. It knocked a house and killed a family of five, there names were Byrnes and the lightning came in through\n(continues on next page)\n", "school_info": "School: Aclint, Ardee", "metadata": [{"Location:": "Aclint, Co. Louth", "Teacher:": "\nP. Ó Neill\n"}, {"Collector": "Annie Mohan", "Gender": "female"}, {"Informant": "Michael Mohan", "Gender": "male", "Address": "Aclint, Co. Louth"}, {"Language": "English"}]}, "5070805/5065881/5096343": {"title": "Composition - Severe Weather - Rainstorms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1006, Page 038", "Page 038"], "url": "https://www.duchas.ie/en/cbes/5070805/5065881/5096343", "text": "\nIn the year 1900 in the month of November there was a rain storm which lasted for two days and two nights without ceasing. There was a flood and it is said that it was the highest flood that came for twenty years before that.It is said that Gallancurragh river overflowed, and no one could go over the bridge as it was covered with water.\n\n\n\nIn this district a school known as \"The Carrickgorman Hedge school\" was taught by Mr. Charles Nugent in a thatched barn in the townland of Carrickgorman, situated alongside the old road leading to where Mr. Charles\n(continues on next page)\n", "school_info": "School: Carrickgorman", "metadata": [{"Location:": "Carrickgorman, Co. Cavan", "Teacher:": "\nM. Fleming\n"}, {"Collector": "Arthur Mc Neill", "Gender": "male", "Address": "Corradooa, Co. Cavan"}, {"Informant": "Mr Joe Mc Neill", "Gender": "male", "Age": "55", "Address": "Corradooa, Co. Cavan"}, {"Language": "English"}]}, "5008980/4973242/5111138": {"title": "Rainstorm 1919", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0706, Page 007", "Page 007"], "url": "https://www.duchas.ie/en/cbes/5008980/4973242/5111138", "text": "\nThe greatest rainstorm in living memory in these parts was in June 1919. Water of the rivers flowed over the walls of the bridge which fords the river Borora at the south end of the village.Fires on the open hearth were extinguished by the flow of the rain down the chimneys. All the turf on the bog was floating in one mass next day and no man knew his own.Various kitchen utensils were floating about and cocks of hay were carried long distances.\n", "school_info": "School: Moynalty (C.)", "metadata": [{"Location:": "Moynalty, Co. Meath", "Teacher:": "\nname not given\n"}, {"Collector": "May Govern", "Gender": "female"}, {"Language": "English"}]}, "5008982/4973645/5112619": {"title": "A Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0706, Page 466", "Page 466"], "url": "https://www.duchas.ie/en/cbes/5008982/4973645/5112619", "text": "\nIn the year 1918, there was a great flood. It was called the June flood.It started at nine o'clock in the morning with thunder and lightning and it stopped at four o'clock. The rain was very heavy after the thunder, and it was'nt long until it made a flood.It brought Casserly's bridge away with it, and the water came up the road and made a hole in our bridge.Barrows were brought away off the bog in the flood. It brought clay down the hill into our street and the water was coming in under the door into the kitchen.A lot of fields were covered with water. A field of oats of ours was covered with water.\n\n\n\nThe greatest storm remembered by the people of this district occurred in 1933. On the February fair of Mullagh, the snow was about six feet deep in some parts. The snow was gathered into drifts.\n(continues on next page)\n", "school_info": "School: Maio", "metadata": [{"Location:": "Trohanny, Co. Meath", "Teacher:": "\nMáire Ní Chreaig\n"}, {"Collector": "Patrick Mc Cormack", "Gender": "male", "Address": "Druminiskin, Co. Meath"}, {"Language": "English"}]}, "5044675/5031069/5144853": {"title": "Local Happenings - The Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0906, Page 099", "Page 099"], "url": "https://www.duchas.ie/en/cbes/5044675/5031069/5144853", "text": "\nLocal Happenings,The Flood.In the year 1933 there was a great flood in Leighlinbridge, owing to a heavy fall of snow which we had.  When the snow melted away, the flood rose, and all Main Street was flooded.  The shop-keepers had to take everything out of the shops, and go upstairs and take food and everything else with them.The flood lasted about a week and to our great delight we got a week from school.  It then began to go back, and after a while there was no water to be seen at all.The people were then very glad\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire, Leighlinn an Droichid", "metadata": [{"Location:": "Leighlinbridge, Co. Carlow", "Teacher:": "\nSr Rosario\n"}, {"Collector": "Máire Ní Coisgle", "Gender": "female", "Address": "Orchard, Co. Carlow"}, {"Informant": "Mr Costello", "Gender": "male", "Address": "Orchard, Co. Carlow"}, {"Language": "English"}]}, "5009263/5002656/5145709": {"title": "Storms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0882, Page 248", "Page 248"], "url": "https://www.duchas.ie/en/cbes/5009263/5002656/5145709", "text": "\n(continued from previous page)\nIt is said that  \"The Big Wind\" blew down one tree and that softened the earth around it and the rest of them fell.  Several other trees in different parts also.\n\n\n\nThere was a house blown down up the back road (leading from Foulksmills to Horetown) where the ruins are still to be seen.It was owned by a man named Cullen who lived in it at that time, there was nobody in the house only himself.  The end wall and a piece of the roof fell, he was slightly injured and he slept in another house for that night.There was straw to be seen the next morning in the tops of all the trees around.Three men were travelling home from town one night named James Fitzpatrick and the other two were brothers named Hanlon, they were all from the Horetown district When they were on the top\n(continues on next page)\n", "school_info": "School: Clongeen", "metadata": [{"Location:": "Clongeen, Co. Wexford", "Teacher:": "\nBrian Ó Broin\n"}, {"Collector": "Thomas White", "Gender": "male", "Address": "Foulkesmill, Co. Wexford"}, {"Language": "English"}]}, "5009263/5002657/5145711": {"title": "Rain and Storms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0882, Page 249", "Page 249"], "url": "https://www.duchas.ie/en/cbes/5009263/5002657/5145711", "text": "\n(continued from previous page)\nof a bleak hill, the side-car in which they were travelling rose up on one wheel several times until finally it turned over and the occupants were thrown out but escaped serious injury.\n\n\n\nThere was a heavy storm about twentyfour years ago.  There was a ship wrecked in Bannow Bay on the Keeragh Rocks just out from the strand in Cullenstown.  Nine members of the Fethard life-boat crew lost their lives going to the rescue.  The storm lasted for three days and the survivors of the \"Mexico\" the wrecked ship had to remain on the rocks for three days as no other lifeboat could reach them.  During that time one of the crew of the ill-fated vessel died.  Some of the bodies were washed ashore at Cullenstown and taken by road to Fethard where a memorial has been erected.\n", "school_info": "School: Clongeen", "metadata": [{"Location:": "Clongeen, Co. Wexford", "Teacher:": "\nBrian Ó Broin\n"}, {"Collector": "James Cullen", "Gender": "male", "Address": "Longgraigue, Co. Wexford"}, {"Language": "English"}]}, "5009263/5002658/5146508": {"title": "Rain and Storms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0882, Page 250", "Page 250"], "url": "https://www.duchas.ie/en/cbes/5009263/5002658/5146508", "text": "\nEveryone in this district will remember for a long time the night of the 24th June 1935.  There was a terrible thunder-storm that night and vivid flashes of forked lightning could be seen every five minutes or oftener.It all came very suddenly and it got so heavy all in a few minutes that very many local people were caught out away from home and had to spend the night wherever they happened to be at 8 o'clock when the Tempest began.  The storm was accompanied by deluges of rain and as a local resident has an instrument for collecting rainfall returns it can be definately stated that on that night 1.99\" of rain fell in Foulksmills district.  In the all Ireland returns for month of June '35, the above figure was given as being the highest daily rainfall.\n", "school_info": "School: Clongeen", "metadata": [{"Location:": "Clongeen, Co. Wexford", "Teacher:": "\nBrian Ó Broin\n"}, {"Collector": "Henry Moran", "Gender": "male", "Address": "Ballybrack, Co. Wexford"}, {"Language": "English"}]}, "5044687/5032169/5147470": {"title": "A Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0909, Page 335", "Page 335"], "url": "https://www.duchas.ie/en/cbes/5044687/5032169/5147470", "text": "\nOne time there were a race in Ballybrack.  It was very fine when the people were going.  A man was there from Ballynasillogue.  At last it started raining and the man started fro home.  He had to pass by the mill.  There was a flood up, and he went to cross the river, the horse and car were swept by the floor.  The man clung on to the bridge and the men pulled him up.  The horse was found in Ballynasillogue and the car was found in Haroldstown.\n", "school_info": "School: Hackettstown (St Joseph's)", "metadata": [{"Location:": "Hacketstown, Co. Carlow", "Teacher:": "\nM. Ní Raghallaigh\n"}, {"Collector": "Nelly Kelly", "Gender": "female"}, {"Informant": "James Kelly", "Gender": "male", "Age": "50", "Address": "Hacketstown, Co. Carlow"}, {"Language": "English"}]}, "5044687/5032203/5147559": {"title": "A Great Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0909, Page 369", "Page 369"], "url": "https://www.duchas.ie/en/cbes/5044687/5032203/5147559", "text": "\nSome years ago there used to be a horse races in Ballybrack.  The day on which the races were held was a very wet day, the people going down to it had to cross a river.  When they were coming home the floods had come down the river.  A car was going across the river, and the horse was swept down it.  It carried the people who were in the car to the footbridge at the mill.  Some people were on the bridge pulled them out.  The horse was pulled out at Ballykillane.  Part of the car was carried to Haroldstown.\n", "school_info": "School: Hackettstown (St Joseph's)", "metadata": [{"Location:": "Hacketstown, Co. Carlow", "Teacher:": "\nM. Ní Raghallaigh\n"}, {"Collector": "Moya Scully", "Gender": "female"}, {"Informant": "Elizabeth O' Toole", "Gender": "female", "Age": "60", "Address": "Scotland, Co. Carlow"}, {"Language": "English"}]}, "4921693/4890544/5153715": {"title": "The Flood in Cladach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0324, Page 157", "Page 157"], "url": "https://www.duchas.ie/en/cbes/4921693/4890544/5153715", "text": "\nLong ago there lived a man in Cladac named Lucy. He was a landlord man and was hated by everybody, he evicted all the poor people from their homes. The people cursed him and the wrath of \"God\" fell on him. He said he would evict them all and put them back to a place called the Madam's bridge. There was a tailor in the house of Lucy and he saw the flood coming and told the people to clear out of their houses and go away to some\n(continues on next page)\n", "school_info": "School: Cnoc an Chuilinn, An Ráth Mhór", "metadata": [{"Location:": "Caherbarnagh, Co. Cork", "Teacher:": "\nNóra, Bean Uí Dhuinnín\n"}, {"Collector": "Maire Horan", "Gender": "female", "Address": "Caherbarnagh, Co. Cork"}, {"Informant": "Franics Horan", "Relation": "parent", "Gender": "male", "Age": "48", "Address": "Caherbarnagh, Co. Cork"}, {"Language": "English"}]}, "4921693/4890696/5153794": {"title": "Another Version of the Flood in Cladach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0324, Page 309", "Page 309"], "url": "https://www.duchas.ie/en/cbes/4921693/4890696/5153794", "text": "\nLucy was a farmer from Doire Réidh near Ballyvourney that got half of Claydagh, which was confiscated land. He had a workman names O'Dowd who had three sons. O'Dowd died, and his three sons grew up with three sons of Lucy. The O'Dowds were better men than Lucy's sons, and Lucy was very jealous of them. They worked for Lucy, and he grew to hate them when he knew they were better than his own sons. At that time any man who would kill a sheep would get\n(continues on next page)\n", "school_info": "School: Cnoc an Chuilinn, An Ráth Mhór", "metadata": [{"Location:": "Caherbarnagh, Co. Cork", "Teacher:": "\nNóra, Bean Uí Dhuinnín\n"}, {"Collector": "Kitty Scannell", "Gender": "female", "Occupation": "domestic worker", "Address": "Hollymount, Co. Cork"}, {"Informant": "Humphrey Moynihan", "Gender": "male", "Age": "76", "Address": "Shrone Beg, Co. Kerry"}, {"Language": "English"}]}, "4921703/4891579/5154005": {"title": "An Tuile Mhór i gClaodach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0330, Page 011", "Page 011"], "url": "https://www.duchas.ie/en/cbes/4921703/4891579/5154005", "text": "\nTá baile i gConndae Ciarraidhe go nglaodhtar Claodach air. Tá sé ar teorainn Co Corcaighe agus timhceall  cead bhlian ó shoin do thuit mí-ádh mór ar na daoine ann. Do bhí rud éigin greanmhar ar na daoine a bhí na gcomhnaidhe ann mar bhí an sagart ag cainnt ortha ó'n álthóir gach Domhnach. Bhí beas eile aca ag breadghailLá breagh amach sa Samhradh d'oscail an spéir, do bhris na sgamaill agus tháinig  fearthainn chómh tiugh le caise. Tháinig tuille mór anuas ós na cnocaibh agus do báthadh gach aon duine ann act aon stroinséar amháin a bhí ann agus tailliúr a b'eadh é. Dubhairt gach aoinne annsan gur mallacht é. Do tháinig buairt agus eagla ar gach aoinne i ngiorracht fiche míle do'n áit. Ní raibh aon cainnt cois teine act é. Do dhein Concubar Masters O Ríoghbardáin an bhéarsa sin. B'olc iad na daoine sinFirí iad na gClaoidigh Síor-guide na gcaorach agus ag crúdh mbó\n(continues on next page)\n", "school_info": "School: Cúl an Bhuacaigh", "metadata": [{"Location:": "Coolavokig, Co. Cork", "Teacher:": "\nCáit, Bean Uí Chathasaigh\n"}, {"Collector": "Eibhlis Ní Ríoghbhardáin", "Gender": "female", "Address": "Coolacresig, Co. Cork"}, {"Informant": "Domhnall O Céilleachair", "Gender": "male", "Address": "Clondrohid, Co. Cork"}, {"Language": "Irish"}]}, "4811656/4809473/5162260": {"title": "The Rainstorm of 1924", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0340, Page 011", "Page 011"], "url": "https://www.duchas.ie/en/cbes/4811656/4809473/5162260", "text": "\nExactly last September thirteen years there was a terrible heavy downpour of rain in all the west Cork especially around Macroom and Dunmanway. The previous day was a splendid harvest one and many farmers were engaged carting in corn. The morn of the day on which the rain fell was calm and gloomy looking until about midday when the rain poured down without a breath of wind and continued so without people being in the least perturbed as regards its intensity until eventually all the low-lying districts were inundated.   It caused great destruction to corn and hay. In a certain field in our farm the flood took three stacks a distance of at least seventy yards and laid them intact on a more elevated part of the field. Many houses were flooded and the ground floors of the two public houses at Cooldorrihy were flooded to a height of six feet, but the saddest episode of the flood in this district was the death of a fine hearty young man. He was coming from Macroom and braved the flood the whole road along until night overtook him within a mile or two of Cooldorrihy\n(continues on next page)\n", "school_info": "School: Tíréaltan, Maghcromtha", "metadata": [{"Location:": "Teerelton, Co. Cork", "Teacher:": "\nDd. Ó Murchadha\n"}, {"Collector": "Joan O' Riordan", "Gender": "female"}, {"Informant": "James Mc Carthy", "Gender": "male", "Age": "63", "Address": "Deshure, Co. Cork"}, {"Language": "English"}]}, "4811655/4809341/5164780": {"title": "The Rainstorm of 1924", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0339, Page 067", "Page 067"], "url": "https://www.duchas.ie/en/cbes/4811655/4809341/5164780", "text": "\nExactly last September thirteen years there was a terrible heavy down-pour of rain in all the west Cork district especially around Macroom and Dunmanway. The previous day was a splendid harvest and many farmers were engaged carting in corn. The morn of the day on which the rain fell was calm and gloomy looking until about midday when the rain poured down without a breath of wind and continued so without people being in the least perturbed as regards its intensity until eventually all the low-lying districts were inundated.It caused great destruction to corn and\n(continues on next page)\n", "school_info": "School: Tíréaltan, Maghcromtha", "metadata": [{"Location:": "Teerelton, Co. Cork", "Teacher:": "\nDd. Ó Murchadha\n"}, {"Collector": "Joan O' Riordan", "Gender": "female", "Address": "Cooldorragha, Co. Cork"}, {"Informant": "James Mc Carthy", "Gender": "male", "Age": "63", "Address": "Deshure, Co. Cork"}, {"Language": "English"}]}, "4921923/4900549/5166640": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0396, Page 248", "Page 248"], "url": "https://www.duchas.ie/en/cbes/4921923/4900549/5166640", "text": "\n(continued from previous page)\nday.  Next thing was that their father and mother came in and the result was that Mrs Blake was beaten.\n\n\n\nIn the year 1887 a severe south-easterly gale swept over the south-east coast of Ireland, particularly the sea coast of Youghal, where a large gap was broken and it flooded the townland of Ballyvergan and the townlands adjoining.  The Railway line was undermined and it was completely torn up and sleepers' were to be seen floating in the great floods.  The trains could not go to and fro from Youghal.  All railway vehicles were at a stand still, and not a train was seen pass the Killeagh station for six long weeks'.At the railway crossing near Ballyvergan, there dwelt a middle aged man, who was in great trouble at\n(continues on next page)\n", "school_info": "School: Cill Liath", "metadata": [{"Location:": "Killeagh, Co. Cork", "Teacher:": "\nMícheál Ó Murchadha\n"}, {"Collector": "Eileen Kennedy", "Gender": "female", "Address": "Killeagh, Co. Cork"}, {"Informant": "John Kennedy", "Gender": "male", "Address": "Killeagh, Co. Cork"}, {"Language": "English"}]}, "4921749/4903326/5168085": {"title": "A Great Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0355, Page 131", "Page 131"], "url": "https://www.duchas.ie/en/cbes/4921749/4903326/5168085", "text": "\nA Great FloodThe biggest flood in this district that was known to the oldest person living at the time occurred on Sunday night, July 18th, 1926.The River Araglen flows beside where I live, and down a few fields on its bank. The Araglen is a tributary of the Blackwater. It rises in the townland of Glountanefinane in North-west Cork and flows into the Blackwater. As the crow flies, from its source to its mouth is a distance of only about ten miles, but the river itself is very much longer as it is constantly winding as it flows along through a beautiful valley. This river is very subject to floods, for countless streams flow into it on its course. The flat land along its banks is covered over frequently, making the valley like a huge lake.The weather in July 1926 was fine and much of the hay was saved before the flood. There was a thunderstorm on Saturday night, July 18th. The sky was lightened up every four minutes with brilliant sheets of light, and till daybreak on Sunday morning the rumbling of distant thunder could be heard in the distance. No rain fell however in the district in which I live. Sunday was fine and calm, ominously calm. As the time passed on the day became close and oppressive, and one could feel that the air\n(continues on next page)\n", "school_info": "School: An Bóthar Buí (B.), Áth Treasna", "metadata": [{"Location:": "Boherboy, Co. Cork", "Teacher:": "\nSeán Ó Gealbháin\n"}, {"Collector": "John Galvin", "Gender": "male", "Occupation": "teacher", "Address": "Islandbrack, Co. Cork"}, {"Language": "English"}]}, "4921867/4897178/5178840": {"title": "Floods", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0384, Page 011", "Page 011"], "url": "https://www.duchas.ie/en/cbes/4921867/4897178/5178840", "text": "\nA great big flood was seen in Courtstown in the year of 1868. A house of Mr Fitzgibbon's in Courtstown was flooded three feet deep.\n", "school_info": "School: Little Island (Inse Ratha)", "metadata": [{"Location:": "Little Island, Co. Cork", "Teacher:": "\nTadhg Ó Deasúna\n"}, {"Collector": "Mary Lynch", "Gender": "female", "Address": "Courtstown, Co. Cork"}, {"Informant": "Mr J. Corkery", "Gender": "male", "Age": "69", "Address": "Courtstown, Co. Cork"}, {"Language": "English"}]}, "4921798/4908184/5179538": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0368, Page 083", "Page 083"], "url": "https://www.duchas.ie/en/cbes/4921798/4908184/5179538", "text": "\nAbout forty years ago there was a great flood in the Summer time. It carried cocks of hay out of places into other peoples land. The people never saw such floods in the Summer time before. They had to take off their boots and go into the floods and bring out the hay. When they hay dried it was black.\n", "school_info": "School: Brughtheine (B.), Malla", "metadata": [{"Location:": "Churchtown, Co. Cork", "Teacher:": "\nTomás Ó Tighearnaigh\n"}, {"Collector": "Francis Guiney", "Gender": "female", "Address": "Clashelane, Co. Cork"}, {"Informant": "Mr Denis Sullivan", "Gender": "male", "Age": "56", "Address": "Imogane, Co. Cork"}, {"Language": "English"}]}, "4921724/4893870/5183407": {"title": "Rainstorm 1931", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0349, Page 187", "Page 187"], "url": "https://www.duchas.ie/en/cbes/4921724/4893870/5183407", "text": "\nWe in Blarney had a great flood on April 1st 1931. The Mills were flooded and work was suspended for nearly a week. So great was the weight of water coming down the River Martin that the weir at the \"Big Pond\" was swept clean away.The new bridge built over the river near the Protestant  School, is too low and does not let the volume of water sweep through when in flood. As this flood was extra high all the houses in the Lower Village which are convenient to the river were flooded, water sweeping through the back doors and out the front.\n", "school_info": "School: Colthurst, An Bhlárna", "metadata": [{"Location:": "Blarney, Co. Cork", "Teacher:": "\nS. Ó Laoghaire\n"}, {"Collector": "John Horgan", "Gender": "male", "Address": "Blarney, Co. Cork"}, {"Informant": "Mr E. Horgan", "Gender": "male", "Age": "45", "Address": "Blarney, Co. Cork"}, {"Language": "English"}]}, "4921843/4896047/5184992": {"title": "A Local Happening - The Big Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0378, Page 183", "Page 183"], "url": "https://www.duchas.ie/en/cbes/4921843/4896047/5184992", "text": "\nMy father often told me that there was a very big flood in this town about twenty-two years ago and the people around this district call it the big flood ever since. It took place in the year 1916 when the \"Great War\" between England and Germany was in progress. The River Blackwater is the name of the rive and it flows through the centre of this town so that when the flood was high the people at one side of river could not get across to the other side unless in a side-car and side-cars were very much by the people of this district during that time. When the flood was very high one evening no-one ventured to go across as it was rising higher but two soldiers who were coming along in a horse and cart drove straight into the flood and they had not gone half ways through it when they were swept away together with the horse and cart over the bridge and they were drowned.\n", "school_info": "School: Barrack Hill, Mainistir Fhearmuighe", "metadata": [{"Location:": "Fermoy, Co. Cork", "Teacher:": "\nTomás Ó Coileáin\n"}, {"Collector": "John Mac Sweeney", "Gender": "male", "Address": "Fermoy, Co. Cork"}, {"Informant": "Mr Mac Sweeney", "Gender": "male", "Age": "50", "Address": "Fermoy, Co. Cork"}, {"Language": "English"}]}, "5177655/5177466/5191932": {"title": "A Great Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0599, Page 461", "Page 461"], "url": "https://www.duchas.ie/en/cbes/5177655/5177466/5191932", "text": "\nAbout the year 1856 in the month of Decenber there was a great spring tide.  In a lake near Broadford the water rose so high that it came out in the road.  After the flood a lot of fish were got dead in the side of the road.\n", "school_info": "School: An Páirtín", "metadata": [{"Location:": "Parteen, Co. Clare", "Teacher:": "\nCiarán Ó Ceallaigh\n"}, {"Collector": "John Cooney", "Gender": "male"}, {"Language": "English"}]}, "5177640/5175405/5194012": {"title": "Floods", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0595, Page 229", "Page 229"], "url": "https://www.duchas.ie/en/cbes/5177640/5175405/5194012", "text": "\nAbout twenty years ago during the season of Summer a very high flood rose in the river Ryne. It was so high that it swept the hay from the fields beside the river. Farmers suffered great loss both in cattle and crops. It was the worst flood that ever came in that river.\n\n\n\nOn the evening of 23th February 1903 the people were wondering at the number of birds they saw soaring in the sky. They said it was a sign for a storm. These words were true. About ten o' clock that night the storm raged all over the country. It was at the time the people were going to bed that the wind was strong. Trees and telegraph poles were uprooted that night. Traffic was stopped for about a week after that as the trees\n(continues on next page)\n", "school_info": "School: Cuinche", "metadata": [{"Location:": "Quin, Co. Clare", "Teacher:": "\nSs. Ó Gríobhtha\n"}, {"Collector": "Mary O' Brien", "Gender": "female"}, {"Informant": "Dan Clune", "Gender": "male", "Age": "72", "Address": "Quin, Co. Clare"}, {"Language": "English"}]}, "5177640/5175407/5194014": {"title": "Floods", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0595, Page 231", "Page 231"], "url": "https://www.duchas.ie/en/cbes/5177640/5175407/5194014", "text": "\nIn February in the year 1902 there was a terrible storm. The evening before the storm, the sky was of a copper colour, and that was a great sign of a storm. The wind was blowing so strong that it tore up trees from their roots, and it swept hay and straw from haggard, and it also swept roofs of houses. It is only a couple of years ago since the roof was swept off Doora school.\n", "school_info": "School: Cuinche", "metadata": [{"Location:": "Quin, Co. Clare", "Teacher:": "\nSs. Ó Gríobhtha\n"}, {"Collector": "Mary Baker", "Gender": "female"}, {"Informant": "Mrs Corbett", "Gender": "female", "Age": "72", "Address": "Quin, Co. Clare"}, {"Language": "English"}]}, "5177640/5175408/5194016": {"title": "A Storm", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0595, Page 232", "Page 232"], "url": "https://www.duchas.ie/en/cbes/5177640/5175408/5194016", "text": "\nThe greatest storm that was ever witnessed in this country, occurred about 33 yers ago. Houses were knocked down, tress were uprooted. Railway carriages and trucks blown off the track and in many cases lives were lost\n\n\n\nAbout six months ago a great flood occurred between Moohane Railway Bridge and Ballycar Station. For a distance of one mile the track was submerged in water. So great was the danger that people travelling to and from those points had to do so at their own risk.\n\n\n\nA heavy thunder storm swept over the country about two  yers ago, doing serious damage to property.\n(continues on next page)\n", "school_info": "School: Cuinche", "metadata": [{"Location:": "Quin, Co. Clare", "Teacher:": "\nSs. Ó Gríobhtha\n"}, {"Collector": "Mary Clune", "Gender": "female", "Address": "Quin, Co. Clare"}, {"Informant": "John T. Clune", "Gender": "male", "Age": "50", "Address": "Quin, Co. Clare"}, {"Language": "English"}]}, "4921775/4905951/5196081": {"title": "The Great Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0361, Page 284", "Page 284"], "url": "https://www.duchas.ie/en/cbes/4921775/4905951/5196081", "text": "\nIn 1892 the greates flood ever seen in Lyre came in July. After three o'clock the sky got covered over with big black clouds; the heat was terrible. Soon afterwards flashes of forked lightning were seen and heavy thunder made the houses shake and the people tremble with fear.Two men who were working in Glencoum bogs ran with their lives but one man who had a slawn over his shoulder was struck by the lightning and killed.Several cows were struck also and a thatched house in [?] was set on fire but no person living in it was killed.About 4:30 rain began to fall heavily and continued for about two hours. Many people who ran for shelter by fences and hedges had narrow escapes from the floods which came on quickly. When the rain ceased at 7 o'clock, it could be seen that the Glen River had overflown its banks and that the public roads and boreens through the country had become the beds of roaring yellow floods.The damage done was considerable. Blocks\n(continues on next page)\n", "school_info": "School: Ladhar (B.), Bán-Tír", "metadata": [{"Location:": "Lyre, Co. Cork", "Teacher:": "\nPádraig Ó Halladáin\n"}, {"Collector": "Pat Halliden", "Gender": "male"}, {"Informant": "Owen Mc Auliffe", "Gender": "male", "Age": "72", "Address": "Lyre, Co. Cork"}, {"Language": "English"}]}, "5177618/5173613/5198586": {"title": "A Great Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0590, Page 163", "Page 163"], "url": "https://www.duchas.ie/en/cbes/5177618/5173613/5198586", "text": "\n163                   A Great  Flood.I know you would like to know all about a big flood.It is about two years ago  it occured . In our locality there was an extraordinary flood.It rained for about an hour and a half. It swept all the stones out of our old avenue down on the public road.it tore up all surface of the road in the way that motor-car or bicycle could not go that road for a long time.it started to rain at about four o'clock and stopped at five o'clock.Two showers met.It rained very heavily.before the rain there was a peal of thunder.\n\n\n\nHidden  Treasure.In Glandree about fifty years ago, there was found in ODonnells place some treasure.The name of the field was (cruscán rua).There was a cave in the field.The cave was made of stone and shaped like a long high drain.There was found in this cave when it was torn up some queer stones ,a silver spoon some money,and it seemed as if there was some foundry works going on there,because there were cinders found there also. Tole by John ODonnell -Glandree, Tulla ,Co Clare, age 75 years.\n", "school_info": "School: Gleann Draoi, An Tulach", "metadata": [{"Location:": "Glendree, Co. Clare", "Teacher:": "\nSeán Ó Conchobhair\n"}, {"Language": "English"}]}, "4811620/4802718/5202854": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0279, Page 161", "Page 161"], "url": "https://www.duchas.ie/en/cbes/4811620/4802718/5202854", "text": "\n(continued from previous page)\nbridge. It took two cows and landed them near the pier. They were dead.\n\n\n\nAbout sixty years ago there was a fierce flood in the school river. Mr. Daly lived near the school. He had to run out of his house during the night and the timber bridge was entirely swept away down the river. When the children came to school the next day they were delighted when they saw the bridge gone\n(continues on next page)\n", "school_info": "School: An Gleann Garbh", "metadata": [{"Location:": "Glengarriff, Co. Cork", "Teacher:": "\nCaoimhín Ó Séaghdha\n"}, {"Language": "English"}]}, "5215799/5212643/5221196": {"title": "Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137B, Page 23_018", "Page 23_018"], "url": "https://www.duchas.ie/en/cbes/5215799/5212643/5221196", "text": "\nLong ago they used go out before there breakfast working  Then when they used have a great deal worked they used come in and eat there breakfast.They used to eat potatoes for the breakfast and milk. They used have tea for the dinner.They used eat the potatoes out of the basket. They used leave the basket on a tub or on a pot.\n(continues on next page)\n", "school_info": "School: Creganbane", "metadata": [{"Location:": "Cregganbaun, Co. Mayo", "Teacher:": "\nDáithí Mag Réill\n"}, {"Collector": "Patrick Kilcoyne", "Gender": "male"}, {"Language": "English"}]}, "5215813/5214595/5221314": {"title": "A Rain Storm", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138D, Page 01_023", "Page 01_023"], "url": "https://www.duchas.ie/en/cbes/5215813/5214595/5221314", "text": "\nA rain storm.    About thirty two years ago, in the month of September a great thunder storm arose, and after some time it turned in to a rain storm.      It rained very heavy so that there was a big flood in the river. It flooded the fields that was near the river. It broke the fence that was on a field of Thady Hastings. It flooded all that field and carried away the hay and corn to the end of the field. It brought the gable of one of the stables.\n(continues on next page)\n", "school_info": "School: St Bridget's", "metadata": [{"Location:": "Derrymore, Co. Mayo", "Teacher:": "\nMáire Uí hOistín\n"}, {"Collector": "Áine Ní Oistín", "Gender": "female", "Address": "Derrymore, Co. Mayo"}, {"Informant": "Thady Hastings", "Gender": "male", "Address": "Tawnyslinnaun, Co. Mayo"}, {"Language": "English"}]}, "5215813/5214806/5237285": {"title": "Big Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138D, Page 05_018", "Page 05_018"], "url": "https://www.duchas.ie/en/cbes/5215813/5214806/5237285", "text": "\nThe big flood started about 32 yrs. in September. It went in to a house called McLoughlin's. The people had to go out of the house. There was a big field called Garrdha Dhomhnail and all the hay and corn was brought down to the bottom of field. Down in Abhainn Buidhe all the hay and corn  was brought away. All the people had to go buying hay and corn everyplace they could get it\n(continues on next page)\n", "school_info": "School: St Bridget's", "metadata": [{"Location:": "Derrymore, Co. Mayo", "Teacher:": "\nMáire Uí hOistín\n"}, {"Collector": "Seán M. Ó hOistín", "Gender": "male"}, {"Language": "English"}]}, "5215813/5214962/5237724": {"title": "Big Floods", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138D, Page 08_020", "Page 08_020"], "url": "https://www.duchas.ie/en/cbes/5215813/5214962/5237724", "text": "\nAbout 32 years ago in the month of September,There was a great rain storm. It began to rain when the people came home from Mass, and it did not stop till late that night.It went in to John Heratys house. It brought the wash tub and the hens from the street and they got it down in the big river.There was a woman down in Durless and she was out saving hay and the fload came in around\n(continues on next page)\n", "school_info": "School: St Bridget's", "metadata": [{"Location:": "Derrymore, Co. Mayo", "Teacher:": "\nMáire Uí hOistín\n"}, {"Collector": "Tomás Ó Tónra", "Gender": "male"}, {"Informant": "Micheal Baines", "Gender": "male", "Address": "Derrymore, Co. Mayo"}, {"Language": "English"}]}, "5215813/5215082/5238743": {"title": "A Big Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138D, Page 10_029", "Page 10_029"], "url": "https://www.duchas.ie/en/cbes/5215813/5215082/5238743", "text": "\nAbout thirty two years ago a flood came in the month of September.   It went in to a house called Mc Loughlins, and they had to leave the house.     It flooded a field belonging to Tadhg Ó hÓistín and it carried all the hay and crops away with it, until it came to the fence at the bottom of the field.   It brought the gable of a barn that belonged to Tadhg Ó hÓistín with it. There was a calf in the\n(continues on next page)\n", "school_info": "School: St Bridget's", "metadata": [{"Location:": "Derrymore, Co. Mayo", "Teacher:": "\nMáire Uí hOistín\n"}, {"Collector": "Peigí C. M. Ní Oistín", "Gender": "female", "Address": "Tawnyslinnaun, Co. Mayo"}, {"Informant": "Tadhg Ó hOistí", "Gender": "male", "Address": "Tawnyslinnaun, Co. Mayo"}, {"Language": "English"}]}, "5215813/5215400/5239533": {"title": "Big Floods", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138D, Page 16_012", "Page 16_012"], "url": "https://www.duchas.ie/en/cbes/5215813/5215400/5239533", "text": "\nAbout twenty years ago there came a very big flood. It carried away some hay and corn and broke fences. It came into two houses and it went into the fire so they had to put the fires up in their hobs.\n", "school_info": "School: St Bridget's", "metadata": [{"Location:": "Derrymore, Co. Mayo", "Teacher:": "\nMáire Uí hOistín\n"}, {"Collector": "Máire Ní Raghallaigh", "Gender": "female"}, {"Informant": "Michael Reilly", "Gender": "male", "Address": "Laghta Oughter, Co. Mayo"}, {"Language": "English"}]}, "5215813/5215476/5240128": {"title": "A Swimmer", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138D, Page 18_003", "Page 18_003"], "url": "https://www.duchas.ie/en/cbes/5215813/5215476/5240128", "text": "\nThere was a man once living in Lenevesta and he swam across the lake in Log a Locháín  His name was John Berry.\n\n\n\nThere was a man once living in Liscarney and he jumped across from one bank of a river to the other. It was about 16 feet in breadth and 30 in depth. His name was Pat Hoban.\n\n\n\nA Flood\n(continues on next page)\n", "school_info": "School: St Bridget's", "metadata": [{"Location:": "Derrymore, Co. Mayo", "Teacher:": "\nMáire Uí hOistín\n"}, {"Collector": "Bríghid Ní Chonmacháin", "Gender": "female"}, {"Language": "English"}]}}