{"4428238/4387622/4462945": {"title": "A Cure for Cancer", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0798, Page 139", "Page 139"], "url": "https://www.duchas.ie/en/cbes/4428238/4387622/4462945", "text": "\n139A Cure for CancerAbout seventy years ago a man named Mr Byrne lived on Tubbermore Avenue. He made a cure for cancer and cured an other man named Mr Dunne. Mr Dunne had cancer under his lip. He told the man about it and the man told Mr Dunne to call at his house. The man called at Mr Byrnes and and he put a kind of ointment under Mr Dunnes lip on a cloth. The next morning he took it off. All the cancer was gone. The man kept this cure a secret and when he died it was still unsolved.Henry Evans1 Seafield Tee, Colremore RdDalkeyFrom Mrs Mooney 7 Tram Tee. Age 50 years\n", "school_info": "School: Harold (B.), Dalkey", "metadata": [{"Location:": "Dalkey, Co. Dublin", "Teacher:": "\nM. Ó Maoláin\n"}, {"Collector": "Henry Evans", "Gender": "male", "Address": "Seafield Terrace, Co. Dublin"}, {"Informant": "Mrs Mooney", "Gender": "female", "Age": "50", "Address": "Dalkey, Co. Dublin"}, {"Language": "English"}]}, "4427966/4361882/4466892": {"title": "Plasters", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0125, Page 430", "Page 430"], "url": "https://www.duchas.ie/en/cbes/4427966/4361882/4466892", "text": "\nThe cure for a headache long ago was to get the head measured by a certain man. At that time there was a certain man in each parish who could measure the head. The moment it was measured the head-ache was said to go. There is another cure for a headache that is to make a pillow from cammomile and to lie on that for a night and the heachache will go.\n\n\n\nCancer nowadays is quite a common disease and it is almost (incurneab) incurable by doctors.They cut it away but the roots remain there is a woman in Eniscrone named Miss Cowell and she has a white poultice and she claps it to the and draws it out from the roots.\n\n\n\nThe cure for boils is soap and sugar, but some soap finely and bruise the sugar finely into a powder with a hnife. Then mix thetwo together and put them on and to the boil, this will soon clean it. First white bread is but to the boil to ripen it and then the soap and sugar will draw it out. There is a plant named buglas and if this is boiled with oatmeal and put to the boil it will cure it.\n", "school_info": "School: Clún na Gaoithe", "metadata": [{"Location:": "Cloongee, Co. Mayo", "Teacher:": "\nPádraig Ó Héaráin\n"}, {"Informant": "Mrs Mary Dunleavy", "Relation": "unknown", "Gender": "female", "Address": "Ummoon, Co. Mayo"}, {"Language": "English"}]}, "4428258/4389368/4476916": {"title": "Cure for Toothache", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1029, Page 35", "Page 35"], "url": "https://www.duchas.ie/en/cbes/4428258/4389368/4476916", "text": "\nThe person suffering from Toothache goes to the local forge, on the way he is not to speak a word to anybody. He asks the smith for three horse stumps for God’s sake. He returns home without speaking a word to any person that he meets. He then hammers the stumps into a bush “that never was planted. By the time he does this the toothache is gone.\n\n\n\nIf the person with toothache is walking and comes accidentally on a stone with a hole in it in which there is water. If he rubs this water to the tooth and blesses himself he will be cured.\n\n\n\nA man, named William Morrow is supposed to hold the secret of making a plaster from herbs that can cure cancer if applied in timeSeveral men of Cashelard district have gone to him. Some were cured + others died. He lives in the Derries the next townland to Cashelard and is aged about sixy.\n", "school_info": "School: Behey", "metadata": [{"Location:": "Behy, Co. Donegal", "Teacher:": "\nMeadhbh, Bean Uí Dhochartaigh\n"}, {"Language": "English"}]}, "4481725/4408557/4481779": {"title": "The Cure for the Cancer", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1083, Page 297", "Page 297"], "url": "https://www.duchas.ie/en/cbes/4481725/4408557/4481779", "text": "\nThere are not many people in the County Donegal at this time who have the cure for the cancer. The only people that I know that have it are the Pattersons of the Race End. The are two men in this family at the present and one of them has the cure. The cure consists of a plaster which is put on the affected part and kept there until all signs of the cancer has disappeared. What the ingredients of the plaster are no one knows. The cure is kept a secret and is only divulged to the eldest son or failing a son to the next eldest surviving brother.\n", "school_info": "School: Glencar", "metadata": [{"Location:": "Glencar Scotch, Co. Donegal", "Teacher:": "\nBrigid Mc Daid\n"}, {"Collector": "Annie Murray", "Gender": "female", "Age": "13", "Address": "Glencar Irish, Co. Donegal"}, {"Language": "English"}]}, "4493664/4409124/4521986": {"title": "Cancer", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1085, Page 246", "Page 246"], "url": "https://www.duchas.ie/en/cbes/4493664/4409124/4521986", "text": "\nCCancer is a prevalent disease in this country. Many remedies have been tried but the greater part have not been successful especially if a person is affected inwardly the only remedy then is by operationWhen outwardly affected there is a plaster made up of herbs which when applied has been very successful in a great many cases and the cure is generally permanent.The plaster is made and applied in this district by a man named Mr Patterson, race end, letterkemmy\n\n\n\nSome people believe in superstitions regarding the days of the week. Tailors do not like to work on a  Monday, because they think it is unlucky\n(continues on next page)\n", "school_info": "School: Ramelton (Mxd)", "metadata": [{"Location:": "Rathmelton, Co. Donegal", "Teacher:": "\nHenry C. Hamilton\n"}, {"Language": "English"}]}, "4493747/4416174/4530190": {"title": "Herbs (Additional Cures)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1109, Page 120", "Page 120"], "url": "https://www.duchas.ie/en/cbes/4493747/4416174/4530190", "text": "\n(1) Tail-slip - When a cow after calving takes \"Tail-slip\":-Split the tail & put garlic in the cut, & swill it round with a cloth, the cow will get power again, & will be able to get up to her feet(2) Tie a piece of Garlic round your wrist and it will cure the tooth-ache.(3) Put a piece of garlic in your boot, & wear it, When it will got through your whole body, & purify your blood.\n\n\n\n(1) Gather the blossom of the red Clover, which is plentiful in the fields, chew it and drink frequently.(2) The Common Sting Nettle stewed and drank is a sure cure for pleúrisy\n", "school_info": "School: Carrowreagh", "metadata": [{"Location:": "Carrowreagh, Co. Donegal", "Teacher:": "\nAnnie Davidson\n"}, {"Collector": "A. Davison"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "female"}, {"Language": "English"}]}, "4701661/4690401/4706664": {"title": "A Dream of Gold", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0155, Page 145", "Page 145"], "url": "https://www.duchas.ie/en/cbes/4701661/4690401/4706664", "text": "\n(continued from previous page)\nJust as he was passing the place he heard a piper playing at the spot where the digging had been done.He knew the tune which the piper was playing well, and he started to lilt it. Then he tripped on something and fell.When he got up he tried to lilt the tune again, but he could not think of it, and he could never think of it again afterwards.\n\n\n\nThe cure for cancer can be made only by one family in this district. These people live in a place called Lower Wood near Grange, Co. Sligo, and their name\n(continues on next page)\n", "school_info": "School: Grange", "metadata": [{"Location:": "Grange, Co. Sligo", "Teacher:": "\nTomás de Búrca\n"}, {"Collector": "Kathleen Mc Gowan", "Gender": "female", "Address": "Streedagh, Co. Sligo"}, {"Informant": "Mr Michael Mc Gowan", "Gender": "male", "Age": "circa 75", "Occupation": "farmer", "Address": "Streedagh, Co. Sligo"}, {"Language": "English"}]}, "4701699/4693659/4713435": {"title": "Local Cures - Cancer", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0169, Page 111", "Page 111"], "url": "https://www.duchas.ie/en/cbes/4701699/4693659/4713435", "text": "\nCancerCancer is and was cured in our own county. It was handed down by a family the name of Cowell. The only survivor is Miss Cowell of Enniscrone Co. Sligo. A woman named Mrs. Connolly of Dromore  West Co. Sligo also has the cure. When a person goes to Miss Cowell she makes the cure by mixing some herbs and puts it on the spot affected. She then puts a plaster on it. The part is very sore for a few days, and sometimes becomes swollen. In about a fortnight the plaster falls off and brings the cancer with it from the roots. There are people in this district who got the cure of it and it was successful.\n", "school_info": "School: Dún Flainn", "metadata": [{"Location:": "Doonflin Upper, Co. Sligo", "Teacher:": "\nSeán Ó Maolagáin\n"}, {"Language": "English"}]}, "4701695/4693404/4727564": {"title": "A Cure for the Heart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0165, Page 148", "Page 148"], "url": "https://www.duchas.ie/en/cbes/4701695/4693404/4727564", "text": "\n(continued from previous page)\nto the patient for 9 mornings. These cured belong to Joseph Fawelt Roslea KaskeyAnnie MorrisonSt. Anne's N.S Raskey A cure for CancerNear Enniscrone there lives a family names Lowell who have the cure for cancer. It is made from herbs which are boiled and made into a paste. This paste is applied to the cancer and often patients continue the treatment for months, because it takes a long time before the roots of the cancer are killed. Annie MorrisonSt. Anne's N.S Raskey\n\n\n\nNear Emniserone there lives a family named bowell who have the cure for cancer. It is made from herbs which are boiled and made into a paste. This paste is applied to the cancer and often patients continue the treatment for months, because it takes a long time before the root of the cancer are killed\n", "school_info": "School: St Anne's, Easkey", "metadata": [{"Location:": "Easky, Co. Sligo", "Teacher:": "\nCáit Nic Eoin\n"}, {"Collector": "Annie Morrison", "Gender": "female"}, {"Language": "English"}]}, "4701685/4692571/4728096": {"title": "Local Cures - Brain Fever", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0161, Page 166", "Page 166"], "url": "https://www.duchas.ie/en/cbes/4701685/4692571/4728096", "text": "\n(continued from previous page)\ncloth on the head of the sufferer, and which is left on until the third visit. The patient pays the \"doctor\" at each visit.\n\n\n\n(a) If a person got a burn from hot water a \"mankeeper\" was got. It is like a frog; and the burnt person would have to lick the mankeeper's back and then the burn.(b) Lick an \"insect\" called a mankeeper.(c) For a burn rub a docken on it.\n\n\n\nRub a raw onion on the lump, which should disappear in three or four days.\n\n\n\nDrink boiled garlic water\n\n\n\n(a) Squeeze the moisture from the garlic and give it as a drink.(b) Look for a horse with four white legs, and ask the owner for a cure. Whatever he prescribed would be the cure.\n\n\n\n(a) For a person with a cold on his chest you get a piece of brown paper and a piece of a blessed candle. Melt the candle at the fire and let the grease drip on the paper, in the form of a cross. Place this on the persons chest who has the cold and in \"no time\" the cold is cured.\n(continues on next page)\n", "school_info": "School: Scoil na mBráthar Sligeach (Sráid na Céibhe)", "metadata": [{"Location:": "Quay Street, Co. Sligo", "Teacher:": "\nAn Br. Ó Cearbhaill\n"}, {"Collector": "P. Rooney"}, {"Language": "English"}]}, "4798708/4792047/4924328": {"title": "Ringworm", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0254, Page 156", "Page 156"], "url": "https://www.duchas.ie/en/cbes/4798708/4792047/4924328", "text": "\nThis was reckoned the only way which Ringworm could be cured. This was a kind of itch and any part of the body might be affected. It works round in a ring. The seventh son or seventh daughter born in succession had this gift/cure. Immediately the child was born a worm was left on the hand. Two or three circles were then formed round it and some prayers said. The worm would then curl up and die. It could not cross the the circle. The person seeking the cure had to start it on either a Monday or a Thursday as these considered the lucky days of the week. It had to be done three times in succession.\n\n\n\nThis is another disease for which there was a cure.It started like a little wart on any part of the body. It had to be treated when very small as they believed if it gets roots it could not be cured. On this a plaster was put. It was very sore and painful. It was supposed to burn it out. Then the skin shrivelled up and as a mark was left. There is a man still living who can make up this plaster and cure this disease. It also has to be dried on a monday or a thursday. It is Burke of Cloondra - Co Longford. Many people from Kilmore go to him.\n", "school_info": "School: Kilmore", "metadata": [{"Location:": "Kilmore, Co. Roscommon", "Teacher:": "\nMáiréad, Bean Mhic Giolla Críost\n"}, {"Collector": "Violet Notley", "Gender": "female"}, {"Language": "English"}]}, "4798708/4792114/4924592": {"title": "The Cure for Cancer", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0254, Page 223", "Page 223"], "url": "https://www.duchas.ie/en/cbes/4798708/4792114/4924592", "text": "\nThe Cure for CancerThere was once a man who had the cure of cancer. He used to lose a great deal of cattle. He left it on the people he cured. He said he would give up the cure. One day a man came to him who was very bad with cancer. Looking for the cure. He would not give it to him. Next morning the herb was growing two foot high on thee thatch of the house. He sent for man and and he cured him. He never refused anyone for the cure afterwardsMy granfather told me about thatJoseph Rhatigan 11th January 1939\n", "school_info": "School: Kilmore", "metadata": [{"Location:": "Kilmore, Co. Roscommon", "Teacher:": "\nMáiréad, Bean Mhic Giolla Críost\n"}, {"Collector": "Joseph Rhatigan", "Gender": "male"}, {"Informant": "(name not given)", "Relation": "grandparent", "Gender": "male"}, {"Language": "English"}]}, "4921567/4880359/4929988": {"title": "Cancer", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0269, Page 141", "Page 141"], "url": "https://www.duchas.ie/en/cbes/4921567/4880359/4929988", "text": "\nPeople have been cured by the application of a plaster to the affected part. A man named Nicholas Murphy near arthlone had the cure formerly. The present custodian is a man named Sweeney Curtis about three miles to the east of athlone. The plaster has to be applied in the ordinary way then allowed to remain until it falls away. The root of the cancer comes, with the plaster.Thomas Gately, Curnalea, Curraghboy, Athlone was cured of cancer in the lip in this way. The pain during the period is intense.The plaster I understand has to be repeated perhaps once or twice - should it fail in dislodging the cancer in a reasonable time as the plaster grows weak sometimes. A third plaster has to applied.\n", "school_info": "School: Baile 'n tSléibhe (B.)", "metadata": [{"Location:": "Cornalee, Co. Roscommon", "Teacher:": "\nMáirtín Mac Conchradha\n"}, {"Language": "English"}]}, "4758554/4754254/4931023": {"title": "An Old Cure for a Cancer", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0859, Page 329", "Page 329"], "url": "https://www.duchas.ie/en/cbes/4758554/4754254/4931023", "text": "\nSome time ago a man named John Brennan had a cancer on his on his ear. He was in great pain, and he ded not know what to do. At last he was told of a woman named Mrs Bradley of Ballasalla who could cure it. He went to her, and she put a plaster on it, and it cured him. Then he was very glad because he was cured.\n", "school_info": "School: Revanagh, Coolcullen, Muine Beag", "metadata": [{"Location:": "Reevanagh, Co. Kilkenny", "Teacher:": "\nS. Mag Uaildric\n"}, {"Collector": "Michael Comerford", "Gender": "male", "Age": "12", "Address": "Coolcullen, Co. Kilkenny"}, {"Informant": "Richard Comerford", "Gender": "male", "Age": "50", "Address": "Coolcullen, Co. Kilkenny"}, {"Language": "English"}]}, "5009138/4990344/5100886": {"title": "Turnip Juice", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0750, Page 329", "Page 329"], "url": "https://www.duchas.ie/en/cbes/5009138/4990344/5100886", "text": "\n(continued from previous page)\nAs the sugar dissolved a thick syrup was formed, which was very soothing to the inflamed throat.\n\n\n\nThe Farrells of Moyvore had the cure of arterial cancer. The cure consisted of a plaster made from certain herbs gathered in the fields. This plaster was placed on the affected part, and when used in the early stages of the disease, was invariably successful. If the plaster adhered, it was a sign that the cure was working. If it fell off, success was not expected. People from the four provinces used to come to old Mrs Farrell for this cure. She died some thirty years ago, and the other members of the family left the district. But the secret of the cure is in the possession of relatives, the Burkes of Cloudra. They continue to use it with great success.\n", "school_info": "School: Forgney, Ballymahon", "metadata": [{"Location:": "Forgney, Co. Longford", "Teacher:": "\nMrs B. Higgins\n"}, {"Collector": "B. Higgins", "Gender": "female", "Occupation": "teacher"}, {"Language": "English"}]}, "5009214/4998702/5108124": {"title": "Ringworm", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0770, Page 422", "Page 422"], "url": "https://www.duchas.ie/en/cbes/5009214/4998702/5108124", "text": "\n(continued from previous page)\nby reciting a prayer.\n\n\n\nBy giving a drink of milk to a ferret and giving the leavings to any person suffering from Whooping Cough it is believed that the person suffering from Whooping Cough will be cured.\n\n\n\nThere is a man living around Granard who cures cancer. By putting a plaster on the effected part of it is able to draw it right out.\n\n\n\nA man named Gormley who lives near Killoe in a place called Esker cures a sprain by trying a piece of wool, which the old people called \"wisted\" around the sprain. The cure is effected by reciting a small prayer.\n\n\n\nAn old man named Greene in Shantum has the cure of warts. By pulling seven laurel leaves and by making the sign of the sign of the cross with each laurel leaf for\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire, Meathas Truim", "metadata": [{"Location:": "Edgeworthstown, Co. Longford", "Teacher:": "\nAn tSiúr Bernard\n"}, {"Language": "English"}]}, "5009089/4985531/5121616": {"title": "Cures - Cure for a Cough", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0738, Page 156", "Page 156"], "url": "https://www.duchas.ie/en/cbes/5009089/4985531/5121616", "text": "\nCure for a cough.  Put salt on garlic and eat it.  Mrs Seery, Grange, Ballinalack, Co. Westmeath.  She is about twenty three years of age.\n\n\n\nCure of a burn.  Rub sweet oil on the burn every morning for three days.  Miss Murtagh, Cullenhue, Ballinalack, Co. Westmeath.  She is about thirty six years of age.\n\n\n\nCure for a bleeding finder.  Get a dandeline leaf and chew it and tie it on the finger.  Miss Gretta Wallace, Ballinalack, Co. Westmeath got this cure from her Aunt.  She is fourteen years of age.\n\n\n\nMr Shannon, Streete, Co. Westmeath says that if you churn butter on a May day and keep a portion of it over unsalted for twelve months it will remove a thorn.\n\n\n\nCure for Corns.  Thomas Smith, Clonave, Coole, Co. Westmeath has the cure for corns.  He puts a plaster on the corn.  This plaster is the shape of a penny, and the corn goes in a few days.  He is seventy three years of age.\n\n\n\nCure for cancer.  John Veldon, Multyfarnham, Co. Westmeath is a seventh son and he has a cure\n(continues on next page)\n", "school_info": "School: Lacken and Leny", "metadata": [{"Location:": "Lackan, Co. Westmeath", "Teacher:": "\nS, Mac Shamhráin\n"}, {"Informant": "John Veldon", "Gender": "male", "Address": "Multyfarnham, Co. Westmeath"}, {"Language": "English"}]}, "5009285/5004687/5132733": {"title": "Cures", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0888, Page 112", "Page 112"], "url": "https://www.duchas.ie/en/cbes/5009285/5004687/5132733", "text": "\n(continued from previous page)\nYellow Jaundice }Goose droppings were boiled in milk.  The liquid was then strained off and drunk as a cure for Yellow Jaundice.Weak Eyes }Mercury was used for weak eyes.  Miss Loughman's mother who had pearls on her eyes was told by the doctor not to use it if she ever hoped to become a mother.(Miss Loughman would be 93 if she had lived)The woman was to take medicine to which a few drops of mercury was added.BoilsBoiled Soap was used for drawing Boils.Bleeding from Nose  May be stopped by tying last two fingers of the right hand together.Also by holding a cold object such as a slate to the back of the neck.BurnsIn case of burns or scalds, flour or bread soda is usually applied immediately to the part affected.Colds\"Scalded\" Buttermilk is the country cure for colds or softening a cough.CutsIn old times whiskey was used to clean an extensive wound.\n\n\n\nCancer\"Michael Redmonds\" grandmother had a cure for cancer + other skin diseases.  She made a green ointment from herbs.  The cure died with her.Kathleen O'Brien.Ballymoney,  Gorey.\n", "school_info": "School: Tara Hill", "metadata": [{"Location:": "Kilcavan, Co. Wexford", "Teacher:": "\nPádraig Mac Fhlannchadha\n"}, {"Informant": "Kathleen O' Brien", "Gender": "female", "Address": "Ballymoney, Co. Wexford"}, {"Language": "English"}]}, "5044582/5023893/5140516": {"title": "Local Cures - Headache", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0803, Page 212", "Page 212"], "url": "https://www.duchas.ie/en/cbes/5044582/5023893/5140516", "text": "\n(continued from previous page)\n(5) drink a cup of hot milk and it will remove the pain immediately\n\n\n\n(6) To cure a headache people used drink black tea without milk or sugar\n\n\n\n(7) Long ago people used drink scorna [?]. It is made like tea. It has a wide leaf like privette leaf\n\n\n\nThere is a family in croghan, Daingeam named Gilligan who cures caner. This cure was handed down from generation to generation. People come from all over Ireland and even from foreign countries to get cured. The cure is ointment and there is a secret in this ointment which i known to none but themselves. Doctors would give them any money for the secret but they would not sell it\n\n\n\n(1)People used to swallow live frogs as a cure for a stomachache. Raw eggs are also a cure for a stomachache.\n", "school_info": "School: Kilmurry", "metadata": [{"Location:": "Kilmurry, Co. Offaly", "Teacher:": "\nA. de Búrca\n"}, {"Collector": "Thomas Scally", "Gender": "male", "Age": "13", "Address": "Ballyteige Little, Co. Offaly"}, {"Informant": "Joseph Scally", "Gender": "male", "Age": "53", "Address": "Ballyteige Little, Co. Offaly"}, {"Language": "English"}]}, "5044638/5028279/5143620": {"title": "To Revive an Old Dog", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0817, Page 275", "Page 275"], "url": "https://www.duchas.ie/en/cbes/5044638/5028279/5143620", "text": "\nGive a small pinch of Nitre in dog's food once a week.\n\n\n\nClean out dogs ear with metholated spirits and let in dry.Mix 10g of calamine (powdered) in metholated spirits & pour one. teaspoonful into ear.\n", "school_info": "School: Moneygall", "metadata": [{"Location:": "Moneygall, Co. Offaly", "Teacher:": "\nA. S. Ó Cléirigh\n"}, {"Informant": "Mr Jerome Delaney", "Gender": "male", "Address": "Ballynaclogh, Co. Tipperary"}, {"Language": "English"}]}}