{"4428050/4372320/4468989": {"title": "A Witch Hare", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0146, Page 280", "Page 280"], "url": "https://www.duchas.ie/en/cbes/4428050/4372320/4468989", "text": "\nThere was once a man and he had a number of cattle.  There was a hare near the place and was supposed to be a witch.  He used to drink all the milk from the cows.One day the man that owned the cows was walking across the field, he saw a hare in the form of a woman milking a cow.   He had a black hound with him and it was said that a black hound could only kill this hare, as soon as the hare saw the man coming towards him he turned into his own shape and ran off.  The man set the hound after him.  The hare ran towards an old broken down house, when the hare was going in the window the hound caught him.  When the man looked in the window he saw an old woman all blood and her crying.  There were two pots on the fire, the man asked her what was in them and she told him it was food in one and water in the other.The man went in a looked in the pots one was full of wool and the full with milk.  The hare died a short time after and the man had no more trouble.  The cows had always plenty of milk after that.\n", "school_info": "School: Clochar na Trócaire, Béal Átha 'n Fheadha", "metadata": [{"Location:": "Ballina, Co. Mayo", "Teacher:": "\nJohn McGee\n"}, {"Informant": "Seamus Bán Belderrig", "Gender": "male"}, {"Language": "English"}]}, "4497723/4344662/4505753": {"title": "Divers' Fort", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0086, Page 70", "Page 70"], "url": "https://www.duchas.ie/en/cbes/4497723/4344662/4505753", "text": "\n(continued from previous page)\n70kind of a song. He shouted at him to be going ad he said that he would not. Then he went out and he saw the serpent creeping up the wall and trying to bore a hole under the thatch. He took the grape to the serpent and he vanished in a ball of light. Soon after the little man left too. He went towards the art again and went into it.\n\n\n\nIn the village of Derentagart, Burrishoole, Newport, Co Mayo there was in former times a hare which came famous all over the countryside for its ability to elude greyhounds. This hare could be found fairly easy at any time and when pursued always made in the direction of a certain clump of bushes where it disappeared and despite the keenest search could not be found again for that evening. Men with famous greyhounds came from all sides to run down this hare but ever with the same result. It vanished. If anyone had a good\n(continues on next page)\n", "school_info": "School: Skerdagh, Newport", "metadata": [{"Location:": "Skerdagh Lower, Co. Mayo", "Teacher:": "\nJames Deffely\n"}, {"Language": "English"}]}, "4723854/4719340/4759440": {"title": "Folklore", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0946, Page 094", "Page 094"], "url": "https://www.duchas.ie/en/cbes/4723854/4719340/4759440", "text": "\n(continued from previous page)\nlands present - St Patrick's land, Donagh, The Kellylough. A.O.H. land and the Dava land was also there.A priest called Father McKenna was saying Mass on Christmas morning and a good marksman of Cromwell's army was put at a place to get a sure shot at the priest. He was told when the priest would stand between the candles at the last Gospel to shoot. He did so and the priest died as the shot went through his brain. People went to see the spot where he died.\n\n\n\nThere was once a woman who lived in Derrygellia and she was supposed to have the evil eye. One day she was at her house, she went in through her window. Then one of the hounds caught her leg and hurt it. The next day she was in bed with a sore leg.\n\n\n\nPatrick Mohan was a very strong man.  He could lift heavy loads and he can thrown a stone\n(continues on next page)\n", "school_info": "School: An Ghráinseach", "metadata": [{"Location:": "Gransha More, Co. Monaghan", "Teacher:": "\nE. Nic Uaid\n"}, {"Collector": "Mary Mc Ginnity", "Gender": "female", "Address": "Derrynawilt East"}, {"Language": "English"}]}, "4723878/4721472/4780538": {"title": "A Fairy Story Named Dolly Gillieland", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0961, Page 225", "Page 225"], "url": "https://www.duchas.ie/en/cbes/4723878/4721472/4780538", "text": "\nA Fairy Story named Dolly GillielandAbout fifty years ago there lived in the townland of Killabough an old woman called Dolly Gillieland. This old woman lived on the side of the high hill of Killabough. She lived in a wee hut called the Divels Den. She had a very small patch of land and all she had on the land was a red hen, a donkey and two goats, and she would be churning offener than the men around that neighbourhood that had five or six cows. She used to go to every man's byre\n(continues on next page)\n", "school_info": "School: Tydavnet", "metadata": [{"Location:": "Tedavnet, Co. Monaghan", "Teacher:": "\nM. Mac Cába\n"}, {"Collector": "Miss Lucy Mc Geough", "Gender": "female", "Address": "Killylough, Co. Monaghan"}, {"Informant": "Mr Patrick Sherry", "Gender": "male", "Age": "67", "Address": "Drumdart, Co. Monaghan"}, {"Language": "English"}]}, "4723862/4720085/4783636": {"title": "Fairy Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0949, Page 057", "Page 057"], "url": "https://www.duchas.ie/en/cbes/4723862/4720085/4783636", "text": "\nOne time there was a man and he had seven cows and he noticed them failing in their milk. When he would go out to the byre every morning a hare would run out in front of him. One morning he made up his mind that he would gather a pack of hounds and kill it.So he did, and they hunted it thro' the country and the hounds were very near catching it and one of the hounds took the bun off it. When it came to Gallaigh it escaped. It went into and old house of Pat Corrigan's and the man saw the hare go into the house and he went after it. When he went in there was a wee old woman putting on her clothes and the man went over to her and he lifted her up and the blood was running out of her where the dog took the bun off her and ever after the man had plenty of milk.\n\n\n\nOnce upon a time there was a man and son who lived together and this son\n(continues on next page)\n", "school_info": "School: Tattenclave", "metadata": [{"Location:": "Tattintlieve, Co. Monaghan", "Teacher:": "\nB. Ní Chróinín\n"}, {"Collector": "Kathleen Murphy", "Gender": "female", "Age": "15", "Address": "Tattintlieve, Co. Monaghan"}, {"Language": "English"}]}, "4723862/4720095/4783929": {"title": "Funny Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0949, Page 067", "Page 067"], "url": "https://www.duchas.ie/en/cbes/4723862/4720095/4783929", "text": "\nThere was a woman and she was a witch and she could turn herself into a hare. One day the huntsmen were hunting and they asked her to do a ring and they would give her a stone of meal. Then she turned herself into a hare and went round six townlands. When she was going into the house the dogs tore the side of her. When the huntsmen went into the house she was bathing her wounds.\n\n\n\nLong ago there was a plague of rats in the time of Noah's Ark. They used to eat the feet off him. He asked God for some means to exterminate the rats. The tiger sneezed, the lion growled, and there jumped a cat out on the floor.\n\n\n\nThere was a poor man was living in the neighbourhood a long time ago, and his wife died. He was in such poor\n(continues on next page)\n", "school_info": "School: Tattenclave", "metadata": [{"Location:": "Tattintlieve, Co. Monaghan", "Teacher:": "\nB. Ní Chróinín\n"}, {"Collector": "James Farmer", "Gender": "male", "Age": "13", "Address": "Liscumasky, Co. Monaghan"}, {"Language": "English"}]}, "4723862/4720095/4783932": {"title": "Funny Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0949, Page 067", "Page 067"], "url": "https://www.duchas.ie/en/cbes/4723862/4720095/4783932", "text": "\nThere was a woman and she was a witch and she could turn herself into a hare. One day the huntsmen were hunting and they asked her to do a ring and they would give her a stone of meal. Then she turned herself into a hare and went round six townlands. When she was going into the house the dogs tore the side of her. When the huntsmen went into the house she was bathing her wounds.\n\n\n\nLong ago there was a plague of rats in the time of Noah's Ark. They used to eat the feet off him. He asked God for some means to exterminate the rats. The tiger sneezed, the lion growled, and there jumped a cat out on the floor.\n\n\n\nThere was a poor man was living in the neighbourhood a long time ago, and his wife died. He was in such poor\n(continues on next page)\n", "school_info": "School: Tattenclave", "metadata": [{"Location:": "Tattintlieve, Co. Monaghan", "Teacher:": "\nB. Ní Chróinín\n"}, {"Collector": "James Farmer", "Gender": "male", "Age": "13", "Address": "Liscumasky, Co. Monaghan"}, {"Informant": "Ellen Beagon", "Gender": "female", "Age": "72", "Address": "Tonagh, Co. Monaghan"}, {"Language": "English"}]}, "4723862/4720120/4784142": {"title": "The Calliagh Witch", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0949, Page 092", "Page 092"], "url": "https://www.duchas.ie/en/cbes/4723862/4720120/4784142", "text": "\nOne time there lived in Galliagh a woman named Kate Grimes. This woman could change herself into a hare. She would go round the people's cows in the shape of a hare and milk them. When she was in this shape she only could be shot with a silver sixpence. One night she was milking Mr. Mick Wood's cow. He shot her with a silver sixpence. He followed her into her own house and she was sitting in the corner bleeding. There was a verse made on her:\"Long live Philip McGavilleAnd may he live long,For he keeps a black dogTo hunt Kate the witchAcross the White Bog\"\n\n\n\nOne time long ago there lived in Rafinny a man who had two cows.  One morning when he got up there was a cow in the field.\n(continues on next page)\n", "school_info": "School: Tattenclave", "metadata": [{"Location:": "Tattintlieve, Co. Monaghan", "Teacher:": "\nB. Ní Chróinín\n"}, {"Collector": "Paddy Ellis", "Gender": "male", "Age": "16", "Address": "Drumhillagh, Co. Monaghan"}, {"Informant": "Mrs Ellis", "Gender": "female", "Age": "76", "Address": "Drumhillagh, Co. Monaghan"}, {"Language": "English"}]}, "4758595/4757621/4784433": {"title": "Witches", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0950, Page 366", "Page 366"], "url": "https://www.duchas.ie/en/cbes/4758595/4757621/4784433", "text": "\nWitchesHere is a story my grandfather told me long ago.  Whether it is true or not I don't know but I will tell it to you now as it was told to me.About ninety years ago there lived a man called Murray in the townland of Lisalea.  There are Murrays there yet and I suppose they are descendants of his.  He had a cow and every morning when he went to the field he saw a hare beside the cow.  Soon the cow stopped giving milk and the man got suspicious of the hare. At last he took it into his head to kill the hare.  He gathered a crowd of men with guns and hounds and surrounded the hare but she miraclously escaped.  She was surrounded again and fired at but it seemed that lead would not kill her.  That night the hare was seen in the field again.  Next day the men surrounded the hare again but without success.  When evening came the hare got tired the men got round her in a bog.  Every man but one fired at her but she escaped.  This man had quicksilver in his gun so he fired at her and broke her leg.  There was a ring of whins near and inside the ring of whins was a ring of whitethorns and inside the whitethorns was a little house covered with the whitethorns.  The wounded hare crawled into this.  The men followed and found an old woman with her leg bleeding.  They could not kill her because she was an old woman.  A month later she died and a hundred black hounds were seen to go round the house three times and disappear.  The cow then gave milk always and the man lived in peace ever after.\n", "school_info": "School: Drumacoon", "metadata": [{"Location:": "Drumacoon, Co. Monaghan", "Teacher:": "\nP. Ó Grianáin\n"}, {"Informant": "James Murray", "Relation": "grandparent", "Gender": "male", "Age": "93", "Address": "Lisalea, Co. Monaghan"}, {"Language": "English"}]}, "4723849/4718589/4814970": {"title": "Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0943, Page 177", "Page 177"], "url": "https://www.duchas.ie/en/cbes/4723849/4718589/4814970", "text": "\nLong ago Mrs. Douglas Tullycaghney turned into a hare and went to George Greer's byre Tullinmabroe and milked the cows. They would see her hopping out through a whole in the wall. They fired shots at her but could not kill her. He put a sixpence in the gun and he hit the hare on the leg and broke it. They followed the hare to the house and tracked the blood. They called in to see did the people there see a hare passing and they were attending to a woman with a broken leg which was supposed to be the hare.\n", "school_info": "School: Carrickaslane", "metadata": [{"Location:": "Carrickaslane, Co. Monaghan", "Teacher:": "\nMary Greer\n"}, {"Collector": "Robin Greer", "Gender": "male", "Age": "12", "Occupation": "farmer", "Address": "Drumleek North, Co. Monaghan"}, {"Informant": "James Greer", "Gender": "male", "Age": "74", "Address": "Tullynamalra, Co. Monaghan"}, {"Language": "English"}]}, "4723849/4718602/4815028": {"title": "Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0943, Page 190", "Page 190"], "url": "https://www.duchas.ie/en/cbes/4723849/4718602/4815028", "text": "\nOnce upon a time there were men out hunting and they saw a boy and they asked him could he tell them where they would get a hare. He told them to come back at a certain time the next day and he would get them a hare. They came the next day with two greyhounds and one of them was a black one. The boy said to go  up into those whins and he said that they would get a hare. They raised the hare and they boy shouted run Mammy run the black greyhound has you.\n", "school_info": "School: Carrickaslane", "metadata": [{"Location:": "Carrickaslane, Co. Monaghan", "Teacher:": "\nMary Greer\n"}, {"Collector": "Robin Greer", "Gender": "male", "Age": "13", "Occupation": "farmer", "Address": "Drumleek North, Co. Monaghan"}, {"Informant": "James Nahor", "Gender": "male", "Age": "30", "Address": "Oram, Co. Monaghan"}, {"Language": "English"}]}, "4742046/4730698/4938524": {"title": "A Funny Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0955, Page 079", "Page 079"], "url": "https://www.duchas.ie/en/cbes/4742046/4730698/4938524", "text": "\n79              A Funny Story.Some years ago a man went out shooting.After a while he saw a hare and fired at it.He was surprised to see the hare running into a house.He followed it into the house.When he went in ,all he saw was an old woman in bed and her toes bleeding.It was a witch he had shot instead of a hare.\n", "school_info": "School: Tulach Chromán", "metadata": [{"Location:": "Tullycroman, Co. Monaghan", "Teacher:": "\nMrs. Brennan\n"}, {"Collector": "Eileen Dinken", "Gender": "female", "Address": "Drumreask, Co. Monaghan"}, {"Informant": "Mr Pat Dinkin", "Gender": "male", "Age": "53", "Address": "Drumreask, Co. Monaghan"}, {"Language": "English"}]}, "4723837/4717527/4939242": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0940, Page 155", "Page 155"], "url": "https://www.duchas.ie/en/cbes/4723837/4717527/4939242", "text": "\nA story told by many of the old residents of this district. About fifty years ago there lived near the village of Ballytrain (a small village about two English miles from this school) a woman whose name was Rosie Carragher. She could turn herself into a witch at any time, in the form of a hare. One My Eve her husband went into the byre and saw what he thought was a wee hare sucking the cow. He stuck the grape in her eye, the hair disappeared but he traced the blood to his own home, where he found his wife with a very sore eye.Next day she had to go to Dublin for treatment and until she died many years later she always had a silver tube in her eye.\n", "school_info": "School: Cor Liath (2)", "metadata": [{"Location:": "Corlea, Co. Monaghan", "Teacher:": "\nRóise Ní Dhéaghain\n"}, {"Collector": "Roíse Ní Dhéaghain", "Gender": "female"}, {"Language": "English"}]}, "4940776/4731725/4941887": {"title": "A Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0958, Page 110", "Page 110"], "url": "https://www.duchas.ie/en/cbes/4940776/4731725/4941887", "text": "\n(continued from previous page)\nmuch surprised. It is said that the fairies are to come back out of their hiding places when Ireland will be free. The wee man wanted to know if it was the time of peace in Ireland.\n\n\n\nThere was an old woman in Killamarley who could turn herself into a hare. This woman could take the butter of the neighbours' milk. One day there were people churning and up to the door came a hare. She was about to go in when the dog of the house gave chase to her. Then the people who were churning followed the chase. The dog chased her into a house but when the people came along they could find no\n(continues on next page)\n", "school_info": "School: Annaglogh", "metadata": [{"Location:": "Aghnaglogh, Co. Monaghan", "Teacher:": "\nDll. Ó Maonaigh\n"}, {"Collector": "John Mc Kenna", "Gender": "male", "Address": "Moyles, Co. Monaghan"}, {"Language": "English"}]}, "4940776/4731726/4941888": {"title": "A Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0958, Page 111", "Page 111"], "url": "https://www.duchas.ie/en/cbes/4940776/4731726/4941888", "text": "\n(continued from previous page)\nhare in the house. All they could find was an old woman lying in bed.\n\n\n\nA  man named Keating went to a bog for a creel of turf. He stayed that long that his people went to look for him but they could see nothing, but the creel full of turf. they say that he was taken by the fairies. He had cut a loan bush the day before.It happened in the time of the Yeomen in this country about one hundred and thirty five years ago.\n\n\n\nAbout forty five years ago George Harvison went away to play cards in the town. When he was coming home at McWilliams' gates he saw a man standing on the side of the road. When George came up to the man he asked him\n(continues on next page)\n", "school_info": "School: Annaglogh", "metadata": [{"Location:": "Aghnaglogh, Co. Monaghan", "Teacher:": "\nDll. Ó Maonaigh\n"}, {"Collector": "Brendan Macklin", "Gender": "male", "Address": "Crosshugh, Co. Monaghan"}, {"Informant": "(name not given)", "Relation": "grandparent", "Gender": "female"}, {"Language": "English"}]}, "4742060/4731807/4942060": {"title": "Wakes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0958, Page 192", "Page 192"], "url": "https://www.duchas.ie/en/cbes/4742060/4731807/4942060", "text": "\n(continued from previous page)\nother and singing comic songs all the time. It was the talk of the county next week until the next funny wake would turn up.\n\n\n\nA long time ago there lived in Ireland a woman who could turn herself into a hare. She would go around the country taking milk from the cows. If she ran under the cows she would have their milk. One morning a man saw her coming out of the byre.He thought she was a hare but when the man went out to the byre to milk the cows they had only a little drop. The next morning the man rose early and took a hail of a three-penny bit with him. When he was going over the street, the hare ran out from the byre door and the man shot at her and he broke her hind leg. He tracked her over the hills and when he came to an old house at the other side of the hill, he saw an old woman sitting on a chair with her leg bleeding. It was she that was taking the milk.\n", "school_info": "School: Rakeeragil", "metadata": [{"Location:": "Rakeeragh, Co. Monaghan", "Teacher:": "\nP. Murray\n"}, {"Informant": "H. Murphy", "Age": "70", "Address": "Crosshugh, Co. Monaghan"}, {"Language": "English"}]}, "4922003/4917222/4945022": {"title": "Story - Piseoga - Hares", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0499, Page 071", "Page 071"], "url": "https://www.duchas.ie/en/cbes/4922003/4917222/4945022", "text": "\nOne May-eve there was a tailor working in a house for the people. The woman of the house used to put the children to bed very early. The little tailor thought their should be something up. So he stayed up and watched. After a while he heard a crowd of women talking near the fire and the woman of the house was there too, and after a while they got a ring and said some words and jumped through the ring and went off in the form of hares. So the tailor put on his clothes and said the same words and jumped through the ring and went off in the form of a hare. He ran after them and when he got up to them there were a crowd of hares on the side of a hill and there was a big man their with a whip and he said \"Ah some of you brought a book with you\", and he faced the little tailor and beat him and said you can all go home now, you can do no good for the year, and they had to go home and the woman of the house did no good for that year she thought nothing was done right. So the tailor watched the same red woman and said the same words and went through the ring and took the shape of a man again and went to bed.\n", "school_info": "School: Granagh (B.), Brúgh Ríogh", "metadata": [{"Location:": "Granagh, Co. Limerick", "Teacher:": "\nSs. Ó Spiaráin\n"}, {"Collector": "James Morrissey", "Gender": "male"}, {"Informant": "Thomas Broderick", "Gender": "male", "Age": "65", "Address": "Kilmacanearla South, Co. Limerick"}, {"Language": "English"}]}, "4922097/4852136/4946800": {"title": "Old Stories", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0524, Page 045", "Page 045"], "url": "https://www.duchas.ie/en/cbes/4922097/4852136/4946800", "text": "\nThere was a man one time who went out to look at his cows. He had a dog with him. He saw a hare sucking the milk from the cows. When the hare saw the man she ran away. The dog followed her. They kept running until they came to a house. There was a window open at (at) the back of the house. The hare ran in through window, and was no more seen. The man called back the dog, and went home. The hare was a woman who took that shape so that when she would go milking the cows she would not be known.\n\n\n\nThere was a little girl one time who used to go across a field coming from school every evening. There was a kind of a lis in this field, and every evening when the little girl would be passing out this lis, a strange woman that no one in the neighbourhood knew used to come out and talk to her. So one night when the girl went she told her mother about it, and the\n(continues on next page)\n", "school_info": "School: Montpelier, O'Brien's Bridge", "metadata": [{"Location:": "Montpelier, Co. Limerick", "Teacher:": "\nLiam Ó Tuama\n"}, {"Collector": "Jeremiah Ryan", "Gender": "male", "Address": "Birdhill, Co. Tipperary"}, {"Informant": "Patrick Ryan", "Relation": "parent", "Gender": "male", "Age": "60", "Address": "Birdhill, Co. Tipperary"}, {"Language": "English"}]}, "4922040/4921267/4949991": {"title": "Piseoga", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0509, Page 124", "Page 124"], "url": "https://www.duchas.ie/en/cbes/4922040/4921267/4949991", "text": "", "school_info": "School: Effin (C.), Ráthluirc", "metadata": [{"Location:": "Effin, Co. Limerick", "Teacher:": "\nMrs A. Fitzgerad\n"}, {"Language": "English"}]}, "4922034/4920788/4955232": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0507, Page 281", "Page 281"], "url": "https://www.duchas.ie/en/cbes/4922034/4920788/4955232", "text": "\n(continued from previous page)\nHe readily composed ballads on such moving incidents of the moment.  Had them arranged somewhat more or less, very often, less metrically by a hand printer named Jack Sheahan, and sang them at the \"Old market\", and at the \"Potato market\" in Limerick city, while equipped with a sheaf of proof-copy leaflets, to an eager purchasing audience.  \"He had but one eye and that of a small dimensions\", according to one of my informants, while another says, \"He had two peculiar, small eyes\".\n\n\n\n\"The weather is very scriabach\", that is broken, drizzly, wet\".(Croom.  A propos of the weather of the moment. 28-11-37)\n\n\n\nMany stories were told about tailors who in those old times liked to travel from one district to another, and in each place do a bout of sewing, both mending and making. I remember one which my mother used to tell, about a certain tailor, who having temporarily established his headquarters in a certain house, was soon suspicious of the activities of the woman of the house.One night after the man of the house and his doubtful partner had retired to bed, the tailor went to sleep in the settle bed in the kitchen.  Being full of doubt, but that the woman of the house had associations with the harmful shee, the tailor was unable to sleep\n(continues on next page)\n", "school_info": "School: Cromadh (B.)", "metadata": [{"Location:": "Croom, Co. Limerick", "Teacher:": "\nDáithí Ó Ceanntabhail\n"}, {"Language": "English"}]}, "4922034/4920788/4955234": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0507, Page 281", "Page 281"], "url": "https://www.duchas.ie/en/cbes/4922034/4920788/4955234", "text": "\n(continued from previous page)\nHe readily composed ballads on such moving incidents of the moment.  Had them arranged somewhat more or less, very often, less metrically by a hand printer named Jack Sheahan, and sang them at the \"Old market\", and at the \"Potato market\" in Limerick city, while equipped with a sheaf of proof-copy leaflets, to an eager purchasing audience.  \"He had but one eye and that of a small dimensions\", according to one of my informants, while another says, \"He had two peculiar, small eyes\".\n\n\n\n\"The weather is very scriabach\", that is broken, drizzly, wet\".(Croom.  A propos of the weather of the moment. 28-11-37)\n\n\n\nMany stories were told about tailors who in those old times liked to travel from one district to another, and in each place do a bout of sewing, both mending and making. I remember one which my mother used to tell, about a certain tailor, who having temporarily established his headquarters in a certain house, was soon suspicious of the activities of the woman of the house.One night after the man of the house and his doubtful partner had retired to bed, the tailor went to sleep in the settle bed in the kitchen.  Being full of doubt, but that the woman of the house had associations with the harmful shee, the tailor was unable to sleep\n(continues on next page)\n", "school_info": "School: Cromadh (B.)", "metadata": [{"Location:": "Croom, Co. Limerick", "Teacher:": "\nDáithí Ó Ceanntabhail\n"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "female"}, {"Language": "English"}]}, "4922034/4920791/4955239": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0507, Page 284", "Page 284"], "url": "https://www.duchas.ie/en/cbes/4922034/4920791/4955239", "text": "\n(continued from previous page)\ntold him what to say in order to change back again from the hare, and then said it would be as well for him to forget all that happened, for his own good.  The tailor was only too glad to do so, but 'twas many a day before he forgot the burn of the whip. (R.B.)\n\n\n\nWhen I was a boy, a mere child maybe, I remember that when the Christmas candle was lighted on Xmas eve, my mother used to take a spray of holly from that which was used to decorate the house, hold it in the flame of the Christmas candle and when, after some considerable time it began to shrivel and smoke, each child, in fact each member of the family had to come forward and snuff the aroma or otherwise of the sizzling holly-leaf.The woman of the house was the priestess of the occasion, as was the father the Priest in Roman society.  Rev. ----  -----.(His mother was a native of Newcastlewest, Co. Limerick. I have not been able to find a trace locally of a similar ceremony.  D.O.C.)\n\n\n\nThe following remarks upon the fair of Glenogra, make me think that quite a volume could be written on the \"dead\" fairs of Co. Limerick. These remarks were offered uninvited, by a man, Mr. Patrick O'Donnell, who at the moment he was speaking to me, did not know who I was.  I give these\n(continues on next page)\n", "school_info": "School: Cromadh (B.)", "metadata": [{"Location:": "Croom, Co. Limerick", "Teacher:": "\nDáithí Ó Ceanntabhail\n"}, {"Informant": "Rev ", "Gender": "male", "Address": "Newcastle, Co. Limerick"}, {"Language": "English"}]}, "4922063/4849042/5010827": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0514, Page 267", "Page 267"], "url": "https://www.duchas.ie/en/cbes/4922063/4849042/5010827", "text": "", "school_info": "School: Coill Beithne (C.), Baile Mhistéala", "metadata": [{"Location:": "Kilbeheny, Co. Limerick", "Teacher:": "\n-\n"}, {"Informant": "John Stanton", "Gender": "male", "Age": "24", "Address": "Castlequarter, Co. Limerick"}, {"Language": "English"}]}, "4922063/4849043/5010829": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0514, Page 268", "Page 268"], "url": "https://www.duchas.ie/en/cbes/4922063/4849043/5010829", "text": "", "school_info": "School: Coill Beithne (C.), Baile Mhistéala", "metadata": [{"Location:": "Kilbeheny, Co. Limerick", "Teacher:": "\n-\n"}, {"Informant": "M. Cunningham", "Gender": "male"}, {"Language": "English"}]}, "4922109/4852972/5011178": {"title": "An Old Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0527, Page 224", "Page 224"], "url": "https://www.duchas.ie/en/cbes/4922109/4852972/5011178", "text": "", "school_info": "School: Tobar Pádraig", "metadata": [{"Location:": "Patrickswell, Co. Limerick", "Teacher:": "\nAnraoi Ó Broin\n"}, {"Informant": "John Carroll", "Gender": "male", "Address": "Patrickswell, Co. Limerick"}, {"Language": "English"}]}, "4922335/4871228/5072063": {"title": "Funny Stories", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0606, Page 358", "Page 358"], "url": "https://www.duchas.ie/en/cbes/4922335/4871228/5072063", "text": "\nFunny StoriesLong ago old men used to gather into one house at night telling funny stories. One night there were a few old men in a certain house and their was on old woman in their midst. After telling a few stories one called out for riddles. The oldest man was asked and he stood up and said \"could anyone of ye tell me where this road outside is going to\". They were thinking and guessing and at last they failed. The old woman was asked to give her judgement and she said. \"I am here ninety years and I never saw it going any place.\" It was true for her. Long ago a man and a woman lived in a little house. The woman often said to the man that she would prefer to die before him. the man did not believe her. One day he went out and caught cock and plucked the feathers off of him. The next morning they were eating their breakfast and the cock came into the kitchen. The woman got a great surprise when she saw the strange cock because she thought it was death. \"O\" she said to the cock \"run away and take himself with you\"There was a servant boy working in his house + his mistress was supposed to have a hand in with the fairies. When May night came all the family were put to bed earlier than usual. The servant boy said to himself that there was something something wrong. She went around about 12 oclock to see if they were all asleep. The servant pretended to be asleep. When she thought they were asleep she jumped up + took down a box from behind the rafters. She smeared herself all over with the stuff from the box. She was then in the form of a hare: When she was gone he hoped up on the table and found the box + smeared himself with it + he was in the form of a hare. He ran out also. He kept sight of her until she came to a hill where there was a great many hares. A big hare went up on a rock\n", "school_info": "School: Radharc na Sionainne, Lios Uí Chathasaigh", "metadata": [{"Location:": "Furroor, Co. Clare", "Teacher:": "\nMáirtín Ó Seasnáin\n"}, {"Collector": "Una Ní Cearáin", "Gender": "female", "Address": "Furroor, Co. Clare"}, {"Collector": "Peig Ní Conmhaigh", "Gender": "female"}, {"Informant": "Mairéad Bean Uí Thuathail", "Gender": "female", "Age": "85", "Address": "Furroor, Co. Clare"}, {"Language": "English"}]}, "5044789/5038394/5083002": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0964, Page 242", "Page 242"], "url": "https://www.duchas.ie/en/cbes/5044789/5038394/5083002", "text": "\nThere was  gate going up to Taylor's house and it was all slats. They were so close together that nothing could get through. In the middle of of the gate was a round hole. The hare used to go this hole when she would be chased by dogs as she could reach the house quicker.\n\n\n\n(continued from previous page)\nThe chief idol long ago in Ireland was in Ballymagovern.It was called Cromm Cruach.One time St Patrick came and smashed Cromm Cruach and his sub Gods twelve. The idols were inlaid with gold and used to be worshipped by the people. Every year the High King and his retinue used to come from Tara to worship the idol. After Patrick cursed and smashed the idols, the people no more came to worship there.\n", "school_info": "School: Munlough", "metadata": [{"Location:": "Munlough North, Co. Cavan", "Teacher:": "\nD. Brady\n"}, {"Language": "English"}]}, "5044789/5038391/5085045": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0964, Page 239", "Page 239"], "url": "https://www.duchas.ie/en/cbes/5044789/5038391/5085045", "text": "\n(continued from previous page)\nwent to the neighbours houses house because beside them called Plunketts. There was a man named Gorge Plunkett in the house. When he heard ahe was missing he went out and shouted at the top of his voice,'' Ann where are you ''?'' I'm here in Kellegher's field '' says she.As soon as she spoke the fairies her and ran away. When Jim Plunkett got her she was clinging to a large stone in Kellegher's field. She still tells the story of how she was brought away by the fairies.She is eighty two years of age.She still goes to Mass every Sunday.\n\n\n\nOne time there were people called Taylors. They lived in the townland of Prospect. There was a woman in this house and she was enchanted. She could turn herself into the form of a hare. She used to travel the country every morn and suck the milk from the cows. When the people that she used to take the milk from would\n(continues on next page)\n", "school_info": "School: Munlough", "metadata": [{"Location:": "Munlough North, Co. Cavan", "Teacher:": "\nD. Brady\n"}, {"Informant": "James Dolan", "Gender": "male", "Address": "Mullaghmore, Co. Cavan"}, {"Language": "English"}]}, "5044789/5038393/5085046": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0964, Page 241", "Page 241"], "url": "https://www.duchas.ie/en/cbes/5044789/5038393/5085046", "text": "\n(continued from previous page)\nThe hare was buried, but she was gone.\n\n\n\nOne time there was a man out shooting. He saw a hare and he fired at her. He thought he had killed her and he put her under a stone. After a while he went back to the stone to bring the hare home with him, but she was gone. Several people fired at her but shots took no effect upon her. One time a man thought of a crooked sixpence. He thought it into the gun. One time a hare went by the end of the house. He fired at her and wounded her in the leg. she began to bleed and he traced her to Taylor's house but when he came to it she was in the form of a woman with a pool a pool of blood beside her.She got better but she never changed her form after this. She was always lame. When she died, the man that wounded her was at the feast, wake but he had to go home because he was haunted\n(continues on next page)\n", "school_info": "School: Munlough", "metadata": [{"Location:": "Munlough North, Co. Cavan", "Teacher:": "\nD. Brady\n"}, {"Informant": "James Dolan", "Gender": "male", "Address": "Mullaghmore, Co. Cavan"}, {"Language": "English"}]}, "5044838/5042937/5087023": {"title": "Witchcraft", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0978, Page 011", "Page 011"], "url": "https://www.duchas.ie/en/cbes/5044838/5042937/5087023", "text": "\nLong ago the people used to turn themselves into hares by witchcraft and go around from house to house sucking the milk from the cows. These people could not be done away with only by shooting them with a crucked sixpence. I know of a woman who turned herself into a hare. Her name was Mrs. Hutchington, a protestant woman lived in the townland of Ryeforth County Cavan. She went to my grandfather's Bennie Goldrich R.I.P. and sucked the milk from the cow. Grandfather saw her; he got his gun loaded it with a crucked sixpence fired at the hare and hit her an the head. She ran away, and he ran after her to her house, where he found the woman in the bed with her head bleeding. He made her promise to never do that again, so she did not.\n\n\n\nHow to Kill the Hare.A crooked threepenny piece or sixpenny piece was used as a bullet. Silver had the charm to kill a witch-hare. This experiment was tried successfully in Carrick, Co.Donegal.\n", "school_info": "School: Banahoe", "metadata": [{"Location:": "Banagher, Co. Cavan", "Teacher:": "\nA. Mac an Bháird\n"}, {"Informant": "Mrs Paddy Brady", "Gender": "female", "Age": "45", "Address": "Killyteane, Co. Cavan"}, {"Language": "English"}]}, "5044848/5043992/5087024": {"title": "Old Stories", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0981, Page 055", "Page 055"], "url": "https://www.duchas.ie/en/cbes/5044848/5043992/5087024", "text": "\nJohn OBrien of Gola had a cow close in to being to the bull when his days work would finished.  The cow broke loose and ran down to the lake.  A bull came in out of the lake to her.  When the cow calved the calf was fed the same as any other calf but in grew any bigger.  Its horns grew long.  When it was being driven to Mullagh fair it jumped into the lake and was drowned.\n\n\n\nThere was an old woman named Ross. She lived in Cliffin.  She used to turn herself into a hare and go out and suck the cows of the country.  One day she was caught in a neighbours byre and burned.  The next day she was found dead in bed.\n", "school_info": "School: Derryham", "metadata": [{"Location:": "Derryhum, Co. Cavan", "Teacher:": "\nA. Ó Máirtín\n"}, {"Informant": "Paddy Clarke", "Gender": "male", "Address": "Greaghnafarna, Co. Cavan"}, {"Language": "English"}]}, "5044848/5043992/5087025": {"title": "Old Stories", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0981, Page 055", "Page 055"], "url": "https://www.duchas.ie/en/cbes/5044848/5043992/5087025", "text": "\nJohn OBrien of Gola had a cow close in to being to the bull when his days work would finished.  The cow broke loose and ran down to the lake.  A bull came in out of the lake to her.  When the cow calved the calf was fed the same as any other calf but in grew any bigger.  Its horns grew long.  When it was being driven to Mullagh fair it jumped into the lake and was drowned.\n\n\n\nThere was an old woman named Ross. She lived in Cliffin.  She used to turn herself into a hare and go out and suck the cows of the country.  One day she was caught in a neighbours byre and burned.  The next day she was found dead in bed.\n", "school_info": "School: Derryham", "metadata": [{"Location:": "Derryhum, Co. Cavan", "Teacher:": "\nA. Ó Máirtín\n"}, {"Informant": "Pat Flood", "Gender": "male", "Address": "Derryhum, Co. Cavan"}, {"Language": "English"}]}, "5044838/5042937/5087027": {"title": "Witchcraft", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0978, Page 011", "Page 011"], "url": "https://www.duchas.ie/en/cbes/5044838/5042937/5087027", "text": "\nLong ago the people used to turn themselves into hares by witchcraft and go around from house to house sucking the milk from the cows. These people could not be done away with only by shooting them with a crucked sixpence. I know of a woman who turned herself into a hare. Her name was Mrs. Hutchington, a protestant woman lived in the townland of Ryeforth County Cavan. She went to my grandfather's Bennie Goldrich R.I.P. and sucked the milk from the cow. Grandfather saw her; he got his gun loaded it with a crucked sixpence fired at the hare and hit her an the head. She ran away, and he ran after her to her house, where he found the woman in the bed with her head bleeding. He made her promise to never do that again, so she did not.\n\n\n\nHow to Kill the Hare.A crooked threepenny piece or sixpenny piece was used as a bullet. Silver had the charm to kill a witch-hare. This experiment was tried successfully in Carrick, Co.Donegal.\n", "school_info": "School: Banahoe", "metadata": [{"Location:": "Banagher, Co. Cavan", "Teacher:": "\nA. Mac an Bháird\n"}, {"Language": "English"}]}, "5044838/5042938/5087031": {"title": "Witchcraft", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0978, Page 012", "Page 012"], "url": "https://www.duchas.ie/en/cbes/5044838/5042938/5087031", "text": "\nThere was once a Catholic man who owned a farm in the Parish of Lavey. He had six or seven cows out on the land and every morning when the man went out to bring home the cows they were all milked and he never got any milk from the cows in the mornings. At last when he was tired of this he sat up one night to see what happened. He made three or four visits to the field during the night and still nothing happened. At last he made his last visit at day-break. As he went into the field a big hare ran from one of the cows across the field. He examined the cows and they were all milked. He went home and considered what he should do. At last he thought of going to the priest. He went immediately and told his story to the priest. The priest was able to tell him that it was his neighbour, a Protestant woman, who was doing the trick. The man asked the priest to try to stop it. The priest then performed a miracle over the woman. Next morning at her usual time to go to milk the cows, she was bound tight to the wall of her kitchen and was there for several days until she sent for the man whom she had deceived and asked him for God's sake to forgive her. He forgave her on the conditions that she would never touch his cows again and she never did afterwards.\n", "school_info": "School: Banahoe", "metadata": [{"Location:": "Banagher, Co. Cavan", "Teacher:": "\nA. Mac an Bháird\n"}, {"Informant": "James Mc Breen", "Gender": "male", "Age": "55", "Address": "Cross Keys, Co. Cavan"}, {"Language": "English"}]}, "5044838/5042939/5087035": {"title": "Witchcraft", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0978, Page 013", "Page 013"], "url": "https://www.duchas.ie/en/cbes/5044838/5042939/5087035", "text": "\nLong ago there lived an old woman in this locality named Mrs Huet, and on May eve she used to get a ball of yarn which she took with her to the neighbouring houses, leaving part of it on every street,  doing this journey in a circle and thus she would return to where she started.  Having done this she wound up the yarn again invoking the devil by whose means she could take all the butter from the people which she had visited.  But before doing this she had to go to the well before sunrise for the water she used when churning.\n\n\n\nA countryman told me that the fact that butter could be got off the churning could be explained by natural causes. He stated a case where a certain man thought a witch was taking his butter, but discovered that it was his sister who caused the mischief. If the \"wind\" (draught) gets at the crock of  cream it is impossible to churn it afterwards.\n", "school_info": "School: Banahoe", "metadata": [{"Location:": "Banagher, Co. Cavan", "Teacher:": "\nA. Mac an Bháird\n"}, {"Informant": "Tommy Galligan", "Gender": "male", "Age": "65", "Address": "Drumliff, Co. Cavan"}, {"Language": "English"}]}, "5044838/5042939/5087040": {"title": "Witchcraft", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0978, Page 013", "Page 013"], "url": "https://www.duchas.ie/en/cbes/5044838/5042939/5087040", "text": "\nLong ago there lived an old woman in this locality named Mrs Huet, and on May eve she used to get a ball of yarn which she took with her to the neighbouring houses, leaving part of it on every street,  doing this journey in a circle and thus she would return to where she started.  Having done this she wound up the yarn again invoking the devil by whose means she could take all the butter from the people which she had visited.  But before doing this she had to go to the well before sunrise for the water she used when churning.\n\n\n\nA countryman told me that the fact that butter could be got off the churning could be explained by natural causes. He stated a case where a certain man thought a witch was taking his butter, but discovered that it was his sister who caused the mischief. If the \"wind\" (draught) gets at the crock of  cream it is impossible to churn it afterwards.\n", "school_info": "School: Banahoe", "metadata": [{"Location:": "Banagher, Co. Cavan", "Teacher:": "\nA. Mac an Bháird\n"}, {"Informant": "John Smith", "Gender": "male", "Age": "66", "Address": "Cross Keys, Co. Cavan"}, {"Language": "English"}]}, "5044838/5042940/5087042": {"title": "Omens", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0978, Page 014", "Page 014"], "url": "https://www.duchas.ie/en/cbes/5044838/5042940/5087042", "text": "\nIn olden times and even yet people believe in superstitions on May day. Some people tie a piece of red rag and a twig of Rowan tree to the cows tail, they believe that it will keep other people from taking their milk and butter by witchcraft, and also these people on May day would throw out no water. They would keep all the slops in the house till next day neither would they lend anything to a neighbour on that day. But they would borrow something themselves on that day. Some of these people still exist and if those people were churning they would not let you go out of their house (if you chanced to be there) without taking a brash at the churn.\n\n\n\nIn olden times the women used to turn themselves into a hare or a cat. One time a woman changed herself into a cat and went to a house. The man was going to Cavan town to buy boots for his children. She (the cat) told him to buy her a pair of boots, and if he wouldn't she would cut his throath. The man went, but he got no boots ; because there are no boots for cats. When he returned he told her that she would have to go to town next day and that she would get boots. The next day came, the cat arose early, and got her breakfast while the man was doing his work. It was\n(continues on next page)\n", "school_info": "School: Banahoe", "metadata": [{"Location:": "Banagher, Co. Cavan", "Teacher:": "\nA. Mac an Bháird\n"}, {"Language": "English"}]}, "5044838/5042954/5087166": {"title": "A Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0978, Page 028", "Page 028"], "url": "https://www.duchas.ie/en/cbes/5044838/5042954/5087166", "text": "\nOver sixty years ago there lived in this district an old woman known as Katherine the Rock.  She used to travel around the district sometimes begging and some-times would make a ceilidhe with the people.  This woman had the power to use witchcraft.  At night she would go into the houses of the people and take or do what she liked.  She would often go into houses and make tea or take anything she liked with her.  If a person was sitting at the fire they would fall asleep when she would approach the house.  She would make tea and leave some beside the person and they would never find her.  At last someone discovered how it was done.  This woman had a dead hand which she found in a grave and at night she carried it about with her.  When she approached a house she left the hand in on a window.  As soon as the hand was left in the house everyone became as if they were dead.  This is how she got doing what she liked in the houses.\n", "school_info": "School: Banahoe", "metadata": [{"Location:": "Banagher, Co. Cavan", "Teacher:": "\nA. Mac an Bháird\n"}, {"Informant": "Jack Smith", "Gender": "male", "Age": "66", "Address": "Cross Keys, Co. Cavan"}, {"Language": "English"}]}, "5044846/5043870/5095496": {"title": "A Fairy Tale", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0980, Page 072", "Page 072"], "url": "https://www.duchas.ie/en/cbes/5044846/5043870/5095496", "text": "\n(continued from previous page)\ntimes, and was often the cause of some trouble.  This idea was a very foolish one.  It has given rise to many pistrogs\" such as place the tongs across the cradle while the mother of the child was absent from the kitchen.\n\n\n\nAbout a century and a half ago there were people living on this earth that could work witch-craft.  Women of this kind were called \"witches\" and men connected in the same business were called \"wizards.\". Such people could change themselves into whatever the wished to change themselves.  The generally changed themselves into a hare or some animal of this kind.  They used to come in some shape or form like this and steal the milk from\n(continues on next page)\n", "school_info": "School: Termon", "metadata": [{"Location:": "Termon, Co. Cavan", "Teacher:": "\nMrs Cooney\n"}, {"Language": "English"}]}, "5044846/5043873/5095497": {"title": "Witchcraft", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0980, Page 075", "Page 075"], "url": "https://www.duchas.ie/en/cbes/5044846/5043873/5095497", "text": "\n(continued from previous page)\nthat this woman was also working witch-craft.\n\n\n\nA man in Lisanymore owned a lot of cows and he used to churn all his milk and sell all the butter.  He always would have a great yield of butter from the milk. One morning when entering the dairy he percieved a hare licking the cream.  He hushed it off.  When he churned his milk he had hardly one pound of butter off it.This happened for a considerable time until one day a very aged woman entered this man's house and asked for a drink.  His wife gave her a cup of sweet milk.  While drinking it she said \"I restore all your butter to you once more.  The man then bethought that it was she who was robbing him of his butter.\n", "school_info": "School: Termon", "metadata": [{"Location:": "Termon, Co. Cavan", "Teacher:": "\nMrs Cooney\n"}, {"Language": "English"}]}, "5162174/5160868/5170666": {"title": "A Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0947, Page 304", "Page 304"], "url": "https://www.duchas.ie/en/cbes/5162174/5160868/5170666", "text": "\nA long time ago in the townland of Drumcrin a man noticed when going for his cows every morning a hare running out of the middle of the cows and disappearing in the bushes. He noticed also that the cows were not milking as well as they should. One day there was a hunt in this part of the district. A hare jumped up before the hounds and there was a great view for a short distance. The hare ran until she came to an old house. As she was jumping through the window a hound bit her on the leg. The hounds ran round the house crying, and the huntsmen came up and looked through the window. They saw an old woman sitting crying in the corner and her leg \"teaming” blood\n", "school_info": "School: Clonrye", "metadata": [{"Location:": "Clonrye, Co. Monaghan", "Teacher:": "\nS. Ó Mearáin\n"}, {"Collector": "Una Mc Caffrey", "Gender": "female"}, {"Informant": "Mr Mc Caffrey", "Gender": "male", "Address": "Drumgramph"}, {"Language": "English"}]}}