{"4427841/4349391/4440302": {"title": "Feast-Days - Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0096, Page 685", "Page 685"], "url": "https://www.duchas.ie/en/cbes/4427841/4349391/4440302", "text": "\nIt is a very old cstom to eat a lot of eggs on Easter Sunday and or Easter Monday also.  If you would get up early on Easter Sunday monday morning you would see the Sun dancing just as it would be rising for a few minutes.  The people used to eat boiled eggs on that day.  They eat about a half a score each on both days.  They used to boil them very soft.  Some people used to drink them without boiling at all.  They used to eat hen eggs mostly.It is a very lucky thing to bring the first can of water from the spring well on Easter Sunday morning.  You would have clear skin for the year if you washed your face in the dew on Easter Sunday morning.  Your skin would have a very red colour for the summer if you washed your face in the dew on that day.  The Sun would not burn you for the summer either.\n", "school_info": "School: Baile an Daingin (B)", "metadata": [{"Location:": "Ballindine, Co. Mayo", "Teacher:": "\nSéamus P. Ó Gríobhtha\n"}, {"Collector": "Mark Connolly", "Gender": "male", "Address": "Ballindine, Co. Mayo"}, {"Informant": "Thomas Connolly", "Gender": "male", "Age": "60", "Address": "Ballindine, Co. Mayo"}, {"Language": "English"}]}, "4427889/4354755/4449610": {"title": "Pisreoga a Bhaineas leis an Nollaig agus le Lá Chinn Bhliana", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0108, Page 170", "Page 170"], "url": "https://www.duchas.ie/en/cbes/4427889/4354755/4449610", "text": "\n(continued from previous page)\nBhliana.  Is ceart deoch a thabhairt don duine sin.2. Ní ceart airgead a íoc an lá sin. Má thugann tú airgead amach an lá sin, deirtear go mbeidh tú á thabhairt uait gach uile lá eile sa mbliain.3. Ní ceart glas a chur ar an doras nó dallóg a chur ar an bhfuinneog Oíche na Nollag ar fhaitíos go mbeadh an Mháthair Bheannaithe is an Leanbh Íosa ar lorg dídine an oíche sin.4. Is ceart coinneal a bheith ar lasadh in gach fuinneog sa teach Oíche na Nollag i dtreo go bhfeicfidh an strainséir nó an taistealaí an solas agus go dtiocfaidh sé isteach le bia agus dídean a fháil, má bhíonn a leithéid ag teastáil uaidh.\n\n\n\n1. Deirtear go bhfeicfidh tú an ghrian ag rince maidin Dhomhnach na Cásca má bhíonn tú in do shuí um a sé a chlog.2. Is ceart uibheacha a thabhairt do pháistí na comharsan um Cháisc.\n", "school_info": "School: Rusgaigh (2)", "metadata": [{"Location:": "Roosky, Co. Mayo", "Teacher:": "\nEibhlín Ní Chorraidhe\n"}, {"Collector": "Eibhlín Ní Chorraidhe", "Gender": "female", "Occupation": "múinteoir"}, {"Language": "Irish"}]}, "4427850/4350553/4451175": {"title": "Good Friday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0098, Page 366", "Page 366"], "url": "https://www.duchas.ie/en/cbes/4427850/4350553/4451175", "text": "\nOn  Good Friday some people  cut a bit of their hair, for a sacrifice and people always try to sow crops on Good Friday because they never fail. It is very bad to cut your nails on Good Friday because they  will never grow. The old people  used to shave their horses that day.\n\n\n\nOn Easter Sunday morning some people look to the sun and they say  that it dances about six o clock. On Sunday morning also it is a custom to eat three or four eggs for your breakfast. Long ago when the people fasted all during lent they made a feast on Easter. They went outside with a big pot and boiled\n(continues on next page)\n", "school_info": "School: Cnocán Mhichíl Naofa (Clochar)", "metadata": [{"Location:": "Claremorris, Co. Mayo", "Teacher:": "\nSiúracha na Trócaire\n"}, {"Collector": "Delia Connolly", "Gender": "female", "Age": "12", "Address": "Claremorris, Co. Mayo"}, {"Language": "English"}]}, "4428071/4375052/4457378": {"title": "Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0151, Page 383", "Page 383"], "url": "https://www.duchas.ie/en/cbes/4428071/4375052/4457378", "text": "\nOn Easter Sunday every body eats a lot of eggs. It is also said that the sun dances on that morning Long ago the children had eggs hidden for Easter Sunday and when that day came round they ate all the eggs.\n", "school_info": "School: Droichead na Daoile", "metadata": [{"Location:": "Lackalustraun, Co. Mayo", "Teacher:": "\nMáire, Bean Uí Ghallchobhair\n"}, {"Language": "English"}]}, "4427931/4358470/4457733": {"title": "Good Friday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0117, Page 159", "Page 159"], "url": "https://www.duchas.ie/en/cbes/4427931/4358470/4457733", "text": "\nSome do not comb their hair until after three o'clock.  People like to do a lot of work on the farm on this day.  They always begin to stick the potatoes on this day- they say this is the luckiest day in the year to set anything.\n\n\n\nEvery person eats two eggs or more on Easter Sunday.  Long ago people used to have potatoes and eggs for breakfast.  The old people used to say if you get up early you would see the Sun dancing.\n\n\n\n[-]\n\n\n\nThe old people used to say  that no one should go near water on Whit Sunday as it is a Contrary day.  The same applies to Whit Saturday and Whit Monday.  If a person fell asleep and awoke with\n(continues on next page)\n", "school_info": "School: Páirc Íseal (C.)", "metadata": [{"Location:": "Lowpark, Co. Mayo", "Teacher:": "\nSorcha Ní Dhumhnaigh\n"}, {"Language": "English"}]}, "4427931/4358470/4457734": {"title": "Good Friday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0117, Page 159", "Page 159"], "url": "https://www.duchas.ie/en/cbes/4427931/4358470/4457734", "text": "\nSome do not comb their hair until after three o'clock.  People like to do a lot of work on the farm on this day.  They always begin to stick the potatoes on this day- they say this is the luckiest day in the year to set anything.\n\n\n\nEvery person eats two eggs or more on Easter Sunday.  Long ago people used to have potatoes and eggs for breakfast.  The old people used to say if you get up early you would see the Sun dancing.\n\n\n\n[-]\n\n\n\nThe old people used to say  that no one should go near water on Whit Sunday as it is a Contrary day.  The same applies to Whit Saturday and Whit Monday.  If a person fell asleep and awoke with\n(continues on next page)\n", "school_info": "School: Páirc Íseal (C.)", "metadata": [{"Location:": "Lowpark, Co. Mayo", "Teacher:": "\nSorcha Ní Dhumhnaigh\n"}, {"Language": "English"}]}, "4428107/4378894/4460291": {"title": "Local Belief and Customs - Bonfire Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0640, Page 39", "Page 39"], "url": "https://www.duchas.ie/en/cbes/4428107/4378894/4460291", "text": "\nBonfire or Bone-Fire night. 24th June. Fire lit. Ashes sprinkled in each field. Cattle driven three times round fire. Jumping over it. Bone put into it. A weed called moguard was put into it. Then this was brought home and put into thatch.\n\n\n\nTaking three sups of Easter water in name of Holy Trinity.  Easter water sprinkled in house and fields on May Eve.   Drop of Easter water put in first mash of bran given to a cow after calving.  Hair burned from cows udder with blessed candle when first milked after calving. Easter water put into first churn, into \"sciollain\". Kept in house for seven years and there is then a cure in it.\n\n\n\nCandle lit on Xmas eve and left lighting through night and next day. Prayers said when candle is lighting. It is lit by man of the House. Candles on All Souls night. One candle is supposed to be lit for each member of the family who is dead. Those candles do not be used for any other purpose. Sometimes 5 or 7 are only lit.\n\n\n\nThe door is left on the latch on Xmas eve. The fire is left lighting. The chimney is swept.\n", "school_info": "School: West Waterford Branch I.N.T.O", "metadata": [{"Location:": "Coshmore and Coshbride, Co. Waterford", "Teacher:": "\nJames Cashman\n"}, {"Collector": "James Cashman", "Gender": "male"}, {"Language": "English"}]}, "4427966/4361819/4466818": {"title": "Easter Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0125, Page 374", "Page 374"], "url": "https://www.duchas.ie/en/cbes/4427966/4361819/4466818", "text": "\nEaster CustomsEaster is regarded as the big feasst of the year.Spy WednesdayIt is the custom on Spy Wednesday not to throw out any water and not to put out the ashes from the fire.Good FridayIt is the custom on Good Friday for all the people that is able, to go to chapel and do the stations of the cross. The blacksmith will not do any work on this day because it is not right to drive a nail on Good  Friday on account of the nails that were driven in Our Lord's flesh.Easter SundayOn Easter Sunday morning it is the custom for all the young boys to get up very early to see the sun dancing. It is also the custom for them to go out in the bogs searching for wild-ducks nests on this day. The people a great feast on this day. It is mostly eggs that is eaten for this feast. If a child went to its friend's house during the Easter he get an egg or two as a present. There are no marriages at all in lent but when Easter Sunday comes rumers of marriages go out.\n", "school_info": "School: Clún na Gaoithe", "metadata": [{"Location:": "Cloongee, Co. Mayo", "Teacher:": "\nPádraig Ó Héaráin\n"}, {"Language": "English"}]}, "4428016/4368436/4471715": {"title": "Festival Customs - Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138, Page 108", "Page 108"], "url": "https://www.duchas.ie/en/cbes/4428016/4368436/4471715", "text": "\nPancakes are made in most homes on this night. The ring is put in the cake and the old superstition that whoever gets it will marry first is attached to the finding of the ring\n\n\n\nCrowds attend morning mass and get the holy ashes. They bring home some of it to those who have not been to mass. There is a pious belief that the ashes should not be rubbed off on any account until the day is over. Some farmers in this district like to sow their oats on this day.\n\n\n\nA great number attend Mass and visit the Blessed Sacrament during the day.\n\n\n\nGood Friday is observed something like a holiday. Very little work is done and almost everyone young and old go to the church and perform the Stations of the Cross\n\n\n\nEaster Sunday there is great rejoicing for the feast. The young children and some of the grown ups to rise very early to see the sun dancing.\n\n\n\nThe people believe that it is not lucky to bathe at Whitsuntide as it is a season of accidents.\n\n\n\nAll crops are supposed to be sown before this date. There is a tradition that no one should touch clay this day. The children erect\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire, Leac an Anfa, Cathair na Mart", "metadata": [{"Location:": "Leckanvy, Co. Mayo", "Teacher:": "\nAn tSr. Treasa\n"}, {"Language": "English"}]}, "4428026/4369425/4475223": {"title": "Festivals - St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0140, Page 133", "Page 133"], "url": "https://www.duchas.ie/en/cbes/4428026/4369425/4475223", "text": "\n(continued from previous page)\nold delighted in singing \"Patrick Day in the morning and \"God save Ireland\" and there was a spirit of patriotism in the air.\n\n\n\nEaster Saturday was always a day of fasting     and hard work. All work in hand was finished and no new undertaking was began on that day. On  Easter  Sunday all young people rose early to see the sun rise as it is supposed to dance for joy so it is a day to be joyful and glad.Eggs for breakfast ( Emblem of new life )  new frocks and new suits were worn to Church and farmyard invariably supplied the dinner table. Friends from far and near visited each other and talked about the crops and stocks and the prospects generally. In the evening the usual devotions were well attended. Now-a-days the evenings are spent by the young people in preparations for the night at the dance-halls. Holy Ireland is different from\n(continues on next page)\n", "school_info": "School: Ballycastle Boys'", "metadata": [{"Location:": "Ballycastle, Co. Mayo", "Teacher:": "\nMícheál de Búrca\n"}, {"Collector": "John Lenihan", "Gender": "male", "Address": "Ballycastle, Co. Mayo"}, {"Informant": "Mrs Polke", "Gender": "female", "Age": "63", "Address": "Ballinglen, Co. Mayo"}, {"Language": "English"}]}, "4428286/4391833/4478410": {"title": "Easter Houses", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1036, Page 051", "Page 051"], "url": "https://www.duchas.ie/en/cbes/4428286/4391833/4478410", "text": "\nFour families attending this school at present time still make “Easter Houses” in which to have their feasts1 Buchanan- This family learned to make them in Tyrone.2 Glenns- natives of this district3 Harrons (Henneys)4 Morrow (Haugh)5 Morrow (Altilow)6 Morrow (Leagan)\n", "school_info": "School: Loch Iasg", "metadata": [{"Location:": "Tawnyvorgal, Co. Donegal", "Teacher:": "\nMáire, Bean Uí Mhurchadha\n"}, {"Language": "English"}]}, "4428350/4398217/4483918": {"title": "Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1053, Page 225", "Page 225"], "url": "https://www.duchas.ie/en/cbes/4428350/4398217/4483918", "text": "\nLong ago on Easter Sunday morning the old people used to go the the tops of hills to watch the sun rise and to see it turn three times in the sky.Every family has a feast on that day.  Small children go to hills and fields and light fires where the boil eggs and make tea.  Then the all sit around and have a feast which the enjoy very much.\n", "school_info": "School: Cill Choinnigh", "metadata": [{"Location:": "Kilkenny, Co. Donegal", "Teacher:": "\nSéamus Mac Giolla Eoin\n"}, {"Collector": "Maggie O' Donnell", "Gender": "female"}, {"Informant": "James O' Donnell", "Gender": "male", "Age": "72", "Address": "Mulnamin Beg, Co. Donegal"}, {"Language": "English"}]}, "4428244/4388110/4510796": {"title": "Customs Associated with Easter Sunday - The Sun Dancing", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0799, Page 301", "Page 301"], "url": "https://www.duchas.ie/en/cbes/4428244/4388110/4510796", "text": "\nIt was customary for children to get up early on Easter Sunday morning to see the sun dancing immediately it appeared above the horizon.\n\n\n\nDuring the afternoon of Easter Sunday it was usual for children to repair to the top of a hill, preferably a rath, where they constructed an 'Easter House'.  A number of stones was gathered and laid down as seats in a ring.  In the centre of the ring a fire of brushwood was kindled.  Tea was made and eggs were boiled on this fire.  At the Easter House the children enjoyed a feast of tea and eggs.  One or two adults were usually present to see that no accidents occured in connection with the fire.\n", "school_info": "School: St Peter's, Phibsboro", "metadata": [{"Location:": "Phibsborough, Co. Dublin", "Teacher:": "\nSs. Breathnach\n"}, {"Language": "English"}]}, "4428244/4388110/4510797": {"title": "Customs Associated with Easter Sunday - The Sun Dancing", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0799, Page 301", "Page 301"], "url": "https://www.duchas.ie/en/cbes/4428244/4388110/4510797", "text": "\nIt was customary for children to get up early on Easter Sunday morning to see the sun dancing immediately it appeared above the horizon.\n\n\n\nDuring the afternoon of Easter Sunday it was usual for children to repair to the top of a hill, preferably a rath, where they constructed an 'Easter House'.  A number of stones was gathered and laid down as seats in a ring.  In the centre of the ring a fire of brushwood was kindled.  Tea was made and eggs were boiled on this fire.  At the Easter House the children enjoyed a feast of tea and eggs.  One or two adults were usually present to see that no accidents occured in connection with the fire.\n", "school_info": "School: St Peter's, Phibsboro", "metadata": [{"Location:": "Phibsborough, Co. Dublin", "Teacher:": "\nSs. Breathnach\n"}, {"Language": "English"}]}, "4427831/4348371/4511585": {"title": "Easter Time", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0094, Page 494", "Page 494"], "url": "https://www.duchas.ie/en/cbes/4427831/4348371/4511585", "text": "\nLong ago, twenty hens was as much as was in any house, and very few eggs were given to the people to ate. But when Easter Sunday came around, there was some egg ateing going on. Spoons were scarce, bog-deal spoons were made for the day. They were cut straight then, and about an inch wide at first, then made a little hollow at the bowl. They were very good, but a little rough and lasted until the following year.All the eggs were boiled in a skillet and, every wan of the family got two or more if they could manage them. Each person scraped a hollow in a big pratie, big enough to hould an egg an this was used as an egg-cup, you could see some of them holden the egg in the left hand while he was ating. you would not see such a harty male now, as the good ould holy people had on this great Sunday  and everyone was full of news after coming from Mass in the ould Church.\n(continues on next page)\n", "school_info": "School: Belcarra (C.)", "metadata": [{"Location:": "Ballycarra, Co. Mayo", "Teacher:": "\nMary T. Moran\n"}, {"Collector": "Annie Kate Conway", "Gender": "female"}, {"Informant": "Michael Moran", "Gender": "male", "Age": "87", "Address": "Roslahan Upper, Co. Mayo"}, {"Language": "English"}]}, "4493633/4405800/4515957": {"title": "Seanreiligí", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1075, Page 249", "Page 249"], "url": "https://www.duchas.ie/en/cbes/4493633/4405800/4515957", "text": "\n(continued from previous page)\nagus rinne. Tháinig sé 'na bhaile, agus an chnámh leis, agus thaisbean sé do na gasúirí í. Bhí achan rud go ceart go dtí go dtáinig an oidhche, agus chuaidh an gasúr in a luighe.Nuair a bhí sé in a chodladh, mhusgail sé go tapaidh, mar mhothuigh sé rud a bhualadh, agus a bhualadh. Tháinig eagla air, agus shuidh sé suas ar an leabaidh. Chonnaic sé an chnámh ag léimnigh suas agus síos an leabaidh, agus a bhualadh. Thuit sé i laige, acht goidé chualaidh sé acht na gasúirí ag gairdhe. Is iad san a rinne an rud. Cheangail siad an chnámh ar chórda, agus tharraing siad an córda, agus léim an chnámh suas agus síós an leabaidh 'san dóigh seo.\n\n\n\nCleachtuigheann na daoiní cuid mhór seannósanna i rith na bliana go h-aithrighthe ag an Cháisg. Nuair a éirgheann siad ar maidin, éigheann siad go luath leis an ghrian a fheiceáil ag damhsa siocair go ndamhsann sé an lá sin go luath mar\n(continues on next page)\n", "school_info": "School: Más an Easa (C.)", "metadata": [{"Location:": "Masiness, Co. Donegal", "Teacher:": "\nMáire Ní Cholchuin\n"}, {"Collector": "Áine Ní Cheállaigh", "Gender": "female", "Address": "Masiness, Co. Donegal"}, {"Language": "Irish"}]}, "4493633/4405836/4517938": {"title": "Easter Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1075, Page 281", "Page 281"], "url": "https://www.duchas.ie/en/cbes/4493633/4405836/4517938", "text": "\nThroughout the year the people practise many old customs especially at Easter.On Easter Sunday morning they rise at six o'clock to see the sun dancing because that is the day that Jesus Christ rose from the dead.Everyone eats eggs on Easter Sunday and a few days before the children hide eggs in a corn stack or behind a ditch. They get the eggs from the neighbours.\n\n\n\nLong, long ago people practised a great many old customs on fair days and they do yet. Once a year there is a fair called the Lammas Fair, and the children are present that day. It is also called the Gooseberry Fair, as different kinds of fruit is sold that day.People sell woolen stockings. They come from Cloch-an-Liath and other places.\n", "school_info": "School: Más an Easa (C.)", "metadata": [{"Location:": "Masiness, Co. Donegal", "Teacher:": "\nMáire Ní Cholchuin\n"}, {"Collector": "Anna Kelly", "Gender": "female", "Address": "Masiness, Co. Donegal"}, {"Language": "Irish"}]}, "4493677/4409877/4522287": {"title": "Easter Houses", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1088, Page 039", "Page 039"], "url": "https://www.duchas.ie/en/cbes/4493677/4409877/4522287", "text": "\nIt is a common custom in this locality for children to make Easter houses.  They are made during Holy Week of sods.  Sods are placed on top of each other in a ring to form the walls.  The walls are generally built to a height of about three feet.  Groups of children co-operate in building them.  A fireplace of stones is placed in the centre.  The children light fires in these on Easter Monday and boil eggs there-on.  The group of children who built the particular Easter house gather to have a meal-which includes the eggs-in their Easter-house.\n", "school_info": "School: Ráth Mhaoláin (Robertson)", "metadata": [{"Location:": "Rathmullan, Co. Donegal", "Teacher:": "\nÉamonn Mac Stiopháin\n"}, {"Language": "English"}]}, "4493699/4412342/4525762": {"title": "Fáinne na Cásca", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1094, Page 408", "Page 408"], "url": "https://www.duchas.ie/en/cbes/4493699/4412342/4525762", "text": "\nAr  Domhnach na Slat  achan bhlían bíonn slatacha le na daoine chun Aifrinn  (palms) le cuimhne a coinneál ar an lá a shiubhal ar Slanuighthe-óir go luthghara fríd Iuraselem. Seo sean gnás ag na Gaedil i gcomhnuidhe. Giotaí crann a bheas leó in Eirinn ach igcómhnuidhe bionn  \" SLATACHA  DUBHA \" leo fosta (black rods ). Indhiadih iad a fhaghail coisre-eachta, ag an Aifreann, fágann síád na slatacha dubha le triomiú agus annsin deanann na daoine FAINNEADH dobhtha( LÉARÁID  FÁINNE )Tá seo trí nó ceithre uair níos mó nó an méid ceart.\n(continues on next page)\n", "school_info": "School: An Árd Leathan", "metadata": [{"Location:": "Altlahan, Co. Donegal", "Teacher:": "\nPádraig Mac Ailin\n"}, {"Collector": "Pádraig Mac Ailin", "Gender": "male", "Occupation": "múinteoir"}, {"Language": "Irish"}]}, "4493771/4418742/4534301": {"title": "Good Friday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1114, Page 300", "Page 300"], "url": "https://www.duchas.ie/en/cbes/4493771/4418742/4534301", "text": "\n(continued from previous page)\nold people would kneel down and say their prayers asking some petition as it was at that hour that Our Lord died on the cross.It was not considered lucky to churn on this day and they would not use any sharp instruments either.  They wouldn't do this as they would be reminded too forcibly of the scourging of Our Lord.\n\n\n\nOn this day a large fire is kindled in the open air on which the eggs are boiled.  The tea is made in the house and is taken out to the fire beside which all the children have gathered around.  After the tea is over the children get sweets and other dainties which they have secured safely from Lent.  All kinds of games are played then.  Long ago the mother would\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire, Carn Domhnaigh", "metadata": [{"Location:": "Ballylosky, Co. Donegal", "Teacher:": "\nAn tSr. M. Beirín Ní Bhaoighill\n"}, {"Language": "English"}]}, "4493776/4419269/4535279": {"title": "Feast and Festivals - St Brigid's Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1116, Page 121", "Page 121"], "url": "https://www.duchas.ie/en/cbes/4493776/4419269/4535279", "text": "\n(continued from previous page)\npeople put one over every door.\"Poundies\" is a local name for mashed potatoes. In some houses when the crosses are made they are wrapped in a white cloth and holy water is shaken on them Then they are left out all night. This cloth is a cure for a sore head and for the toothache. It is called bratóg Bhrighde. Some people put out a bowl in under a bush and if it rains that night the water in the bowl is kept as a cure for sickness.\n(continues on next page)\n\n\n\nOn that day shamrocks and emblems are worn by Catholics, Protestants and Presbyterians. The old people say:_\"On Patrick's Day throw candle and candle stick away\"The Sunday before lent is called \"Whispering Sunday\", because of the old people \"match-making\" when going to and from Chapel. The next day is called Galloping Monday because of the rush to get married.The next day is Shrove Tuesday because of boys and girls who wished to get married to people their parents didn't like left to the last day and kept it secret. On this day Pancakes are made for evening tea, and it is commonly known as Pancake Tuesday.\n\n\n\nChildren get up early to see the sun dance at  6. o'clock. It is supposed to give three Skips at this hour. In the afternoon they gather at an Easter House made of sods some time before.\n(continues on next page)\n", "school_info": "School: Glassalts", "metadata": [{"Location:": "Glasalt or Treanfasy, Co. Donegal", "Teacher:": "\nM. P. Ó Dochartaigh\n"}, {"Language": "English"}]}, "4493781/4419796/4538283": {"title": "The Customs of Easter Sunday and May Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1117, Page 226", "Page 226"], "url": "https://www.duchas.ie/en/cbes/4493781/4419796/4538283", "text": "\nThe Customs of Easter Sunday and May-eve.Of all the feasts of the Ecclesiastical Year, Easter Sunday is the most important. Likewise, its customs are of importance, which are, solely, remnants of the past. In this locality, the children practice the old-time custom of lighting a fire in the open air, and boiling eggs at it. The fire resembles the one lit by St. Patrick at Slane, and the eggs resemble the Resurrection,- namely as the young bird springs forth from the egg, so in the same manner, did Our Saviour, spring forth from the grave. Sometimes, the children pluck \"whin\" or furze blossoms, and boil them with the eggs, and this gives the shells a radiant yellow colour. They then sit around the fire, peel the skins off, and eat the eggs with salt.The local people believe the sun dances in the East on each Easter Sunday morning in memory of the resurrection, and this belief is confirmed by a few who have witnessed this strange thing.On the day before Easter Sunday\n(continues on next page)\n", "school_info": "School: Drong", "metadata": [{"Location:": "Drung, Co. Donegal", "Teacher:": "\nSeán P. Mac Gabhann\n"}, {"Collector": "Annie M. Harrigan", "Gender": "female", "Address": "Drung, Co. Donegal"}, {"Language": "English"}]}, "4493810/4423071/4539075": {"title": "Easter Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1124, Page 372", "Page 372"], "url": "https://www.duchas.ie/en/cbes/4493810/4423071/4539075", "text": "\nWhen our parents were children their customs for Easter were to make a scone of oatmeal an oval shape with a hole on the top of it this scone was called a Scrután.When this was baked it was tied with a woollen thread around their neck.Then they ate this scone with their eggs outside around their fires.It is said they who do this would not want anything until that day twelve month again.The most of the people who did these customs are dead and this customs is nearly forgotten and no one except very old people remember it.\n", "school_info": "School: Ceann Mhálainne", "metadata": [{"Location:": "Ardmalin, Co. Donegal", "Teacher:": "\nSeán S. Ó Coigligh\n"}, {"Collector": "Mary Ann Gallagher", "Gender": "female", "Address": "Ardmalin, Co. Donegal"}, {"Language": "English"}]}, "4493796/4421510/4540308": {"title": "Easter Sunday, May Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1121, Page 226", "Page 226"], "url": "https://www.duchas.ie/en/cbes/4493796/4421510/4540308", "text": "\nEASTER SUNDAY:-The old people say that Easter got its name because of the numbers of eggs which were eaten by the people on that day. The old people would eat no eggs in Lent and they would not sell them as they would get a bad price for them so they kept them. On Easter Sunday they would have a terrible lot so they would eat them.MAY-DAYThere are a lot of old stories told about \"May Day\". The people say that it is terrible unlucky to have the first smoke in a town on this morning. The old people say that any bread or meat which was made before May Day shouldl not be eaten that day because the fairies stole the real thing and left in its place a piece of turf or clay of the same shape. The fairies are said to go about that morning trying to do all the harm they can.Bridie DohertyCloughfinClonmanyGot from my father\n", "school_info": "School: Gaduidhe Dubh (C.)", "metadata": [{"Location:": "Gaddyduff, Co. Donegal", "Teacher:": "\nCáitlín Ní Mhiothagáin\n"}, {"Collector": "Bridie Doherty", "Gender": "female", "Address": "1419774"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "male"}, {"Language": "English"}]}, "4583331/4580249/4591703": {"title": "Festival Customs - Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0055, Page 0121", "Page 0121"], "url": "https://www.duchas.ie/en/cbes/4583331/4580249/4591703", "text": "\nEaster SundayIt is believed that the sun dances when rising on Easter Sunday morning, it is supposed to be rejoicing on account of the Resurrection of Our Lord.  On this day people eat as many eggs as they wish to have.  Children are also treated to chocolate eggs on Easter Sunday.\n\n\n\nWhit SundayA foal born on Whit Sunday is considered unlucky, and it is believed he will cause somebody's death.  Children born on Whit Sunday are believed to be awkward.  People do not bathe on Whit Sunday.\n", "school_info": "School: Baile Mór Síl Anmchadha (Laurencetown)", "metadata": [{"Location:": "Laurencetown, Co. Galway", "Teacher:": "\nSeán Ó Cogaidhín\n"}, {"Language": "English"}]}, "4622978/4619869/4629381": {"title": "Garraí na Sióg", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0074, Page 280", "Page 280"], "url": "https://www.duchas.ie/en/cbes/4622978/4619869/4629381", "text": "\n(continued from previous page)\n[-]\n\n\n\nBíonn Pruthóg ag na páistíbh Domnach Cásca. Bíonn teach beag deanta acu amuigh ins an bpáirc. Deanann siad teine le h-aghaidh an tae a dheanamh agus na h-uibheacha a bhruith agus bíonn féasta acu. Itheann siad go-leór uibheacha, cistí milis, uibheacha cásca, milseáin, brioscaí, aráin agus im. Agus glaodhtar ar an bféasta Pruthóg Cásca.Deirtear go mbíonn an grian ag damhsadh le teann áthais maidin Domhnaigh Cásca mar gheall ar Éis Eirghe Íosa Críosta agus an dhuine a fheiceas í ag damhsadh rachaidh sé go Flaithis go cinnte.\n", "school_info": "School: Coill Maolacáin", "metadata": [{"Location:": "Kilmeelickin, Co. Galway", "Teacher:": "\nAnna M. Ní Loingsigh\n"}, {"Collector": "Máire Ní Stancáird", "Gender": "female", "Address": "Kilmeelickin, Co. Galway"}, {"Informant": "Éilis Ní Mháille", "Relation": "grandparent", "Gender": "female", "Address": "Kilmeelickin, Co. Galway"}, {"Language": "Irish"}]}, "4622991/4621523/4629419": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0077, Page 254", "Page 254"], "url": "https://www.duchas.ie/en/cbes/4622991/4621523/4629419", "text": "\nBoxty Bread was made from raw potatoes and oatmeal. The pot cake was made from oatmeal and bacon boiled together.Sowen Cheerings were made from oatmeal and water and left up for a week to get sour. This was a drink used in Summer time.\n\n\n\nThe cure of the nine irons.If any body had sore feet, they made the sign of the cross on the sore with each iron. After a short time it was healed.\n\n\n\nThey had great feasts in Easter houses at Easter time. Dances were held in barns during the winter and on the roadside in summer time. The piper played and when the dance was over he went around holding out a plate on which everybody left a few\n(continues on next page)\n", "school_info": "School: Naomh Seosamh, Baile an Ruadháin", "metadata": [{"Location:": "Ballinrooaun, Co. Galway", "Teacher:": "\nMrs Nora Lally\n"}, {"Language": "English"}]}, "4622985/4620888/4630610": {"title": "Lá Fhéile Pádraig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0076, Page 184", "Page 184"], "url": "https://www.duchas.ie/en/cbes/4622985/4620888/4630610", "text": "\n(continued from previous page)\nar an bhfairche nach mbíonn in aon áit eile sé sin patrún agus bíonn go leor daoine ann. Máire Nic AodhagáinCill BhrighdeÓMairtín Mac AodhagáinCill Bhrighde\n\n\n\nDomhnach CásgaTagann Domhnach Cásga gach bliadhain act ní thagann sé an dáta ceadhna gach bliadhain. Tugtar omós mór don lá sin mar sin é an lá a deirigh ár slanightheoir ón marbh agus tá grádh mór ag daoine na hEireann don lá sin ó shoin go mór mór na páistí beaga. Is fada leo go d’tagadh an lá bíonn an oiread sin suim acu ann.\n(continues on next page)\n", "school_info": "School: Clochar ar an bhFáirche", "metadata": [{"Location:": "Clonbur, Co. Galway", "Teacher:": "\nSiúr Iarfhlaith Ní Mhóráin\n"}, {"Collector": "Áine Ní Shomacháin", "Gender": "female", "Address": "Kilbride, Co. Mayo"}, {"Informant": "Micheál Ó Shomacháin", "Gender": "male", "Address": "Kilbride, Co. Mayo"}, {"Language": "Irish"}]}, "4622985/4620895/4630615": {"title": "Domhnach Cásca", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0076, Page 191", "Page 191"], "url": "https://www.duchas.ie/en/cbes/4622985/4620895/4630615", "text": "\nDomhnach Cásga  Bíonn an spórt ag an aos óg Domhnach Cásga déanann siad bruthóg. Téigheann cuigear nó seisear aca ar an gCéad Aifrean agus nuair a thagann siad abhaile déanann siad bruthóg. Tógann gach duine aca cupla ubh leis agus déanann siad teine amuigh sa páirc. Is é Dómhnach Cásga ceann de na féasta is mó san mbliadhain. Tagann sé gach bliadhain. Tugann na daoine an-onóir don lá sin. Ní thagann Domhnach Cásga ar an dáta céadhna gach bliadhain . Ar maidin Domhnaigh Cáscga deirtear go mbíonn an ghrian ag damhsadh. Bíonn go leor rudaí deasa eile seachas na h-uibheacha bíonn cacaí milse agus briosca agus milseáin acu agus go leor rudaí deas eile.\n(continues on next page)\n", "school_info": "School: Clochar ar an bhFáirche", "metadata": [{"Location:": "Clonbur, Co. Galway", "Teacher:": "\nSiúr Iarfhlaith Ní Mhóráin\n"}, {"Collector": "Máire Nic Aodhagáin", "Gender": "female", "Address": "Kilbride, Co. Mayo"}, {"Informant": "Máirtín Mac Aodhagáin", "Gender": "male", "Address": "Kilbride, Co. Mayo"}, {"Language": "Irish"}]}, "4602737/4599777/4633483": {"title": "An Easter Time Custom", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0193, Page 330", "Page 330"], "url": "https://www.duchas.ie/en/cbes/4602737/4599777/4633483", "text": "\nA small house is built out on the hills. A few \"coals\" are brought out and put inside of the house. An old can is then got. Eggs are put in it and boiled. Salt spoons and bread are then got and the eggs are eaten out on the hills\n\n\n\nThe Famine affected this district just as it did the rest of the country. The rotten potatoes were put along with the good ones after the digging with the result that there was very little seed the following year. James Dolan, Tullentloy, Kiltyclogher, heard people say that they saw children standing around their mothers crying with hunger. They had nothing to give them only a little crust of bread. The people had sold all their oats to England and there was no wheat to sell to the mill to get flour to make bread so that when the potatoes failed they died of starvation. Any people that had enough money emigrated and when they saved a little sent it home to their starving relations. There were a number of houses then occupied which are now in ruins owing to emigration and death. Those that separated the good potatoes from the rotten ones had seed for the following years. There came sickness after the famine which swept away the majority of those who were left.\n", "school_info": "School: Corra Cluana", "metadata": [{"Location:": "Corracloona, Co. Leitrim", "Teacher:": "\nPádraig Ó Caomháin\n"}, {"Informant": "Margaret Mc Morrow", "Gender": "female", "Address": "Tullintloy, Co. Leitrim"}, {"Language": "English"}]}, "4605924/4602923/4643577": {"title": "A Local Holy Well", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0202, Page 119", "Page 119"], "url": "https://www.duchas.ie/en/cbes/4605924/4602923/4643577", "text": "\nThe Local Holy Well that I know of in this part of the District is a well in the Village of Killargue. The Well is about three miles distant from the place where I live. It is under the side of a rock and there is a big green field around the well. I visit that well oftenest and these are the certain days I visit it the 15th of August and the 8th of September because people say the Blessed Virgin was once seen at the place where the well is now situated by a person named Miss McMorrow who is now dead is said to have seen the Vision.All around the well a number of bushes are growing and it is a these bushes certain prayers are said when people perform the \"Stations\"The scenery around the well is very beautiful.\n\n\n\nEaster Sunday is a great feast day. It is kept  in honour of the rising of our Lord from the dead.There are alot of customs observed on that day now as well as in olden times.The people eat alot of eggs and the children\n(continues on next page)\n", "school_info": "School: Ardvarney", "metadata": [{"Location:": "Ardvarney, Co. Leitrim", "Teacher:": "\nMáire, Bean Uí Amhaltúin\n"}, {"Collector": "Veronica Mc Govern", "Gender": "female", "Age": "13", "Address": "Cleen, Co. Leitrim"}, {"Language": "English"}]}, "4644827/4613040/4651175": {"title": "St Patrick's Crosses", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0408, Page 179", "Page 179"], "url": "https://www.duchas.ie/en/cbes/4644827/4613040/4651175", "text": "\nSilk and velvet little ribbons were sewn on to a cardboard cross covered with ribbon. A nice like bunch of ribbons were sewn on to each end of the cross and the nicest bunch was kept for the centre of the cross. On St Patrick's day the children wore these crosses on their shoulders. They were very fond of these brightly coloured crosses. The old people saved up pieces of ribbon from hats and bonnets and kept them for favourite children coming to the house, for the purpose of making these crosses.\n\n\n\nSmall eggs were collected and boiled with blossoms of furze and grass to colour them. Then the children who usually visited the house, and the children of the house went out into a field on Easter Sunday and some one threw the eggs one\n(continues on next page)\n", "school_info": "School: An Drom Clochach (B.)", "metadata": [{"Location:": "Dromclogh, Co. Kerry", "Teacher:": "\nPártholán Ó Ruadhacháin\n"}, {"Collector": "Mrs Norah Costello", "Gender": "female", "Occupation": "assistant teacher"}, {"Informant": "Michael Costello", "Gender": "male", "Age": "78", "Address": "Ballyhorgan East, Co. Kerry"}, {"Language": "English"}]}, "4658430/4654717/4659502": {"title": "The Straws", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0221, Page 116", "Page 116"], "url": "https://www.duchas.ie/en/cbes/4658430/4654717/4659502", "text": "\nTaken down from my father John Kilkenny who heard it from the old people.Very long ago they used to have great fun and diversion on Easter Sunday evening. All the lads and lassies, pipers, fiddlers and flute players used to gather together in an open field.\n(continues on next page)\n", "school_info": "School: Drumloughan (Dromlachan)", "metadata": [{"Location:": "Sunnagh More, Co. Leitrim", "Teacher:": "\nPeadar Mac Giolla Choinnigh\n"}, {"Collector": "P. Mac Giolla Choinnigh", "Gender": "male"}, {"Informant": "John Kilkenny", "Relation": "parent", "Gender": "male", "Age": "66", "Address": "Drumshanbo, Co. Leitrim"}, {"Language": "English"}]}, "4591084/4589007/4660556": {"title": "Lá Fhéile Muire", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0011, Page 269", "Page 269"], "url": "https://www.duchas.ie/en/cbes/4591084/4589007/4660556", "text": "\nTagann Lá Fhéile Mhuire san bhfoghmhar igcomhnaidhe. Téigheann na daoine ag tabhairt turas cuighe tobar Rí an Domnaigh an uair sin. Tá an tobar sin an beannuighthe ar fad, agus duine bhith a tugh turas ar an lá sin bíodh se go máith tamall  na dhiaidh sin. Nuair a théigheann duine ag tabhairt turas cuighe tobar mar sin fágann siad leabhar nó bláthanna ann. Níl aon máith ann mar a bhfuil siad beannuighthe. Ní téigheann aon duine ag tobar  mar sin,  mar a mbíonn siad go dona. Tá an tobar sin i bhfad o'n aith seo, agus téigheann duine as an aith seo ag tabhairt turas cuighe. Tagann an lá sin ar Dia Domhnaigh i gcomhnaidhe. Is maith le na duine uilig dul ag tabhairt turas cuighe tobar beannuighthe mar sin. Bhíonn an athás ar na daoine, nuair a bíonns an turas tugtha achu, agus iad san mbhaile arís.Bartlaí Ó ClochartaighÁrdmóir\n\n\n\nDomhnac CáscaTágann Domnac Casca ar an Domnac deireanach den caraois. Bhíonn an lá sin i gcuimre ar\n(continues on next page)\n", "school_info": "School: Árd Mhór", "metadata": [{"Location:": "Ardmore, Co. Galway", "Teacher:": "\nPádhraic Ó Gleasáin\n"}, {"Collector": "Antoine O Flaitbearthaigh", "Gender": "male", "Address": "Ardmore, Co. Galway"}, {"Language": "Irish"}]}, "4658459/4657741/4668576": {"title": "How the Festival of Easter Was Kept here 40 Years Ago", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0228, Page 089", "Page 089"], "url": "https://www.duchas.ie/en/cbes/4658459/4657741/4668576", "text": "\nForty years ago on an Easter Sunday morning most of the members of the family in a country house got up at daylight to see the Sun dancing. Then they put on a pot of potatoes and anyone that was not going to Holy Communion ate potatoes and as many eggs as they could eat.When they came home from Mass, dinner was got. In the evening the children prepared what they called a \"cludóg\" that is they made a fire outside and boiled eggs and ate as many eggs as they could with bread and milk.\n\n\n\nAbout forty years ago this is how the festival of Christmas was kept around here. About a week before Xmas the younger members of the family began to clean the house. It was whitewashed inside and outside, the furniture was newly painted, pictures taken out of their frames and dusted and put back again. When the house was clean, three days before Xmas, the man and woman of the house went to the country shop at which they bought groceries the whole year round\n(continues on next page)\n", "school_info": "School: Druim Bréan Lios", "metadata": [{"Location:": "Drumbreanlis, Co. Leitrim", "Teacher:": "\nEibhlín Nic Ghuidhir\n"}, {"Informant": "Mrs H. Duffy", "Gender": "female", "Age": "86"}, {"Language": "English"}]}, "4605949/4605148/4673101": {"title": "Festival Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0207, Page 071", "Page 071"], "url": "https://www.duchas.ie/en/cbes/4605949/4605148/4673101", "text": "\n(continued from previous page)\non the tenth of November. The following custom is the only one I know of. A fowl is killed and the blood of it is sprinkled round the four corners of the house so as to keep away all evil spirits.The old people believed that at this period of the year there were evil spirits going about.\n\n\n\nOn \"Easter Sunday\" the people get up early to see the sun dancing. It is said that the sun dances with joy because of the resurrection of our Saviour.An old custom kept by the people is the eating of eggs and in a house where\n(continues on next page)\n", "school_info": "School: Drumshanbo (C.)", "metadata": [{"Location:": "Drumshanbo, Co. Leitrim", "Teacher:": "\nMargaret Flynn\n"}, {"Collector": "Kathleen Gilhooly", "Gender": "female"}, {"Language": "English"}]}, "4687714/4686481/4689779": {"title": "Féilí na Bliana - Easter", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0434, Page 161", "Page 161"], "url": "https://www.duchas.ie/en/cbes/4687714/4686481/4689779", "text": "\nLong ago the people used to get up on Easter Sunday Morning to see the sun and moon dancing. It was said to start at three minutes to six. They used to dance in rejoicing for Our Lord's resurrection.On Easter Sunday morning they have a competition in some houses to see who would eat the most eggs.Some people used\n(continues on next page)\n", "school_info": "School: Killorglin (C.)", "metadata": [{"Location:": "Killorglin, Co. Kerry", "Teacher:": "\nÚna Nic Coluin\n"}, {"Collector": "Eibhlín Níc Chárrtha", "Gender": "female", "Address": "Killorglin, Co. Kerry"}, {"Language": "English"}]}, "4687719/4687009/4708685": {"title": "Féilte na Bliana - Céadaoin an Luaithrigh", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0435, Page 386", "Page 386"], "url": "https://www.duchas.ie/en/cbes/4687719/4687009/4708685", "text": "\n(continued from previous page)\níacal ortha a gcuid té d'ól dubh gan rían bainne uirthe. Níor bféidir leó ím do thógaint ná uibheaca do thógaint i gcóir na béilí. Téigheadh daoine go raibh chreideamh maith aca go h-Aifrinn an lá seo cun an luaithridh beannuighthe d'fhághailt.\n\n\n\nBíodh a lán meas ag na sean daoine ar Domhnach Cásga mar is an lá san a ais eirig Críost. Téigeadh na daoine go léir ag glacadh Comaoine Naomhta an lá seo. Deireann an sean fhocal \"Domhnach Cásga is mór an náire bheith gan feóil\" Bíodh laoigh fheóil aca i gcóir dínnéir.Cuiridís síos corcán mór lán d'uibheaca an lá seo agus bíodh féasta mór aca. Itheadh siad na h-uibhe le sliogán mar ná bheadh spúineóga aca. Bíodh éadaighe nuadh aca i gcomhnuidhe Domhnach Cásga mar a deireann an sean-fhocal \"Bíadh agus deoch do'n Nodhlag agus éadach nuadh do'n Cásg\"\n(continues on next page)\n", "school_info": "School: Dubhghlas (C.)", "metadata": [{"Location:": "Douglas, Co. Kerry", "Teacher:": "\nEibhlín, Bean de Róiste\n"}, {"Collector": "Síle Máire Ní Dhuígín", "Gender": "female", "Address": "Killorglin, Co. Kerry"}, {"Informant": "Seán P. Ó Dhuigín", "Gender": "male", "Age": "86", "Address": "Killorglin, Co. Kerry"}, {"Language": "Irish"}]}, "4687719/4687013/4708702": {"title": "Féilte na Bliana - Carghas", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0435, Page 390", "Page 390"], "url": "https://www.duchas.ie/en/cbes/4687719/4687013/4708702", "text": "\n(continued from previous page)\nUaireannta ní thógadh na seandaoine aon biadh ó trí a'chlog Aoine an Céásda go dtí breachadh an lae Domhnach Cásga.\n\n\n\nDomhnach Cásga is mór an náire bheith gan feóil. Fadó bhíodh laoigh fheóil ag na daoine i gcóir an dinnéir Domhnach Cásga. Ghlachaidís Comaoine Naomhtha gach aon Domhnach Cásga. Chuiridís corcán uibheaca ar an dteine agus in aon áit in a bhfuil a lán daoine gheibhidís sliogán cun iad d'ithe.\" Ithe agus ól do'n Nodlag, agus éaduighe nuadh do'n gCásg.Fadó chaithidís éadaig nuadh an lá seo. Do bhíodh Domhnach Cásga ar nós  \" Aonach a Puic \" anois. Ar maidin do théighidís go dtí an t-séipéil cun Aifrinn do chlos.Do chaithidís an cuid eile de'n lá sa bhaile mhór ag rinnce, ag déanamh amhránuideacht agus ag caitheamh aimsire in gach slighe is a mbéidir leó.\n(continues on next page)\n", "school_info": "School: Dubhghlas (C.)", "metadata": [{"Location:": "Douglas, Co. Kerry", "Teacher:": "\nEibhlín, Bean de Róiste\n"}, {"Collector": "Cáit Ní hEachthegeirn", "Gender": "female", "Address": "Tullig More, Co. Kerry"}, {"Informant": "Mícheál de hÓr", "Gender": "male", "Age": "73", "Address": "Tullig More, Co. Kerry"}, {"Language": "Irish"}]}, "4701700/4693779/4721660": {"title": "Festival Customs - Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0169, Page 231", "Page 231"], "url": "https://www.duchas.ie/en/cbes/4701700/4693779/4721660", "text": "\nOn Easter Sunday the people bring home holy water and they sprinkle it on the crops.\n", "school_info": "School: Páirc Árd (High Park)", "metadata": [{"Location:": "Carrowgilhooly, Co. Sligo", "Teacher:": "\nEoghan Ó Conaill\n"}, {"Collector": "Annie Browne", "Gender": "female", "Address": "Carrowbrickeen, Co. Sligo"}, {"Informant": "Mrs Browne", "Gender": "female", "Age": "56", "Address": "Carrowbrickeen, Co. Sligo"}, {"Language": "English"}]}, "4701770/4701320/4727222": {"title": "Christmas Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0188, Page 087", "Page 087"], "url": "https://www.duchas.ie/en/cbes/4701770/4701320/4727222", "text": "\n(continued from previous page)\nSmaller groups have harmonicas or fifes or tin whistles. Some of them have a good step dancer with them and then they collect money. Gradually this custom is dying out - one or two groups now only visiting where formerly there used to be as many as ten or twelve.\n\n\n\nShamrock badges and green ribbons are worn - the men wear the Shamrock in their hats.\n\n\n\nPancakes are made and eaten in almost every house in the district.\n\n\n\nUntil quite recently old people used to go from house to house begging eggs - These poor travelling people were well known to people of fifty years ago. Some names of those  which I have heard my father ( RIP ) mention were Kitty the Maid, Mary High Bog, Soft Ann, John Sampey. These travelled great distances and brought the news from one place to another.\n", "school_info": "School: St. Michael's Clooncunny", "metadata": [{"Location:": "Clooncunny, Co. Sligo", "Teacher:": "\nÚna, Bean Uí Stondúin\n"}, {"Language": "English"}]}, "4701770/4701321/4727228": {"title": "Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0188, Page 088", "Page 088"], "url": "https://www.duchas.ie/en/cbes/4701770/4701321/4727228", "text": "\nUntil quite recently the young people use to build a little hut usually in the bog and cook eggs there on Easter Sunday. The young people still strive to see who will eat the most number of eggs on Easter Sunday. It is a firm local belief that the Sun dances on Easter Sunday morning and many who have got up at dawn to witness this phenomenon declare that such is the case.\n\n\n\nI can find no trace of any local customs for this feast.\n\n\n\nBonfires are still built in this area and coals from the dying fire brought and thrown into the tilled fields to bless the crops for the year.\n\n\n\nA fowl is killed and the blood spilled for St Martin to prevent sickness or death in the year. It is a believe that\n(continues on next page)\n", "school_info": "School: St. Michael's Clooncunny", "metadata": [{"Location:": "Clooncunny, Co. Sligo", "Teacher:": "\nÚna, Bean Uí Stondúin\n"}, {"Language": "English"}]}, "4723815/4716029/4760384": {"title": "Cúig Chéimeanna an Phósta", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0934, Page 353", "Page 353"], "url": "https://www.duchas.ie/en/cbes/4723815/4716029/4760384", "text": "\n(continued from previous page)\nmí-adhbhárach le deor dílleachtuidhe nó mallacht baintreabaigheSeacht sgalladh do chriodhe ort!Is léar do’n Dall a bhéal.Go rabh tarraingt do láimhe agat!Phós mé bean mar gheall ar eallach,Thainic an geimhreadh is d’fheann sé an t-eallachIs tá mé ‘nois gan bhean nó eallach.Éist le tuile na h-abhna agus gabhfaidh tú breac.\n\n\n\nFadhó shoin nuair a bhíodh an breicfeasta réidh agus bunadh an toighe 'na suidhe thart fá'n mbórd leis an bhreicfeasta d'uibheacha ithe, d'eírigheadh fear an toighe agus thugadh sé ubh agus spanóg leis go dtí an doras. Sheasadh sé ins an doras agus bhriseadh sé an ubh. Chaitheadh sé giota de'n uibh amach agus giota eile isteach agus annsin giota amach agus giota isteach an dara h-uair. Deireadh sé na focla seo de réir mar bhí sé á gcaitheamh amach is isteach!\" Carghas amach,Caísg isteachA' donas amachA' sonas isteach.\"Annsin shuidheadh sé shíos  agus thoisigheadh siad  uilig ar an bhreicfeasta ithe.Tomás Ó Beirn,Liosdúnaina d'nnis.S.O'M.\n", "school_info": "School: Cor Críochach", "metadata": [{"Location:": "Corcreeghagh, Co. Monaghan", "Teacher:": "\nSs. Ó Muireadhaigh\n"}, {"Collector": "Séamus Ó Muireadhaigh", "Gender": "male", "Occupation": "múinteoir"}, {"Informant": "Tomás Ó Beirn", "Gender": "male", "Address": "Lisdoonan, Co. Monaghan"}, {"Language": "Irish"}]}, "4758455/4745480/4779236": {"title": "A Story told about Churning", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0231, Page 253", "Page 253"], "url": "https://www.duchas.ie/en/cbes/4758455/4745480/4779236", "text": "\n(continued from previous page)\nman where he threw the coal he lit his pipe with and when he told them they dug there and discovered all the butter.\n\n\n\nEaster is one of the greatest feasts of the whole year.  It is a movable feast, but it is always on the Sunday following Good Friday as it commemorates the Resurrection of Our Lord.There are many customs on Easter Sunday, one is to eat eggs and the children never neglect this one.  Another custom is to send cards and greetings to your friends.  It is a very old custom in Ireland, to say when you go into a house at Easter \"My Easter eggs on you\" and then the woman of the house would give you an egg for yourself.It is said that the sun dances on Easter Sunday with joy at Our Lord's Resurrection.  It is also believed\n(continues on next page)\n", "school_info": "School: Drom Bhaoghalláin", "metadata": [{"Location:": "Ardcarn, Co. Roscommon", "Teacher:": "\nM. Pagnam\n"}, {"Collector": "Peggy Gallagher", "Gender": "female"}, {"Language": "English"}]}, "4706346/4704676/4779980": {"title": "Festival Customs - Chalk Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0444, Page 453", "Page 453"], "url": "https://www.duchas.ie/en/cbes/4706346/4704676/4779980", "text": "\n(continued from previous page)\nis the last Sunday of Shrove, and that  on that day the men used have chalks and chalked everybody that was the age to get married but did not.\n\n\n\nMrs E. Reidy of Maglass, aged 70, said she never heard of Chalk Sunday, but of something similar called \" Punching Day \". If a father did not get his daughters or sons ( who were well marriageable ) married during Shrove he was attacked and punched with sticks by people who dressed up as wren boys. When they entered the house they said \" Why did you not get your son ( or daughter )  married this year ?  \". Then they commenced punching or prodding him with the sticks and often \"made him sore\". She told me that she heard of 2 marriageable daughters who dressed up one night in mens' clothes and attacked their own father for not making any effort to get them married. She said that when they went to confession afterwards they were refused absolution until they did penance.This \" Punching Day \" was generally held on Shrove Tuesday night as far as she knows.Shrove Tuesday falls on the night before Ash Wednesday. Pancakes are made and eaten - as a farewell feast to Shrove.Easter Sunday is the first Sunday after Lent. In the old times, no eggs were eaten during Lent therefore there were many eggs spared for Easter Sunday. Tea was taken black on \"Black Fast Days\". Pots of eggs\n\n\n\nShrove Tuesday falls on the night before Ash Wednesday. Pancakes are made and eaten as  a farewell feast to Shrove.\n\n\n\nEaster Sunday is the first Sunday after Lent. In the old times no eggs were eaten during Lent therefore there were many eggs spared for Easter Sunday. Tea was taken black on \" Black Fast Days \". Pots of eggs\n(continues on next page)\n", "school_info": "School: O'Brennan, Baile Mhic Ealgóid, Tráighlí", "metadata": [{"Location:": "Tonreagh Lower, Co. Kerry", "Teacher:": "\nPádraig Ó Loingsigh\n"}, {"Language": "English"}]}, "4742169/4741809/4815825": {"title": "Festival Customs - Easter", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0775, Page 287", "Page 287"], "url": "https://www.duchas.ie/en/cbes/4742169/4741809/4815825", "text": "\nEasterEaster comes every year in the Spring. On the first Easter Sunday, Christ rose from the dead. It is said that the sun dances for joy on Easter morning.  People eat a lot of eggs on EasterMorning. Children eat sweet Easter  eggs. Some people get presents and Easter cards from their friends at Easter. Children who are going to school get holidays. People like new clothes at Easter. There is an old proverb about it. \"Clothes at Easter, and food and drink at Christmas.Easter Sunday.Easter morning Christ rose from the dead. There are services in every Church on when Christ rose. It is called easter Sunday. People try to eat as many eggs as they can on Easter Sunday.There is an old rhyme at the Irish people about it:An egg for a gentleman,Two eggs for a l man,Three eggs for a bog man.Bunty Gray\n", "school_info": "School: Kilmeague, Naas", "metadata": [{"Location:": "Kilmeage, Co. Kildare", "Teacher:": "\nBean Mhic Thomáis\n"}, {"Collector": "Bunty Gray"}, {"Language": "English"}]}, "4770044/4768872/4818417": {"title": "Easter Saturday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0836, Page 120", "Page 120"], "url": "https://www.duchas.ie/en/cbes/4770044/4768872/4818417", "text": "\nOn Easter Saturday young boys and girls go round to houses looking for Easter  \" Coobógs \".   (eggs)Easter Sunday.1. People get up very early and go out to see if the sun in shining. The sun is supposed to dance on Easter Sunday morning.2. People eat as many boiled eggs as they are able for breakfast usually two or three.\n\n\n\nHoly water is sprinkled in the corners of each field. Each animal on the farm is sprinkled with Holy water also as well as each House, stable, cowhouse\n", "school_info": "School: Ballyadams", "metadata": [{"Location:": "Ballyadams, Co. Laois", "Teacher:": "\nP. Ó Bruadair\n"}, {"Language": "English"}]}, "4798671/4788983/4836919": {"title": "All Fool's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0239, Page 147", "Page 147"], "url": "https://www.duchas.ie/en/cbes/4798671/4788983/4836919", "text": "\n'All fool's day\" falls on the 1st of April, and on that day people have a custom which is –Everyone one tries to makea fool of another person, by saying that something terrible has happened or other things of the kind. If the one they say it to believes them, they call him \"April Fool\"\n\n\n\nThere is an old custom regarding Easter Sunday.The people + children eat as many eggs as they are able. If any of the young children go into a house the woman gives him an egg + when [\"they\" struck out and within parentheses; \"he\" written above] goes home [\"they\" struck out and within parentheses; \"he\" written above] eats it.This old custom is surely practised by everybody round here.S. Ní Doraiḋ\n", "school_info": "School: Mullach na Sídhe (C.)", "metadata": [{"Location:": "Fairymount, Co. Roscommon", "Teacher:": "\nBean Uí Dhubhthaigh\n"}, {"Collector": "S. Ní Doraidh", "Gender": "female"}, {"Language": "English"}]}, "4798725/4793649/4926806": {"title": "Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0259, Page 027", "Page 027"], "url": "https://www.duchas.ie/en/cbes/4798725/4793649/4926806", "text": "\nWe have holidays from school for Easter Sunday and for a few days after. If you get up early Easter Sunday you will see the Sun dancing in honour of Our Savour who rose from the dead on the first Easter Sunday. Everyone eats three eggs at least when they come home from Mass. We eat as many eggs as we can on that day because we are not allowed to eat so many any other time.I like like Easter Sunday morning  very well.\n(continues on next page)\n", "school_info": "School: Cúl Seachtaine", "metadata": [{"Location:": "Coolshaghtena, Co. Roscommon", "Teacher:": "\nCaitlín Nic Dhonnchadha\n"}, {"Collector": "Ellie A. Corcoran", "Gender": "female", "Address": "Cloonaddra, Co. Roscommon"}, {"Informant": "Mrs Corcoran", "Gender": "female", "Age": "59", "Address": "Cloonaddra, Co. Roscommon"}, {"Language": "English"}]}, "4922324/4870198/4933691": {"title": "Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0602, Page 098", "Page 098"], "url": "https://www.duchas.ie/en/cbes/4922324/4870198/4933691", "text": "\nOn Easter Sunday it is a custom in nearly every home to eat many eggs. The people get up early to see the sun rising as it is said that the sun dances when it is rising on this morning. Sometimes they sprinkle the Easter Water on the land this day so as that they would have good crops for the year.St. John's Day. On St. John's Day children go about to collect sticks and they also get turf in the different houses. This night a bon-fire is lighted in memory of St. John and all the children come to this fire.\n\n\n\nTinkers. The Mc. Carthys and Caseys and Faulkners are the tinkers to be seen in our district. They come here whenever there is a fair being held and they remain for a few days. before and after the fair. Sometimes they come to sell tin vessels about the country, sometimes the people buy these vessels from them or if not they ask them for charity. They make the tin vessels themselves by the roadside. The people dont usually have any welcome for these people but they remain until they get some\n(continues on next page)\n", "school_info": "School: Lacken (B.), Cill Mhichíl", "metadata": [{"Location:": "Lacken, Co. Clare", "Teacher:": "\nM. Ó Maonaigh\n"}, {"Collector": "Seán Fitzpatrick", "Gender": "male", "Address": "Kilmihil, Co. Clare"}, {"Informant": "Jack Clancy", "Gender": "male", "Address": "Kilmihil, Co. Clare"}, {"Language": "English"}]}, "4723809/4715430/4939263": {"title": "Customs at Easter Time", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0929, Page 065", "Page 065"], "url": "https://www.duchas.ie/en/cbes/4723809/4715430/4939263", "text": "\nIn many places certain people go round to strange houses on Spy Wednesday, and they ask money of the people of the house. If the people refuse to give them any money, they will overlook some of the cattle or fowl, and these things will die in a short time afterwards.On Easter Sunday morning several people used to rise shortly after day-break for the purpose of boiling potatoes for the breakfast. The people who were not fasting used to eat them before going to mass, and those who  were fasting  would eat them when came home for their breakfast.On Easter Saturday the children join together, and gather a bundle of sticks, then they lay the place for a fire. About tea time on Easter Sunday they carry all their provisions out to a field, and some of the big girls cook the meal. After the feast they start to play games.On Good Friday many people take black tea and bread without butter in honour of Our Lord when dying on the cross asked for a drink and they handed him gall.\n", "school_info": "School: Cill Eirc", "metadata": [{"Location:": "Killark, Co. Monaghan", "Teacher:": "\nS. Mac Druaidhe\n"}, {"Language": "English"}]}, "4723809/4715438/4939274": {"title": "Customs at Easter Time", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0929, Page 073", "Page 073"], "url": "https://www.duchas.ie/en/cbes/4723809/4715438/4939274", "text": "\nOn Easter Sunday morning many of the old people bring eggs, and salt to the church to be blessed by the priest.It is a custom for the people to eat eggs on Easter Sunday, and also Easter Monday. On Good Friday the people used to kneel and pray from twelve until three o'clock in honour of the three hours our Lord was dying on the Cross.If any person washes clothes on Good Friday, it is said that when they are taking them in they will be covered with blood.On Easter Monday they used to make pancakes, and in one of them they used to put a ring. It was the common belief of the people that the person who would get the ring would be married before anyone else in the house.On Easter Sunday people go to the church to pray, and make the holy hour.On Easter Sunday a number of boys and girls come together and bring out tea  and provisions with them to a nice green field. There they light a big fire and make tea. When they have the tea made they put on eggs and boil them. They usually boil them hard and roll\n(continues on next page)\n", "school_info": "School: Cill Eirc", "metadata": [{"Location:": "Killark, Co. Monaghan", "Teacher:": "\nS. Mac Druaidhe\n"}, {"Language": "English"}]}, "4921968/4914243/4942914": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0489, Page 223", "Page 223"], "url": "https://www.duchas.ie/en/cbes/4921968/4914243/4942914", "text": "\nOn Easter Sunday about fifty years ago there was a football match in Knockaderry between Feenagh and Kilmeedy. At the last half hour as the match was very exciting and as the Kilmeedy team were on the points of winning the match, a young man from the Feenagh team picked up the ball and ran with it. He ran across the fields and it is said that he kept on running, kicking the ball before him till he arrived at Feenagh at half past five. After that he was counted a great runner.\n", "school_info": "School: Áth an Lín (B.), Baile an Gharrdha", "metadata": [{"Location:": "Aughalin, Co. Limerick", "Teacher:": "\nMichael de Búrca\n"}, {"Collector": "Eamonn Ó Duinneacar", "Gender": "male", "Address": "Knockaderry, Co. Limerick"}, {"Informant": "Seán Ó Donnagáin", "Gender": "male", "Age": "56", "Occupation": "oibrí", "Address": "Knockaderry, Co. Limerick"}, {"Language": "English"}]}, "4922085/4850906/4946446": {"title": "Priest Hunting in the Penal Days", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0520, Page 204", "Page 204"], "url": "https://www.duchas.ie/en/cbes/4922085/4850906/4946446", "text": "\n(continued from previous page)\nhim ran for their lives.  After having the priest's head cut off they went down to the chapel and took the gold chalice and any thing valuable that was there.\n\n\n\nOn the week before Easter, people go out gathering eggs for Easter.  They go out in twos and threes and so on.  Before they go out they select a nice journey.  They take with them cans and baskets and put moss into them so that the eggs would not break.On Easter Sunday all the families in every house eat a log of eggs, and whoever would eat the most could be reckoned the winner.On Easter Sunday morning people get up at five o'clock to see the\n(continues on next page)\n", "school_info": "School: Cappamore (B.)", "metadata": [{"Location:": "Cappamore, Co. Limerick", "Teacher:": "\nJames McCarthy\n"}, {"Collector": "Charles O' Reilly", "Gender": "male", "Age": "12", "Address": "Cappamore, Co. Limerick"}, {"Language": "English"}]}, "4922085/4850907/4946447": {"title": "Easter Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0520, Page 205", "Page 205"], "url": "https://www.duchas.ie/en/cbes/4922085/4850907/4946447", "text": "\n(continued from previous page)\nsun dance.   They say sometimes it would dance at five o'clock, and sometimes about half-past five.  People get up specially so see the sun dance.\n\n\n\nLong ago many children used go out gathering eggs, but that custom has early died out now.  On Easter Saturday people go to the Chapel for the Easter water.  Each person takes three sups of Easter water, in the name of the Father, and of the Son, and of the Holy Ghost.Most people eat a lot of eggs on Easter Sunday.   Some people get up very early on Easter Sunday morning to see the sun dancing.\n", "school_info": "School: Cappamore (B.)", "metadata": [{"Location:": "Cappamore, Co. Limerick", "Teacher:": "\nJames McCarthy\n"}, {"Collector": "Tom Fitzgerald", "Gender": "male", "Age": "13", "Address": "Killuragh, Co. Limerick"}, {"Language": "English"}]}, "4922085/4850908/4946448": {"title": "Easter Customs and Beliefs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0520, Page 206", "Page 206"], "url": "https://www.duchas.ie/en/cbes/4922085/4850908/4946448", "text": "\nIt is said that people who would get up early on Easter Sunday morning, to see the sun dancing, would have a very happy Easter.  It is also said that people who would eat twelve eggs on Easter Sunday would never be married.  If the dancing sun shines on crops they will grow well.\n\n\n\nAt Glenstal, Murroe, Co. Limerick, on Easter Morning every year the Priests give out eggs of different colours to the people.The eggs that are laid on Good Friday are kept by the people.On Easter Morning all the\n(continues on next page)\n", "school_info": "School: Cappamore (B.)", "metadata": [{"Location:": "Cappamore, Co. Limerick", "Teacher:": "\nJames McCarthy\n"}, {"Collector": "Willie Hayes", "Gender": "male", "Age": "12", "Address": "Towerhill, Co. Limerick"}, {"Language": "English"}]}, "4922085/4850908/4946450": {"title": "Easter Customs and Beliefs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0520, Page 206", "Page 206"], "url": "https://www.duchas.ie/en/cbes/4922085/4850908/4946450", "text": "\nIt is said that people who would get up early on Easter Sunday morning, to see the sun dancing, would have a very happy Easter.  It is also said that people who would eat twelve eggs on Easter Sunday would never be married.  If the dancing sun shines on crops they will grow well.\n\n\n\nAt Glenstal, Murroe, Co. Limerick, on Easter Morning every year the Priests give out eggs of different colours to the people.The eggs that are laid on Good Friday are kept by the people.On Easter Morning all the\n(continues on next page)\n", "school_info": "School: Cappamore (B.)", "metadata": [{"Location:": "Cappamore, Co. Limerick", "Teacher:": "\nJames McCarthy\n"}, {"Collector": "Pat Mc Carthy", "Gender": "male", "Age": "11", "Address": "Cappamore, Co. Limerick"}, {"Language": "English"}]}, "4922085/4850911/4946459": {"title": "Customs on Good Friday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0520, Page 209", "Page 209"], "url": "https://www.duchas.ie/en/cbes/4922085/4850911/4946459", "text": "\n(continued from previous page)\neggs in gallons and paper bags for Easter Sunday.\n\n\n\nA very old Irish custom is gathering eggs for Easter.  About four days before Easter boys can be seen going around to all the farmer's houses looking for eggs.  Each boy gets about two dozen eggs.  When Easter Sunday morning comes every person eats more eggs than usual.Another custom is getting up before sun-rise on Easter Sunday morning to see the sun dancing inthe sky.\n", "school_info": "School: Cappamore (B.)", "metadata": [{"Location:": "Cappamore, Co. Limerick", "Teacher:": "\nJames McCarthy\n"}, {"Collector": "Chris Humphreys", "Gender": "male", "Age": "12", "Address": "Cappamore, Co. Limerick"}, {"Language": "English"}]}, "4922103/4852435/4948489": {"title": "A St Patrick's Day Custom", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0525, Page 067", "Page 067"], "url": "https://www.duchas.ie/en/cbes/4922103/4852435/4948489", "text": "\nA St Patrick’s Day CustomWhen I was a school boy I remember my mother on St Patrick’s day, getting a sally or willow, put it into the fire until the end of it became ignited, then putting out the flame and making on the right shoulder of every member of the family the sign of the cross with the blackened or burned end of the stick.Narrator: Ml. Fitzgerald, Lickadoon. Age 45 Yrs.\n\n\n\nAn Easter Custom.On Shrove Tuesday a small portion of meat left after dinner, was wrapped up and fixed to the rafters and was left there until Easter Sunday morning. This was known as the Bickeen (bícín). On Easter Sunday morning each member of the family would get a small morsel of this on awaking.This custom was continued in our household up to twenty years ago.Narrator: Ml. Fitzgerald, Lickadoon. Age 45\n", "school_info": "School: Knockea, Ballysheedy", "metadata": [{"Location:": "Knockea, Co. Limerick", "Teacher:": "\nMl. Fitzgerald\n"}, {"Informant": "Michael Fitzgerald", "Gender": "male", "Age": "45", "Address": "Lickadoon, Co. Limerick"}, {"Language": "English"}]}, "4758505/4749530/4951540": {"title": "Social - Food on Easter Sunday - Eggs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0846, Page 305", "Page 305"], "url": "https://www.duchas.ie/en/cbes/4758505/4749530/4951540", "text": "\nFood on Easter Sunday - Eggs2 at least for breakfast eggs for dinner and eggs for tea,Present of eggs given to children & called a \"Pruthóg\"On Christmas Eve - Currant Cake Turkey or Goose and Plum Pudding,On Shrove Tuesday called Shraft - PancakesOn Good Friday - no food taken until after mid-day: black fast then observed.On November Eve - whoever found Ring would be first to marry,On St Martin's Eve - fowl or domestic animal killed, and the blood spilled in honour of St Marten - saying while doing so\"in bnêir do Dia agus Do mhuire, agus mártún.\"\n\n\n\nYoung people often boasted of the number of fowl killed in their homes for St. Marten's night: they seemed to long for that feast for one saying was: \"St Marten will take (anything killed in his honour before his feast but he wont take after it\"\n(continues on next page)\n", "school_info": "School: Tullogher, Ros Mhic Treoin", "metadata": [{"Location:": "Tullagher, Co. Kilkenny", "Teacher:": "\nMrs Winnie Murphy\n"}, {"Collector": "(name not given)", "Occupation": "teacher"}, {"Language": "English"}]}, "4922136/4855731/4953975": {"title": "Easter Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0534, Page 446", "Page 446"], "url": "https://www.duchas.ie/en/cbes/4922136/4855731/4953975", "text": "\nEaster Customs.Easter is one of the most enjoyable feasts of the year and the most glorious of the Church. It is celebrated in honour of the Resurrection of Our Lord.It is a custom to get up very early on Easter Sunday to see the sun dancing which is said to be dancing with joy on account of Our Lord being risen from the dead.Another custom is to eat a\n(continues on next page)\n", "school_info": "School: Aonach Urmhumhan, Clochar na Trócaire", "metadata": [{"Location:": "Nenagh, Co. Tipperary", "Teacher:": "\nAn tSr. Celestine\n"}, {"Collector": "Breeda Fennessey", "Gender": "female", "Age": "12", "Address": "Gortnaskehy, Co. Tipperary"}, {"Informant": "Mr T. Fennessey", "Gender": "male", "Age": "45", "Occupation": "farmer", "Address": "Gortnaskehy, Co. Tipperary"}, {"Language": "English"}]}, "4922136/4855733/4953986": {"title": "Easter Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0534, Page 448", "Page 448"], "url": "https://www.duchas.ie/en/cbes/4922136/4855733/4953986", "text": "\nEaster is one of the most joyous feasts kept by the Church because it reminds us of the Glorious Resurrection of Our Lord Jesus Christ and of our resurrection on the last day.It is an old custom to eat a number of eggs on Easter Sunday as we have to fast from eggs during Lent and the eggs are supposed to be very plentiful.\n(continues on next page)\n", "school_info": "School: Aonach Urmhumhan, Clochar na Trócaire", "metadata": [{"Location:": "Nenagh, Co. Tipperary", "Teacher:": "\nAn tSr. Celestine\n"}, {"Collector": "Sheila Bergin", "Gender": "female", "Age": "13", "Address": "Silver Street, Co. Tipperary"}, {"Informant": "Mr M. Bergin", "Gender": "male", "Age": "70", "Occupation": "merchant", "Address": "Silver Street, Co. Tipperary"}, {"Language": "English"}]}, "4922136/4855735/4953992": {"title": "Easter Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0534, Page 450", "Page 450"], "url": "https://www.duchas.ie/en/cbes/4922136/4855735/4953992", "text": "\nEaster is one of the Churches most beautiful feasts. It reminds us of our resurrection on the last day and of the resurrection of Jesus Christ on Easter Sunday morning.The Church celebrates it specifically by the lighting of the Paschal candle, lighting the Easter fire, and the blessing of Easter water. On Easter morning it is a custom for the people of\n(continues on next page)\n", "school_info": "School: Aonach Urmhumhan, Clochar na Trócaire", "metadata": [{"Location:": "Nenagh, Co. Tipperary", "Teacher:": "\nAn tSr. Celestine\n"}, {"Collector": "Mary Maher", "Gender": "female", "Age": "11", "Address": "Summerhill, Co. Tipperary"}, {"Informant": "Mr S. Bourke", "Gender": "male", "Age": "42", "Address": "Borrisoleigh, Co. Tipperary"}, {"Language": "English"}]}, "4922049/4847559/4955628": {"title": "Féilí na Bliana i gContae Luimnigh - Christmas Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0511, Page 332", "Page 332"], "url": "https://www.duchas.ie/en/cbes/4922049/4847559/4955628", "text": "\n(continued from previous page)\nchildren hang up their stockings the night before Christmas. Everyone gets candles and lights them Christmas Eve night. People get lots of things for Christmas such as sweets, cake, oranges, apples, and a lot of other things. They always kill a turkey for to have her for the Christmas dinner.\n\n\n\nEaster Saturday is the last day of lent. The people go to the chapel on that day and water is blessed on that day. Easter do be on general dates of the year generally in springtime. It is called Easter Saturday because our Lord was in the sepulchre on that day. Eater Saturday is a very holy day. All the people generally go to Connfession on that day. There do not be much work done on Easter Saturday. All the people go to mass on that morning.\n", "school_info": "School: Baile an Tobair, Baile an Londraigh", "metadata": [{"Location:": "Ballintober, Co. Limerick", "Teacher:": "\nTadhg Ó Tuama\n"}, {"Collector": "Michéal O Dwyer", "Gender": "male"}, {"Language": "English"}]}, "4770004/4766025/4956438": {"title": "29th June", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0828, Page 091", "Page 091"], "url": "https://www.duchas.ie/en/cbes/4770004/4766025/4956438", "text": "\nOn the 29th June the country side seemed on fire. Bonfires blazed at every cross-road. At Glosha about one and a half miles from Rathdowney a fire always blazed on St. Peter and St. Paul's day. A dance was held from evening until day-break and crowds were induced to join in the merry amusement. Of course they had music, melodians, and violins.\n\n\n\nOn Easter Saturday the Easter water was blessed in the Parish Church. Every house in the Parish got a vessel of it. People drank three drops of it they said it prevented sickness during the year. It was also sprinkled around the farm. People gave present of eggs on that day.\n\n\n\nLong ago on Hansel Monday the people thought it very unlucky to give out money because it was said if they did that they would be as poor themselves as the person to whom they gave the money, so they tried to get in all the money they could and give out none. The first person that went into a shop on Hansel Monday the shop keeper asked him for a\n(continues on next page)\n", "school_info": "School: St John of God Convent, Rathdowney", "metadata": [{"Location:": "Rathdowney, Co. Laois", "Teacher:": "\nThe Sisters\n"}, {"Language": "English"}]}, "4922138/4855963/5011426": {"title": "Easter", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0536, Page 122", "Page 122"], "url": "https://www.duchas.ie/en/cbes/4922138/4855963/5011426", "text": "\nWe have Lent before Easter to honour the Passion of Our Lord.  People fast in Lent.  After the forty days of Lent.  We have Lent before Easter.  No school is opened from the Wednesday before Easter to the Tuesday after Easter.  Easter Monday is a Bank Holiday.  All the shops are closed.  On Good Friday morning there are devations in the Church.  People pay visits to the church all day Friday.  There is a collection taken up on Easter Sunday morning.  People go nowhere for their holidays because they are too short and Summer would be coming on.  Some people wear Easter Lillies on Easter Sunday.  Long ago people used not eat any eggs during Lent and they used to eat a lot of them on Easter Sunday morning.  People at the present time do not eat\n(continues on next page)\n", "school_info": "School: Clais", "metadata": [{"Location:": "Clash, Co. Tipperary", "Teacher:": "\nCristíona Ní Chearbhalláinn\n"}, {"Language": "English"}]}, "4922156/4856773/5012785": {"title": "Easter Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0538, Page 298", "Page 298"], "url": "https://www.duchas.ie/en/cbes/4922156/4856773/5012785", "text": "\nIn olden times Easter was a great feast. Everyone used to get up to see the sun dancing. As there used to be very strict fast in Lent the people used to eat a lot of eggs on Easter Sunday after fasting from them during the six weeks. The woman of the house used to put down a big oven of eggs for the breakfast and the young people used to vie with each other to see who would eat the greatest number of them.\n", "school_info": "School: Boher, Bushfield. Nenagh", "metadata": [{"Location:": "Boher, Co. Tipperary", "Teacher:": "\nMargaret A. Malone\n"}, {"Collector": "Kitty Bray", "Gender": "female", "Address": "Curraghmore, Co. Tipperary"}, {"Informant": "Michael O' Brien", "Gender": "male", "Address": "Curraghmore, Co. Tipperary"}, {"Language": "English"}]}, "4758530/4752283/5014393": {"title": "Easter Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0854, Page 016", "Page 016"], "url": "https://www.duchas.ie/en/cbes/4758530/4752283/5014393", "text": "\nCúbógThe young people goes around from house to house gathering eggs during Holy Week. On Easter morning the people eat two or three eggs each. This is called gathering the cúbóg.Good Friday eggIt is a custom that the people should an egg that was laid on Good Friday.Easter WaterOn Easter Saturday Easter Water is distributed, and on Easter Sunday morning each person drinks three sups of Easter Water.\n", "school_info": "School: Callan (B.)", "metadata": [{"Location:": "Callan, Co. Kilkenny", "Teacher:": "\nÉamonn Ó Loinn\n"}, {"Language": "English"}]}, "4758542/4753119/5015093": {"title": "Easter", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0856, Page 186", "Page 186"], "url": "https://www.duchas.ie/en/cbes/4758542/4753119/5015093", "text": "\n28.4.38EasterBefore Easter Sunday boys and girls from the city go out the country looking for their \"Easter Cupoge\". The \"Easter Cupoge\" consists of eggs for Easter Sunday which they get in most farmers' houses. Evidently only one \"Easter Cupoge\" is given from each house because the excuse \"You're too late. Somebody has been here before you\" is frequently given. This results in great rivalry amongst the \"beggars\", each trying to get to the house before the other. \"Cupoges\" are also promised beforehand.The following traditions are common regarding the \"Cupoge\".1. It is unlucky to go for your Easter Cupoge on Good Friday.2. If you get a bad egg in a house it means that the person has an evil wish for you and you should never go there again for an Easter Cupoge.3. If a person gives bad eggs for the Cupoge some evil will befall him\n(continues on next page)\n", "school_info": "School: Naomh Eoin, Cill Choinnigh", "metadata": [{"Location:": "Kilkenny, Co. Kilkenny", "Teacher:": "\nBráthair Tomás Mac Binéid\n"}, {"Language": "English"}]}, "4922148/4856462/5018136": {"title": "Easter Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0537, Page 296", "Page 296"], "url": "https://www.duchas.ie/en/cbes/4922148/4856462/5018136", "text": "\nOn someday about Easter holy water blessed on Easter Saturday is sprinkled on the [?], cattle, pigs, outhouses & in the fields.\n", "school_info": "School: Lissenhall", "metadata": [{"Location:": "Lissenhall, Co. Tipperary", "Teacher:": "\nPádraig Ó Cléirigh\n"}, {"Language": "English"}]}, "5009219/4999078/5019803": {"title": "Festival Customs - Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0870, Page 347", "Page 347"], "url": "https://www.duchas.ie/en/cbes/5009219/4999078/5019803", "text": "\nEaster SundayEaster Sunday was the day of which Christ rose from the dead.  Also every child haves baskets of easter eggs, and great fun playing.Long ago it used to be a great day also.  The children used to get no egg any day, but on that day, they all used to get one egg each.  No baskets of easter eggs were sold that time, but they used to get one small easter egg each and a hens egg.  They used to be laughing with Joy whey they would get the two eggs.They used to attend mass, and be thinking of when Christ rose from the dead.  Long ago they used to get up at five oclock to see the sun dancing.  They used to smoke glass the night before to see the sun better.\n", "school_info": "School: Ballycullane", "metadata": [{"Location:": "Ballycullane, Co. Wexford", "Teacher:": "\nSeán Ó Dubhghaill\n"}, {"Collector": "Joan Stafford", "Gender": "female"}, {"Language": "English"}]}, "5009219/4999089/5019824": {"title": "Festival Customs - Trawn water", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0870, Page 358", "Page 358"], "url": "https://www.duchas.ie/en/cbes/5009219/4999089/5019824", "text": "\n(continued from previous page)\nthe plant of the root of corn grass and green crop. The trawn water is shaken by one of the family. They go into the middle of each field and make the sign of cross with the trawn water.Cattle water is shaken also on all the stock. The cattle water and trawn water is blessed in the Friary in Grantstown.Jim Caulfield\n\n\n\nEaster Sunday is  a very important feast as it was the day on which Our Lord rose from the dead. On easter sunday morning old and young used to get up to see the sun dancing. It divides into six parts and each part dances in the air with gladness.\n", "school_info": "School: Ballycullane", "metadata": [{"Location:": "Ballycullane, Co. Wexford", "Teacher:": "\nSeán Ó Dubhghaill\n"}, {"Collector": "Lizzie Furlong", "Gender": "female"}, {"Language": "English"}]}, "4922236/4863172/5053322": {"title": "May Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0560, Page 391", "Page 391"], "url": "https://www.duchas.ie/en/cbes/4922236/4863172/5053322", "text": "\nA person in Ballycullen whose butter was taken by having a well skimmed went to a smith who was known to remedy such trouble. The smith came and heated the coulter of a plough and some other parts. He put some parts of the plough into the churn and the others under it and brought the butter. He told them that the butter of that churning would not be fit for use. All future churns, however, were good. The smith then said he could bring the person who had taken their luck to the spot, but the woman of the house would not allow him to do so, as she said she would prefer not to know who had done them the injury.\n\n\n\nPeople keep Good Friday eggs to be eaten on Easter Sunday.\n\n\n\nWe go to the Church for the Easter Water  on Easter Saturday, then we sprinkle it on the four corners of the garden to invoke the blessing of God on our crops. Easter water is kept in the house, and is sprinkled on the seed when the crops are about to be sown.\n", "school_info": "School: Mullinahone (C.)", "metadata": [{"Location:": "Mullinahone, Co. Tipperary", "Teacher:": "\nMáire Ní Shéaghdha\n"}, {"Collector": "Patricia Ahearne", "Gender": "female", "Address": "Mullinahone, Co. Tipperary"}, {"Informant": "Mrs Ahearne", "Gender": "female", "Age": "54", "Occupation": "mason's wife", "Address": "Mullinahone, Co. Tipperary"}, {"Language": "English"}]}, "4922303/4868550/5054014": {"title": "Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0581, Page 152", "Page 152"], "url": "https://www.duchas.ie/en/cbes/4922303/4868550/5054014", "text": "\nThe old people in the district say that the sun dances on the walls on Easter Sunday morning to commemorate the resurrection of Our Lord.Easter is still a great feast and everyone eats as many eggs as he is able on that day. In olden times people were then so poor that they used not eat any eggs during the year but on Easter Sunday they used to make a great feed of them. They used to boast of the number of eggs they used to eat.In this district they children of the poor people who have no fowl go round the district on Good Friday and Easter Saturday and collect eggs for the feast of Easter\n", "school_info": "School: Eatharlach (Aherlow)", "metadata": [{"Location:": "Aherlow, Co. Tipperary", "Teacher:": "\nÉnrí Mac Eochaidh\n"}, {"Language": "English"}]}, "5008806/4957827/5054963": {"title": "Easter Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0658, Page 023", "Page 023"], "url": "https://www.duchas.ie/en/cbes/5008806/4957827/5054963", "text": "\nEaster CustomsIt is a usual thing on Easter Sunday morning everybody for to eat some eggs, some eat one and some eat more according to their taste.  In olden times it was known for people to eat as many as seven eggs.During the day young children gather together and light a big fire, and boil some eggs there and sit down by the fire and eat them, this was called an Easter Clucking, then they would all dance together around the fire and have a good time.At Easter time people put shiny paper over a horse shoe and hang it up for to bring good luck to the house.\n", "school_info": "School: Bush, Riverstown", "metadata": [{"Location:": "The Bush, Co. Louth", "Teacher:": "\nMrs Christmas\n"}, {"Collector": "Edwin Bothwell", "Gender": "male", "Age": "11"}, {"Language": "English"}]}, "5008836/4959794/5073153": {"title": "Easter Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0665, Page 129", "Page 129"], "url": "https://www.duchas.ie/en/cbes/5008836/4959794/5073153", "text": "\nThere are many Easter customs in this district.  Most of the people get up early on Easter Sunday morning to see the sun dancing, it is said that the sun dances with joy, because Our Lord rose from the dead that morning.All the old people who were not able to go to Mass during the winter go to Msdd on Easter Sunday morning.  Most of the men buy new suits for that day.  All the people have a picnic in a field on a hill or on a lane, they take a kettle, a teapot and eggs and bread and spoons, they lite a fire and have a great feast after the feast the old people tell stories and the young people play about.At night they light bone-fires on the mountains and in the bogs.\n", "school_info": "School: Louth (B.)", "metadata": [{"Location:": "Louth, Co. Louth", "Teacher:": "\nP. Randles\n"}, {"Collector": "Séan Ó Liondáin", "Gender": "male", "Address": "Louth, Co. Louth"}, {"Language": "English"}]}, "5008836/4959795/5073157": {"title": "Easter Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0665, Page 130", "Page 130"], "url": "https://www.duchas.ie/en/cbes/5008836/4959795/5073157", "text": "\nThere are a few Easter customs in this district, eat plenty of eggs on Easter Sunday morning.  All the old people try to go to Mass on that day that had not been at Mass during all the winter.  We all get up at six oclock on Easter Sunday morning to see the sun dancing in honour of our Lord rising from the dead.  The children always have a party on Easter Sunday they light a fire on an old lane hill or field and boil eggs in a saucepan and make tea, after that they play ball all the evening until they are tired.  On Shrove Tuesday the children make pancakes and they eat plenty of them for their long fast.\n", "school_info": "School: Louth (B.)", "metadata": [{"Location:": "Louth, Co. Louth", "Teacher:": "\nP. Randles\n"}, {"Collector": "Colm Mach Uidhir", "Gender": "male", "Address": "Killeen, Co. Louth"}, {"Language": "English"}]}, "5008836/4959796/5073158": {"title": "Easter Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0665, Page 131", "Page 131"], "url": "https://www.duchas.ie/en/cbes/5008836/4959796/5073158", "text": "\nThere are many old Easter customs in this district.  The people get up at day break on that morning because it is said that the sun dances with joy because Our Lord has risen from the dead.The old people, who were not able to come to Mass during the winter come to Mass on that day.  The people go for a picnic to a field, a hill or an old lane, they take a kettle, and eggs and a teapot with them, they light a fire, boil or roast the eggs and make tea.When the picnic is over the old people talk among themselves and the young people play around or they go and light the bogs.If the people have a new suit they wear it on that\n(continues on next page)\n", "school_info": "School: Louth (B.)", "metadata": [{"Location:": "Louth, Co. Louth", "Teacher:": "\nP. Randles\n"}, {"Collector": "Pádraig Ó Lionnáin", "Gender": "male", "Address": "Corderry, Co. Louth"}, {"Language": "English"}]}, "5008837/4959942/5076941": {"title": "Easter Lore", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0665, Page 277", "Page 277"], "url": "https://www.duchas.ie/en/cbes/5008837/4959942/5076941", "text": "\nOn Easter Sunday morning the old people get up very early to watch the rising sun dance.  Long ago on easter Sunday the people used to eat a terrible feed of eggs, since they would have to fast from them during the six weeks of Lent.  They would eat six eggs at every meal.  The children used to have a great feast.  They used to gather together and light a fire in the open, and have lots of eggs as they were very plentiful.  They used to boil them in saucepans, and some of them very hard and then they used to go up to the top of a hill,and fire downwards to see which of them would win the race.  People cover their mirrors on Good Friday as they think it unlucky to look in a mirror on that day.  It is still the custom for some people to go round gathering eggs before Easter.\n", "school_info": "School: Louth (C.)", "metadata": [{"Location:": "Louth, Co. Louth", "Teacher:": "\nM. Ní Chasaide\n"}, {"Collector": "Eveline Byrne", "Gender": "female", "Address": "Chanonrock, Co. Louth"}, {"Language": "English"}]}, "5008837/4959943/5077069": {"title": "Easter Lore", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0665, Page 278", "Page 278"], "url": "https://www.duchas.ie/en/cbes/5008837/4959943/5077069", "text": "\nDuring Holy week some people go around gathering eggs, when they go into the houses they ask for an Easter Egg.  On Easter Sunday morning the rising sun can be seen dancing on the wall and long ago the old people used to get up to see it dancing.On Easter Saturday morning Holy water is blessed.  People take some of it home as it is said when Easter holy water is in a house the house will never be burned.  Eggs that are laid on Good Friday are put aside to be eaten for Easter Sunday.  They are called Good Friday Eggs and anyone who eats one of these eggs will not be sick the whole year through.  At three o'clock on Good Friday evening all catholics who can, go to the Chapel .  It is said that they will get any request they ask from God if it is for their good, and if they deserve it.Biddy McArdle who is dead now used to tell me that no food was eaten on Ash Wednesday or on Good Friday except nettle gruel, and she told us that on Easter Sunday five or six dozen of eggs would\n(continues on next page)\n", "school_info": "School: Louth (C.)", "metadata": [{"Location:": "Louth, Co. Louth", "Teacher:": "\nM. Ní Chasaide\n"}, {"Collector": "Cecilia Ryan", "Gender": "female", "Address": "Louth, Co. Louth"}, {"Language": "English"}]}, "5008837/4959944/5077070": {"title": "Easter Lore", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0665, Page 279", "Page 279"], "url": "https://www.duchas.ie/en/cbes/5008837/4959944/5077070", "text": "\n(continued from previous page)\nbe boiled in a big pot and that every one who would come into the house would eat one.\n\n\n\nPeople here used to consider it a good sign if Good Friday were a dull day.  It was kept as a day of mourning because it was on that day Our Lord was crucified.  At three o'clock on good Friday evening no matter where the people are, they stop work for a few moments and reflect on the death of Our Lord.  On this day it is supposed to be unlucky to look into a mirror.  On Holy Thursday there is a procession of the Blessed Sacrament and the whole day long Our Lord is exposed on the altar of repose.  On Easter Saturday the people used to take portion of their goods, such as salt, butter and the like to the church and get them blessed and they believed there was a cure in these articles.  On Easter Sunday the people\n(continues on next page)\n", "school_info": "School: Louth (C.)", "metadata": [{"Location:": "Louth, Co. Louth", "Teacher:": "\nM. Ní Chasaide\n"}, {"Collector": "Maggie Kirk", "Gender": "female", "Address": "Chanonrock, Co. Louth"}, {"Language": "English"}]}, "5008837/4959945/5077084": {"title": "Easter Lore", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0665, Page 280", "Page 280"], "url": "https://www.duchas.ie/en/cbes/5008837/4959945/5077084", "text": "\n(continued from previous page)\neat a lot of Easter eggs.  It is the custom for some people to boil eggs real hard and paint them in different colours and roll them down the hills.\n\n\n\nAt Easter the people go around and collect Easter Eggs.  They keep those eggs until Easter Sunday and then they cook them.  On Easter Sunday morning some people get up very early to watch the sun dancing.  The sun the moon and seven stars are supposed to dance on that morning.  On good Friday the people do not look in a mirror because it is supposed to be unlucky.  Most of the people like to be in the church at three o'clock on Good Friday.\n", "school_info": "School: Louth (C.)", "metadata": [{"Location:": "Louth, Co. Louth", "Teacher:": "\nM. Ní Chasaide\n"}, {"Collector": "Maureen Mc Ardle", "Gender": "female", "Address": "Tullycahan, Co. Louth"}, {"Language": "English"}]}, "5008837/4959946/5077085": {"title": "Easter Lore", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0665, Page 281", "Page 281"], "url": "https://www.duchas.ie/en/cbes/5008837/4959946/5077085", "text": "\nEaster is the opening of the holiday season.  At Easter some people boil eggs in colouring stuffs and make corkshots of them, out in the fields.  Other people take out their eggs to the fields and all the food and boil them in the fields.  Our Blessed Lady said to Our Lord when his Passion began \"What way shall this world be \"This world shall be dark, Mother, as dark as can be, even the stones on the street, they shall all worship me; but on Spy Wedneday great moans I shall make, and on Good Friday my life they will take.  But on Easter Sunday great wonders you'll see, you will see the sun and moon dancing in honour of me\".\n", "school_info": "School: Louth (C.)", "metadata": [{"Location:": "Louth, Co. Louth", "Teacher:": "\nM. Ní Chasaide\n"}, {"Collector": "Ana Kane", "Gender": "female", "Address": "Louth, Co. Louth"}, {"Language": "English"}]}, "5008848/4960875/5077731": {"title": "Easter", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0668, Page 303d", "Page 303d"], "url": "https://www.duchas.ie/en/cbes/5008848/4960875/5077731", "text": "\nEasterEaster Sunday means as we know it now that the end of Lent is at hand. Before the year1828 or so there was no leave for meat duringLent either on Sunday or any other day.  Easteris always associated with eggs around here.Some years ago it was the custom here for people, especially youngsters to go round collecting eggs (free of course) with the cry -Gimmie my Easter Cludhogues or itmight have been cluide or from the LatinOvum.\n\n\n\nNew TimeWe also have new time this week and a fellowhas to get up earlier to go to school, etc. I don't know what benefit it is to any one. I thinkthe only solution is the extraordinary numberof mental homes in this country. Wonder what our forefathers would say with their sundials etc. to see the sun at ten o'clock at night. Even in the church some have it and others don't. In our church when we had no bell (only 70 years ago) mass commenced with the arrival of the carriage containing the Oxford accent. We must always ape somebody, are we any better to-day'By Mr Tom BoylanKilpatrick HouseArdee\n", "school_info": "School: Drakestown, Ardee", "metadata": [{"Location:": "Drakestown, Co. Louth", "Teacher:": "\nMichael Ó Flynn\n"}, {"Language": "English"}]}, "4922344/4872168/5078789": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0608, Page 320", "Page 320"], "url": "https://www.duchas.ie/en/cbes/4922344/4872168/5078789", "text": "\n(continued from previous page)\n320spices ,onions,and lard.They are distributed amongst  the neighbours. This custom is universal in Kilmaley.Sheep's puddings are made into tripe.The neck pudding of the goose is filled with blood ,salt lard, and meal.                       34On Easter Sunday morning each man used to eat 4 eggs.Some men used to eat 8 eggs.Some men that I know in the parish eat their easter eggs on Easter Saturday as a cure for toothache.A special cake was made for Easter Sunday ,and, meat was always used on that day.                    The Tulassa people used to kill a gander for Easter Sunday as the goslings would be big then.                        On Christmas eve sweet bread was always eaten for supper and again on Christmas day.Every woman got a Christmas box,and a big sweet loaf or barm brack from the shopkeeper .On\n\n\n\nOn Easter Sunday morning each man used to eat 4 eggs.Some men used to eat 8 eggs.Some men that I know in this parish eat their Easter eggs on Easter Saturday as a cure for a toothache.A special cake was made for Easter Sunday and meat was always used on this day.            The Tullassa people used to kill a gander for Easter Sunday as the goslings used to be big then.           On Christmas eve sweet bread was always eaten for supper and again on Christmas  day.Every woman got a Christmas box and a big sweet loaf.or barm brack from the shopkeeper.On\n(continues on next page)\n", "school_info": "School: Cill Mháille (C.), Inis", "metadata": [{"Location:": "Kilmaley, Co. Clare", "Teacher:": "\nNóra Ní Asaoid\n"}, {"Language": "English"}]}, "5008873/4962726/5080653": {"title": "Festival Customs - Easter Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0676, Page 115", "Page 115"], "url": "https://www.duchas.ie/en/cbes/5008873/4962726/5080653", "text": "\nFestival CustomsEaster CustomsEaster Sunday occurs on the Sunday after Lent. Easter Sunday is a great feast day because Our Lord arose from the dead on the first Easter Sunday morning.In the homes many preparations are made for Easter. The people paper the kitchen and white wash the the outside of the housesPeople exchange presents with one and other. The children look forward to their chocolate eggs which are called \"Easter Cudhach\" The people send cards of greetings to one and otherThere are a great many preparations also made in the churches\n(continues on next page)\n", "school_info": "School: Termonfeckin", "metadata": [{"Location:": "Termonfeckin, Co. Louth", "Teacher:": "\nT. Ó Corcoráin\n"}, {"Collector": "Mary Duff", "Gender": "female", "Address": "Termonfeckin, Co. Louth"}, {"Language": "English"}]}, "5008892/4964428/5082150": {"title": "Festival Customs - Ash Wednesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0682, Page 084", "Page 084"], "url": "https://www.duchas.ie/en/cbes/5008892/4964428/5082150", "text": "\nIt was an old custom for everyone who possibly could to go to the Chapel  for Blessed Ashes on Ash Wednesday. They believed that their houses would not be burned if they got the Ashes. They used to bring water to have it blessed, and then they threw it on the land to prevent diseases.Patrick Lennon (Sgoláire)SheephouseDrogheda\n\n\n\nEaster SaturdayPeople used to bring butter, eggs, and salted cheese to have them blessed on Easter Saturday morning.Patrick Lennon (Scolaire)Got from: Mrs Margt. Kelly (76)Sheephouse,Drogheda\n\n\n\nEaster SundayEggs are eaten for breakfast and tea on Easter Sunday. (For several days before Easter children (and sometimes adults) go from house to house asking for their \"cludog” (eggs))\n", "school_info": "School: Donore", "metadata": [{"Location:": "Donore, Co. Meath", "Teacher:": "\nMaighréad Nic Eóin\n"}, {"Collector": "Patrick Lennon", "Gender": "male"}, {"Informant": "Mrs Margaret Kelly", "Gender": "female", "Age": "76", "Address": "Sheephouse, Co. Meath"}, {"Language": "English"}]}, "5008892/4964428/5082152": {"title": "Festival Customs - Ash Wednesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0682, Page 084", "Page 084"], "url": "https://www.duchas.ie/en/cbes/5008892/4964428/5082152", "text": "\nIt was an old custom for everyone who possibly could to go to the Chapel  for Blessed Ashes on Ash Wednesday. They believed that their houses would not be burned if they got the Ashes. They used to bring water to have it blessed, and then they threw it on the land to prevent diseases.Patrick Lennon (Sgoláire)SheephouseDrogheda\n\n\n\nEaster SaturdayPeople used to bring butter, eggs, and salted cheese to have them blessed on Easter Saturday morning.Patrick Lennon (Scolaire)Got from: Mrs Margt. Kelly (76)Sheephouse,Drogheda\n\n\n\nEaster SundayEggs are eaten for breakfast and tea on Easter Sunday. (For several days before Easter children (and sometimes adults) go from house to house asking for their \"cludog” (eggs))\n", "school_info": "School: Donore", "metadata": [{"Location:": "Donore, Co. Meath", "Teacher:": "\nMaighréad Nic Eóin\n"}, {"Language": "English"}]}, "4922383/4876307/5083095": {"title": "Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0621, Page 416", "Page 416"], "url": "https://www.duchas.ie/en/cbes/4922383/4876307/5083095", "text": "\nA day of rejoicing and happiness in every parish. Children take great pleasure in collecting a supply of eggs for that morning's breakfast and announce to one another with joy the number they ate that morning. Easter Sunday night is a great night for parties and dances in every parish.Easter Cards are sent by friends to one another with greetings.\n\n\n\nFarmers bring home holy water which is specially blessed in all churches after Mass to sprinkle on their crops.\n\n\n\nMay Eve is a sidheógai evening\n(continues on next page)\n", "school_info": "School: Lahinch", "metadata": [{"Location:": "Lehinch, Co. Clare", "Teacher:": "\nDónall Ó Ríordáin\n"}, {"Informant": "John O' Dwyer", "Gender": "male", "Age": "72", "Address": "Calluragh South, Co. Clare"}, {"Language": "English"}]}, "5044803/5040023/5083161": {"title": "Saint Brigid's Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0968, Page 324", "Page 324"], "url": "https://www.duchas.ie/en/cbes/5044803/5040023/5083161", "text": "\nSaint Brigid's Crosses were made out of rushes on this night, and hung over the doors holy water been thrown on them and a prayer to Saint Brigid something like: \"Down on your knees, and let St Brigid come inWelcome: Welcome oh Lady, from all within\"Pieces of blue ribbons, or pieces of blue cloth were hung on the door outside on that night. These ribbons were kept safe and sound, and if any one took a pain in the head, teeth or any other place, she got this St Brigid's ribbon (St Brigid blessed it that night outside, as well as the Crosses in-side) and tied it on her head or put it where the pain was. It cures at once. I saw a  woman lately put a ribbon round her head, who had a very bad sick head-ache. She was well in about ten minutes, and at her work. This custom still exists in this district.\n\n\n\nPeople rise before the break of day to see the sun dance with joy, when it is rising. It dances for about ten minutes, and then it gets like a ball of fire. Old people who cant climb hills to see the sun rise, put out a tub of water, and they see the sun dance with joy in the water.The people long ago ate a big feed of\n(continues on next page)\n", "school_info": "School: Tiercahan", "metadata": [{"Location:": "Tircahan, Co. Cavan", "Teacher:": "\nP. Ó Riain\n"}, {"Language": "English"}]}, "5008881/4963283/5083427": {"title": "Eastertide Customs and Food", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0678, Page 150", "Page 150"], "url": "https://www.duchas.ie/en/cbes/5008881/4963283/5083427", "text": "\nChildren get up early on Easter Sunday to see the sun dancing. It is said that it dances with joy on that morning. Some of the children light fires outside on Easter morning and boil eggs and have a feast in the open. Eggs are eaten in large numbers by all. Dumplings are put in the soup on Easter Day.Good FridayHot cross buns used be eaten( A gruel made from water ) Water gruel and nettles used be the principal food used on Good Friday. This nettle gruel is still made around the school district. Another name for the gruel was \" Súipín Cúl Fá \".A substitute for milk was the water strained from steeped oaten meal.Christmas EveThe pudding is boiled and eaten on Christmas Eve.Pancakes are eaten on Shrove Tuesday\n", "school_info": "School: Ballymakenny, Drogheda", "metadata": [{"Location:": "Ballymakenny, Co. Louth", "Teacher:": "\nM. Ní Chearbhaill\n"}, {"Language": "mixed"}]}, "5044787/5038086/5084105": {"title": "Festival Customs - Good Friday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0963, Page 483", "Page 483"], "url": "https://www.duchas.ie/en/cbes/5044787/5038086/5084105", "text": "\nGood Friday is so called because on that day christ died in the cross for us. People go to the chapel for the adoration of the cross.Some years ago a black fast used to be observed on Good Friday. People fast all day on bread and water and others fast till twelve o clock.The latter custom is still common in this district.\n\n\n\nThere are no customs in this locality for Easter Saturday except the common Church custom of getting water and salt blessed in the chapel. Some of this is put in the cowhouse to bring God's blessing on the stock.It is still a belief here that the sun dances on Easter Sunday morning and many people rise at an early hour to see it.Breakfast time provides one of the big feasts of the year. Often there is a competition to see who would eat the greatest number of eggs. The eggs are boiled in a pot. Eggs were never eaten in Lent and that is probably the reason why so many are eaten in Easter.Easter Monday is another big day with the\n(continues on next page)\n", "school_info": "School: Tomena", "metadata": [{"Location:": "Gortullaghan, Co. Cavan", "Teacher:": "\nT. Mac Uidhir\n"}, {"Informant": "Phyllis Maguire", "Gender": "female", "Address": "Derrynacreeve, Co. Cavan"}, {"Language": "English"}]}, "5044838/5042962/5087253": {"title": "An Easter Custom", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0978, Page 036", "Page 036"], "url": "https://www.duchas.ie/en/cbes/5044838/5042962/5087253", "text": "\nDuring the week preceding Easter Sunday, the poorer class children go around the country from house to house gathering clúdógs.A clúdóg means a number of eggs. In each house they expect to get from three to a dozen eggs. When the collection is finished the eggs are divided among the children who took part in collecting them, and each child brings his share home with him. These are boiled for him on Easter Sunday morning and he may eat as many as he wishes. The custom is disappearing gradually. People are becoming too proud to allow their children to go among the neighbours asking for clúdógs and besides the neighbours seem to have become less charitable and often refuse the clúdóg boys. A child might go five or six miles from home in search of eggs. John Smith ( Sen ) 66 yrsCarrick a TobairCrosskeys\n", "school_info": "School: Banahoe", "metadata": [{"Location:": "Banagher, Co. Cavan", "Teacher:": "\nA. Mac an Bháird\n"}, {"Informant": "John Smith", "Gender": "male", "Age": "66", "Address": "Cross Keys, Co. Cavan"}, {"Language": "English"}]}, "5044832/5042576/5091364": {"title": "Easter Sunday Custom", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0976, Page 279", "Page 279"], "url": "https://www.duchas.ie/en/cbes/5044832/5042576/5091364", "text": "\nOn Easter Sunday it is the custom for all  people to eat eggs on this day. The children of this country build a small mud house in which they have a party on Easter day. They invite other children to come to it. They boil eggs and have a good evening's fun. As Easter is kept in memory of our Lord's coming to life again, so is the origin in eggs and this causes this feasting of eggs.  Holy Thursday, Good Friday, and Easter Monday the letter being a public holiday. All people go to their place of worship on these special days. These are kept as school holidays as well as general holidays. All classes and creeds go to their place of worship on St. Patrick's Day. The sermon is all about St Patrick. The people sing St Patrick's Breastplate at this service. They also wear a shamrock in memory of St Patrick. This day is kept as a general holiday all over the country.  On Ash Wednesday a Roman Chatolic can be easily known from a Protestant because he wears a cross made of ashes on his forehead. All people usually go to their place of worship on this day. New Years Day is also a general holiday. All Roman Catholic and few Protestants go to their house of prayer on this day. The men in this country usually celebrate the day by hunting. The towns people usually have big Balls and Dances on this night. On Shrove Tuesday which is the night before \"All Saint's Day, it is the custom to give a great feast of pancakes.\n(continues on next page)\n", "school_info": "School: Gartbratten", "metadata": [{"Location:": "Gartbrattan, Co. Cavan", "Teacher:": "\nMiss W. Price\n"}, {"Collector": "Jane Poyntz", "Gender": "female", "Address": "Inishconnell, Co. Cavan"}, {"Language": "English"}]}, "5070744/5058973/5092269": {"title": "Festival Customs - Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0987, Page 115", "Page 115"], "url": "https://www.duchas.ie/en/cbes/5070744/5058973/5092269", "text": "\nWhat a glorious time it is when Easter  Sunday comes. Most of all the children like that day because children bring out eggs  - Cludhogs they call them - into the field and put down a fire and boil the eggs.It is a time of joy for young and old. Many preparations are made for that day. The houses are cleaned up. All children have vacation from school at that time and that is why they like it so much.\n\n\n\nThe old people tell you that a lot of strange things happen at Whit time. Some say that if you were out bathing you would be drowned. These are supposed to be true.They say any animal born a Whit time is said to possess an\n(continues on next page)\n", "school_info": "School: An Charraig", "metadata": [{"Location:": "Carrick, Co. Cavan", "Teacher:": "\nS. Ó Tiománaí\n"}, {"Collector": "John Mc Larney", "Gender": "male", "Age": "12", "Address": "Moydristan, Co. Cavan"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "male", "Age": "55", "Address": "Moydristan, Co. Cavan"}, {"Language": "English"}]}, "5070750/5059581/5093069": {"title": "Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0989, Page 176", "Page 176"], "url": "https://www.duchas.ie/en/cbes/5070750/5059581/5093069", "text": "\nOn Easter Sunday every child lights a fire in the field or garden. They invite some of their neighbouring pals to come on that Sunday. When they are all gathered they light the fire of sticks. When it is well lighted, they get a saucepan and boil the eggs or \"clúdóga\" as they are called. Then sometimes they make tea and eat the eggs with it and other times they do not make any tea only eat the eggs. They sit around the fire and eat eggs until they almost burst. On Easter Sunday morning numbers of people get up early to see the sun dancing on this morning. The people say that the sun danced with joy on the first Easter Sunday morning, because Our Lord had risen from the dead. They bring out the looking glass and they can see the sun dancing but otherwise they cannot.\n", "school_info": "School: Garrysallagh", "metadata": [{"Location:": "Garrysallagh (O'Reilly), Co. Cavan", "Teacher:": "\nP. Greally\n"}, {"Collector": "Brigid Smyth", "Gender": "female", "Address": "Lismacanigan Upper, Co. Cavan"}, {"Language": "English"}]}, "5070741/5058872/5093332": {"title": "An Old Easter Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0986, Page 243", "Page 243"], "url": "https://www.duchas.ie/en/cbes/5070741/5058872/5093332", "text": "\nAn old Easter StoryA story used to be told by the fireside about the soldiers whom the jews put to guard the sepulchre where Our Lord lay buried. It appears that those soldiers had an argument as to whether Our Lord was put to death unjustly or not. One of them held that the trial was unfair and the whole proceedings irregular and that Our Lord was not guilty of any crime. He said there was more guilt amongst the accusers than the accused. The other soldier tried to argue the opposite but was not able to refute the arguments of his opponent. Now it happened that those soldiers had a fowl boiling in a pot beside the place where they sat, and the soldier who was beaten in the argument turned towards the pot and said \"I will believe all you say when the cock in that pot comes\n(continues on next page)\n", "school_info": "School: Kilcogy (B.)", "metadata": [{"Location:": "Kilcogy, Co. Cavan", "Teacher:": "\nJas. Mc Kiernan\n"}, {"Collector": "Patrick Coyle", "Gender": "male", "Age": "13"}, {"Language": "English"}]}, "5070766/5060721/5093849": {"title": "Easter Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0993, Page 185", "Page 185"], "url": "https://www.duchas.ie/en/cbes/5070766/5060721/5093849", "text": "\nSome of the customs are, giving cludogs to children and to Gipsies and eating eggs. The people do not eat all the eggs in the morning. They divide them into three meals; in the morning, at dinner time, and in the evening. I ate three cludogs on Easter Sunday. The day was too cold to light a fire outside and I ate them inside. In some places the people ate all the eggs in the morning.\n", "school_info": "School: Kilderry", "metadata": [{"Location:": "Keelderry, Co. Cavan", "Teacher:": "\nÁine Ní Riain\n"}, {"Collector": "Aindreas Gheallaghan", "Gender": "male", "Address": "Drumakinneo, Co. Cavan"}, {"Language": "English"}]}, "5070768/5060882/5094316": {"title": "Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0993, Page 346", "Page 346"], "url": "https://www.duchas.ie/en/cbes/5070768/5060882/5094316", "text": "\nEaster Sunday falls in March or April.Easter is the Sunday following the first full moon after the 22nd March.It is the greatest church feast of the year because Our Lord from the tomb on that morning.All children like Easter because they get holidays at that time and usually they all get something new for that day.On Easter Sunday evening all children gather together in groups and light a fire outside in fields and eat their cludóg. Each child brings an egg or two, bread, a spoon and a pinch of salt. First they gather dry sticks and turf and fix them in a sheltered place at the back of a ditch. When they have the fire set they get oil and a match and light it. Then they get a saucepan or a porringer full of water and put the eggs into it and leave them on the fire to boil. When they are boiled they take them off and sit around the field on the grass and eat their cludóg.When they finished they play games together until night.\n", "school_info": "School: Crosserlough", "metadata": [{"Location:": "Crosserlough, Co. Cavan", "Teacher:": "\nL. Reilly\n"}, {"Language": "English"}]}, "5070789/5063674/5094808": {"title": "Festival Customs - St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1000, Page 141", "Page 141"], "url": "https://www.duchas.ie/en/cbes/5070789/5063674/5094808", "text": "\n(continued from previous page)\nover the seas. There is a poem made up about St. Patrick's Day and it goes like this:-Saint Patrick;s Day we'll be merry and gay, And will kick the old Protestant out of our way,If that doesn't do we'll cut them in two,And put them in under the red, white and blue.\n\n\n\nOn Easter Sunday the local people eat hard boiled eggs and everybody eats as many as they can. Some local people put buttercups (?) egg-shells and colour papers on the branches. These bushes are to greet the Summer.\n", "school_info": "School: Virginia (B)", "metadata": [{"Location:": "Virginia, Co. Cavan", "Teacher:": "\nE. O' Reilly\n"}, {"Collector": "Eddie O' Reilly", "Gender": "male", "Address": "Virginia, Co. Cavan"}, {"Language": "English"}]}, "5070794/5064497/5095674": {"title": "Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1002, Page 018", "Page 018"], "url": "https://www.duchas.ie/en/cbes/5070794/5064497/5095674", "text": "\nIn this district it is customary on Waster Week for the poor to go about the country gathering \"cluedogs\". A very old custom on Easter Sunday is, many youngsters gather together and go to some hillside or whinny place and light a fire. Some of them bring \"cluedogs\" and the, and the, others bring the milk tea, sugar, spoons, knives, bread, butter and a saucepan. They boil the \"cluedogs\" in the saucepan and they make tea also. After the feast is over the boys kick football and in the evening they return home after an enjoyable day. At Easter the people renew the  friendships of the past and go visiting their friends.\n(continues on next page)\n", "school_info": "School: Lattoon", "metadata": [{"Location:": "Lattoon, Co. Cavan", "Teacher:": "\nP. Ó Hiorraí\n"}, {"Collector": "Margaret Mc Intyre", "Gender": "female", "Address": "Lismeen, Co. Cavan"}, {"Language": "English"}]}, "5070803/5065637/5097277": {"title": "Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1005, Page 197", "Page 197"], "url": "https://www.duchas.ie/en/cbes/5070803/5065637/5097277", "text": "\nShrove Tuesday is the day before Lent, and is usually called \"Pancake Day\" because it is a very old custom to make pancakes for that day - hence the name \"Pancake Day\". Hot-cross buns are generally made for tea also. Concerts and Danes are finished for the season on this day.\n\n\n\nAsh Wednesday is the first day of Lent and is a church holiday for some of our schools, and many people attend worship on that day . It is also a Fast Day and most people abstain from meat and milk. It is a day, however, on which people work.\n\n\n\nGood Friday is a National and Church Holiday, and also a Fast Day. People of every denomination usually attend their place of worship on that day. It is considered the saddest day in the year, and all amusements are abandoned.\n\n\n\nOn Easter Saturday preparations are being made for the Festival the following day. In olden days it was customary for the poorer people to collect eggs in this day, and on visiting the houses they asked for a \"Cludog\" - meaning eggs - which they were rarely refused.\n", "school_info": "School: Lisnagirl (1)", "metadata": [{"Location:": "Lismagiril, Co. Cavan", "Teacher:": "\nHarriett Kinkade\n"}, {"Collector": "H. Kinkade", "Gender": "female", "Occupation": "teacher"}, {"Language": "English"}]}, "5070803/5065638/5097278": {"title": "Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1005, Page 198", "Page 198"], "url": "https://www.duchas.ie/en/cbes/5070803/5065638/5097278", "text": "\nOn Easter Sunday special services are held in every place of worship to commemorate the resurrection of Jesus Christ. Almost everyone attends worship that day and it is one of the happiest days in the church year.It is a very old custom to eat a lot of eggs on that day and to give presents of eggs to people who keep no fowl. It was a usual thing for a man living not for from here to eat 15 eggs (boiled) for his breakfast. Then the shops in the local towns sell a great number of chocolate and sweet eggs and other novelties for this Festival and people have begun to gibe presents and Easter cards to their friends just as they do at Christmas. In the locality children congregate in the evening and boil eggs out in a field or wood and eat these.\n\n\n\nWhit Monday is also a National Holiday and all the schools are closed in the locality. It is a very quiet day in the country and work goes on as usual.\n\n\n\nNew Year's Eve is another day on which people attend worship. A great many dances and concerts are held here on New Tear's Eve.\n", "school_info": "School: Lisnagirl (1)", "metadata": [{"Location:": "Lismagiril, Co. Cavan", "Teacher:": "\nHarriett Kinkade\n"}, {"Collector": "H. Kinkade", "Gender": "female", "Occupation": "teacher"}, {"Language": "English"}]}, "5070811/5066514/5097681": {"title": "Easter", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1008, Page 043", "Page 043"], "url": "https://www.duchas.ie/en/cbes/5070811/5066514/5097681", "text": "\nPeople get up early when the sun is rising on Easter Sunday morning. to see the sun dancing as it is believed to dance on the day. Another old custom is that people go around before Easter and gather eggs and boil them in the open on Easter Sunday evening these eggs are called \"cludogs\"The eggs are boiled out in the fields where a fire is lighted and the eggs boiled on it. Each person gets one egg.\n", "school_info": "School: Kingscourt (B.)", "metadata": [{"Location:": "Kingscourt, Co. Cavan", "Teacher:": "\nMl. Breathnach\n"}, {"Language": "English"}]}, "5070810/5066403/5098198": {"title": "Easter Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1007, Page 261", "Page 261"], "url": "https://www.duchas.ie/en/cbes/5070810/5066403/5098198", "text": "\nThere are still some Easter Customs left in this district.On Easter Sunday morning most people eat two eggs for their breakfast.On that evening children gather together and light a fire outside in the fields. This fire is called cludog. Another custom is that a few days before easter the poor people send their children around through the country gathering eggs for easter. This fire is lighted in honour of Saint Patrick lighting his fire on the hill of slain on Easter Saturday. Also the lighting of the fire on Easter sunday is held in honour of our Lord from the dead,.Easter always comes  in April or May. It is a great feast day in all countries. On the night before easter severals of the people do not go to bed the way they would be able to see the sun and moon dancing.\n", "school_info": "School: Edenagully", "metadata": [{"Location:": "Edennagully, Co. Cavan", "Teacher:": "\nS. Ó Cléirigh, C. Ó Baoighealláin\n"}, {"Informant": "Bridget Claire", "Gender": "female", "Address": "Moyer, Co. Cavan"}, {"Language": "English"}]}, "5070810/5066404/5098200": {"title": "Easter Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1007, Page 262", "Page 262"], "url": "https://www.duchas.ie/en/cbes/5070810/5066404/5098200", "text": "\nThere are a lot of Easter customers in the country at the present day. One custom is that on Easter Sunday morning nearly all the people eat two eggs for their breakfast.Another custom is on Easter Sunday evening a crowd of children gather together and go outside and light a fire and bring a few eggs with them and boil them.Long ago the people used to get up early on Easter Sunday morning and boil potatoes and have potatoes and eggs for the breakfast.It is a custom for the poor children to go about the country a few days before Easter gathering eggs which they call an Easter \"Cludog\". People say that Easter Sunday morning the sun dances in the sky. Another custom is that couples who are going to get married if they do not get married before Lent they get married shortly after Easter.\n", "school_info": "School: Edenagully", "metadata": [{"Location:": "Edennagully, Co. Cavan", "Teacher:": "\nS. Ó Cléirigh, C. Ó Baoighealláin\n"}, {"Informant": "Theresa Mc Mahon", "Gender": "female"}, {"Language": "English"}]}, "5070829/5068342/5099268": {"title": "Easter Monday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1013, Page 402", "Page 402"], "url": "https://www.duchas.ie/en/cbes/5070829/5068342/5099268", "text": "\nThere is a feast on Easter Monday.People light fire's outside and boil eggs on it.  They keep that day as a holiday and there are many games played.  People stay outside all the day and cook their food outside.  Some people go out hunting rabbits and hares.\n", "school_info": "School: Shercock (2)", "metadata": [{"Location:": "Shercock, Co. Cavan", "Teacher:": "\nBean Mhic Giolla Cluig\n"}, {"Collector": "Georgie Shields", "Gender": "female", "Address": "Carrickcreeny, Co. Cavan"}, {"Language": "English"}]}, "5070837/5068973/5099379": {"title": "Easter Saturday, Holy Thursday and Good Friday and Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1019, Page 241", "Page 241"], "url": "https://www.duchas.ie/en/cbes/5070837/5068973/5099379", "text": "\nHoly Thursday:- This is the fourth last day of Lent. On the day it is the custom for local residents to be present at Mass and the lighting of the Paschal Candle. The people long ago fasted intensely for the last few days of Lent. The first thing in the morning  was a drink of water and they worked until one o'clock, and then came the dinner which consisted of a \" bonnach \" of oaten, wheaten, or potato bread and a \" noggin \" of goat's or sweet milk. Then, working until eight or nine o'clock they eat their \" stirabout \". I know of no stories connected with Holy Thursday.Good Friday:-On this day it is the custom for local residents to go to the chaple. On this morning there is the Mass of the Presanctified and in the evening there is Benediction and the Stations of Cross. This day the people do with a drink of water in the morning and work hard until one or two o'clock. Then comes the dinner which consists of a \" bonnach \" of oaten bread and a  \" noggin \" of sweet milk and sometimes of potatoes and gruel mixed with white heads of cabbage called \" scud him up the road \". Then they set to work again until about five o'clock and then they go to Benediction\n(continues on next page)\n", "school_info": "School: Druim na dTréad", "metadata": [{"Location:": "Drumnatread, Co. Cavan", "Teacher:": "\nS. Stondúin\n"}, {"Collector": "Mary Ellen Murtagh", "Gender": "female", "Address": "Bindoo, Co. Cavan"}, {"Informant": "Mr Patrick Murtagh", "Gender": "male", "Address": "Bindoo, Co. Cavan"}, {"Language": "English"}]}, "5009143/4991101/5100216": {"title": "Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0752, Page 110", "Page 110"], "url": "https://www.duchas.ie/en/cbes/5009143/4991101/5100216", "text": "\nThe children have a competition on that day seeing who will eat the most eggs. We eat a lot of chocolate eggs too.It is said that the sun dances with joy on Easter Sunday morning at about five o'clock.May Day.May day is the first day of Summer. Everyone likes to be alive on that day especially the old people.We have no customs on that day to wash our faces in the dew. We also change cattle and sheep from one field to another. We usually\n(continues on next page)\n", "school_info": "School: Mercy Convent, Baile Mathúna", "metadata": [{"Location:": "Ballymahon, Co. Longford", "Teacher:": "\nSr. M. Clement\n"}, {"Collector": "Angela O' Donohoe", "Gender": "female"}, {"Language": "English"}]}, "5009212/4998433/5105727": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0770, Page 115", "Page 115"], "url": "https://www.duchas.ie/en/cbes/5009212/4998433/5105727", "text": "\n(a) Easter Sunday. It is a custom to eat as many eggs as you are able on Easter Sunday. \"The children are always comparing to see who will eat the most\" The old people used to always give children  \"Clúdóg\". (Present of eggs for Easter)(b) \"Christmas Eve.  Long ago the people used to make a Boxty Loaf and put currants and raisins in it for Christmas Eve. (c) \"Shrove Tuesday. People in district make pancakes for Tea on Shrove Tuesday. Its generally known as Pancake night\"(d) Good Friday. Oaten meal dumplings boiled in water or gruel. (e) Hallow Eve. Colcannon eaten for supper.\n", "school_info": "School: Monedarragh, Mostrim", "metadata": [{"Location:": "Monadarragh, Co. Longford", "Teacher:": "\nBean Uí Mhealláin\n"}, {"Language": "English"}]}, "5008912/4966233/5106134": {"title": "Food in Olden Times", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0687, Page 105", "Page 105"], "url": "https://www.duchas.ie/en/cbes/5008912/4966233/5106134", "text": "\n(continued from previous page)\nAll sat round the table.Meat chiefly bacon was used only at Xmas and Easter.  In Lent the festing was very strict.  No meat was used from Ash Wednesday until Easter Sunday.\n\n\n\nPlenty of eggs were eaten on Easter Sunday.  A man named Jack Darcy, well known in the neighbourhood used to eat 21 eggs at breakfast on Easter Sunday.Mugs were used before cups came into use.Eggs were distributed lavishly by those who had them to such as had not and that custom has survived yet.The poorer class youngsters and travelling folk also call at the houses asking for a \"clúdác\" which consists of any kind of alms, clothes, food, eggs, etc.The sun is supposed to dance or cut some sort of capers in the sky on Easter Sunday morning in honour of the Resurection.  I remember as a child getting up to see it but I cannot recall having seen anything unusual.\n", "school_info": "School: Johnstown", "metadata": [{"Location:": "Johnstown, Co. Meath", "Teacher:": "\nMiss H.C. Hickie\n"}, {"Language": "English"}]}, "5009187/4995819/5106190": {"title": "Saint Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0764, Page 349", "Page 349"], "url": "https://www.duchas.ie/en/cbes/5009187/4995819/5106190", "text": "\n(continued from previous page)\nEaster Sunday is also a great feast day especially with the children. The children of this district give a pic-nic out in the fields. First they light a fire, then they boil eggs and make tea.Each child brings their own eggs and these are called \"Cludoges\".On \"May Day\" the children cut a branch from the sloe-bush. Then they get primroses and blue-bells and they tie them in little bunches with little bits of coloured strings on the sloe-bush.Hallow-Een is also a good night because there are all sorts of games played and there are also sweet cakes made.\n\n\n\nEaster Sunday is one of the greatest feats of the year.It is kept in the commeration of Our Lord's rising from the dead.It is one of the greatest feasts for children for eating eggs.The poor children, and men, and women, go from house to house\n(continues on next page)\n", "school_info": "School: Achadh na Garron (Aughnagarron)", "metadata": [{"Location:": "Aghnagarron, Co. Longford", "Teacher:": "\n-\n"}, {"Collector": "Kathleen Donohoe", "Gender": "female", "Address": "Ballynacross, Co. Longford"}, {"Language": "English"}]}, "5009198/4996945/5106825": {"title": "Old Festive Customs - Easter", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0766, Page 395", "Page 395"], "url": "https://www.duchas.ie/en/cbes/5009198/4996945/5106825", "text": "\nThe following was told me by Paddy Donnohoe:- To all the Irish people even now-a-days but more so back twenty years ago Easter meant \"a good feed of eggs\".I often heard my father telling that when he was a wee gassoon running about barelegged along with the other youngsters they would \"put in\" as they used to say to be asked to \"gugger\" praties to their neighbour's house on Easter Saturday so that they would be sure to receive a few eggs as a gift for their cludóg on Easter Sunday. Here is his description of Easter Sunday custom.   We always heard that the sun danced early on Easter Sunday morning so many a time we were\n(continues on next page)\n", "school_info": "School: Moyne (B.)", "metadata": [{"Location:": "Moyne, Co. Longford", "Teacher:": "\nFrancis Doyle\n"}, {"Collector": "Francis Doyle", "Gender": "male", "Address": "Moyne, Co. Longford"}, {"Informant": "Patrick Donohoe", "Gender": "male", "Age": "84", "Address": "Farmullagh, Co. Longford"}, {"Language": "English"}]}, "5008929/4967440/5108424": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0691, Page 144", "Page 144"], "url": "https://www.duchas.ie/en/cbes/5008929/4967440/5108424", "text": "\nThe people of this district are usually very busy on Easter Saturday. It is the custom to have a piece of an early lamb on Easter Sunday. People eat many eggs on Easter Sunday. The woman of the house puts sixpence on the table. She then ties coloured pieces of cloth round the eggs. She puts the eggs in a pot and boils them. The eggs  will then turn the colour of the cloth. Whoever eats the most eggs get the sixpence. We have this custom because long ago  the lent was very strict and the people were not allowed any eggs and so they thought it a great thing to eat plenty of eggs on Easter Sunday.It is the custom with most people to got to Fairyhouse races on Easter Monday. They talk about the races for many weeks beforehand. If they win money at the races\n(continues on next page)\n", "school_info": "School: Kilmessan (B.)", "metadata": [{"Location:": "Kilmessan, Co. Meath", "Teacher:": "\nBrian S. Pléimeann\n"}, {"Collector": "Noel O' Brien", "Gender": "male", "Address": "Kilmessan, Co. Meath"}, {"Informant": "Mrs O' Brien", "Gender": "female", "Address": "Kilmessan, Co. Meath"}, {"Language": "English"}]}, "5008941/4968681/5109972": {"title": "Easter Customs - Good Friday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0694, Page 361", "Page 361"], "url": "https://www.duchas.ie/en/cbes/5008941/4968681/5109972", "text": "\n361Easter CustomsGood FridayEggs collected (and) on Good Friday is the cure of a headache.No blood should be shed on Good Friday.When a child would be hung(a)ry on Good Friday they should be let cry three times before (they) it would get any-thing to eat.On Good Friday evening when the people would collect the eggs they would make the sign of the cross on the eggs with soot and them would be the first eggs to be eaten on Easter Sunday morning\n", "school_info": "School: Coolronan", "metadata": [{"Location:": "Coolronan, Co. Meath", "Teacher:": "\nBean Uí Chonmhidhe\n"}, {"Language": "English"}]}, "5008978/4972970/5111479": {"title": "The Festival Customs - Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0705, Page 174", "Page 174"], "url": "https://www.duchas.ie/en/cbes/5008978/4972970/5111479", "text": "\nIt is another great feast day. It is supposed on that morning the sun dances in the sky. Everyone eats eggs for breakfast. In the evening the children used to gather together and light a fire. The used to eat the eggs with wooden spoons called \"Smallcrus or spellogs\" which perhaps means \"spiunog\n\n\n\nOn May eve long ago the people thought it lucky to clean out their wells. On May morning the people used to wash their face and hand in the dew. The people used to put up a may bush and put flowers and egg shells on it.\n", "school_info": "School: Ughtyneill", "metadata": [{"Location:": "Ughtyneill, Co. Meath", "Teacher:": "\nMaighréad, Bean Uí Chinnéide\n"}, {"Language": "English"}]}, "5008978/4972972/5111504": {"title": "The Festival Customs - Chalk Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0705, Page 176", "Page 176"], "url": "https://www.duchas.ie/en/cbes/5008978/4972972/5111504", "text": "\n(continued from previous page)\na man would bring a piece of chalk to Mass and put a mark on their back, to bring them under the notice of all people.\n\n\n\nOn May Eve it is a custom among the people to put up a \"May Bush\". A branch of a \"sgeac\" bush is but standing in the yard, and the children decorate it with egg shells, which they have been gathering for some time before. They also put bunches of primroses and other flowers on it. They leave it there until after May Day and then it is taken down.\n\n\n\nIt is a custom among the people to go from house to house gathering eggs for Easter Sunday which they call their \"Cludóg\". On Easter Sunday evening they go out to a sheltry corner in the field and light a fire. Then they make the tea and\n(continues on next page)\n", "school_info": "School: Ughtyneill", "metadata": [{"Location:": "Ughtyneill, Co. Meath", "Teacher:": "\nMaighréad, Bean Uí Chinnéide\n"}, {"Collector": "Cristiná Nic an t Saoi", "Gender": "female", "Address": "Ballymakane, Co. Meath"}, {"Language": "English"}]}, "5008986/4974127/5111623": {"title": "Festival Customs - St Stephen's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0708, Page 019", "Page 019"], "url": "https://www.duchas.ie/en/cbes/5008986/4974127/5111623", "text": "\n(continued from previous page)\nSome of them keep whatever money they make but the majority I am afraid, leave it in the village \"pubs\" and perhaps it is that night when they are in an exceptionally jolly mood that the \"Wren Song\" is sung. I do not know it all myself but here are a few lines:\"The Wren, the Wren, the King of all birds;St Stephen's Day, he was caught in the furze.He dipped his bill in a barrel of beerTo wish you all a happy New Year.Her body is little, but her family is greatGet up, kind lady and give us a treat.\n\n\n\nSome of the children in this locality have pic-nics on Easter Sunday. They light a huge fire on the top of a hill and make tea and boil lots of eggs.\n\n\n\nLittle girls make a \"May-bus\". They decorate a bush with bits of ribbon, coloured pieces of paper, cloth and bunches of flowers. Then they hold each others hands and dance around it singing songs and reciting etc.\n\n\n\nIn bygone days the people used to keep all the Christmas holly and make a fire of it on Shrove Tuesday night. On this fire they would bake pancakes, and a merry feast was held.\n", "school_info": "School: Carlanstown", "metadata": [{"Location:": "Carlanstown, Co. Meath", "Teacher:": "\nSéamus Ó Gérbheannaigh\n"}, {"Language": "English"}]}, "5008974/4972516/5111644": {"title": "Feast Days - Good Friday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0704, Page 265", "Page 265"], "url": "https://www.duchas.ie/en/cbes/5008974/4972516/5111644", "text": "\nYears ago the fasting regulations were very strict on good Friday as no milk was allowed in tea or coffee now it is allowed.In olden days our forefathers used to fast from meat, smoking & drinking for the whole of lent.\n\n\n\nOn Easter Saturday to commerate the end of the lent fast, little children would go to the neighouring houses with a can to get gifts of eggs to have plenty of the glorious feast of Easter, this is called their cludog.\n\n\n\nOn Easter Sunday people would boast how many eggs they were able to eat on that morning.\n", "school_info": "School: Kilskeer (B.)", "metadata": [{"Location:": "Kilskeer, Co. Meath", "Teacher:": "\nMáirtín Ó Loingsigh, R. Ó Fithcheallaigh\n"}, {"Language": "English"}]}, "5008974/4972516/5111649": {"title": "Feast Days - Good Friday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0704, Page 265", "Page 265"], "url": "https://www.duchas.ie/en/cbes/5008974/4972516/5111649", "text": "\nYears ago the fasting regulations were very strict on good Friday as no milk was allowed in tea or coffee now it is allowed.In olden days our forefathers used to fast from meat, smoking & drinking for the whole of lent.\n\n\n\nOn Easter Saturday to commerate the end of the lent fast, little children would go to the neighouring houses with a can to get gifts of eggs to have plenty of the glorious feast of Easter, this is called their cludog.\n\n\n\nOn Easter Sunday people would boast how many eggs they were able to eat on that morning.\n", "school_info": "School: Kilskeer (B.)", "metadata": [{"Location:": "Kilskeer, Co. Meath", "Teacher:": "\nMáirtín Ó Loingsigh, R. Ó Fithcheallaigh\n"}, {"Language": "English"}]}, "5008989/4974535/5112665": {"title": "Little Christmas Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0709, Page 138", "Page 138"], "url": "https://www.duchas.ie/en/cbes/5008989/4974535/5112665", "text": "\n(continued from previous page)\nthe people make another plum- pudding for that day.\n\n\n\nOn Easter Sunday all the children in this district light a big fire out-side the house and they boil eggs at it and then they tell stories around it.\n", "school_info": "School: Kilbeg", "metadata": [{"Location:": "Robertstown, Co. Meath", "Teacher:": "\nAodh Ó Duibhgeannáin\n"}, {"Collector": "Mary Moore", "Gender": "female", "Address": "Newrath, Co. Meath"}, {"Language": "English"}]}, "5008989/4974536/5112666": {"title": "Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0709, Page 139", "Page 139"], "url": "https://www.duchas.ie/en/cbes/5008989/4974536/5112666", "text": "\nEaster a Sunday is the day Our Lord rose from the dead. On Easter Sunday the children of my district light a fire outside, and make tea, and boil eggs. The people eat more eggs on aeaster Sunday than on any other day. All the children gather sticks on Easter eve. And then on Easter Sunday evening they light the fire. Then after a while they play football.\n\n\n\nOn hallow eve night the people in my district eat apples and nuts. They put an apple hanging from the ceiling, the children have to put their hands behind their backs, and try to catch the\n", "school_info": "School: Kilbeg", "metadata": [{"Location:": "Robertstown, Co. Meath", "Teacher:": "\nAodh Ó Duibhgeannáin\n"}, {"Collector": "Mat Morris", "Gender": "male", "Address": "Staholmog, Co. Meath"}, {"Language": "English"}]}, "5008989/4974538/5112670": {"title": "Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0709, Page 141", "Page 141"], "url": "https://www.duchas.ie/en/cbes/5008989/4974538/5112670", "text": "\nThe people in this district have many customs. Some people say that if you were up at sun rise, you could see the sun dancing. The children light fires and boil eggs as it is a custom in thie district. The custom of lighting fires is a very old one.In pagan times the Druids held a feast which corresponds with Easter. All the fires were put out on Saturday and no  one dared light a fire till the King's fire blazed on Tara hill. Saint Patrick broke this law when he lighted the Paschal fire on the hill of Slane in view of Tara. It was then the Druid uttered this prophesy, \"If that fire is not put out this day it will never be put out in\n(continues on next page)\n", "school_info": "School: Kilbeg", "metadata": [{"Location:": "Robertstown, Co. Meath", "Teacher:": "\nAodh Ó Duibhgeannáin\n"}, {"Collector": "John Melady", "Gender": "male", "Address": "Robertstown, Co. Meath"}, {"Language": "English"}]}, "5008982/4973699/5112826": {"title": "New Year's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0706, Page 520", "Page 520"], "url": "https://www.duchas.ie/en/cbes/5008982/4973699/5112826", "text": "\nNew Year's day is spent much the same as Christmas in this district. A pudding is made from currants, raisins, sultanas, spices, peel, nutmeg, eggs and is wet  with porter.We kill a turkey or goose and roast it and stuff it with potatoes flavoured with onions.Long ago, the people used to make a big cake on New Year's eve. They used to paste it to the back of the door and say,\"Fógraimín an gorta go tír na dúchta go bliadhain ó anocht is anocht  é go fírinne. After dinner, the pudding is cut and each person must take a bit. Long ago, the neighbours  used to meet in one house on the night before, and as soon as the clock struck twelve each would shout, \"A happy new year\", and then they would go.Some of the boys used to go from place to place singing \"Ring out the old year, ring in the new.\n\n\n\nOn Easter Sunday, the children light a fire on top of a hill. They spend the previous evening gathering sticks for it. First they take a handful of straw and light it. When it blazes up they put whins\n(continues on next page)\n", "school_info": "School: Maio", "metadata": [{"Location:": "Trohanny, Co. Meath", "Teacher:": "\nMáire Ní Chreaig\n"}, {"Collector": "Peggy O' Connor", "Gender": "female", "Address": "Corboggy, Co. Meath"}, {"Language": "English"}]}, "5009009/4976624/5113520": {"title": "Holy Saturday and Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0715, Page 001", "Page 001"], "url": "https://www.duchas.ie/en/cbes/5009009/4976624/5113520", "text": "\nThe full ceremonies on Easter Sunday are performed in the parish Church.Easter water is blessed and taken home to each house. It is sprinkled in the house and on crops and some is left in reserve. The first to get the water at the Church is supposed to be cured of a disease.On Easter Sunday many eggs are eaten at breakfast. During the afternoon the children light a fire\n(continues on next page)\n", "school_info": "School: Grangegeeth", "metadata": [{"Location:": "Grangegeeth, Co. Meath", "Teacher:": "\nSéosaimhín, Bean Uí Dhubhghaill\n"}, {"Language": "English"}]}, "5009034/4979353/5115511": {"title": "Easter", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0722, Page 139", "Page 139"], "url": "https://www.duchas.ie/en/cbes/5009034/4979353/5115511", "text": "\nEaster usually occurs in the last months of Spring.  It is nearly always on a different date.  Some years Easter occurs in the month of March.On Easter Sunday morning the people get up at sunrise to see the sun dancing in the sky.  It is supposed to dance with joy because Our Lord arose from the dead.There are two Masses in the local Chapel on Easter Sunday morning.  The people eat more eggs than usual for their breakfast.Children like Easter very much because they get holidays from school for a few weeks and Easter eggs are sold in all the shops.  The poorer children come from the towns and gather eggs from the people in the country.  They call these eggs \"Cludac's\"It is said that whatever kind of weather we have on Easter Sunday we will have it the greater part of the year.\n(continues on next page)\n", "school_info": "School: Carpenterstown (Templefanum)", "metadata": [{"Location:": "Carpenterstown, Co. Westmeath", "Teacher:": "\nMary Smyth\n"}, {"Collector": "Rose Farrelly", "Gender": "female"}, {"Language": "English"}]}, "5009046/4980808/5116466": {"title": "Easter Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0726, Page 220", "Page 220"], "url": "https://www.duchas.ie/en/cbes/5009046/4980808/5116466", "text": "\nEaster is the happiest time of the year it is kept in honour of Christ rising from the dead. In olden times there were many old customs kept, all the girls and boys when they get their holidays used to go around collecting eggs and they call that their \"Easter Cludog\". It is customary to eat more eggs on Easter Sunday than any other day. It is said that the eggs that are layed on \"Good Friday\" are kept and eaten on Easter Sunday. Some people get up to see the sun dancing on Easter Sunday morning. All these customs are fading away now in this part of the country, people say the sun dances, but very few ever are so interested as to arise on this one morning in the year to see this unusual sight.In some localities salt is blessed  on Easter Sunday morning in each church and the salt so blessed is kept. Some is sprinkled on the foods used by the domestic animals and it is said this custom of sprinkling salt keeps away sickness and disease for the animals of the farm.Water is also  blessed and this water is sprinkled on the crops and on the cattle, and the belief or faith is that cattle and crops sprinkled with this blessed water will be free from all diseases throughout the year.\n", "school_info": "School: Killough", "metadata": [{"Location:": "Killulagh, Co. Westmeath", "Teacher:": "\nMary Lynch\n"}, {"Collector": "Kathleen Murray", "Gender": "female", "Address": "Delvin, Co. Westmeath"}, {"Language": "English"}]}, "5009042/4980506/5117424": {"title": "St Stephen's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0725, Page 084", "Page 084"], "url": "https://www.duchas.ie/en/cbes/5009042/4980506/5117424", "text": "\nIt is a general custom for men and boys to go around from house to house singing the Wren Song. These men are called the “Wren Boys”. The Wren Boys disguise themselves as much as possible so that their neighbours would not recognize them. They have false faces and put them on thin faces. Besides this they wear girls’ dresses and old hats decorated with feathers. Some of them bring musical instruments, it being generally arranged if possible to have a musician in the party. When they arrive at the different houses the sing ‘The Wren Song’ and play music outside the door. If admitted they sing and dance for the occupants of the house, and usually get some money before leaving. After the day outing, the money received is divided equally among the different members of the party. The words of the ‘Wren Song’ are.          The wren the wren the king of all birds, It was on St. Stephan’s Day that she was caught in the ferns. Up with the kettle and down with pan, Give is some money to bury the wren.\n\n\n\nProverbsI  “A stitch in time saves nine.”II “ The more hurry the less speed.”III “ Too many cooks spoil the broth.”\n\n\n\nEaster SundayIn this district a few boys go around from house to house gathering eggs. Gathering the eggs is called “cluideóg.”\n", "school_info": "School: Clonmellon (B.)", "metadata": [{"Location:": "Clonmellon, Co. Westmeath", "Teacher:": "\nP. Ó Droighneáin\n"}, {"Language": "English"}]}, "5008898/4965089/5118835": {"title": "Easter Sunday Custom", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0684, Page 277", "Page 277"], "url": "https://www.duchas.ie/en/cbes/5008898/4965089/5118835", "text": "\nDuring the long years in our grandparents' times and for years before that Lent was kept very strictly and for the entire 40 days no meat was used in the house.This must have been a pretty \"lean\" time for the butchers and they showed their delight when Lent was drawing to a close.In Drogheda on Easter Saturday all the butchers' boys assembled at an early hour when the people were gathering for the market and a few of them tied a herring to the end of a rope.One of them ran through the principal streets with the poor herring dragging after him with sticks trying to get a blow at the fish, while at the same time each boy shouted to his heart's content.This  \"ceremony\" was called \"beating the herring out of town\" and my grandmother often told me it was great fun especially for the butcher's boys.\n(continues on next page)\n", "school_info": "School: Yellow Furze", "metadata": [{"Location:": "Yellow Furze, Co. Meath", "Teacher:": "\nSíle, Bean Uí Leamhain\n"}, {"Language": "English"}]}, "5009126/4989167/5121398": {"title": "Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0747, Page 244", "Page 244"], "url": "https://www.duchas.ie/en/cbes/5009126/4989167/5121398", "text": "\nEaster Sunday is the end of Lent. People eat a lot of eggs on that day. Sometimes children buy Easter eggs. People get up very early on that morning to see the sun dancing as it is supposed to dance with joy.\n\n\n\nShrove Tuesday is the last day before Lent and we always have a great feast on that night. The mother makes a great big dish of pancakes and she puts a ring in the batter. Whoever gets the ring will be married first.\n\n\n\nChildren put a bit of a rag or a bit of paper behind on the coat of someone that is not looking so that everyone that sees that person would laugh at him. These are called ash bags.\n", "school_info": "School: Ballinacliffy", "metadata": [{"Location:": "Ballynacliffy, Co. Westmeath", "Teacher:": "\nA. Ní Dhubhthaigh\n"}, {"Informant": "John Reid", "Gender": "male", "Age": "12", "Address": "Ballynacliffy, Co. Westmeath"}, {"Language": "English"}]}, "5009113/4988133/5122834": {"title": "Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0744, Page 131", "Page 131"], "url": "https://www.duchas.ie/en/cbes/5009113/4988133/5122834", "text": "\n34.   Easter Sunday - eggs laid on Good Friday.Christmas Eve:  Fish Rc. REShrove Tuesday - pancakes.Good Friday, Michaelmas Eve - Roast Goose.35.  No information35A  No information36     No information\n", "school_info": "School: Boher", "metadata": [{"Location:": "Bracknahevla, Co. Westmeath", "Teacher:": "\nT. Kavanagh\n"}, {"Language": "English"}]}, "5009108/4987359/5123501": {"title": "Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0742, Page 306", "Page 306"], "url": "https://www.duchas.ie/en/cbes/5009108/4987359/5123501", "text": "\nOn Easter Sunday the sun dances with joy at the Resurrection of Our Lord. Everyone eats the Good Friday eggs for their breakfast.\n\n\n\nIt is very lucky to cut or wash your hair on Good Friday but a man should never shave as it is unlucky to draw blood on that day. You should never shave, cut hair or your nails on a Sunday for\"Sunday cut hair or Sunday cut hornTwere better for that man he never was born\".\n\n\n\nSt John's day falls on the twenty first of June. People gather furze bushes and sticks and light a bonfire. Then they dance and sing all around the fire.\n", "school_info": "School: Loughanvally", "metadata": [{"Location:": "Loughanavally, Co. Westmeath", "Teacher:": "\nMrs. O'Connor\n"}, {"Language": "English"}]}, "5009226/4999926/5124593": {"title": "Easter Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0873, Page 189", "Page 189"], "url": "https://www.duchas.ie/en/cbes/5009226/4999926/5124593", "text": "\nIt has always been a habit amongst the old people here, to get up early on Easter Sunday morning to see the rising sun, dancing.Another custom here is for people to get something new to wear on Easter Sunday morning.  A very old custom which is beginning to die away now is this:-A whole crowd of young people used to band together on Easter Sunday night and go around from house to house gathering eggs from the people.  Sometimes there would be about forty, maybe and they would go to every house in the neighbourhood and outside of it too, asking eggs at every door.At some houses they would get maybe one, two or three as\n(continues on next page)\n", "school_info": "School: Aughclare", "metadata": [{"Location:": "Aughclare, Co. Wexford", "Teacher:": "\nM.E. Campbell\n"}, {"Informant": "Kitty Gaffney", "Gender": "female", "Address": "Aughclare, Co. Wexford"}, {"Language": "English"}]}, "5009260/5002415/5130949": {"title": "Customs at Easter", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0882, Page 008", "Page 008"], "url": "https://www.duchas.ie/en/cbes/5009260/5002415/5130949", "text": "\n9 June 1937At Easter time the children go around to all the Farmers's places looking for their Easter eggs. The \"farmers' wives have all the eggs gathered up for the children. The children dress themselves up in old clothes, an old coat belonging to Father or mother  all torn, and an old pair of boots.They have a basket and a stick. Some of them blacken their faces and hands with soot out of the chimney so that they would not be known. They use the stick to threaten it on the women that refuse to give them the eggs and when they come home they go around telling ever one all the eggs they got and telling how some of the Farmer's would not give them eggs and how they made them give them some with the stick.Lizzie RedmondSinnotstownDrinagh\n", "school_info": "School: Faythe", "metadata": [{"Location:": "The Faythe, Co. Wexford", "Teacher:": "\nAn tSr. Columcille\n"}, {"Collector": "Lizzie Redmond", "Gender": "female", "Address": "Sinnottstown, Co. Wexford"}, {"Language": "English"}]}, "5009273/5003757/5131556": {"title": "Festivals - Easter", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0885, Page 162", "Page 162"], "url": "https://www.duchas.ie/en/cbes/5009273/5003757/5131556", "text": "\nEASTERIn this district Easter is one of the greatest feasts of the year in the Church.CUSTOMS.There are many customs still carried on in connection with this feast. On Easter Saturday morning salt and water are blessed.Blessed salt is very necessary in every household especially for the curing of sick animals and every good Catholic keeps Easter water in the house to sprinkle in time of danger such as storms, lightning and in time of war.FOODIn every household rich or poor plenty of eggs are eaten for breakfast at Easter. For dinner everyone tries to have a bit of lamb or a roasted kid and for tea there is  a special cake made which is called a \"Simmel\" cake.This cake is so called because\n(continues on next page)\n", "school_info": "School: Castlebridge (C.)", "metadata": [{"Location:": "Castlebridge, Co. Wexford", "Teacher:": "\nMrs. Shortall\n"}, {"Collector": "Kathleen Murphy", "Gender": "female", "Address": "Butlerstown, Co. Wexford"}, {"Language": "English"}]}, "5009295/5005241/5132969": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0890, Page 095", "Page 095"], "url": "https://www.duchas.ie/en/cbes/5009295/5005241/5132969", "text": "\n9534.Heard from : James Hall. (see p. 27) Three or four eggs were eaten at every meal on Easter Monday.On Shrove Tuesday : pancakes are eaten.On Good Friday bread made of flour & water was used.On Hallow Eve   (31st October )  Colcannon is eaten.\n", "school_info": "School: Boulavogue", "metadata": [{"Location:": "Boleyvogue, Co. Wexford", "Teacher:": "\nÉnrí Tréinfhear\n"}, {"Informant": "James Hall", "Gender": "male", "Age": "68", "Address": "Boleyvogue, Co. Wexford"}, {"Language": "English"}]}, "5044730/5035025/5135277": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0918, Page 098", "Page 098"], "url": "https://www.duchas.ie/en/cbes/5044730/5035025/5135277", "text": "\nEggs are eaten on Easter Sunday-each child trying to out rival the other in the number consumed by himOn Xmas Eve the people indulge in Currant bread, plum puddingOn Shrove Tuesday, pan cakes are made-cakes made from flour milk and eggs beaten together\n", "school_info": "School: Lough Dan, Roundwood", "metadata": [{"Location:": "Baltynanima, Co. Wicklow", "Teacher:": "\nBean Uí Mhaolagáin\n"}, {"Language": "English"}]}, "5044596/5024582/5139435": {"title": "Customs on Christmas Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0805, Page 353", "Page 353"], "url": "https://www.duchas.ie/en/cbes/5044596/5024582/5139435", "text": "\n(continued from previous page)\n[-]\n\n\n\nWell! it is the custom for the little children to gather all the eggs in order to have them for Easter Sunday. It is also the custom for the people not to sell Good Friday eggs, because they say that if you sell the eggs you get on Good Friday you give away the luck of your eggs for the rest of the year.The young people visit the Blessed Sacrament on that morning.\n(continues on next page)\n", "school_info": "School: Island Parish", "metadata": [{"Location:": "Ballina, Co. Offaly", "Teacher:": "\nSeán Ó Móráin\n"}, {"Collector": "Kathleen Boland", "Gender": "female", "Address": "Castletown, Co. Offaly"}, {"Informant": "Mr Thomas Boland", "Gender": "male", "Address": "Castletown, Co. Offaly"}, {"Language": "English"}]}, "4921597/4883171/5148623": {"title": "Easter Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0288, Page 404", "Page 404"], "url": "https://www.duchas.ie/en/cbes/4921597/4883171/5148623", "text": "\nLong ago the people of Ireland fulfilled a great many Easter customs. People went to the seashore on Good Friday to gather shellfish, when they gathered them they washed them then they put them into a pot and boiled them rapidly for it was feared they would \"toughen\".It was also the custom to rise early on Easter Sunday morning to see the sun \"dancing\". On Easter Sunday morning  a pot of eggs was boiled and placed on the table and everyone could eat as many eggs as would satisfy him. Another custom was the going to devotions on Good Friday evening, and making the \"Stations of the Cross\".\n", "school_info": "School: Rossbrin, Béal Átha an Dá Chab", "metadata": [{"Location:": "Rossbrin, Co. Cork", "Teacher:": "\nCormac Mac Carrthaigh\n"}, {"Language": "English"}]}, "4921666/4888553/5151965": {"title": "Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0318, Page 088", "Page 088"], "url": "https://www.duchas.ie/en/cbes/4921666/4888553/5151965", "text": "\nPrevious to 50 years ago the peasants of this district in addition to observing the Lenten fast observed a self imposed fast on the afternoon of Saturday before Easter Sunday in order to be able to eat a great number of eggs on Easter morning. In addition to usual breakfast of the period all seemed to compete in the eating of the eggs - many ate up to 12, while some ate as much as 18. The number eaten by each person began to decline about 40 years ago. Children also had a feast during the day.\n\n\n\nThe usual fish and milk for dinner was displaced by \"Cnuasach\" gathered from certain strands. Poor peasants used this on other occasions also, to spare fish. Cnuasach is unobtainable now on almost all the rocks where it abounded 40 years ago.\n", "school_info": "School: Baile an Bhuitléirigh, Tigh Molaga", "metadata": [{"Location:": "Butlerstown, Co. Cork", "Teacher:": "\nMícheál Ó Muimhneacháin\n"}, {"Language": "English"}]}, "4921641/4887242/5152501": {"title": "Christmas Night Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0313, Page 036", "Page 036"], "url": "https://www.duchas.ie/en/cbes/4921641/4887242/5152501", "text": "\n1.The door is left unlocked this night.2.The Christmas candle is left lighting all night.3.The eldest person in the house should light the Christmas candle.4.Dinner is not served until six or seven o'clock on Christmas Eve.5.Candles are lighted in every window.\n\n\n\n1.Everyone has some special treat for dinner on that day. Those who can afford to have a turkey or goose and plum pudding2.Everyone remains at home on that day.3.Candles are again lighted in every window on that night.\n\n\n\n1.It is a custom to eat as many eggs as you can on that day.2.The sun is supposed to dance on Easter Sunday morning and some people get up early to see it.\n", "school_info": "School: Barr Liath, Droichead Banndan", "metadata": [{"Location:": "Baurleigh, Co. Cork", "Teacher:": "\nEibhlín Nic Gearailt\n"}, {"Language": "English"}]}, "4921638/4887123/5154100": {"title": "Religious - Holy Wells", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0312, Page 225", "Page 225"], "url": "https://www.duchas.ie/en/cbes/4921638/4887123/5154100", "text": "\nThere is a holy well at Pedlar's Cross and it is supposed to cure warts. The person says a few prayers and leaves a piece of rag or something. He washes his hands in the well.\n\n\n\nThe old customs at Easter are that the people eat as many eggs as they can on Easter Sunday and fasten the shells on a whitethorn bush.The people used to get up early on Easter Sudnay to see the sun dancing.\n", "school_info": "School: Cill Moluda, Clanna Caoilte", "metadata": [{"Location:": "Kilmaloda, Co. Cork", "Teacher:": "\nLaura Nugent\n"}, {"Language": "English"}]}, "5008944/4969039/5167515": {"title": "Old Festival Customs - Ash Wednesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0695, Page 248", "Page 248"], "url": "https://www.duchas.ie/en/cbes/5008944/4969039/5167515", "text": "\n(continued from previous page)\nforeheads.\n\n\n\nOn Holy Thursday people go to visit the Church. It is always beautifully decorated with flowers, and candles.\n\n\n\nOn that day people eat a lot of eggs. The sun dances with joy on Easter Sunday morning,\n", "school_info": "School: Cloncarneel", "metadata": [{"Location:": "Cloncarneel, Co. Meath", "Teacher:": "\nMáire, Bean Uí Bhreacáin\n"}, {"Collector": "Janie Dunne", "Gender": "female", "Address": "Corballis, Co. Meath"}, {"Language": "English"}]}, "4811666/4810643/5170189": {"title": "Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0342, Page 186", "Page 186"], "url": "https://www.duchas.ie/en/cbes/4811666/4810643/5170189", "text": "\nWhen I was a youngster, it was the custom to eat as many eggs as possible on Easter Sunday, and it was the great boast of young boys and girls for weeks after to say that they had eaten so many eggs on Easter Sunday morning.\n\n\n\nAbout forty years ago, I spent a good deal of my spare time at my grandfather's home at Shanballyshane at Kilnamartyra. Irish was the main language, rosary always in Irish. The custom invariable on Xmas Eve was : No dinner at usual midday hour. In evening, potatoes and prepared stock fish. Then, before a fire blazing with  turf and a special 'scolb', the tea things were brought first, with home-made and purchased Christmas cakes, and afterwards the kettle was put down, when the drinking of \"punch\" commenced. The Christmas candles had of course been lighted - by the youngest of the house [I do that myself in the town of Macroom still]. This went on, I am afraid up to a late hour, with plenty of songs. Sometimes close neighbours (menfolk) exchanged \"calls\", but as a rule no strangers were seen that night.\n", "school_info": "School: Maghcromtha (B.)", "metadata": [{"Location:": "Macroom, Co. Cork", "Teacher:": "\nPádraig Ó Deasmhumhna\n"}, {"Language": "English"}]}, "5008945/4969144/5171104": {"title": "Customs - Ash Wednesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0695, Page 358", "Page 358"], "url": "https://www.duchas.ie/en/cbes/5008945/4969144/5171104", "text": "\nAsh WednesdayAsh- bags_ little bags filled with the ashes were pinned to the coat tails of old bachelors on Ash-Wednesday\n\n\n\nChildren went around from house to house gathering their \"cloodhog\" on Easter Saturday.\n\n\n\nValentines used to be sent on St Valentine's Day up to about forty years ago.\n\n\n\nMy mother told me she remembered one funeral at which she heard keening. THe funeral was going to Memker (?) Church, and as she was very young at the time, she could give no particulars but she thought the funeral had come a long distance.\n", "school_info": "School: Moyaugher", "metadata": [{"Location:": "Moyagher, Co. Meath", "Teacher:": "\nMáire, Bean Uí Choileáin\n"}, {"Collector": "Mary Collins", "Gender": "female", "Occupation": "múinteoir"}, {"Language": "English"}]}, "4921780/4906628/5178218": {"title": "Food Formerly Used on Ceremonial Occasions - Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0362, Page 296", "Page 296"], "url": "https://www.duchas.ie/en/cbes/4921780/4906628/5178218", "text": "\nIn this district (Glantane, Lombardstown, Co. Cork) when I was a school boy it was the custom in every house to boil, on Easter Sunday morning, as many eggs as each person would wish to eat, and very often there used to be a competition between the children as to which of them could consume the greatest number, and for some days after each boy would be asking others how many did they eat, until it was discovered who ate the greatest number, and the person who did so was looked up to as a hero.Even the grown-up people often indulged in these rivalries, and some in order to help them to win, used to ask for potatoes instead of tea on Easter Sunday morning as they thought they could consume more eggs with the potatoes than with the bread and tea.That practice has almost entirely died out and when I ask how many eggs were eaten by each boy in a class on Easter Sunday I hardly ever meet a boy who says he has eaten two.\n", "school_info": "School: An Gleantán, Lombardstown", "metadata": [{"Location:": "Glantane, Co. Cork", "Teacher:": "\nTomás Ó Colmáin\n"}, {"Collector": "T. Coleman"}, {"Language": "English"}]}, "4921837/4895609/5184191": {"title": "Festive Customs - Easter Time", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0377, Page 018", "Page 018"], "url": "https://www.duchas.ie/en/cbes/4921837/4895609/5184191", "text": "\nWe have the season of Lent at present. There are forty days in Lent, and it ends at easter. It is a custom in Ireland that some of the people abstain from certain things during Lent. Some men stop smoking, and others do not eat sweets.   Long ago eggs were not allowed during Lent, so that on Easter Sunday a pot of eggs were boiled and every member of the house would eat as many eggs as he could. But now eggs are allowed during Lent. Every person goes to the church during Lent and makes the stations of the cross. Easter water is blessed on Easter saturday by the priest and all the people get a bottle of easter water, and sprinkle it over all the cattl and on all the houses for it is said it would bring luck for the year.\n", "school_info": "School: Araglin (B.), Cill Úird", "metadata": [{"Location:": "Araglin, Co. Cork", "Teacher:": "\nLiam Ó Mothair\n"}, {"Collector": "Liam Ó Riain", "Gender": "male", "Address": "Propoge, Co. Cork"}, {"Language": "English"}]}, "5177602/5172496/5185632": {"title": "Lent", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0586, Page 111", "Page 111"], "url": "https://www.duchas.ie/en/cbes/5177602/5172496/5185632", "text": "\n(continued from previous page)\nFrom eggs other butter others from sugar and children generally fast from sweets, People don’t eat so much as they every other time of the year, They don’t have any rarities but very plain foodOn Ash Wednesday and Good Friday there is a very strict fast and abstainace  people eat no egg and they drink black tea and they use no butter and there bread they eat no meat,Easter SundayOn Easter Sunday every body get up very early to see the sun dancing Every body eats more eggs than usual its is a custom there is no reason for it . Children get presents of Easter Eggs which are from chocolates, they generally get\n\n\n\nEaster SundayOn Easter Sunday every body get up very early to see the sun dancing Every body eats more eggs than usual its is a custom there is no reason for it . Children get presents of Easter Eggs which are from chocolates, they generally get\n(continues on next page)\n", "school_info": "School: Belvoir, Kilkishen", "metadata": [{"Location:": "Belvoir, Co. Clare", "Teacher:": "\nBríd Ní Chadhla\n"}, {"Language": "English"}]}, "4921885/4898868/5189329": {"title": "White Mice", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0389, Page 251", "Page 251"], "url": "https://www.duchas.ie/en/cbes/4921885/4898868/5189329", "text": "\nIn Dromore North, near wood is an old disused graveyard called Religpatrick graveyard and also a well called St Patrick's Well.(Both are marked on Ordnance Map, 1904 Edition, Cork, Sheet 42)The story goes that though field in which this old graveyard is situated is quite level and looks like any ordinary field, still it is never tilled.It happened that a man once went to plough it preparatory to setting of a crop in it, and that as he was turning the first furrow with plough white mice appeared around plough which frightened the ploughman that he beat a hasty retreat. The field was never tilled since. The man was the grandfather of Mr J Sheahan N.T. Monaparson, Mallow, aged 45 years who often heard his mother telling above story.\n\n\n\nI often heard my Grandmother, R.I.P. quoting following couplet:\"Tis on Easter Sunday great wonders you'll see, The sun and moon dancing rejoicing for Me.\"She herself said that she saw phenomenon, and on more occasions than once called the family early on Easter Morning to see it.\n", "school_info": "School: Ráth an Tóiteáin (Burnfort), Malla", "metadata": [{"Location:": "Burnfort, Co. Cork", "Teacher:": "\nDomhnall Mac Óda (Archdeacon)\n"}, {"Collector": "Donal Archdeacon", "Gender": "male", "Occupation": "teacher"}, {"Informant": "Mrs S. Moynahan", "Relation": "grandparent", "Gender": "female", "Address": "Drommahane, Co. Cork"}]}, "5177624/5173893/5199305": {"title": "Easter Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0591, Page 252", "Page 252"], "url": "https://www.duchas.ie/en/cbes/5177624/5173893/5199305", "text": "\nAn abundance of fresh eggs is still a feature of Easter tide.The people in many places get up before sunrise to see the sun dancing.The people eat a number of eggs for breakfast on that morning. The origin of the custom being that  from the egg the bird comes - sign of life. Easter occurs in spring time, when the birds come forth - so our Lord came to life again on that morning.\n\n\n\nSt.John's Eve is still the greatest festival outdoor in rural Irish life. Bonfires have always been a sign of rejoicing, it was natural to expect that the birth of John the Baptist was an occasion of great rejoicing among God's chosen people. The fires are lit on some eminence and it is a pleasing sight on a calm summer evening to watch them blazing from hill to hill. Cattle were driven with hazel switches through the smoke of the bonfires as a preventative against disease. The switches were afterwards consigned to the flames.\n", "school_info": "School: Carhurley", "metadata": [{"Location:": "Caherhurly, Co. Clare", "Teacher:": "\nNóra Uí Nuanáin\n"}, {"Language": "English"}]}, "5177626/5173940/5199849": {"title": "Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0591, Page 325", "Page 325"], "url": "https://www.duchas.ie/en/cbes/5177626/5173940/5199849", "text": "\nPalm Sunday is a day of devotion.Palms are blessed before Mass and given to the people after Mass.  The men put up a little branch in their hats and the women carry home a few branches to be put up in the bedrooms and to be kept till next Palm Sunday when the old palm is burned.This week is called Holy Week and is respected by the people.Wednesday used to be a black fast day.  The people drank tea black, ate dry bread with it for breakfast and for dinner they had herrings (fish is always scarce) roasted on the tongs and cold water round it on the plate way of sauce (no H.P. or Garryowen that time) or else sauce alone made from flour and called flour dip.They used to say flour dip is the last shift.  Black tea was used again with dry bread.  They would not put a drop of milk.Holy Thursday is a day of special devotion.  We have the usual ceremonies of the church.  The Altar of Repose is beautifully decorated and lighted with many candles and colored lights.  The children are dressed in white and march in procession before the Blessed Sacrament which is carried by the priest under a Canopy carried by  local pal bearers.\n(continues on next page)\n", "school_info": "School: Lúbán Díge (Bodyke)", "metadata": [{"Location:": "Bodyke, Co. Clare", "Teacher:": "\nBríd, Bean Uí Chadhla\n"}, {"Language": "English"}]}, "5177626/5173942/5199854": {"title": "Holy Saturday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0591, Page 327", "Page 327"], "url": "https://www.duchas.ie/en/cbes/5177626/5173942/5199854", "text": "\nThey throw the Easter water on the crops, May Eve, and on the cows and farm animals to preserve them from harm.Fast of Lent is over at 12 o'clock.\n\n\n\nThis is a great feast again next to Christmas.Sweet cakes for the young and plenty of eggs are used at breakfast.Children boast of all they have eaten.I think parents are getting more careful in this matter and not giving them to eat more than two.The dinner of this day is also very good.  Churches are decorated for this great feast which is really more welcome by the old people. You have the long day and the trees bursting into leaf - the birds building their nests and singing or warbling amongst the trees.People who have plenty eggs make presents of them to poorer people.  Eggs are regarded here as a \"luxury present\" and are often given to a child who enters your house for the first time.They are also given to a new comer in the district.A hen and clutch chickens are often given, too.When I came to live in our new house, I got from a woman in the place, a hen and chickens.  She said they would bring me luck.\n", "school_info": "School: Lúbán Díge (Bodyke)", "metadata": [{"Location:": "Bodyke, Co. Clare", "Teacher:": "\nBríd, Bean Uí Chadhla\n"}, {"Language": "English"}]}, "5215813/5214661/5221355": {"title": "Festival Customs - Ash Wednesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138D, Page 02_022", "Page 02_022"], "url": "https://www.duchas.ie/en/cbes/5215813/5214661/5221355", "text": "\n(continued from previous page)\nAll in the house.\n\n\n\nOn Good Friday the people do not eat anything till after twelve o'clock, or the men do not smoke.The men, women, and children go to the chapel and do stations.\n\n\n\nOn Easter Sunday if you get up before the sun rises, you will see the sun dancing three times.\n", "school_info": "School: St Bridget's", "metadata": [{"Location:": "Derrymore, Co. Mayo", "Teacher:": "\nMáire Uí hOistín\n"}, {"Collector": "Áine Ní Oistín", "Gender": "female", "Address": "Derrymore, Co. Mayo"}, {"Language": "English"}]}, "5215813/5214888/5237475": {"title": "St Brigid's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138D, Page 06_035", "Page 06_035"], "url": "https://www.duchas.ie/en/cbes/5215813/5214888/5237475", "text": "\nOn St Brigid's Day long ago the people used make crosses out of straw and put them up on the roof of their houses. They don't do that now.\n\n\n\nOn Easter Sunday all the people used get up at seven o clock to see the sun dancing with joy.\n\n\n\nThis is the way St. Stephen's Day is observed in this district, First a band of boys gather together and they catch the wren on the evening before. Then the next morning they turn their\n(continues on next page)\n", "school_info": "School: St Bridget's", "metadata": [{"Location:": "Derrymore, Co. Mayo", "Teacher:": "\nMáire Uí hOistín\n"}, {"Collector": "Seán Máirtín Caoigín Ó hOistín", "Gender": "male"}, {"Language": "English"}]}, "5215813/5215366/5239325": {"title": "Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138D, Page 15_003", "Page 15_003"], "url": "https://www.duchas.ie/en/cbes/5215813/5215366/5239325", "text": "\nIf you get up early Easter Sunday morning you will see the son dancing. The people eat a lot of eggs on that Day.foreheads, foreheads, foreheads,sun, sun, sun, put, put, put,\n", "school_info": "School: St Bridget's", "metadata": [{"Location:": "Derrymore, Co. Mayo", "Teacher:": "\nMáire Uí hOistín\n"}, {"Collector": "Caitlín Ní Oistín", "Gender": "female"}, {"Language": "English"}]}, "5215813/5215463/5240065": {"title": "St Stephen's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138D, Page 17_008", "Page 17_008"], "url": "https://www.duchas.ie/en/cbes/5215813/5215463/5240065", "text": "\n(continued from previous page)\nDown with the panGive us the money to bury the wren.\"Whatever they get they divide it on each other.\n\n\n\nOn St Brigids day people make a cross in honour of St Brigid. Then the cross is nailed to the roof of the house.\n\n\n\nEaster Sunday is always a great day for eating eggs. Every child gets two eggs for his meal and the big people get three or four. They also buy Easter eggs.\n", "school_info": "School: St Bridget's", "metadata": [{"Location:": "Derrymore, Co. Mayo", "Teacher:": "\nMáire Uí hOistín\n"}, {"Collector": "Máire Ní Raghallaigh", "Gender": "female"}, {"Language": "English"}]}, "5236093/5231099/5244221": {"title": "Easter", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0131C, Page 05_026", "Page 05_026"], "url": "https://www.duchas.ie/en/cbes/5236093/5231099/5244221", "text": "\nWe will have Easter next Sunday. The day before is holy Saturday. The sun dances on Easter Sunday morning and in the evening. We are sure that this Easter will be lovely for the weather is lovely. Easter is celebrated in honour of the death and the resurrection of Our Lord. We are sure that we will get holidays at Easter. The sun dances twice a day with joy for it was on Easter Sunday Our Lord rose from the dead. Easter is the nicest season of the year. Friday will be Good Friday the day Our Lord was crucified. The days are lovely and dry, the sun is lovely and hot. The birds are to be heard singing\n(continues on next page)\n", "school_info": "School: Sheanmore", "metadata": [{"Location:": "Sheeanmore, Co. Mayo", "Teacher:": "\nSíghle Ní Dhonnchadha\n"}, {"Collector": "Bríghid Ní Ódhra", "Gender": "female"}, {"Language": "English"}]}, "5236093/5231232/5261455": {"title": "Easter", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0131C, Page 08_007", "Page 08_007"], "url": "https://www.duchas.ie/en/cbes/5236093/5231232/5261455", "text": "\nNext Sunday will be Easter Sunday. Easter comes in honour of the resurrection of Our Lord. Easter will be very nice this time for the weather is fine. The day before Easter Sunday will be Holy Saturday. The sun dances on Easter morn. Easter Sunday is celebrated in honour of the resurrection of Our Lord. Good Friday will come before Holy Saturday. Will soon have holidays now. Lent is over now since Friday. There used be devotions every evening in Lent. Easter lasts a fortnight. There is a lot of customs on Easter morning. On Easter Sunday Our Lord arose from the dead. Easter is the nicest Season of\n(continues on next page)\n", "school_info": "School: Sheanmore", "metadata": [{"Location:": "Sheeanmore, Co. Mayo", "Teacher:": "\nSíghle Ní Dhonnchadha\n"}, {"Collector": "Pádraig Ó hÓrdha", "Gender": "male"}, {"Language": "English"}]}, "5260488/5259305/5263190": {"title": "Names of Animals", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1054B, Page 04_030", "Page 04_030"], "url": "https://www.duchas.ie/en/cbes/5260488/5259305/5263190", "text": "\n(continued from previous page)\nhouse we keep our cow in is a byre\n\n\n\nSt Patricks day is great day for music all the bands  be out and all the children be following the band. Every man and woma and child does have in a Three Leafed  Shamrock\"\n\n\n\nEaster Sunday is another great day\n(continues on next page)\n", "school_info": "School: Mín a Ghabhann (Meenagowan)", "metadata": [{"Location:": "Meenagowan, Co. Donegal", "Teacher:": "\nSéamus Ó Glacáin\n"}, {"Collector": "Seán Ó Rusail", "Gender": "male", "Address": "Ranny, Co. Donegal"}, {"Language": "English"}]}, "5260488/5259477/5263338": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1054B, Page 08_022", "Page 08_022"], "url": "https://www.duchas.ie/en/cbes/5260488/5259477/5263338", "text": "\nOn Easter Sunday our Lord rose from the dead.On Easter Sunday morning all the people get up early to see the sun dancing. On Easter Sunday, everybody eats eggs, And in (the) the evening the children make a feast on the hill.On St Brigids night the people pull rushes and make crosses.\n", "school_info": "School: Mín a Ghabhann (Meenagowan)", "metadata": [{"Location:": "Meenagowan, Co. Donegal", "Teacher:": "\nSéamus Ó Glacáin\n"}, {"Collector": "Treasa Ní Thrimble", "Gender": "female"}, {"Language": "English"}]}, "5260488/5259776/5265284": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1054B, Page 16_025", "Page 16_025"], "url": "https://www.duchas.ie/en/cbes/5260488/5259776/5265284", "text": "\nOn Easter Sunday the people rise early to see the sun dancing.  The people eat eggs on Easter Sunday.On the 23rd of June the people have a big bonfire.Its not right to sleep twice on Whit Sunday.On St Patricks Day the band comes to the chapel and there does be a big crowd.\n(continues on next page)\n", "school_info": "School: Mín a Ghabhann (Meenagowan)", "metadata": [{"Location:": "Meenagowan, Co. Donegal", "Teacher:": "\nSéamus Ó Glacáin\n"}, {"Collector": "Máire Ní Toland", "Gender": "female"}, {"Informant": "Paddy Magee", "Gender": "male", "Address": "Meenagowan, Co. Donegal"}, {"Language": "English"}]}, "5215784/5210748/5279220": {"title": "Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0095C, Page 18_022", "Page 18_022"], "url": "https://www.duchas.ie/en/cbes/5215784/5210748/5279220", "text": "\nOn Easter Sunday morning we first go to Mass. when we come home we have our breakfast. It is the customs to have to have eggs for breakfast and each one gets as many as he is able to eat.After the dinner all the girls gather together in a field  and they make a feast.We make a fire, and we make tea and we have sweet-cakes and eggs in a field if the day is fine.All the children get up\n(continues on next page)\n", "school_info": "School: Gleann an Dúin - Prison", "metadata": [{"Location:": "Prison East, Co. Mayo", "Teacher:": "\nMáire A. Ní Dhocartaigh\n"}, {"Collector": "Teresa Kelly", "Gender": "female", "Address": "Prison North, Co. Mayo"}, {"Language": "English"}]}}