{"4428064/4374356/4464681": {"title": "The Wren", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0149, Page 417", "Page 417"], "url": "https://www.duchas.ie/en/cbes/4428064/4374356/4464681", "text": "\nThe wren is a very small birds. She makes her nest in the eaves of houses. She lays six eggs. The wren is the smallest bird of them all. On Stephens day all the young boys go around to every house with the wren. This is the rhyme they say. “The wren the wren”The King of all birds.On Stephens dayShe was caught in the furze.Up with te kittle and down with the pan.And give us some money to bury the wren.Although she is small, her family is great.Get up land lady and give us a treat.If you treat us of the small\n(continues on next page)\n", "school_info": "School: Sruthán an Aifrinn", "metadata": [{"Location:": "Massbrook Lower, Co. Mayo", "Teacher:": "\nBríd Ní Mhóráin\n"}, {"Collector": "Thomas Grehan", "Gender": "male", "Address": "Massbrook Lower, Co. Mayo"}, {"Language": "English"}]}, "4428298/4392773/4476048": {"title": "Birds and Bird-Lore", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1038, Page 32", "Page 32"], "url": "https://www.duchas.ie/en/cbes/4428298/4392773/4476048", "text": "\n(continued from previous page)\nWhen the swallow flies high fine weather is coming or expected to continue, but when they fly low and close to the ground wet weather and storms are approaching. When seagulls assemble on land storm and wet weather are approaching and the curlew with its peculiar cry foretells wet weather and storm. When the crows are lined along ditches and on the road it is a sign of wet weather too.\n\n\n\nLong long ago when Our Saviour died a robin saw him bleeding [and?] dipped its breast in His blood and since that all robins have red breasts.It is said that another time when Our Lord was hiding from the Jews that the robin hid Him by covering Him with leaves. But the wren [give] gave the Jews some sign and the got Our Lord.\n\n\n\nSome people would tell you that it is not right to let a wren build in the eaves of houses because when St. Stephen was going to be killed, he hid up in a tree but the wren [give?] gave some sign to his enemies telling them where he was and he was stoned to death, therefore it is said that the wren is a bad bird. It is said that if every egg that the wren (would) lays, if it were broken that it would lay and lay away until it would die.\n", "school_info": "School: Coill-Chéim", "metadata": [{"Location:": "Calhame, Co. Donegal", "Teacher:": "\nSeán Mac Cuinneagáin\n"}, {"Language": "English"}]}, "4428253/4388876/4476447": {"title": "Why the Wren Flies Low", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1028, Page 37", "Page 37"], "url": "https://www.duchas.ie/en/cbes/4428253/4388876/4476447", "text": "\nOne day St. Columcille called all the birds together and said which ever of them would fly highest would be King of the Birds. Up the birds went and the eagle went the highest. Then wren flew off the eagle’s wing but in going up the eagle’s wing hit him and broke his back. The wren was King of the Birds but he could not fly high anymore.\n", "school_info": "School: Seosamh Naomhtha", "metadata": [{"Location:": "Ballyshannon, Co. Donegal", "Teacher:": "\nAn Bráthair Naiti\n"}, {"Collector": "John Gettins", "Gender": "male", "Address": "Ballyshannon, Co. Donegal"}, {"Informant": "Mr Frank Gettins", "Relation": "unknown", "Gender": "male", "Age": "48", "Address": "Ballyshannon, Co. Donegal"}, {"Language": "English"}]}, "4428108/4378800/4484485": {"title": "The Wren", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0640, Page 304", "Page 304"], "url": "https://www.duchas.ie/en/cbes/4428108/4378800/4484485", "text": "\nOur Lord was fleeing from His enemies and He passed by a field where people were sowing corn in the early morning. The corn grew and ripened  miraculously and the people were cutting it down when the enemies of Our Lord came up in pursuit of Him. They enquired of the robin if He had passed by. \"He did not (?) pass by since this corn was sown,\" says the robin. They were about to turn back when the wren called \"To-day To-day.\" St. Stephen was bleeding from his persecutors and he hid in a bush. When those pursuing him came up they would have passed by but the wren by its chirping attracted their notice and they discovered the Saint and beat him to death with stones and so it is that the wren is hunted for and killed.\n", "school_info": "School: Baile Uí Chorráin, Eóchaill", "metadata": [{"Location:": "Ballycurrane South, Co. Waterford", "Teacher:": "\nEibhlín, Bean Uí Háirdín\n"}, {"Language": "English"}]}, "4428250/4388398/4498954": {"title": "Bird-Lore - The Riabhóg", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1026, Page 211", "Page 211"], "url": "https://www.duchas.ie/en/cbes/4428250/4388398/4498954", "text": "\n(continued from previous page)\nA young cuckoo. The riabhóg is the small bird which is supposed to follow the cuckoo. She is brown in colour.\n\n\n\nThe wren does not migrate in the winter. She builds her nest in an ivy tree or in a thorny hedge. Her nest is made of fog and feathers and is very cozy and haped like a ball. It has two entrances, one by which the bird enters, and she leaves the nest by the other. They are both on the sides of the nest. The eggs which are about twenty in number are brown with red dots. She is sometimes called the “scutty wren”. In some parts the “wren boys” bring a wren round with them in a little box. If the people of the house refuge to give the “wren boys” money they threaten to buy the wren at the door. This is supposed to bring bad luck for the year. The wren is the bird that betrayed Our Lord. The “wren boys” used to say “The wren, the wren, the king of all birds\n(continues on next page)\n", "school_info": "School: Loughill", "metadata": [{"Location:": "Ballymunterhiggin, Co. Donegal", "Teacher:": "\nEibhlis Ní Mhathghamhna\n"}, {"Language": "English"}]}, "4493695/4411768/4525557": {"title": "The Wren", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1093, Page 269", "Page 269"], "url": "https://www.duchas.ie/en/cbes/4493695/4411768/4525557", "text": "\nThe wren is the smallest bird. It is called the King of the Birds. All the birds gathered one day to choose a king over them. Which ever one of them would soar up the highest would become king. The wren hid in the eagle's tail, and being so light the eagle did not know. When the eagles was unable to go any higher, the wren jumped out of the eagle's tail and went higher into the sky, and proclaimed himself king. She builds her of moss, hay and feathers. It is round in  shape, and a very tiny hole in one side. She lays five eggs, which are very small. They are of a white\n(continues on next page)\n", "school_info": "School: An Clochán", "metadata": [{"Location:": "Cloghan Beg, Co. Donegal", "Teacher:": "\nSeóirsín R. Middleton\n"}, {"Collector": "James Cunningham", "Gender": "male", "Age": "12", "Address": "Ballybotemple, Co. Donegal"}, {"Language": "English"}]}, "4493723/4414195/4527886": {"title": "The Robin", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1100, Page 238", "Page 238"], "url": "https://www.duchas.ie/en/cbes/4493723/4414195/4527886", "text": "\n(continued from previous page)\nIt builds a comfortable nest of moss and lines it with hair and feathers. The robin is very tame. In winter when the frost and snow are on the ground it will come into the kitchen where it is sure to get crumbs.The robin tried to remove the nails from the Cross and that is how it got its red breast.\n\n\n\nThe sparrow is another farmyard bird it feeds on grain, and is very destructive especially in the harvest. It makes its nest in the eaves of houses in holes and in trees It makes a good nest of moss and lines it with feathers. It is very careful in selecting a place for its nest and likes a warm, cosy place for it.\n\n\n\nSmallest of birds. It never flies out out in the open but stays at the roots of hedges and eaves of houses. It builds its nest in holes and it is a very comfortable nest. It is all\n(continues on next page)\n", "school_info": "School: Boitheach", "metadata": [{"Location:": "Boyagh, Co. Donegal", "Teacher:": "\nAodh Ó Dochartaigh\n"}, {"Language": "English"}]}, "4493647/4407693/4528810": {"title": "Scéal fá Íosa agus Muire", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1080, Page 66", "Page 66"], "url": "https://www.duchas.ie/en/cbes/4493647/4407693/4528810", "text": "\nLá amháin bhí Íosa agus Muire ag siubhail ar an bhealach mhór le chéile. Nuair a bhí siad-san tamall ag siubhail tháinig tóir saighdiúirí ag iarraidh Íosa do chur chun báis. Acht nuair a chonnaic Íosa iad thionntuigh sé é féin isteach i n-uan agus thoisigh sé ag ithe i gcois an bhealaigh mhóir agus shiubhail Muire léithe agus d'imthigh na saighdiúirí chomh thuigh agus tháinig siad.\n\n\n\nLá amháin bhí saighdiúirí i ndiaidh Naoimh Stiofán agus chuaidh sé i bhfolach i gcrann agus bhí dreilín ins an chrann. Nuair a tháinig na saighdiúirí fhad leis an chrann a rabh sé ann shuidh siad faoi agus i ndiaidh tamaill léim an dreoilín as an chrann agus chuir sé sgannradh ar na saighdiúirí agus d'amharc siad suas agus chonnaic siad an Naomh agus mharbh siad é. Sin an fáth go bhfuil droch-mheas ar an dreoilín.Sgéal eile fá'n dreoilín. Bhí Íosa ag siubhail i gcuibhreann arbhair lá amháin. Cuireadh é an lá sin acht dubhairt sé go mbéadh sé apuighthe amárach. Bhí na saighdiúirí ar a thoir agus nuair a tháinig siad fhad leis na fir a bhí ag baint an\n(continues on next page)\n", "school_info": "School: An Gleann", "metadata": [{"Location:": "Glen, Co. Donegal", "Teacher:": "\nSéamus Ó Domhnaill\n"}, {"Collector": "Cáit Ní Bhuidhe", "Gender": "female", "Address": "Glengillagrana High, Co. Donegal"}, {"Informant": "Cáit Bean Uí Bhuidhe", "Gender": "female", "Age": "73", "Address": "1419886"}, {"Language": "Irish"}]}, "4493737/4415293/4529349": {"title": "Birds - The Blackbird", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1105, Page 211", "Page 211"], "url": "https://www.duchas.ie/en/cbes/4493737/4415293/4529349", "text": "\n(continued from previous page)\ncome out. Blackbirds eat cherris, currants and worms.\n\n\n\nThe wren is one of the smallest wild birds in this country. It stays with us all the year round like the robin, the blackbird and the thrush.It is a brown bird with a short tail which always sticks up straight.It makes its nest in a bush or in a hole or in an old house. The nest is made of moss and is lined with wool and hair. The nest is not like any other bird's nest. It is round with a little hole in the side.It lays eighteen or nineteen eggs and sometimes more. They are white and very small.\n", "school_info": "School: Druim Beag", "metadata": [{"Location:": "Drumbeg, Co. Donegal", "Teacher:": "\nSinéad Bean de Faoite\n"}, {"Language": "English"}]}, "4539340/4362780/4539782": {"title": "The Wren", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0127, Page 32", "Page 32"], "url": "https://www.duchas.ie/en/cbes/4539340/4362780/4539782", "text": "\nThe wren though the smallest and most timid of birds is their king.  When the great bird(sic) died all the bird gathered together to decide which one was to be king.  At last after much arguing they decided that the bird that could fly the highest should be king.  The poor wren did not know what to do for all the other birds could fly higher than him.  Just as they were about to fly into the air he perched himself on the eagles tail.  As the eagle was a big strong bird the wren knew that he would not feel the weight.  The birds kept going up, higher till they could hardly be seen at all from the ground.  Then they started getting tired and falling one by one they all dropped and then the eagle seeing them all below him said \"Now I am the king of the birds\". On hearing that the wren jumped off his back, flew as high as he could above him and said \"Oh no ! your'e not I'm the king of the birds\".  The two joined the others on the ground then.\n(continues on next page)\n", "school_info": "School: Bun an Fhionnghlaise", "metadata": [{"Location:": "Bunnafinglas, Co. Mayo", "Teacher:": "\nP. Ó Maoláin\n"}, {"Collector": "Nora Mc Nulty", "Gender": "female", "Address": "Roosky, Co. Mayo"}, {"Informant": "Anthony Mc Nulty", "Gender": "male", "Address": "Roosky, Co. Mayo"}, {"Language": "English"}]}, "4562126/4561587/4562135": {"title": "An Dreoilín agus an Dáréag Mac", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0022, Page 0005", "Page 0005"], "url": "https://www.duchas.ie/en/cbes/4562126/4561587/4562135", "text": "\n1. Seán Ó Cuinneagáin, 2. Bunarobair, Corandolla, Gaillimh3. 60 Bliandhain, 4. Feilmeár 5. Bunarobair. An Dreóilín agus an Dáréag MacIns an droch-soaghál fadó bhí dreóilín ann dár raibh dáréag mac aige. Nuair a tháinig mí Iúil tháinig sé gearr ar a mbeatha le iad a thógáil. Chuaidh sé ag ceannuidhe siopa go bhfaigheadh sé mála mion-bhuidhe ar spás go ceann raíthe go n-íocfadh sé é. Fuair sé sin ó fear an t-siopa. Nuair a bhí an ráithe caithre ni raibh sé ag tigheact ag an siopadóir le n-íoc. Tháinig an siopadóir chuig teac an dreóilín go bhfuigheadh sé luach an mhála mhine-bhuide. Bhí an dáréag mac chomh mór leis an sean dreóilín. Ní raibh fios ag ag an siopadóir cé aca a n-íarrfadh sé de luach an mála mhine. Aimsear na bhfaca nua a bhí ann agus bíodar an-bheag. Bhí siad agdul ag déanamh \"cally\" díobta. Dubhairt ceann acu le h-aonmhar a dhul amach agus meacan a bhamnc le chur sa \"gcally\". Chuaidh sé amach agus thug sé buile ar a ní, buile ar a hó agus buile ar a iarramc acu clis\n(continues on next page)\n", "school_info": "School: Cill Chuana", "metadata": [{"Location:": "Kilcoona, Co. Galway", "Teacher:": "\nLiam Ó Conáin\n"}, {"Collector": "(name not given)", "Gender": "unknown"}, {"Informant": "Seán Ó Cuinneagáin", "Relation": "parent", "Gender": "male", "Age": "60", "Occupation": "feirmeoir", "Address": "Bunatober, Co. Galway"}, {"Language": "Irish"}]}, "4602697/4596064/4615594": {"title": "An Dreolán", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0008, Page 366", "Page 366"], "url": "https://www.duchas.ie/en/cbes/4602697/4596064/4615594", "text": "\nAn DreoleanBhí da dreoilean ann faó agus bhí dhá ean déag aca   Lá amain cuaidh an dhá dhreoilean mhora ag fagail bhídh do na h-eanaca oga agus connaic siad [peasg?] mor istig faoi chloc.  Bheir ceann aca orri agus ní raibh sé indon í thobairt amach on cloc   Rug an ceann eile ar sin agus ní raibh siad indon an peast a thabairt amac on cloc.  [Ciaidh?] siadh abhaile ag iarraidh na h-eanaca oga.  Thug siad leo iad agus rugadar héin ar a ceile agus ní raibh siad indon an peast a thobairt amach on cloc seo é sgeal\n(continues on next page)\n", "school_info": "School: Loch Con Uidhre (Lochán Iarthach)", "metadata": [{"Location:": "Loughaconeera, Co. Galway", "Teacher:": "\nMicheál Mac Aodhgáin\n"}, {"Collector": "Siobhán Ní Confhaóile", "Gender": "female", "Address": "Loughaconeera, Co. Galway"}, {"Informant": "Padraic O Confhaoile", "Gender": "male", "Address": "Loughaconeera, Co. Galway"}, {"Language": "Irish"}]}, "4602697/4596092/4615604": {"title": "An Dreoilín", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0008, Page 394", "Page 394"], "url": "https://www.duchas.ie/en/cbes/4602697/4596092/4615604", "text": "\nAn DreoilínTháinig an Dreoilín go dora  teach an Tailliur   Bhuail sé cic áir is bhain s  clár as.  Toir domsa m  coithin is [beilbhet?] lé na capain no beidh mé goil do cicinn ort go mbhrise mé do craman.Teara Dia Luain ars an Tailliur is beid sé réid   tháinig Luain tháinig Máirt act ní raibh an cotha réid\n", "school_info": "School: Loch Con Uidhre (Lochán Iarthach)", "metadata": [{"Location:": "Loughaconeera, Co. Galway", "Teacher:": "\nMicheál Mac Aodhgáin\n"}, {"Collector": "Siobhán Ní Confhaoile", "Gender": "female", "Address": "Loughaconeera, Co. Galway"}, {"Informant": "Padhraic O Confhaoile", "Gender": "male", "Address": "Loughaconeera, Co. Galway"}, {"Language": "Irish"}]}, "4613698/4609838/4627018": {"title": "An Dreoilín agus an Chiaróg", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0066, Page 026", "Page 026"], "url": "https://www.duchas.ie/en/cbes/4613698/4609838/4627018", "text": "\nBhí dreoilín agus ciaróg ag seanchus lá agus iad ar bhruach faille. D'éirigh troid eatorrtha agus thug an ciarog masla do'n dreoilín. Bhris an foidhne an dreoilín agus chuir sé a ghob fe'n gciaróig agus chaith sé leis an bhfaill í. Báthadh sa bfairrge í. Chonnaic an dreoilín cad do bhí déanta aige. Bhain sé craith as a sciatháin agus dubhairt sé go maoidhteamh:-\"Nach mór an nígh an neart.\"Bhí seabhaic ag féachaint ar an rud ar fad ó thús go deireadh. Nuair chonnaic cad a thárla do a cáirde  an ciaróg rug sí ar an dreoilín agus  mharbhuigh sí é.Roibeard Mac Donnacha, Leitir Fó\n", "school_info": "School: An Léim", "metadata": [{"Location:": "Leam East, Co. Galway", "Teacher:": "\nM. Ó Dubhda\n"}, {"Collector": "Roibeard Mac Donnacha", "Gender": "male", "Age": "12", "Address": "Letterfore, Co. Galway"}, {"Informant": "Mícheál Mac Donachadha", "Gender": "male", "Occupation": "feirmeoir", "Address": "Letterfore, Co. Galway"}, {"Language": "Irish"}]}, "4602736/4599741/4633279": {"title": "The Goldfinch", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0193, Page 264", "Page 264"], "url": "https://www.duchas.ie/en/cbes/4602736/4599741/4633279", "text": "\n(continued from previous page)\nput into a cage.  It feels very uneasy in the cage because it does not like to be there.  In the winter the goldfinch's are seen around the haystack looking for seeds.  The seeds are bachelors buttons.\n\n\n\nThe RobinThe robin builds its nest in the side of a ditch. The nest is made of moss and is lined with hair. The robin lays five or six small brown eggs. The robin has a red breast. There is a story told about the robin why it has a red breast. When Our Lord was crucified on the cross the robin tried to pull out the nails out of the flesh with its bill and some blood stained its breast.\n\n\n\nThe wren builds its nest in the eve of the house. The nest is made of moss and there is a roof on it. There is a small opening left on the nest for the bird to get into it.\n(continues on next page)\n", "school_info": "School: Gleann an Chairthe", "metadata": [{"Location:": "Glencar, Co. Leitrim", "Teacher:": "\nSeán Mag Ualghairg\n"}, {"Collector": "Margaret Mary Gilligan", "Gender": "female", "Age": "13", "Address": "Fenagh, Co. Leitrim"}, {"Informant": "Thomas Kelly", "Gender": "male", "Age": "65", "Address": "Drumdillure, Co. Leitrim"}, {"Language": "English"}]}, "4602761/4602096/4634266": {"title": "Bird-Lore - The Wren", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0200, Page 053", "Page 053"], "url": "https://www.duchas.ie/en/cbes/4602761/4602096/4634266", "text": "\nThe Wren - \"Jenny\" Wren is here every season, the tail is always erect, and eyes sparkling, very small brown bird with a \"top\" on head.  She always gives forth a ringing note, and can be seen flitting about our hedgerows.  Although so small the wren is the king of the birds the fable being - All the birds gathered together to consult which of them would be king.  After much thought and worry they decided that the bird which flew highest would be king.  The eagle was about to be proclaimed king, when the little wren who was on the eagle's back fluttered above them all, and thus was proclaimed king.  The wren builts its nest in the thatch of houses, or in a white or black thorn bush.  The nest is roofed like a little cottage.  She builds several nests during the season probably to shield her in bad weather.  She lays from 10 to 20 small blue eggs.On St. Stephen's night the boys of the district collect together, and go from house to house and say the following rhyme at the door\"The wren, the wren, the king of all birdsWas caught in the firs on St Stephen's DayUp with the kettle, and down with the panGive me a penny to bury the wren\"They then dance, and are given donations.  They then \"rise a dance\"\n", "school_info": "School: Carrigeencor", "metadata": [{"Location:": "Carrigeencor, Co. Leitrim", "Teacher:": "\nMrs Annie Gillmor\n"}, {"Collector": "Mrs Annie Gillmor", "Gender": "female", "Occupation": "múinteoir"}, {"Language": "English"}]}, "4672120/4671954/4682501": {"title": "An Dreoilín", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0173, Page 192", "Page 192"], "url": "https://www.duchas.ie/en/cbes/4672120/4671954/4682501", "text": "\nBhí dreóilin ann uair amhain agus bhí ocht sgaltain déag aici. Thainig an droch aimsir agus bhí sé ag dul aitti leithi leacha sáithe shólar leo. Cuaidh sí go dtí créisg agus d'iarr sí da sgilling ar iasacht uirthi.Thug an créisg an rud sin dí. Thóg sé o bhás go beatha í féin agus a clann. Bhí sé aici annsin go dtí teacht na Samhna.Thainig an créisg chuice go bhruigheadh sí a bhuid airgid ar ais. Bhí an dreoilin agus a chlann ag bialadh coirce. Tháinig an creisg 'na measg, fiche cheann. Ní raibh fhios aici cén ceann de na fiche ceann do thug sí an píosa dhá sgilling dho. D'ith sí graínne de'n choirce agus chuaidh sí abhaile\n(continues on next page)\n", "school_info": "School: Kilmacteige (B.)", "metadata": [{"Location:": "Kilmacteige, Co. Sligo", "Teacher:": "\nMícheál Ó Cuirnín\n"}, {"Collector": "Andy Curneen", "Gender": "male", "Address": "Kilmacteige, Co. Sligo"}, {"Informant": "John Carrol", "Gender": "male", "Age": "70", "Address": "Letterbrone, Co. Sligo"}, {"Language": "Irish"}]}, "4701708/4694693/4702141": {"title": "An Dreoilín", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0174, Page 050", "Page 050"], "url": "https://www.duchas.ie/en/cbes/4701708/4694693/4702141", "text": "\nAn DreoilínRinne an dreoilín seo a nead i Márta an Earraigh. Rug sí ocht n-uibheacha déag agus chuir sí ghor nhaoí lá ortha. Tháinig ocht sicíní déag amach. Aimsear dointeanta a bhí ann agus bhí an dreoilín bocht marb mórán ag iarraidh biadh a sholáthar don chlainn. Chuaidh sí chuig an gcor-éisg ag iarraidh airgid gaimbín agus fuair sí dhá sgilling.Chuaidh sí abhaile agus cheannuigh sí go leór beatha leis an airgead i gcoinn sé mí tháinig an chór-éisg i gcoinnibh an airgid, bhí an chlann go léir ag bualadh coirce i stór. Sheas sé ag an doras ar feadh i bhfad agus phiocadh sé suas cor. Ghrán anois is arís agus bhí sé ag dearcadh go géar ar na dreoilíní ach níor fhéad sé aithint idir an t-óg is an sean. Chuaidh sé arais abhaile go brónach. Ar sise leis an ngandal “níl fhios agam cé acu den chlainn go léir a dtug mé an t-airgead dhó. Ní dheacha mé in am nuair a bhí an chlann óg agus b’fhurast aithint eadtorra.” “Gabh arais arís” ars an gandal\n(continues on next page)\n", "school_info": "School: Castlerock N.S.", "metadata": [{"Location:": "Drummartin, Co. Sligo", "Teacher:": "\nFrank Haran\n"}, {"Collector": "Tomás Ó Cearbhall", "Gender": "male", "Address": "Letterbrone, Co. Sligo"}, {"Language": "Irish"}]}, "4701732/4697025/4708749": {"title": "Bird-Lore", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0180, Page 283", "Page 283"], "url": "https://www.duchas.ie/en/cbes/4701732/4697025/4708749", "text": "\n(continued from previous page)\nof a mass of seaweed placed on the ledge of cliffs facing the sea. When they are inland they make their nest of sticks placed in trees.\n\n\n\nThe wren is a very small brown bird. It builds its nest in house-eaves and very often in hedges. It lays a brown spotted egg. At Christmas the wren is killed for the wren boys who tie him on a stick to make money. They dance in the houses every place they go to. They dress themselves with funny old looking shirts and cover their heads with rags. They dress the tree with holly and the little wren is left in the middle. They sing as they go about.\n(continues on next page)\n", "school_info": "School: Riverstown 2", "metadata": [{"Location:": "Riverstown, Co. Sligo", "Teacher:": "\nÁine Ní Pheadair\n"}, {"Collector": "Jack Lawson", "Gender": "male", "Address": "Drumfin, Co. Sligo"}, {"Language": "English"}]}, "4770019/4767218/4784767": {"title": "The Wren", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0831, Page 022", "Page 022"], "url": "https://www.duchas.ie/en/cbes/4770019/4767218/4784767", "text": "\nThere are wild birds in our district and they are very plentiful. The names of the birds are, thrushes, blackbirds, robins, wrens, golf-finches, chap-finches, magpies, sparrows and crows. A wren builds her nest in a bush, and she makes the nest of of moss. It is a round nest with a little hole in it, just big enough for herself to pass in and out. A wren builds three or four nests, and she lays in the nest that is most comfortable. The wren lays about twenty eggs, and they are coloured brown. The wren sits on the eggs for three weeks before the young ones come out.\n", "school_info": "School: Ballinakill (B.)", "metadata": [{"Location:": "Ballinakill, Co. Laois", "Teacher:": "\nWilliam Hande\n"}, {"Language": "English"}]}, "4742057/4731575/4817171": {"title": "The Wren", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0957, Page 343", "Page 343"], "url": "https://www.duchas.ie/en/cbes/4742057/4731575/4817171", "text": "\nThe wren is one of our most common wild birds. She stays with us the whole year round. She is the smallest bird we have. She has a beautiful song and she always sings the same note. The wren is grey in colour and has a brown breast. Her head is small and her beak is black. She is a very tame bird and and if you are near her she will not fly away. The wren is one of our best nest builders. She places a roof on her nest. She builds it of leaves, ferns, and moss. She places it in a wall or in the hedge in a place where she thinks no one can see it. The father bird brings the things required to build the nest, while the little mother builds it. When the wren has her nest built she lays her eggs. She lays one every day until she has seventeen or eighteen laid. These are white with brown spots all over them. They are very tiny and easily broken. The mother bird sits on the eggs and in ten days\n(continues on next page)\n", "school_info": "School: Killymarley", "metadata": [{"Location:": "Killymarly, Co. Monaghan", "Teacher:": "\nBean Uí Chléirigh\n"}, {"Collector": "Ethel Gillanders", "Gender": "female"}, {"Language": "English"}]}, "4428280/4391734/4822795": {"title": "Faire an Bhacaigh", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1035, Page 59", "Page 59"], "url": "https://www.duchas.ie/en/cbes/4428280/4391734/4822795", "text": "\n(continued from previous page)\nagus b’urranta aca bhí léim an dorais aca. Bhí an cuid a ba laige sin le na [?]cosa. Cuid eile nach rabh in-innimh corraighadh as áit na mbonn. Cuid eile thuit na gcnap i laige. Chuid a loitead sa teangbhail agus a chuaidh (tra)  arsta ‘féin. Ní chluinnfea a dhath indo chluais acht caoineadh agus screadach agus béicfeach.Bhí fear mór uachtach amhain ann a bhí annonn go maith i mbun a stuidéir. Chuaidh sé isteach agus cheanngail sé an marbhanach arís. Sgairt sé isteach ar an té a bhí fágta amuigh go n-abradh siad (siad) an paidrín. Chruinnigh siad isteach go h-úr nuaidh arís.Bhí bean an toighe na seasamh ar leit na teineadh. Bean uath mhallach rásganta a bhí inntí a mbhead na comharsanaigh i gcomhnuidhe ag lagadh uirthí. D’amharc sí thart ceithre coirneil an toighe agus leigh sí uaill amhain aistí a chraith an t-urlár fuithe.“Dá mbíodh múnadh orraibh”, arsa sise. “Dheanan lá go lá fheil Oádraig nach gcoinneochainn sé istoigh é acht ó tharla nach bhfuil rachaidh scaol air ar bhéal mhaidne”.\n\n\n\nAn Tiolar agus an Dreolán.Thug an tiolar siorradh thart ar an fhál agus sgiorr an dreolán isteach faoi fhoscadh a bhadhbdhúin féin. Labhar an tiolar- “A éin bhig is deise a bhfaca mé riamh gabh ar mo mhuin go dtéighidhmid suas os cionn na néaltaí agus gheobhaidhmid radharc ar an domhan mhór”. Labhar an dreolán amach leis- “Níl dúil agam in aedhar an tsaoghail, níl árd agam ar phlámas ba beag ar tóin do phutóige. Mise is clann mo mháthra”.\n", "school_info": "School: Cineal Conaill", "metadata": [{"Location:": "Garvagh, Co. Donegal", "Teacher:": "\nAntoin Ó Dochartaigh\n"}, {"Informant": "Donnchadh Ó Sléibhín", "Gender": "male", "Address": "Edergole, Co. Donegal"}, {"Language": "Irish"}]}, "4921978/4914921/4942521": {"title": "The Wren", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0493, Page 025", "Page 025"], "url": "https://www.duchas.ie/en/cbes/4921978/4914921/4942521", "text": "\nThe wren 21-12-1938Many years ago all the birds gathered together and wanted to have a king.  The birds were satisfied that the bird that would fly the highest was to be their king.  All the birds flew up into the air and the eagle far above them looked down and shouted, \"I am the king of all birds.\"  But the wren hopping out from beneath the eagle's wing shouted \"You are not the king yet\" and he flew still higher.  The eagle was too tired to follow him and the wren was the king.  When the wren came down out of the air the birds said he was too small and they proposed to drown him.  But no water was to be found so all the birds began to cry into a bowl.  When the bowl was filled with tears the clumsly owl tripped over the bowl and spilt it.  They had all their tears shed and had nothing to drown him and he is still the king of all birds.\n", "school_info": "School: Raheenagh (B.), Ráthluirc", "metadata": [{"Location:": "Raheenagh, Co. Limerick", "Teacher:": "\nTomás Ó Gríobhtha\n"}, {"Collector": "Denis Sexton", "Gender": "male", "Address": "Camas, Co. Limerick"}, {"Language": "English"}]}, "4921978/4914977/4942699": {"title": "Herbs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0493, Page 081", "Page 081"], "url": "https://www.duchas.ie/en/cbes/4921978/4914977/4942699", "text": "\n(continued from previous page)\nthat it is good to heal wounds.\n\n\n\nThere is only one fort in the townland of Kantoher.  In olden times people built forts as houses to protect themselves from the Danes.  It is surrounded by a hedge.  At the out side of the fort there is a big dyke to safeguard it.  It is not right to cut timber in forts because it is said the fairies would follow you.  Most of them are round and are built in a circular shap and are higher than the level of the field.\n\n\n\nMany years ago all the birds gather together to see which of them would be King.  It was said that the bird that would fly the highest would be King of all birds.  It was the that flew the highest.  All the birds started to fly and just as the eagle began to fly the wren flew under the\n(continues on next page)\n", "school_info": "School: Raheenagh (B.), Ráthluirc", "metadata": [{"Location:": "Raheenagh, Co. Limerick", "Teacher:": "\nTomás Ó Gríobhtha\n"}, {"Collector": "Daniel Begley", "Gender": "male"}, {"Language": "English"}]}, "4921978/4915000/4942737": {"title": "An Old Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0493, Page 104", "Page 104"], "url": "https://www.duchas.ie/en/cbes/4921978/4915000/4942737", "text": "\nAn old storyYears ago all the birds gathered together to know which one of them would become the king. They started flying at the same moment into air. After some time the eagle felt tired and could not go any higher. The eagle thought he had been the highest and would be the king of all birds.The wren just flew from beneath the eagles wing and soared into the air. The wren been the smallest bird became the king of all the birds. The eagle was far up in the air from the rest of the birds the wren got from under the eagles wing and got very far into the air and from that day to this the wren held the title.\n\n\n\nThe FortsIf we take a strole about the fields we notice here and there large forts. Then we ask ourselves who built them. In days gone by when the Normans invaded Ireland they built these...\n(continues on next page)\n", "school_info": "School: Raheenagh (B.), Ráthluirc", "metadata": [{"Location:": "Raheenagh, Co. Limerick", "Teacher:": "\nTomás Ó Gríobhtha\n"}, {"Collector": "Sean Hennessy", "Gender": "male"}, {"Language": "English"}]}, "4758602/4757997/4955154": {"title": "The Magpie and the Wren", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0951, Page 223", "Page 223"], "url": "https://www.duchas.ie/en/cbes/4758602/4757997/4955154", "text": "\nA story called the magpie and the wren.\n\n\n\nThe magpie and the wren build nests with a roof on them. The magpie does not build a proper roof on his nest and this is the reason why.The magpie was being taught by the wren how to build a nest. The wren would say while showing the magpie how to make the nest \"do it this way, do it this way.\" The magpie would say \"I know, I know, I know.\" After a time the wren got tired of hearing the magpie saying \"I know, I know, I know\" so he said to the magpie \"if you know finish it yourself.\" But the magpie never finished the nest.Peter Woods, Lisconduff, Castleshane says that it was the English that brought the magpies to Ireland and that as long as the English remain in Ireland, the magpies will remain also.\n", "school_info": "School: Liathdruim", "metadata": [{"Location:": "Leitrim, Co. Monaghan", "Teacher:": "\nE. Ó Maitiú\n"}, {"Informant": "James Hughes", "Gender": "male", "Age": "46", "Address": "Fedoo, Co. Monaghan"}, {"Language": "English"}]}, "4922263/4865345/5053394": {"title": "Why the Wren is the King of All Birds", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0572, Page 111", "Page 111"], "url": "https://www.duchas.ie/en/cbes/4922263/4865345/5053394", "text": "\nWhy The Wren is King of all BirdsLong ago people did not know which bird they would make king, so they gathered all the biggest and all the smallest birds and which ever of them would fly the higest would be king. The eagle was the biggest and the wren was the smallest. The wren hid under the eagles wing and when the eagle was high above all the other birds the wren flew above the eagle and and was higher up than any of the birds. Sohe was called \"King of the Birds\" ever since.\n\n\n\nRobin RedbreastWhen Our Lord was nailed to the Cross it is said that the robin had pity on HIm and that he was picking the thorns off Our Lord's Sacred head and the Precious blood dropped on him and his breast turned from brown to red. This is how rhe robin got the name of Robin Redbreast.\n", "school_info": "School: Currach Chluana (Croughclooney)", "metadata": [{"Location:": "Curraghcloney, Co. Tipperary", "Teacher:": "\nMáire, Bean Uí Fhloinn\n"}, {"Informant": "Mary Ormond", "Gender": "female", "Address": "Cappoquin, Co. Waterford"}, {"Language": "English"}]}, "4758602/4757997/5077322": {"title": "The Magpie and the Wren", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0951, Page 223", "Page 223"], "url": "https://www.duchas.ie/en/cbes/4758602/4757997/5077322", "text": "\nA story called the magpie and the wren.\n\n\n\nThe magpie and the wren build nests with a roof on them. The magpie does not build a proper roof on his nest and this is the reason why.The magpie was being taught by the wren how to build a nest. The wren would say while showing the magpie how to make the nest \"do it this way, do it this way.\" The magpie would say \"I know, I know, I know.\" After a time the wren got tired of hearing the magpie saying \"I know, I know, I know\" so he said to the magpie \"if you know finish it yourself.\" But the magpie never finished the nest.Peter Woods, Lisconduff, Castleshane says that it was the English that brought the magpies to Ireland and that as long as the English remain in Ireland, the magpies will remain also.\n", "school_info": "School: Liathdruim", "metadata": [{"Location:": "Leitrim, Co. Monaghan", "Teacher:": "\nE. Ó Maitiú\n"}, {"Informant": "Peter Woods", "Gender": "male", "Address": "Lisconduff, Co. Monaghan"}, {"Language": "English"}]}, "5070847/5069969/5099850": {"title": "Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1022, Page 426", "Page 426"], "url": "https://www.duchas.ie/en/cbes/5070847/5069969/5099850", "text": "", "school_info": "School: Drong (2)", "metadata": [{"Location:": "Drung, Co. Cavan", "Teacher:": "\nBean Uí Fháinín\n"}, {"Collector": "May Hudson", "Gender": "female", "Address": "Rakenny, Co. Cavan"}, {"Language": "English"}]}, "5009144/4991262/5100660": {"title": "Bird-Lore", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0752, Page 271", "Page 271"], "url": "https://www.duchas.ie/en/cbes/5009144/4991262/5100660", "text": "\n(continued from previous page)\nMichael Kearney, Fermoyle, Lanesborough, Co. Longford. Told by my father Michael Kearney, Fermoyle, Lanesborough, Co. Longford.\n\n\n\nThe wren is said to be the king of all birds. He got to be king in the following way: The eagle wanted to be the king of the birds because of his strength, size and height and beauty. They made up a plan. They were all to gather together and fly up in the air. Whoever would fly up the highest would be the king. The eagle thought he would go up the highest because he was the strongest. When they were starting the wren got inside the eagle's tail. None of them was as strong as the eagle and he went up as far as he was able. He was above the others and he gave a cheer and said \"I am the king of the birds\". Then the little wren came out of his hiding place and flew above the eagle and said: \"You are not the\n(continues on next page)\n", "school_info": "School: Fermoyle (B.), Lanesboro", "metadata": [{"Location:": "Formoyle (Newcomen), Co. Longford", "Teacher:": "\nSs. Mac Eoghain\n"}, {"Collector": "Michael Connor", "Gender": "male", "Address": "Cashelbeg, Co. Longford"}, {"Informant": "Mattie Connor", "Relation": "parent", "Gender": "male", "Address": "Cashelbeg, Co. Longford"}, {"Language": "English"}]}, "5008984/4973852/5110207": {"title": "How the Wren Became King of the Birds", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0707, Page 142", "Page 142"], "url": "https://www.duchas.ie/en/cbes/5008984/4973852/5110207", "text": "\nOne day, all the birds came together to see which of them would be king. To do this, they began to fly upwards to see which of them would fly the highest. While the birds were soaring upwards, the wren sat under the eagle's wing. The eagle thought he went the highest, but then he saw the wren was higher. When the eagle stopped soaring, the wren came out from under his wing and flew a bit higher. The wren became king that day. The other birds decided to kill the wren, because he was too small to be king, but they did not.Laurence DallardFartha\n", "school_info": "School: Maio", "metadata": [{"Location:": "Trohanny, Co. Meath", "Teacher:": "\nMáire Ní Chreaig\n"}, {"Collector": "Laurence Dallard", "Gender": "male", "Address": "Fertagh, Co. Meath"}, {"Language": "English"}]}, "5009059/4982190/5119727": {"title": "The Wren", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0730, Page 351", "Page 351"], "url": "https://www.duchas.ie/en/cbes/5009059/4982190/5119727", "text": "\nThe following story is told about St. Stephen. The Jews were always spying on him because he used to be preaching about Our Saviour. One day the Jewish soldiers proposed to kill him and he went (to) up into a tree to hide. It happened that a wren was in the tree and when the soldiers can near the wren began to flutter. The soldiers looked up and seeing Saint Stephen dragged him down and martyred him by throwing big stones at him. Since that the wren is supposed to be cursed.\n\n\n\nIt is said that when the soldiers were looking for Our Lord to kill Him. He walked over a field of wheat and drops of blood fell from Our Saviour as he walked over it, and by a miracle the\n(continues on next page)\n", "school_info": "School: Knockaville", "metadata": [{"Location:": "Knockaville, Co. Westmeath", "Teacher:": "\nC. de Búrca\n"}, {"Collector": "Michael Ennis", "Gender": "male"}, {"Informant": "Mrs Michael Gowran", "Relation": "grandparent", "Gender": "female", "Address": "Knockaville, Co. Westmeath"}, {"Language": "English"}]}, "5009059/4982190/5119740": {"title": "The Wren", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0730, Page 351", "Page 351"], "url": "https://www.duchas.ie/en/cbes/5009059/4982190/5119740", "text": "\nThe following story is told about St. Stephen. The Jews were always spying on him because he used to be preaching about Our Saviour. One day the Jewish soldiers proposed to kill him and he went (to) up into a tree to hide. It happened that a wren was in the tree and when the soldiers can near the wren began to flutter. The soldiers looked up and seeing Saint Stephen dragged him down and martyred him by throwing big stones at him. Since that the wren is supposed to be cursed.\n\n\n\nIt is said that when the soldiers were looking for Our Lord to kill Him. He walked over a field of wheat and drops of blood fell from Our Saviour as he walked over it, and by a miracle the\n(continues on next page)\n", "school_info": "School: Knockaville", "metadata": [{"Location:": "Knockaville, Co. Westmeath", "Teacher:": "\nC. de Búrca\n"}, {"Collector": "Michael Ennis", "Gender": "male"}, {"Informant": "Mrs Michael Gowran", "Relation": "grandparent", "Gender": "female", "Address": "Knockaville, Co. Westmeath"}, {"Language": "English"}]}, "5044583/5023950/5140989": {"title": "Hallow Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0803, Page 269", "Page 269"], "url": "https://www.duchas.ie/en/cbes/5044583/5023950/5140989", "text": "\n(continued from previous page)\nare lifted off and hidden sometimes the gates of neighbours, not on speaking terms are exchanged the ensuing row being a source of great enjoyment to the perpetrators of the dead. Other tricks are also played and of course the victim is always some crunky old man or other individual who has incurred the displeasure of the young boys of the place. Cart-wheels are taken and hidden or exchanged carts are dismantled and taken into houses where they are re-assembled. Doors are tied and chimneys stuffed with straw or hay. Many people will not leave their own houses after dark on Nov. 1st. The belief is that all the souls are supposed to re-visit the places where they lived while on earth and no Catholic will retire on that night without saying at least a prayer for the departed.\n\n\n\nOld custom still survives in the locality though it has lost much of it's splendour and traditions.  It is now carried out only by a few who go about from house to house for sole purpose of collecting whatever money people may be pleased to give them. Groups consisted of only three or four young people. There is no music or\n(continues on next page)\n", "school_info": "School: Kilclonfert", "metadata": [{"Location:": "Kilclonfert, Co. Offaly", "Teacher:": "\nT. Mainséal\n"}, {"Language": "English"}]}, "5044651/5029041/5145056": {"title": "Bird-Lore - The Thrush", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0820, Page 330", "Page 330"], "url": "https://www.duchas.ie/en/cbes/5044651/5029041/5145056", "text": "\nBird LoreThe ThrushThe thrush builds her nest in a bush in a ditch, and she makes it out of moss and hair and hay.She lays white and speckled eggs, and she hatches them for three weeks.  She eats grubs and worms.  She stays here all the year round.  Her colour is speckled and she is a fairly big bird.She is a very nice singer and she is middling tame.  She is a very nice and clean bird.  She feeds her young ones with grubs and insects.  Her bill is black and is very small.Writer's name and address:  Willie Joe Carry, Kinnitty.Informant's name and address: Mr. W. Carry, Kinnitty, Co. Offaly.\n\n\n\nThe WrenThe wren is the smallest of all the birds.  She lays fourteen eggs and they are a kind of white.  She makes her nest of moss and hair.  She makes it in a bush in a ditch or in an old wall.\n(continues on next page)\n", "school_info": "School: Kinnitty", "metadata": [{"Location:": "Kinnitty, Co. Offaly", "Teacher:": "\nS. Ó Murchadha\n"}, {"Collector": "Willie Joe Carry", "Gender": "male", "Address": "Kinnitty, Co. Offaly"}, {"Informant": "William Carry", "Gender": "male", "Address": "Kinnitty, Co. Offaly"}, {"Language": "English"}]}, "4921606/4884248/5149880": {"title": "The Wren", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0291, Page 181", "Page 181"], "url": "https://www.duchas.ie/en/cbes/4921606/4884248/5149880", "text": "\nThe wren, the wren, the king of all birds, St. Stephen's Day she was caught in the furze, Although she is little, her family is great,Rise up land-lady and give us a treat If you'll give it at all, don't give it too small. For that would not satisfy us at-all. 2As I went up through Loughawee, I spied my wren upon a tree, Up with my stick and I gave her a fall,And I brought her here to visit you all. 3I hunted my wren all round Glandore, I hunted my wren from shore to shore, O'er hedges, and ditches, and fields so green, And such fine sport was never seen. 4Now my wren she is plainly seen, She is well mounted on a holly - tree,\n(continues on next page)\n", "school_info": "School: Béal Átha an Dá Chab", "metadata": [{"Location:": "Ballydehob, Co. Cork", "Teacher:": "\nSíle Ní Mhathúna\n"}, {"Collector": "Kitty Cronin", "Gender": "female", "Address": "Coolagh More, Co. Cork"}, {"Informant": "John Cronin", "Relation": "parent", "Gender": "male", "Age": "50", "Occupation": "farmer", "Address": "Coolagh More, Co. Cork"}, {"Language": "English"}]}, "5162131/5156743/5192504": {"title": "Folklore - Customs on Feast Days", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0603, Page 076", "Page 076"], "url": "https://www.duchas.ie/en/cbes/5162131/5156743/5192504", "text": "\n(continued from previous page)\nAn apple is also put into a pan of water and then one is led blindfolded up to it, with the hands tied behind the back.  One then tries to grab the apple with the mouth and if successful receives the apple.  A lot of nuts and apples are eaten on that night.Christmas Day: On that day a goose is killed in every house as a custom.Christmas night is kept on the 24th: of December.\n\n\n\nThe Wren, The Wren, the King of all birds.St Stephen's Day was caught in the furze.Up with the kettle and down with the pan.Give me my answer and let me be on.The Wren is dry and so am I.A penny or two to make me fly.From bush to bush: from tree to tree.\n(continues on next page)\n", "school_info": "School: Crannach, Inis", "metadata": [{"Location:": "Cranny, Co. Clare", "Teacher:": "\nMícheál Ó Maolchaoin\n"}, {"Informant": "James Doyle", "Gender": "male", "Address": "Six Cross Roads, Co. Clare"}, {"Language": "English"}]}, "5215813/5214773/5221466": {"title": "The Wren", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138D, Page 03_coverA", "Page 03_coverA"], "url": "https://www.duchas.ie/en/cbes/5215813/5214773/5221466", "text": "\n[/]\n(continues on next page)\n", "school_info": "School: St Bridget's", "metadata": [{"Location:": "Derrymore, Co. Mayo", "Teacher:": "\nMáire Uí hOistín\n"}, {"Collector": "Áine Ní Oistín", "Gender": "female", "Address": "Derrymore, Co. Mayo"}, {"Language": "English"}]}, "5215813/5215494/5240198": {"title": "Why the Robin's Breast is Red", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138D, Page 18_021", "Page 18_021"], "url": "https://www.duchas.ie/en/cbes/5215813/5215494/5240198", "text": "\nThe robin has a red breast because when the thorns was on Our Lord's head the robin came and went to pull out a thorn. It is stuck in her own breast and the blood began to flow and that is why the robin's breast is red.\n\n\n\nWhen the soldiers were after Our Lord to kill Him they were passing by a field of wheat. They me a robin and a\n(continues on next page)\n", "school_info": "School: St Bridget's", "metadata": [{"Location:": "Derrymore, Co. Mayo", "Teacher:": "\nMáire Uí hOistín\n"}, {"Collector": "Bríghid Ní Chonmacháin", "Gender": "female"}, {"Language": "English"}]}}