{"4427869/4352232/4435964": {"title": "Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0103, Page 033", "Page 033"], "url": "https://www.duchas.ie/en/cbes/4427869/4352232/4435964", "text": "\nThe last faction fight in this district took place about eighty-five years ago, when three \"camps\" of the Farraghe faction came to the fair of Cong which was then held about a statute mile east of that village. These faction fights did not apply directly to this district as they were fought between the people of Ballinrobe and Cong but as the Neale lies practically mid-way between these two places more than probably some of its people were involved.It is said in connection with the fight above referred to, that the Farraghe faction was opposed by a party led by Mareus Cunalta (Nalty) who, when all his men deserted him, fought his opponents single-handed, and by the ruse of entering their tents from the rear and attacking those who defended the doors so terrified them that he was able to make good his escape by getting a boat at Funshinagh near Cross where he crossed Lough Corrib to Oughterard, and from thence to Dublin and London, and tales are told amongst the people here of his deeds of strength and bravery in these cities.\n", "school_info": "School: The Neale (B.)", "metadata": [{"Location:": "Neale, Co. Mayo", "Teacher:": "\nTomás Mac an Bháird\n"}, {"Language": "English"}]}, "4428095/4378098/4437320": {"title": "West Waterford Factions", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0637, Page 57", "Page 57"], "url": "https://www.duchas.ie/en/cbes/4428095/4378098/4437320", "text": "\nWest Waterford Factions.There used to be a lot of faction fighting in West Waterford up to fifty years ago. The (Skanrests) 'Skanarests' and the 'Caravats' were the titles given to the most well known factions. The 'Skanarests' came from Modeligo and wore a white waistcoat. The 'Caravats' came from the Touraneema district and wore a kind of cravat. These two factions used meet at the annual fair of Modeligo. The fighting began after the buying and selling was done. Each man was armed with a stout stick and stones were often used. Fine young men were sometimes maimed for life and it was a common sight after the fight to see badly injured people lying on the fair ground. Each faction tried to drive the other across the river Finisk and victory came to the side which succeeded. Each side was led by a recognised captain\n(continues on next page)\n", "school_info": "School: Ceapach Chuinn (B.)", "metadata": [{"Location:": "Cappoquin, Co. Waterford", "Teacher:": "\nProinnsias Ó Laoghaire\n"}, {"Collector": "Carl O' Leary", "Gender": "male", "Address": "Cappoquin, Co. Waterford"}, {"Informant": "Owen O' Keefe", "Relation": "unknown", "Gender": "male", "Age": "85", "Occupation": "farmer", "Address": "Shanbally, Co. Waterford"}, {"Language": "English"}]}, "4428095/4378100/4437321": {"title": "West Waterford Factions", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0637, Page 59", "Page 59"], "url": "https://www.duchas.ie/en/cbes/4428095/4378100/4437321", "text": "\nThe leader of the Waterford branch of the 'Caravats' was William McCarthy and the principal members of the 'Caravats' were the McCarthys, the Barrons, the Gleesons. the Cullinanes and the Walls.The leader of the 'Seanabheses' was William Smith and his principal followers were the Powers.the Currrans, the Crottys and the O'Mearas.\n\n\n\nTwo famous faction fighters in this county were the Barrons and the O'Mearas. The Barrons were followers of the Caravats, and the OMearas were followers of the Shanavest. They were always very hostile toward each other, even when the other factions were not engaged in combat these two families always\n(continues on next page)\n", "school_info": "School: Ceapach Chuinn (B.)", "metadata": [{"Location:": "Cappoquin, Co. Waterford", "Teacher:": "\nProinnsias Ó Laoghaire\n"}, {"Collector": "Thomas Conway", "Gender": "male"}, {"Informant": "Mr L. Kiely", "Relation": "unknown", "Gender": "male"}, {"Language": "English"}]}, "4428095/4378100/4437322": {"title": "West Waterford Factions", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0637, Page 59", "Page 59"], "url": "https://www.duchas.ie/en/cbes/4428095/4378100/4437322", "text": "\nThe leader of the Waterford branch of the 'Caravats' was William McCarthy and the principal members of the 'Caravats' were the McCarthys, the Barrons, the Gleesons. the Cullinanes and the Walls.The leader of the 'Seanabheses' was William Smith and his principal followers were the Powers.the Currrans, the Crottys and the O'Mearas.\n\n\n\nTwo famous faction fighters in this county were the Barrons and the O'Mearas. The Barrons were followers of the Caravats, and the OMearas were followers of the Shanavest. They were always very hostile toward each other, even when the other factions were not engaged in combat these two families always\n(continues on next page)\n", "school_info": "School: Ceapach Chuinn (B.)", "metadata": [{"Location:": "Cappoquin, Co. Waterford", "Teacher:": "\nProinnsias Ó Laoghaire\n"}, {"Collector": "Patrick Moynihan", "Gender": "male", "Address": "Cappoquin, Co. Waterford"}, {"Informant": "Ellen Moynihan", "Relation": "parent", "Gender": "female", "Age": "50", "Address": "Cappoquin, Co. Waterford"}, {"Language": "English"}]}, "4428095/4378108/4438947": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0637, Page 66", "Page 66"], "url": "https://www.duchas.ie/en/cbes/4428095/4378108/4438947", "text": "\n(continued from previous page)\nable to go out the door.(My grandfather Tom Kean told me this story. Thomas McCarthy.\n\n\n\nLong ago the Seanabhests and the Carabhats used to come to the \"Cats\" * to fight. They used to use sticks and stones and often killed one another with them. The Carabhats generally won. The girls used to come to see the fights. One day Tom O'Donnell's mother [since dead] saved the life of a Carabhat. The man's name was John Fox. He was attacked by all the Seanabhests and he would have been killed if Mrs. O'Donnell hadn't thrown herself on him to protect him when he was lying unconscious.The two factions often went to Mountain Castle * to fight and it was seldom any man left the fair without getting some kind of a blow.\n(continues on next page)\n", "school_info": "School: Ceapach Chuinn (B.)", "metadata": [{"Location:": "Cappoquin, Co. Waterford", "Teacher:": "\nProinnsias Ó Laoghaire\n"}, {"Collector": "Thomas Conway", "Gender": "male"}, {"Informant": "Mr Tom O' Donnell", "Relation": "unknown", "Gender": "male", "Age": "78", "Address": "Cappoquin, Co. Waterford"}, {"Language": "English"}]}, "4428136/4381109/4459667": {"title": "An Old Fair", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0647, Page 285", "Page 285"], "url": "https://www.duchas.ie/en/cbes/4428136/4381109/4459667", "text": "\n(continued from previous page)\nthe Sean-Bheist beat him unmercifully until he was dead. This the other did not mind.\n\n\n\nAbout sixty years ago a man near Millstreet came to Mountain Castle. At that time the 'Sean-Bheists' and the 'Carabhats' were fighting. The man, however, was a Sean-Bheist and after the fair he played football with them against the Carabhats.After some time he had an argument with a Carabhat. They fought and the Sean-Bheist won. When the Sean-Bheist was returning he crossed the river and bent down to wash his wound. Suddenly his foe came behind him. Lifting up a heavy stone from the ground he hit him on the head and laid his rival dead on the ground.\n(continues on next page)\n", "school_info": "School: Tuar an Fhíona, Cluain Meala", "metadata": [{"Location:": "Tooraneena, Co. Waterford", "Teacher:": "\nGearóid Ó Coindealbháin\n"}, {"Collector": "Pádraig Teidhirs", "Gender": "male", "Address": "Cahernaleague, Co. Waterford"}, {"Informant": "Seumas Ó hAnnracháin", "Relation": "unknown", "Gender": "male", "Address": "Ballynamult, Co. Waterford"}, {"Language": "English"}]}, "4428136/4381110/4459668": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0647, Page 286", "Page 286"], "url": "https://www.duchas.ie/en/cbes/4428136/4381110/4459668", "text": "\n(continued from previous page)\n[-]\n\n\n\nOnce two men a \"Sean-Bhiest\" and a \"Carabhat\" had a fight. After a while the former, was winning. When had knocked the \"Carabhat\" he began to kick him. To kill him right he hit him on the head with a big stone. The names of those two men were I think Philip O'Meana and a man named Butler.\n", "school_info": "School: Tuar an Fhíona, Cluain Meala", "metadata": [{"Location:": "Tooraneena, Co. Waterford", "Teacher:": "\nGearóid Ó Coindealbháin\n"}, {"Collector": "Pádraig Teidhirs", "Gender": "male", "Address": "Cahernaleague, Co. Waterford"}, {"Informant": "Pádraig Mac Cártaigh", "Relation": "unknown", "Gender": "male"}, {"Language": "English"}]}, "4428107/4379041/4460508": {"title": "Ballyduff Races", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0640, Page 53", "Page 53"], "url": "https://www.duchas.ie/en/cbes/4428107/4379041/4460508", "text": "\n(continued from previous page)\nRiardon owned Vanbay. So ended the famous Ballyduff races.\n\n\n\nThe number of houses in the village at one time - up to 1900 - was very small and the sole landlord was John Tobin. He was in need of money so he sold half of his share to a man named John Stafford.The tenants held a meeting and decided to call on their respective landlords to lower the rents. John Stafford reduced the rent but John Tobin refused to do so.The inhabitants of the village then sided themselves with John Stafford and called themselves \"Lackeys\". the people from the hillside and country around sided with John Tobin and called themselves \"Danes.\"Fights between the parties were\n(continues on next page)\n", "school_info": "School: West Waterford Branch I.N.T.O", "metadata": [{"Location:": "Coshmore and Coshbride, Co. Waterford", "Teacher:": "\nJames Cashman\n"}, {"Collector": "James Cashman", "Gender": "male"}, {"Language": "English"}]}, "4428121/4380029/4462020": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0644, Page 11", "Page 11"], "url": "https://www.duchas.ie/en/cbes/4428121/4380029/4462020", "text": "\nBhí fear bocht ann uair amháin agus bhí brionglóid aige an oidhce seo go raibh croca óir i bhfolach in chistin feirmeora inaice Ceapach Chuinn. Aon lá amháin tháinigh sé ó Conntae an Chláir chun an tighe seo agus d'innis sé a scéal do mhuinntir an tighe. Nuair a tháinig an oidhche chuaidh an fear bocht a chodladh. Annsan chuaidh an feirmeoir ag lorg an croca óir agus fuair sé é. Nuair d'éirig an fear bocht ar maidean ní raibh aon cróca óir le faghail aige agus chaith sdul abhaile arís gan é.\n", "school_info": "School: An Teampoll Geal, Ceapach Chuinn", "metadata": [{"Location:": "Whitechurch, Co. Waterford", "Teacher:": "\nLiam Ó Faoláin\n"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "male", "Age": "45", "Occupation": "feirmeoir", "Address": "Cappagh, Co. Waterford"}, {"Language": "Irish"}]}, "4428122/4380024/4462298": {"title": "Na Seanveists agus na Carbhats", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0644, Page 105", "Page 105"], "url": "https://www.duchas.ie/en/cbes/4428122/4380024/4462298", "text": "\nPósadh m'athair 68 bliaina ó shoin agus is leis na Carabhats ab eadh féin agus gach duine ar bhain leis. I gcreidfidhe gur phós sé iníon Sheanbhest. Bhí san dona go leor ach fós níor bhuail isteach go docht daingean in aigneaoinne i láthair na bain-fhéise an choir millteach a bhí déanta.Nuair a bhí árd-cheó na h-oíche ar a aoirde agus na 'braoiníní cruadha' ag oibriughadh agus aon nabhfeidm san le feiscint go soiléir, 'seadh chaith duine éigin isteach sa crann-sparainne seo : \"Cad fén diabhal a bhí ar Sheán Leathan\" - ba sin mo shean-athair - \"agus a rughaon dó thabhairt do giolla na gCarabhats?\" Dá gcaithfidhe bolcán isteach so a bhí láthair ia ar éigin a bheadh an scéal níos measa ná mar a bhí.I dheachar bhí an dá dream i scórnachaibh a chéile; bhí sé ina cogadh dearg eatortha: leath díobh ar lár agus gan cnuig asta agus na mná ag cóireacht. Ní féidir cur síos ar rí-rá na h-oíche sin agus an búirthíl agus an  dearg-bhuile a bhuail na daoine bochta san gan truagh gan taist, de réir chúntas mo athar. Bhí áthas ar féin teacht as lena anam. Ní raibh de anuimh air ach cnapán mór ina chloigeann agus lámh-leonta. Curtar deire le gach troid agus léi seo mar cách agus sa deire thíar thall d'fhoghlaimia an dá dream baoth so gur fearr an síodhán ná an toirmeasc agus in ionad a chéile chuaidh an dá bhéic crosta san Carabhat agus Sean-bheist in éig.\n(continues on next page)\n", "school_info": "School: Coill Íseal, Ceapach Chuinn", "metadata": [{"Location:": "Killeeshal, Co. Waterford", "Teacher:": "\nSeán Ó Conaire\n"}, {"Collector": "Seán Ó Conaire", "Gender": "male"}, {"Language": "Irish"}]}, "4428122/4380026/4462300": {"title": "Aonach Chaisleáin an tSléibhe", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0644, Page 107", "Page 107"], "url": "https://www.duchas.ie/en/cbes/4428122/4380026/4462300", "text": "\nTá leath-chead bliain ann anois ó bhí an t-aonach sa cheanntar seo i bparóiste Midh Deoilge, i lár na nDéise, atá sé suite  agus ar bruach abhann na Fionn-uisge. Sa Bhealtaine a beadh lá an aonaig. Is cuimhin liom go rabhas féin ag an aonach  deireannacg seo. Thug mo athair cead dom dul leis mar bhí le díol aige sean-ghabhar mór, bán, maol. Bhíos acrach chun aireachas do thabhairt don maol. D'oir so do mo athair mar bhí rud beag dúile sa mbrannín cruaidh aige chun a mhisneach agus a choidhe do choiméad ar boradh agus dar ndóigh ba mhaith an fheudáil chuige sin é. Ba mhinic budh phráidhmneach bolgam den deúichtín mar ba soléir do duine a bheadh láithreach a chidhfeadh na ciotrainní, na h-achrainní, na iomeasgháil agus na hiarrachtaí treuna, calma a thugtaoí fé chloiginn a chéile do chur i na bfiar le neart phléascaidh leis na mbataibh dhroighinn a bhíodh á righniughadh sa t-simné ó san go deire na bliadna.Tar éis mór-chuid duaidh d'éirigh le mo athair an gabhar do dhíól ar trí ia raol ach amháin trí-pingne 'luck penny' do thabhairt uaidh. Tá fhios agam anois go raibh an gabhar bocht san chomh-aosta le 'Bóthar Eochaill' agus 'Baty an Cnagaire' a bhíodh againne i gcónaí airthi mar ainm agus dar ndóigh ní gá ceist do chur ina thaobh.Im thráthnóna tháinigh fear mór fiadhain stuacach an seanncum do fhágáil ó mo athair ach ní fheadar cad é an crann fearainne. Bhí sé 'ag baint fóidíní' buailte nuair a thug mo athair fogha idurthar é agus d'éirigh leis é a chur á thomhas féin ar fleasc a dhroma. Nuair a bhí sé ar lár aige as go bráth le mo athair agus d'fhág mise ar crith le uathbhás agus scoimhle.Bhí fonn ar mo chosa féin stailc do ghlachadh ach comh luath is do éirigh liom iad do mhealladh chun bóthair as go bráth liomsa leis ar mo athar ach ní bhfuaras leagaint na\n(continues on next page)\n", "school_info": "School: Coill Íseal, Ceapach Chuinn", "metadata": [{"Location:": "Killeeshal, Co. Waterford", "Teacher:": "\nSeán Ó Conaire\n"}, {"Collector": "Seán Ó Conaire", "Gender": "male"}, {"Language": "Irish"}]}, "4428047/4371977/4474065": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0145, Page 218", "Page 218"], "url": "https://www.duchas.ie/en/cbes/4428047/4371977/4474065", "text": "\nAbout eighty or ninety years ago faction fights used to be carried on at the fairs of Townnahowen and Newtown. Any old spleen between families would generally end in a fight at the fair. The weapons used were blackthorn sticks and ash plants. Sometimes stones were used when the sticks would fail.The parties on both sides would go to the fair prepared for the fray and would be helped by their friends and well-wishers. Any person who was suspected of being friendly with either party was generally attacked by the opposite party during the combat, even though he took no part in the fight. Tom McFee (who died in Rathoma about thirty years ago and who was eighty years\n(continues on next page)\n", "school_info": "School: Baile Mhic Citheóla", "metadata": [{"Location:": "Ballymackeehola, Co. Mayo", "Teacher:": "\nSeán Mac Giolla Bharraigh\n"}, {"Collector": "James A. P. Gilvarry", "Gender": "male", "Address": "Rathoma, Co. Mayo"}, {"Informant": "Miss S. Browne", "Gender": "female", "Address": "Ballymackeehola, Co. Mayo"}, {"Language": "English"}, {"Location": "Tonrehown"}]}, "4428333/4396250/4485545": {"title": "A Faction Fight", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1048, Page 285", "Page 285"], "url": "https://www.duchas.ie/en/cbes/4428333/4396250/4485545", "text": "\nA man named Waters who lived in Downstrands had four nephews. He went to the fair of Maghera More where he got badly beaten by Connell Mac Loone of Letterily. One of his nephews, named Patrick, swore to have revenge. In those days the people smuggled tobacco into the country along the coasts. Patrick lay hidden in a cave near the roadway over which Connell's nephew was passing with his cart, and took some tobacco out of the cart. The other man said nothing. Patrick took some more out and the man replied \"You will take no more\". Both men fought a duel and Patrick won.When Connell Mac Loone heard about it he was very angry. Patrick was going to America shortly afterwards and he decided to go to Maghera Mor fair before going. When he reached Maghera Móre he saw Connell coming towards him. The two men began to fight and Patrick was winning, and when he had Connell half-way down the latter said \"Don't put\n(continues on next page)\n", "school_info": "School: Scoil Dhalláin Forgaill", "metadata": [{"Location:": "Kilclooney Beg, Co. Donegal", "Teacher:": "\nS. Ó Baoighill\n"}, {"Collector": "Brigid T. Moore", "Gender": "female", "Address": "Clooney, Co. Donegal"}, {"Informant": "Pat Moore", "Gender": "male", "Age": "78", "Address": "Clooney, Co. Donegal"}, {"Language": "English"}]}, "4493672/4409652/4519207": {"title": "Faction Fighting", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1087, Page 027", "Page 027"], "url": "https://www.duchas.ie/en/cbes/4493672/4409652/4519207", "text": "\nIn the townland of Gortmacall adjacent to Milford, Co. Donegal, lived a farmer named Andrew Callaghan. He was a bachelor and lived alone in his farm which he sold a few years before his death to Mr. Diamond of Milford. His house is now in ruins. At this time of his death about twenty years ago he was a man of eighty years of age. In Andrew's early years faction fighting was common in this part of the country. Sometimes it was catholics against Protestants and sometimes people of one family connection against another family group. When these rival groups met at fairs markets or other gatherings it\n(continues on next page)\n", "school_info": "School: Baile na nGalloglach (Milford)", "metadata": [{"Location:": "Millford, Co. Donegal", "Teacher:": "\nTadhg Ó Súilleabháin\n"}, {"Collector": "Kathleen Mills", "Gender": "female", "Address": "Millford, Co. Donegal"}, {"Informant": "Miss S. Ward", "Gender": "female", "Age": "34", "Address": "Millford, Co. Donegal"}, {"Language": "English"}]}, "4493672/4409654/4519227": {"title": "My Home District", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1087, Page 029", "Page 029"], "url": "https://www.duchas.ie/en/cbes/4493672/4409654/4519227", "text": "\nI live in Milford, Co. Donegal in the parish of Tullyfern and in the barony of Milmacrennan. Milford got its name from the mill at the bottom of the town which was built about  a hundred years ago and from a river at the bottom of the town also where there was a ford or stepping stones. \"Baile na nGalloglach was the old name for Milford. The name means \"The town of the foreign soldiers\" or Gallowglasses who were hired by Donegal Chieftains in time of war. The Gallowglasses gave  a great account of themselves in a battle that was fought where Milford now stands. The Landlord and his agents had great difficulty in pronouncing and writing this name so they changed it to Milford. There are about eighty four houses in Milford and  population of about three hundred and sixty. Sweeney and\n(continues on next page)\n", "school_info": "School: Baile na nGalloglach (Milford)", "metadata": [{"Location:": "Millford, Co. Donegal", "Teacher:": "\nTadhg Ó Súilleabháin\n"}, {"Collector": "Una Mc Cafferty", "Gender": "female", "Age": "14", "Address": "Millford, Co. Donegal"}, {"Language": "English"}, {"Location": "Millford"}]}, "4493670/4409454/4522549": {"title": "Historic", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1086, Page 195", "Page 195"], "url": "https://www.duchas.ie/en/cbes/4493670/4409454/4522549", "text": "\n(continued from previous page)\non the map which Woodhouse had in his possession. Woodhouse, I believe, died rather unexpectedly and nothing more was heard of the map or the vein of coal but the old people here still believe that Woodhouse believed that coal was to be found and they believed in Woodhouse. They often wonder that tests were never made in the area mentioned.\n\n\n\nThis faction fight was of a religious nature. A woman named Poar at the instigation of a Presbyterian named Sam Laird shook a daffodil in the face of a Catholic man named Duffy and taunted him about his religion. It appears that Duffy struck the woman and this started a row. This row was apparently settled but both sides gathered on the fair day of May 1813 and a very serious fight took place. Three persons were killed on each side, and by a strange coincidence a father and son were killed on each side. On the Catholic side a father and son named McConighly and a man named O'Donnell were killed and on the Presbyterian side a father and son named McCauley and a man named Sam Wallace were killed.\n", "school_info": "School: Kerrykeel", "metadata": [{"Location:": "Carrowkeel, Co. Donegal", "Teacher:": "\nSéamus Mac Gabhann\n"}, {"Collector": "Séamus Mac Gabhann", "Gender": "male", "Occupation": "múinteoir"}, {"Informant": "Cormac Lurgan", "Gender": "male", "Age": "74", "Address": "Ranny, Co. Donegal"}, {"Language": "English"}]}, "4493685/4410552/4524645": {"title": "Local Sports of Long Ago and Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1090, Page 441", "Page 441"], "url": "https://www.duchas.ie/en/cbes/4493685/4410552/4524645", "text": "\nAbout fifty years ago there was a great game carried on around this district called caman. It used to be played on St Stephens day. on the Portsalon shore. There were two teams. It was played with sticks with a turned end on them and wooden balls. The parish was divided into two parts one of the teams stayed on one side of the stocker burn and the other team stayed on the other side they played cross the burn. They would play for some gallons of whiskey. Then they would go to a public house at night they were foes all day but then they would become friends at night. When they would be playing during the day the ball would go out into the tide they would all run out to their necks in the water and the whole lot of them would fall on each other.A hundred years ago there were what the called faction fights. There were what they called groups or parties. If a man had a grievance against his neighbour or other he collected his party to meet his opponents at a fair or market and challenge the other party and the weapons they were black thorn stocks or Shillelaghs. They would fight until one side\n(continues on next page)\n", "school_info": "School: St Davaddog's, Tamney", "metadata": [{"Location:": "Tawny, Co. Donegal", "Teacher:": "\n-\n"}, {"Collector": "Katie Mc Bride", "Gender": "female"}, {"Language": "English"}]}, "4493685/4410553/4524646": {"title": "Local Sports of Long Ago and Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1090, Page 442", "Page 442"], "url": "https://www.duchas.ie/en/cbes/4493685/4410553/4524646", "text": "\n(continued from previous page)\nwould defeat the other and beat them out of the town. There was a man in the lower part of the parish who was very much in the habit of rising a row in the town of Rossnakill. So the authorities had to put him under bail. He would get some of his friends to raise a row he would walk in  front of them over to Balina then he would call back to his man \"Keep chap\" boys till you get over the Balina bridge\". he was free of his bail there.\n\n\n\nIn olden days when the men went to the fairs a good lot of them got drunk. When the men got into a rage with a bad fair the faced one and a nother and began to fight. The way the  fought was by throwing stones on a sling. When one man got hit with a stone he jumped at another man and the tow would begin to fight. The would hammer one a nother with big black thorn sticks. Some men got as much as they were not able to eat there food. They had to drink milk to keep them alive. Other people got as much as the were left unconscious what the would them do with them was leve them about a yard from a lough to see would the roll in.\n", "school_info": "School: St Davaddog's, Tamney", "metadata": [{"Location:": "Tawny, Co. Donegal", "Teacher:": "\n-\n"}, {"Collector": "Mary Ann Gibbons", "Gender": "female"}, {"Language": "English"}]}, "4566067/4564088/4572168": {"title": "Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0027, Page 0240", "Page 0240"], "url": "https://www.duchas.ie/en/cbes/4566067/4564088/4572168", "text": "\nA few hundred years from now there were great Faction Fights between Donmore and Tuam in Donmore. The people used to gather at a certain spot and every second man would bring a cart and horse and one man would be in charge of about thirty men.When they arrived at the spot to fight they looked for the enemy. It was a custom at that time that they should hide in the ditches. Each party had strong sticks with knobs on them. Very many fell with wounds from blows of the sticks. As soon as the fight was over all that were hurt were layed on straw.For that purpose the men made straw beds on the carts. A few miles from the battlefield there was a large house in which the wounded received first aid. Many brave men received broken legs and arms and one of them who was brave and received a few sticks in his head\n", "school_info": "School: Scoil na mBráthar, Tuaim", "metadata": [{"Location:": "Tuam, Co. Galway", "Teacher:": "\nAn Br. Ó Duinn\n"}, {"Collector": "Eamon de Baldráin", "Gender": "male", "Address": "Tuam, Co. Galway"}, {"Language": "English"}]}, "4566067/4564089/4572171": {"title": "A Cave", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0027, Page 0241", "Page 0241"], "url": "https://www.duchas.ie/en/cbes/4566067/4564089/4572171", "text": "\nThere is a great on the top of Healy's hill on the Denmore Rd near the Fairy Mills. It is said that within the cave was found a sword and shield belonging to a soldier of some army.\n\n\n\nSome arms were found about a few miles in the from Tuam in the village of Cusceh. It is not known what was found but it was found under a big stone by a soldier.\n", "school_info": "School: Scoil na mBráthar, Tuaim", "metadata": [{"Location:": "Tuam, Co. Galway", "Teacher:": "\nAn Br. Ó Duinn\n"}, {"Collector": "Eamon de Baldráin", "Gender": "male", "Address": "Tuam, Co. Galway"}, {"Language": "English"}]}, "4566067/4564089/4572172": {"title": "A Cave", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0027, Page 0241", "Page 0241"], "url": "https://www.duchas.ie/en/cbes/4566067/4564089/4572172", "text": "\nThere is a great on the top of Healy's hill on the Denmore Rd near the Fairy Mills. It is said that within the cave was found a sword and shield belonging to a soldier of some army.\n\n\n\nSome arms were found about a few miles in the from Tuam in the village of Cusceh. It is not known what was found but it was found under a big stone by a soldier.\n", "school_info": "School: Scoil na mBráthar, Tuaim", "metadata": [{"Location:": "Tuam, Co. Galway", "Teacher:": "\nAn Br. Ó Duinn\n"}, {"Collector": "Eamon de Baldráin", "Gender": "male", "Address": "Tuam, Co. Galway"}, {"Language": "English"}]}, "4566067/4564090/4572175": {"title": "Clais an Aifrinn", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0027, Page 0242", "Page 0242"], "url": "https://www.duchas.ie/en/cbes/4566067/4564090/4572175", "text": "\nIn the parish of Cummer near Tuam there is an open pit known as \"Clais an Aifrinn\" in which a cross is erected where the people used to go to Mass at the time of the Penals Laws\n", "school_info": "School: Scoil na mBráthar, Tuaim", "metadata": [{"Location:": "Tuam, Co. Galway", "Teacher:": "\nAn Br. Ó Duinn\n"}, {"Collector": "Seán Seoigheach", "Gender": "male", "Address": "Tuam, Co. Galway"}, {"Language": "English"}]}, "4566067/4564091/4572178": {"title": "An Officer That Was Killed by Countrymen", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0027, Page 0243", "Page 0243"], "url": "https://www.duchas.ie/en/cbes/4566067/4564091/4572178", "text": "\nThere was once an officer who was standing at a crossroad. This was in Penal Days in Ireland. There was a lot of country Protestants they were very proud. The officer was a Catholic.There was about ten Protestant countrymen coming down the road. They say the officer saying his prayers on the road. They went back to one of their houses and got some pick's and ran up the road to kill the officer because he was a Catholic. The officer saw them and ran away across the fields. He ran up a hill the countrymen caught him and killed him. A stone then fell and killed them all.\n", "school_info": "School: Scoil na mBráthar, Tuaim", "metadata": [{"Location:": "Tuam, Co. Galway", "Teacher:": "\nAn Br. Ó Duinn\n"}, {"Collector": "Seán Ó Monacháin", "Gender": "male", "Address": "Tuam, Co. Galway"}, {"Informant": "Mrs Hancock", "Gender": "female", "Age": "59", "Address": "Tuam, Co. Galway"}, {"Language": "English"}]}, "4566067/4564092/4572181": {"title": "Factions Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0027, Page 0244", "Page 0244"], "url": "https://www.duchas.ie/en/cbes/4566067/4564092/4572181", "text": "\nThere is a place in Co Galway called Torloughmore noted for notorious Faction Fights. The parties used to meet there. On a fair day which was held on first of August some of the men had lead melted on the top of their sticks, so that the blow they gave would cause death. The women too were fighting.One fair day the parties could not start a fight so one man stepped out of the crowd and took off his coat, threw it on the ground, and defied any man to step on it. Out came another man who was anxious to fight. He did not get time to say anything. He was knocked down by the blow. Some women took off their stockings and put stones into them and began to swing them around. They caused a great amount of harm. So that brought an end to the Factions fights in Torloughmore.\n", "school_info": "School: Scoil na mBráthar, Tuaim", "metadata": [{"Location:": "Tuam, Co. Galway", "Teacher:": "\nAn Br. Ó Duinn\n"}, {"Collector": "Iosamh Mac Giolla Ceallaigh", "Gender": "male", "Address": "Tuam, Co. Galway"}, {"Language": "English"}]}, "4569046/4566482/4574863": {"title": "Tubberbracken Fair", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0033, Page 0256", "Page 0256"], "url": "https://www.duchas.ie/en/cbes/4569046/4566482/4574863", "text": "\nTubberbracken FairOver fifty years ago a famous fair was held in the townland of Tubberbracken, in a field which is known to day as the \"fair Field\". Cattle, sheep, horses, and turkeys were brought at the fair. In the evening when the business of the day was over, factions fathered and a faction fight took place.At one particular fair there, the leader of the factions trailed his coat along the ground and bemoaned the fact as follows: \"Three a clock, and not a blow struck yet\". Walking up and down the fair, he saw a man laughing at him. Raising his stick he struck this man a heavy blow in the face knocking him down. When this man got up he remarked: \"Why did you hit me? I did nothing to you.\" I know that you did not, but I gave you that up in the chance that you might\".\n", "school_info": "School: Cill Fhínghín", "metadata": [{"Location:": "Killeeneen More, Co. Galway", "Teacher:": "\nSéamus Ó Ceallaigh\n"}, {"Collector": "Ned Kelly", "Gender": "male", "Address": "Kilcornan, Co. Galway"}, {"Informant": "Denis Kelly", "Gender": "male", "Age": "42", "Address": "Kilcornan, Co. Galway"}, {"Language": "English"}]}, "4569046/4566523/4574948": {"title": "A Story of Kilcornan House", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0033, Page 0297", "Page 0297"], "url": "https://www.duchas.ie/en/cbes/4569046/4566523/4574948", "text": "\n(continued from previous page)\nShe opened the door but there was no sign of anything.\n\n\n\nThe races of Rahasan.There were races in Rahasan about fourty years ago. The races were held in the Turlough opposite Rahasan. There were six jumps and about five horses for every race. Always in the Summer when the Turlough was dry, crowds of people would gather to the races. They were held once a year.There were tents and \"trick o'loop\" and all classes of amusements. When the races were over in the evening there was terrible faction fighting among the people.Land agutation started and all the gentry were hunted out of this country and that great and popular was abandoned. The reason the races stopped was, the people had not enough money to keep the races going. They say too that at the last races the faction fighting was so bad that there were so many people injured that the races had to be stopped.\n", "school_info": "School: Cill Fhínghín", "metadata": [{"Location:": "Killeeneen More, Co. Galway", "Teacher:": "\nSéamus Ó Ceallaigh\n"}, {"Informant": "Patrick Kelly", "Gender": "male", "Age": "58", "Address": "Caheradine, Co. Galway"}, {"Language": "English"}]}, "4569054/4567271/4575288": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0035, Page 0357", "Page 0357"], "url": "https://www.duchas.ie/en/cbes/4569054/4567271/4575288", "text": "\nYears ago there were many important events connected with the village in which I live, but the most important of all was the great annual fair held on the first day of May.Those were the days of the faction fighting. Political and personal grievances were generally settled on that day and black eyes and broken bones were very much in evidence for weeks after.In a faction fight at one of these fairs there was a man of the name Michael Silver (Ballinew, Woodville) killed with a blow from another man named Roland.After that the fair was changed to Eserkelly and continued to be held there until the land was divided\n(continues on next page)\n", "school_info": "School: Cill Críosta", "metadata": [{"Location:": "Kilchreest, Co. Galway", "Teacher:": "\nSeán Ó Cléirigh\n"}, {"Collector": "Peggy Forde", "Gender": "female", "Address": "Kilchreest, Co. Galway"}, {"Informant": "Mrs Bridget Forde", "Gender": "female", "Address": "Kilchreest, Co. Galway"}, {"Language": "English"}]}, "4569054/4567272/4575291": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0035, Page 0358", "Page 0358"], "url": "https://www.duchas.ie/en/cbes/4569054/4567272/4575291", "text": "\n(continued from previous page)\nabout twelve years ago.\n\n\n\nIn olden times there used to be a fair in Kilchreest. It was held there once a year on the 22nd of June. A great number of people used to attend this fair, because it was the only one held in the parish.The people who attended these fairs were very fond of fighting and they used to take off their coats and draw them after them, and anyone who walked on it he wold fight that person.It was on this account that the fairs are not still held in Kilchreest. It was changed from Kilchreest to\n(continues on next page)\n", "school_info": "School: Cill Críosta", "metadata": [{"Location:": "Kilchreest, Co. Galway", "Teacher:": "\nSeán Ó Cléirigh\n"}, {"Collector": "Clare Ward", "Gender": "female", "Address": "Ballynacurragh, Co. Galway"}, {"Informant": "John Ward", "Gender": "male", "Address": "Ballynacurragh, Co. Galway"}, {"Language": "English"}]}, "4602723/4598456/4626438": {"title": "Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0190, Page 023", "Page 023"], "url": "https://www.duchas.ie/en/cbes/4602723/4598456/4626438", "text": "\nStories are yet told of faction fights that took place some distance from this school.At the old graveyard of Conwell were two public houses about one hundred and fifty  yards apart. One owned by a man named Clancy, just opposite the graveyard and the other in the townland of Largydonnell near the present post office of Largydonnell.The road between the two public houses appears to have been the popular arena for Glenade faction fights. The McGoey's and the McGloin's formed one faction and the Clancy's the other.The districts involved were Ahanlish and Largydonnell versus Drumcashel and Creevlea, the home of the Clancy's. No serious consequences seems to have followed these fights.\n", "school_info": "School: Ahanlish", "metadata": [{"Location:": "Aghanlish, Co. Leitrim", "Teacher:": "\nPádraig Ó Gallchobhair\n"}, {"Collector": "Pádraig Ó Gallchobhair", "Gender": "male", "Occupation": "teacher", "Address": "Aghanlish, Co. Leitrim"}, {"Language": "English"}]}, "4622996/4622000/4629596": {"title": "Hardship", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0078, Page 220", "Page 220"], "url": "https://www.duchas.ie/en/cbes/4622996/4622000/4629596", "text": "\n(continued from previous page)\ndiseases such as measles, Ringworm, Scarlet fever, Diphteria.\n\n\n\nIn 1920, a cattle drive took place from Caltra. The cattle were driven as far as Monivea. One crowd drove them a few miles where they were met by another crowd who drove them until they met another crowd.\n\n\n\nThere used to be faction fights in Clough nearly every week about thirty- five or thirty years ago. There used to be cattle drives on Clough farm and some people were put to jail on account of them.\n", "school_info": "School: Goirtín", "metadata": [{"Location:": "Gorteen, Co. Galway", "Teacher:": "\nMáiréad Ní Dhubhthaigh\n"}, {"Collector": "Mollie Mannion", "Gender": "female", "Address": "Temple, Co. Galway"}, {"Informant": "Mrs M. Coen", "Gender": "female", "Age": "73", "Address": "Temple, Co. Galway"}, {"Language": "English"}]}, "4602714/4597879/4631681": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0084, Page 038", "Page 038"], "url": "https://www.duchas.ie/en/cbes/4602714/4597879/4631681", "text": "\nWe got this story from Mrs Connolly, Carton, Ballygar.There used to be faction fights in Ballaghlea and when the people were coming home a man would take off his coat and leave it on the road and he would dare any man to walk on the coat and the man who would walk on it the owner of the coat would fight against him and friends on each side would help. The winner of the fight would be first to get a wife. The best faction fighters were Quinn and Hannon.\n\n\n\nThere was a road from Aughrane across to Ballaghlea Chapel and the O Kellys used to go on two carriges over to that church until they turned protestants after the battle of Aughrame in 1691.It is said that the real heads of the O Kellys did not turn protestants and so they were hunted out of their lands and some poorer relations of them that did not turn catholics got the lands.One of the real chieftains of Uí Máine became a priest and went to France with James II.  James Brennan told me this story.\n(continues on next page)\n", "school_info": "School: Ballygar (C)", "metadata": [{"Location:": "Ballygar, Co. Galway", "Teacher:": "\nEithne, Bean Uí Liatháin\n"}, {"Informant": "Mrs Connolly", "Gender": "female", "Address": "Cartron, Co. Galway"}, {"Language": "English"}]}, "4613718/4612137/4644645": {"title": "Faction Fighting", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0406, Page 395", "Page 395"], "url": "https://www.duchas.ie/en/cbes/4613718/4612137/4644645", "text": "\nIn the townland of Knockavalig lived a family of the name of Doody or rather the families of four brothers comprising in all - thirty two men.These men were courageous and warlike and their aid was eargerly sought at faction fights.There was one of them in particular who shone out in deeds of strenght he was known as \"Shawn Láidir\".The \"Pattern day\" at Beale Ballybunion was usually marked out for a faction fight between the two great factions then in North Kerry - the Cooleens + the Mulvihills. Shawn Láidir was enlisted on the side of the Mulvihills on one particular fight. Beale strand was crowded with people as well as the usual tents + apple carts seen\n(continues on next page)\n", "school_info": "School: Islandanny", "metadata": [{"Location:": "Rea, Co. Kerry", "Teacher:": "\nMáire, Bean Uí Chatháin\n"}, {"Collector": "John O Connor", "Gender": "male", "Address": "Rathoran, Co. Kerry"}, {"Language": "English"}]}, "4613718/4612139/4644651": {"title": "Faction Fighting", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0406, Page 397", "Page 397"], "url": "https://www.duchas.ie/en/cbes/4613718/4612139/4644651", "text": "\nFaction Fighting was general about eighty years ago. A parish was divided into two factions and leaders of these were supposed to be the strongest men in the district. They were always bitter enemies and fought with blackthorn sticks which were seasoning for months. The fights usually took place at fairs, races and markets.In this parish the factions were the Cooleens and the Mulvihills. The leader of the Mulvihills was Daniel Kean, Libes, Duagh. On one occasion the Cooleens decided to prevent the Mulvihills of going to Mass so they lined up along the road. Sean Burns happened to be absent this morning and Kean and his men fought their way through them.\n", "school_info": "School: Islandanny", "metadata": [{"Location:": "Rea, Co. Kerry", "Teacher:": "\nMáire, Bean Uí Chatháin\n"}, {"Collector": "John O Connor", "Gender": "male", "Address": "Rathoran, Co. Kerry"}, {"Language": "English"}]}, "4649677/4645817/4659206": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0030, Page 451", "Page 451"], "url": "https://www.duchas.ie/en/cbes/4649677/4645817/4659206", "text": "\nAbout a hundred years ago faction fighting was very common. The game was carried on with black thorn sticks and ash plants. One faction challenged another faction to meet in their town. Then when both sides were ready the fight commenced. They lashed each other with ash plants and black thorns and blood was often spilt. Then when the beaten party surrendered they whet home. The law put an end to this game which is called Faction Fighting. The fights were carried out mostly on fair days and holidays.\n", "school_info": "School: Rathún (Clochar)", "metadata": [{"Location:": "Rahoon, Co. Galway", "Teacher:": "\nSeán Mac Suibhne\n"}, {"Collector": "Bea Mangan", "Gender": "female", "Age": "12", "Address": "Salthill, Co. Galway"}, {"Informant": "(name not given)", "Relation": "grandparent", "Gender": "female"}, {"Language": "English"}]}, "4658465/4658398/4662400": {"title": "Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0229, Page 438", "Page 438"], "url": "https://www.duchas.ie/en/cbes/4658465/4658398/4662400", "text": "", "school_info": "School: Beith Mhór (Beaghmore)", "metadata": [{"Location:": "Beagh More, Co. Leitrim", "Teacher:": "\nPilib Mac Aonghusa\n"}, {"Collector": "May Rose Reilly", "Gender": "female", "Address": "Drumard (Magerraun), Co. Leitrim"}, {"Informant": "Mrs Reilly", "Gender": "female", "Age": "45", "Address": "Drumard (Magerraun), Co. Leitrim"}, {"Language": "English"}]}, "4658465/4658399/4662412": {"title": "Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0229, Page 439", "Page 439"], "url": "https://www.duchas.ie/en/cbes/4658465/4658399/4662412", "text": "\n(continued from previous page)\nend, the smiths won.\n\n\n\nAbout a hundred years ago; there was a (fight) faction fight held in the locality. It was held in a field outside of Carrigallen. The man who owned the field was Mc Gaurahan. The two families that fought were the Sweenies and the Degnan's. They had spite against each other for a long time. So they agreed to fight one day.They gathered their friends on each side together and also all their blood relations. There were about eighty friends on each side. The Degnans were from Drumsilla, And the Sweenies were from Drumderiglin. They arrived at the field about ten oclock. They were armed with black-thorn sticks and loaden\n(continues on next page)\n", "school_info": "School: Beith Mhór (Beaghmore)", "metadata": [{"Location:": "Beagh More, Co. Leitrim", "Teacher:": "\nPilib Mac Aonghusa\n"}, {"Collector": "Lizzie Murphy", "Gender": "female", "Address": "Drumard (Magerraun), Co. Leitrim"}, {"Informant": "Michael Murphy", "Gender": "male", "Age": "50", "Address": "Drumard (Magerraun), Co. Leitrim"}, {"Language": "English"}]}, "4658465/4658401/4662421": {"title": "Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0229, Page 441", "Page 441"], "url": "https://www.duchas.ie/en/cbes/4658465/4658401/4662421", "text": "", "school_info": "School: Beith Mhór (Beaghmore)", "metadata": [{"Location:": "Beagh More, Co. Leitrim", "Teacher:": "\nPilib Mac Aonghusa\n"}, {"Collector": "Kathleen Brady", "Gender": "female", "Address": "Beagh More, Co. Leitrim"}, {"Informant": "Mrs Brady", "Gender": "female", "Age": "50", "Address": "Beagh More, Co. Leitrim"}, {"Language": "English"}]}, "4658465/4658402/4662423": {"title": "Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0229, Page 442", "Page 442"], "url": "https://www.duchas.ie/en/cbes/4658465/4658402/4662423", "text": "\n(continued from previous page)\nwere armed with stones. The O'Rourkes were victorious.\n", "school_info": "School: Beith Mhór (Beaghmore)", "metadata": [{"Location:": "Beagh More, Co. Leitrim", "Teacher:": "\nPilib Mac Aonghusa\n"}, {"Collector": "Chris Masterson", "Gender": "male", "Address": "Cornaferst, Co. Leitrim"}, {"Informant": "Eugene Masterson", "Gender": "male", "Age": "45", "Address": "Cornaferst, Co. Leitrim"}, {"Language": "English"}]}, "4666572/4663009/4666739": {"title": "Local Happenings", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0400, Page 017", "Page 017"], "url": "https://www.duchas.ie/en/cbes/4666572/4663009/4666739", "text": "\nThe Ballyeagh Fight took place in the year 1833, between the Cooleens and Lawlors. They used sticks and stones as weapons. It is related that seventeen or eighteen people were drowned when they took to boats to cross the river to escape to Mahara side. This was the \"wind up\" of faction fights in the locality.\n", "school_info": "School: Rahavanaig", "metadata": [{"Location:": "Rahavanig, Co. Kerry", "Teacher:": "\nMáire de Stac\n"}, {"Collector": "Nora Moran", "Gender": "female", "Address": "Lahesheragh South, Co. Kerry"}, {"Language": "English"}]}, "4666608/4666350/4667209": {"title": "Faction Fights - Culeens and Lawlors", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0415, Page 045", "Page 045"], "url": "https://www.duchas.ie/en/cbes/4666608/4666350/4667209", "text": "\nOn the 13th May fair in Listowel some time previous to 1830 some Maghera (Ballyduff, Causeway, Ballyheigue, Killahan etc.) men were selling potatoes. A discussion arose as to the comparative merits of the potatoes between the Maghera men and the Cul-na-lin (Culian near Listowel) men. The discussion ended in a fught, where the Maghera men got off the worst, as they wouldn't have the backing in Listowel that the others had. At the Whit Monday fair in Ardfert the fight was renewed. Practically every man in North Kerry took one side or another, and for years after wherever people assembled at fair or market or Sunday after Mass, the fight was renewed. The biggest fight of all took place at Ballyeigh on the 24th June 1834. The North Kerry race meeting was then held in Ballyeigh Strand (opposite the Cashen School) but eventually was transferred to Listowel (1870). The races were held on the right hand side of the river Cashen on the strand opposite where the school is now, and when some of the combatants tried to escape by crossing the river in boats and swimming, they were attacked by their opponents with stones, bottles, sticks, and so on, at the left side of the river. A terrible fight ensued in which about fourteen people were drowned, and very many injured. As far as I know there was only one man arrested for it a well-to-do farmer named Leahy of Ballinorig near Causeway. Many others,\n(continues on next page)\n", "school_info": "School: Cashen, Baile Dubh, Tráighlí", "metadata": [{"Location:": "Ballyduff, Co. Kerry", "Teacher:": "\nMáire de Paor, Dd. Allman\n"}, {"Informant": "Denis Lawlor", "Gender": "male", "Address": "Causeway, Co. Kerry"}, {"Language": "English"}]}, "4666608/4666351/4667219": {"title": "Faction Fights - Culeens and Lawlors", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0415, Page 046", "Page 046"], "url": "https://www.duchas.ie/en/cbes/4666608/4666351/4667219", "text": "\n(continued from previous page)\nwent on the run, but were never arrested. He was tried and sentenced to be transported to Freemantle. For three quarters of a century afterwards the people in this district and in North Kerry generally recorded events from \"the year the boat was drowned\", or from \"the night of the big wind\". After that tragedy this faction fight slackened and died down, and the famine helped to put an end to it altogether. Up to recent years wherever men met they inquired of each other whether they were Culeens or Lawlors. Even yet some old people take pride in the fact that their ancestors took one side or another in this faction.\n\n\n\nA good many got killed. They carried butts of sthones, and the women filled their stockings with um and they fought, an' whin they had the sthones finished they bate one another.There was an uncle of Cud Carthy's an' he found a drowned man, and he didn't put a hand to him. From that out whin he'd be washing his face he'd see the shadow of the drowned man in the bowl an' he'd always get a wakeness when he'd see it.\n", "school_info": "School: Cashen, Baile Dubh, Tráighlí", "metadata": [{"Location:": "Ballyduff, Co. Kerry", "Teacher:": "\nMáire de Paor, Dd. Allman\n"}, {"Informant": "Biddy Power", "Gender": "female", "Age": "over 100", "Address": "Ballyconry, Co. Kerry"}, {"Language": "English"}]}, "4666608/4666352/4667226": {"title": "Sequel to Culeen-Lawlor Faction Fight", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0415, Page 047", "Page 047"], "url": "https://www.duchas.ie/en/cbes/4666608/4666352/4667226", "text": "\nAfter Leahy was some years in Freemantle, a government medical officer came to the settlement on horseback. He hobbled his horse while he was making his inspection. His work carried him a good distance from where he left his horse, and he asked the governor to send one of the convicts to bring the horse to him. When the convict had unloosed the horse and sent him going in the direction of the inspector, he put his hands on the horse's loins and sprung on his back. When he came up to the officers the inspector complimented him on his agility, and remarked that he saw that feat performed only once before, and that wa sin Ireland. \"Perhaps in Kerry\", said the convict. \"Yes\", said the inspector. The doctor had been a poor scholar in Causeway, at the common school of Mr. Charles Church, grandfather of the present James (\"J\") Church, and used to stay frequently at the paternal home of Leahy, and Leahy was the man whom he had seen perform the feat previously. He used his influence with the government on Leahy's behalf, as the result of which he was released on parole, and got a parcel of land to work for himself, after which he brought all his family out to Australia.\n", "school_info": "School: Cashen, Baile Dubh, Tráighlí", "metadata": [{"Location:": "Ballyduff, Co. Kerry", "Teacher:": "\nMáire de Paor, Dd. Allman\n"}, {"Informant": "Denis Lawlor", "Gender": "male", "Address": "Causeway, Co. Kerry"}, {"Language": "English"}]}, "4666595/4665355/4667486": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0412, Page 027", "Page 027"], "url": "https://www.duchas.ie/en/cbes/4666595/4665355/4667486", "text": "\n(continued from previous page)\nin their holding after many years had elapsed, and now a direct representative of each family is in possession, but the name of George Sandes, though long dead, if I may use the expression, stinks in the nostrils still.\n\n\n\nThis was not a clan prejudice, or one district against another as members of the same family were often known to be on different sides. How it originated is not very clear - one version is that it was a dispute as to the ownership of a small patch of land carried by the force of the River Feale from one side of the bank to the opposite side. The fight lasted for many years and caused a great deal of bitterness between families. Fights took place wherever men congregated - at fairs + markets, patterns, sports meetings etc. They fought with blackthorn sticks, and men\n(continues on next page)\n", "school_info": "School: Baile an Chlochair, Lic Snámha", "metadata": [{"Location:": "Ballincloher, Co. Kerry", "Teacher:": "\nSeán Ó Laochdha\n"}, {"Language": "English"}]}, "4672090/4669213/4678740": {"title": "Travelling Folk", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0164, Page 169", "Page 169"], "url": "https://www.duchas.ie/en/cbes/4672090/4669213/4678740", "text": "\nTravelling folk call to our home very often.  Some of them are calling for six or seven years and the rest of them started calling lately.  They are very poor.  Some of them sell small articles.   People buy from them.  They obtain their supplies in the shops.These travellers are generally welcome.  Hardly any of them remain a night.  Some of them have caravans to sleep in. The rest of them make up a tent along the roadside for to sleep in.They don't have food with them.  they travel on foot and in single families.The names of the best known of them are Maughans, Maloneys and McDonaghs.The Maughans family visit the district most frequently.  The travelling folk don't come at any special time.They don't tell stories or bring news from distant places, nor do the people gather around them to hear any news.\n", "school_info": "School: Coillín Aodha (C.)", "metadata": [{"Location:": "Culleens, Co. Sligo", "Teacher:": "\nCristíona Ní Cheallaigh\n"}, {"Language": "English"}]}, "4678374/4673174/4678744": {"title": "Factions in North Kerry", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0416, Page 011", "Page 011"], "url": "https://www.duchas.ie/en/cbes/4678374/4673174/4678744", "text": "\nFactions in North KerryAbout one hundred years ago there were in North Kerry two parties. Ine party was called Cooleens and the other party were called Lawlors. The Lawlors were living across the Cashen and the Cooleens were living in this parish.Two men came from England to train each party. When they were properly trained they rose against each other and fought each other with blacktorn sticks. Whenever they met wheather at fairs or races they fought and wounded each other. There were races in Ballyyea Strand and about 100 years ago the two parties were fighting there all day. The Cooleens had got the better of the Lawlors and when some of the Cooleens were coming home in a boat across the Cashen the Lawlors began to\n(continues on next page)\n", "school_info": "School: Sliabh an Mhadra (B.)", "metadata": [{"Location:": "Slievawaddra, Co. Kerry", "Teacher:": "\nLiam Mac Énrí\n"}, {"Collector": "Patrick Hayes", "Gender": "male", "Address": "Slievawaddra, Co. Kerry"}, {"Informant": "Pat Hayes", "Relation": "parent", "Gender": "male", "Address": "Slievawaddra, Co. Kerry"}, {"Language": "English"}]}, "4678375/4673288/4681663": {"title": "Local Happenings", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0416, Page 159", "Page 159"], "url": "https://www.duchas.ie/en/cbes/4678375/4673288/4681663", "text": "\n(continued from previous page)\nwent round a rick of turf he saw his opponent having the opportunity of turning the end of the rick before him he leaped across the rick and carried the ball from him. A young lady standing by said bad luck to the woman that would maoidheamh her daughter in you. He heard the remark and although he was a married man he eloped with the lassie that night.\n\n\n\nOver a 100 years ago this country at least North Kerry was split up into two factions called Cooleens and Lawlors, they met in a faction fight in Ballyea strand, they fought with sticks\n(continues on next page)\n", "school_info": "School: Sliabh an Mhadra (C.)", "metadata": [{"Location:": "Slievawaddra, Co. Kerry", "Teacher:": "\nEibhlín Ní Chearbhaill\n"}, {"Language": "English"}]}, "4678375/4673289/4681664": {"title": "Local Happenings", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0416, Page 160", "Page 160"], "url": "https://www.duchas.ie/en/cbes/4678375/4673289/4681664", "text": "\n(continued from previous page)\nand stones. The people at one side loaded the boat with stones to reach the scene of battle across the river Feale.That side was defeated the victors killing them in the boat and sinking the boat with the cargo of stones.There were many killed and hundreds wounded.\n\n\n\nA young man who was fleet of foot named Maurice Leahy was going home that evening to his home in in Ballinoe near Causeway.A man got out of a house in the way and asked him how did their fight go. He said what wasn't killed of them were\n(continues on next page)\n", "school_info": "School: Sliabh an Mhadra (C.)", "metadata": [{"Location:": "Slievawaddra, Co. Kerry", "Teacher:": "\nEibhlín Ní Chearbhaill\n"}, {"Collector": "Peggy O Neill", "Gender": "female", "Address": "Causeway, Co. Kerry"}, {"Informant": "James O Connor", "Relation": "unknown", "Gender": "male", "Address": "Causeway, Co. Kerry"}, {"Language": "English"}]}, "4678381/4674031/4682111": {"title": "Namhadas idir Pharóistí - Bád na nGort nDubh", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0418, Page 089", "Page 089"], "url": "https://www.duchas.ie/en/cbes/4678381/4674031/4682111", "text": "\nNamhadas idir PharóistíBád na nGort nDubh (1818)Fachta ó:- Labhras Ó Ciabháin (80 bliadhan)Baile na RáthaDun ChaoinDaingean Uí ChúiseTá namhadas le fada riamh idir Dhun Chaoin agus muinntir Pharóiste an Fhirtéaraig agus ní gan chúis é dréir deallraimh. Seo mar thosnuig sé an cheud lá riamh.Tháinig athrach reiceálta gan chriú isteach go Cuan a'Chaoil in aice le talamh na bhFirtéarach i bParóiste an Fhirtéaraig sa mbliadhain 1818.Chonnaic bád ó Dhún Chaoin í ag teacht ón bhfarraige aniar agus d'aithnigheadar go raibh sí ar léig. Bhí Seán Ó Ciabháin (Croppy) ó Bhaile na Rátha agus Tadhg Ó Séaghdha ó'n Muillean sa bhád pé beirt eile a bhí innte. Leanadar í .i. an raic gur bhuail sí talamh thuaidh ag Cuan a' Chaoil. Chuadar ar bórd. Bhí sí lán de rudaí luachmhara des gach aon t-saghas. Thosnuigheadar ag toghadh is priocadh agus ag líonadh a mbáid. Ní fada mar sin dóibh nuair a tháinig bád ón nGort Dubh ortha.Nuair a chonnaiceadar san muinntir Dhún Chaoin\n(continues on next page)\n", "school_info": "School: Scoil N. Gobnait", "metadata": [{"Location:": "Dunquin, Co. Kerry", "Teacher:": "\nMuiris Ó Dálaigh\n"}, {"Informant": "Labhras Ó Ciabháin", "Gender": "male", "Age": "80", "Address": "Ballynaraha North, Co. Kerry"}, {"Language": "Irish"}]}, "4666609/4666395/4682312": {"title": "Faction Flights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0415, Page 126", "Page 126"], "url": "https://www.duchas.ie/en/cbes/4666609/4666395/4682312", "text": "\nOn the 13th of May fair in Listowel some time previous to 1830. some Magheragh men (Ballyduff, Causeway, Ballyheigue, Killanhan, etc) were selling potatoes. A discussion arose as to the comparative merits of the potatoes between the Magheragh men and the cúl-na-lín (Culeen near Listowel) men. The discussion ended in a fight, where the Magheragh men got off the worst as they wouldn't have the backing in Listowel that the others had. At the Whit Monday fair in Ardfert the fight was renewed. Practically every man in North Kerry took one side or another and for years after whenever people assembled at fair or market on Sunday after mass the fight was renewed.The biggest fight of all took place at (Ballyduff) Ballyeigh on the 24th June 1834. The North Kerry race meeting was then held in Ballyeigh Strand (opposite the Cashen School) but was eventually transferred to Listowel (1870). The races were held on the\n(continues on next page)\n", "school_info": "School: Ballyduff B. N. School", "metadata": [{"Location:": "Ballyduff, Co. Kerry", "Teacher:": "\nTadhg Ó Leathlobhair\n"}, {"Collector": "Murtie Dowling", "Gender": "male"}, {"Informant": "Denis Lawlor", "Gender": "male", "Address": "Causeway, Co. Kerry"}, {"Language": "English"}]}, "4666610/4666500/4682658": {"title": "Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0415, Page 233", "Page 233"], "url": "https://www.duchas.ie/en/cbes/4666610/4666500/4682658", "text": "\nOn the 13th May fair in Listowel some time previous to 1830, some Magheragh men (Ballyduff, Causeway, Ballyheigue, Killahan etc.) men were selling potatoes. A discussion arose as to the comparative merits of the potatoes between the Magheragh men and the Cul-na-lín (Culeen near Listowel) men. The discussion ended in a fight, where the Magheragh men got off the worst as they wouldn't have the backing in Listowel that the others had. At the Whit Monday fair in Ardfert the fight was renewed. Practically every man in North Kerry took one side or another and for years after whenever people assembled at fair or market on Sunday after mass the fight was renewed. The biggest fight of all took place at Ballyeigh on the 24th June 1834. The North Kerry race meeting was then held in Ballyeigh Strand) opposite the Cashen School) but was eventually transferred to Listowel (1870). The races were held on the right hand side of the River Cashen on the strand where the school is now, and when some of the\n(continues on next page)\n", "school_info": "School: Baile Dubh (C.)", "metadata": [{"Location:": "Ballyduff, Co. Kerry", "Teacher:": "\nBrighid, Bean Uí Leathlobhair\n"}, {"Collector": "Mrs Bridget Lawlor", "Gender": "female", "Occupation": "teacher"}, {"Informant": "Denis Lawlor", "Gender": "male", "Age": "65", "Address": "Causeway, Co. Kerry"}, {"Language": "English"}]}, "4666610/4666531/4682888": {"title": "The Mermaid", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0415, Page 264", "Page 264"], "url": "https://www.duchas.ie/en/cbes/4666610/4666531/4682888", "text": "\nAbout fourteen years ago a cousin of mine named Michael Kelleher saw a mermaid in Banna strand, as he was gathering seaweed. She was a lovely maiden with long golden hair and she was combing it. She was half a woman and half a fish. It is said that anyone who sees her would be drowned. This man had a narrow escape from drowning the same day as he was collecting the seaweed, as his horse was drowned and himself was nearly drowned.Told to me by my mother Mrs. Patrick Sheehry Ballyduff\n", "school_info": "School: Baile Dubh (C.)", "metadata": [{"Location:": "Ballyduff, Co. Kerry", "Teacher:": "\nBrighid, Bean Uí Leathlobhair\n"}, {"Collector": "Mary Sheehy", "Gender": "female", "Address": "Ballyduff, Co. Kerry"}, {"Informant": "Mrs Patrick Sheehy", "Relation": "parent", "Gender": "female", "Address": "Ballyduff, Co. Kerry"}, {"Language": "English"}]}, "4678400/4677213/4683647": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0424, Page 367", "Page 367"], "url": "https://www.duchas.ie/en/cbes/4678400/4677213/4683647", "text": "", "school_info": "School: Scoil na mBráthar, An Daingean", "metadata": [{"Location:": "Dingle, Co. Kerry", "Teacher:": "\nAn Br. P. Ó hAragáin\n"}, {"Collector": "Peadar Ó Fearghail", "Gender": "male", "Address": "Doonsheane, Co. Kerry"}, {"Informant": "Tomás Ó Gríbhthín", "Gender": "male", "Address": "Doonsheane, Co. Kerry"}, {"Language": "Irish"}]}, "4678400/4677225/4683769": {"title": "An Dún", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0424, Page 379", "Page 379"], "url": "https://www.duchas.ie/en/cbes/4678400/4677225/4683769", "text": "\nDo bhí gleann mór i nDún Síon fadó agus tug adh an Dún mar ainm air go dtí an lá indiu. Do bhí an fairrge ag dul isteach tríd an gleann fadó ach bhí troid idir na Seánaigh agus na Dómhnallaigh inDún Síon agus do marbhuigheadh alán daoine ann agus gach duine a marbhuigheadh ann do caithfeadh isteach san gleann iad agus diaidh ar ndiaidh do bhí an gleann lán agus ó shin amach níor chuaidh an fhairrge isteach tríd agus tá an Dún mur ainm ar fós.\n", "school_info": "School: Scoil na mBráthar, An Daingean", "metadata": [{"Location:": "Dingle, Co. Kerry", "Teacher:": "\nAn Br. P. Ó hAragáin\n"}, {"Collector": "Éamonn O Ruaidhrí", "Gender": "male", "Address": "Ballintaggart, Co. Kerry"}, {"Informant": "Seán Ó Concúbhair", "Gender": "male", "Address": "Doonsheane, Co. Kerry"}, {"Language": "Irish"}]}, "4666578/4663502/4688638": {"title": "Local Heroes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0401, Page 298", "Page 298"], "url": "https://www.duchas.ie/en/cbes/4666578/4663502/4688638", "text": "\nThere were two parties in North Kerry once.The landlord always kept them divided.Their names were Cooleens and Mulvihills.The two parties fought a great battle one time in Ballyeagh.It was called Faction fighting in those days.The women fought with sticks and stones.There was plenty drink poured out to them by the heads of each party.The battle raged so fierce between them that there were six or seven of them drowned.The people that were arrested for fighting were saved by the landlord.\n", "school_info": "School: An Chúil Árd (C.)", "metadata": [{"Location:": "Coolard, Co. Kerry", "Teacher:": "\nMáire Ní Liaghain\n"}, {"Collector": "Nancy Hanrahan", "Gender": "female", "Address": "Inch East, Co. Kerry"}, {"Informant": "Michael Hanrahan", "Gender": "male", "Age": "60", "Address": "Inch East, Co. Kerry"}, {"Language": "English"}]}, "4678409/4678292/4689063": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0426, Page 620", "Page 620"], "url": "https://www.duchas.ie/en/cbes/4678409/4678292/4689063", "text": "\n(continued from previous page)\n[-]\n\n\n\nThere was a man there long ago and every night he used carry a bag of guano to spread on potatoes and every day he used miss half the bags, and this night he stayed up watching. In the middle of the night two women came to the bag with two buckets and filled a bucket each. He followed them into the grave yard. There was someone to be burried the day after. When morning came he found out it was two living women. He summoned them and they had to give a hundred pounds each.\n\n\n\nThe Kennedy's came from Nienah in Tipperary. There were three brothers there. Morice James and Roger. Rogers settled in Garfenny. Maurice settled in Mame a Grainne. James was the youngest and James settled in Cournduff. They married three sisters Mary, Cathleen and Brigid. Mary got married to Rogers. Cathleen got married to Maurice, and Brigid got married to James. James had five sons Daniel, James, John, Maurice Michael. Rogers descendants came to Anagap to Ballinclare, Ballinacourty and to Annascaul. James's grandson used be fighting at Ballinclare fair. He was called Who's Afraid. Whos Afraid's brothers too used be fighting at Ballinclare fair. The Currans they used be fighting against. Whos Afraid was my great\n(continues on next page)\n", "school_info": "School: Breac-Cluain (B.)", "metadata": [{"Location:": "Brackloon, Co. Kerry", "Teacher:": "\nPádraig Ó Séaghdha\n"}, {"Language": "English"}]}, "4687702/4685374/4689188": {"title": "Cnocán Éagóir", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0430, Page 117", "Page 117"], "url": "https://www.duchas.ie/en/cbes/4687702/4685374/4689188", "text": "", "school_info": "School: Baile Dubh, Caisleán Ghriaire", "metadata": [{"Location:": "Ballyduff, Co. Kerry", "Teacher:": "\nPádraig Ó Séaghda\n"}, {"Informant": "Seamus Ághas", "Gender": "male", "Age": "74", "Address": "Lisnamovaun, Co. Kerry"}, {"Language": "Irish"}, {"Location": "Lisnamovaun"}]}, "4687706/4685873/4707000": {"title": "Local Prejudice", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0432, Page 286", "Page 286"], "url": "https://www.duchas.ie/en/cbes/4687706/4685873/4707000", "text": "\nLocal prejudice Local prejudice still exists between two divisions of the Castlemaine parish namely Keel and Kiltallagh.Several faction fights took place in the past between the people of these two places, and they met at Castlemaine fairs and fought with sticks of all kinds. At the last faction fight in Castlemaine the roof was torn off a house to provide sticks for the fight. A new house now stands in the place of the one which was unroofed on this occasion. A man named Whelan, who was a weaver at the time owned the thatched house when the extending parties attacked it. The Teahans and McCarthy's of Keel fought against the Fitzgeralds and Brodes and Flynns of Kiltallagh. These faction fights have been discontinued for about 90 years. ____________________\n\n\n\nA mound of earth and an ash tree mark the spot on which stood Castledrum Castle, which was levelled to the earth in 1652 by Ludlow on his way to knock Ross Castle, Killarney.His men brought their boats up the Laune and fired across the river at Castledrum Castle. A cannon ball and a sword were\n(continues on next page)\n", "school_info": "School: Caisleán an Droma, Caisleán na Mainge", "metadata": [{"Location:": "Castledrum, Co. Kerry", "Teacher:": "\nCáit, Bean Uí Bhriain\n"}, {"Collector": "Mrs Katherine O' Brien", "Gender": "female", "Occupation": "teacher"}, {"Informant": "Eugene O' Sullivan", "Relation": "parent", "Gender": "male"}, {"Language": "English"}]}, "4687708/4685918/4707859": {"title": "A Faction Fight Between Keel and Kiltallagh", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0432, Page 315a", "Page 315a"], "url": "https://www.duchas.ie/en/cbes/4687708/4685918/4707859", "text": "\nAbout eighty years ago there was a great fight in the village of Castlemaine between Keel and Kiltallagh.The reason for the fight was because the most of the Kiltallagh people were protestants and soupers and they always disliked the people of Keel.When ever a fight was to take place the people of Dingle and Odorney would come to help Keel and from Castlemaine to Killorglin would help Kiltallagh.When the fight began the people of Kiltallagh started to advance towards the Keel people and to drive them back.After a great struggle four of the Keel people had to take cover. It was in a small little house they took shelter and locked themselves in.When the Kiltallagh people got to the house they tried to burst in but it was in vain. A Kiltallagh man named Barry rushed at the door but as he was about to strike it a Keel man fired at him from Anagh height and killed him. It\n(continues on next page)\n", "school_info": "School: Fadhbach, Caisleán na Mainge", "metadata": [{"Location:": "Fybagh, Co. Kerry", "Teacher:": "\nMl. Ó Tíodhcháin\n"}, {"Collector": "Euge Carroll", "Gender": "male", "Address": "Fybagh, Co. Kerry"}, {"Informant": "John Regan", "Gender": "male", "Age": "45", "Address": "Fybagh, Co. Kerry"}, {"Language": "English"}]}, "4713233/4709787/4727054": {"title": "Na Daithinnigh agus na Gearaltaigh", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0451, Page 059", "Page 059"], "url": "https://www.duchas.ie/en/cbes/4713233/4709787/4727054", "text": "", "school_info": "School: Ráth Mhór (B.)", "metadata": [{"Location:": "Rathmore, Co. Kerry", "Teacher:": "\nDiarmuid Ó Cróinín\n"}, {"Collector": "Diarmuid Ó Cróinín", "Gender": "male"}, {"Informant": "Cormac Ó Laoghaire", "Gender": "male", "Address": "Gullaun East, Co. Kerry"}, {"Language": "Irish"}]}, "4713236/4710138/4744259": {"title": "A Fairy Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0451, Page 408", "Page 408"], "url": "https://www.duchas.ie/en/cbes/4713236/4710138/4744259", "text": "", "school_info": "School: Gníomh go Leith (B.)", "metadata": [{"Location:": "Gneevgullia, Co. Kerry", "Teacher:": "\nCormac Ó Laoghaire\n"}, {"Language": "English"}]}, "4713236/4710147/4744329": {"title": "Troda Móra", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0451, Page 417", "Page 417"], "url": "https://www.duchas.ie/en/cbes/4713236/4710147/4744329", "text": "", "school_info": "School: Gníomh go Leith (B.)", "metadata": [{"Location:": "Gneevgullia, Co. Kerry", "Teacher:": "\nCormac Ó Laoghaire\n"}, {"Collector": "Mícheál Mac Curtain", "Gender": "male", "Address": "Leamyglissane, Co. Kerry"}, {"Informant": "Seán Ó Finnegáin", "Gender": "male", "Age": "80", "Address": "Leamyglissane, Co. Kerry"}, {"Language": "Irish"}]}, "4713229/4709557/4759503": {"title": "The Story of Knocknagoshel Pattern", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0450, Page 077", "Page 077"], "url": "https://www.duchas.ie/en/cbes/4713229/4709557/4759503", "text": "\nThe Knocknagoshel Pattern is always kept on August the fifteenth, since its birth about sixty years ago.This Pattern was formerly kept at a place known locally as Tuairín Ochuig, about half way from here on the high road to Brosna.Here, mass was offered every fifteenth of August, in memory of the masses said in this quiet, out-of-the-way place.  during the Penal Days.In those times faction fights were a feature of every gathering, and the fights at this pattern became so fierce and dangerous that the local clergy decided that no further anniversary masses would be offered at this place.When the mass was discontinued the old Pattern died, only to be resurrected in Knocknagoshel some years later.The Knocknagoshel Pattern is now the most popular of all local features, and people \"for miles and miles around\" flock to the village on that occasion.  The late Kerry Y. O'Connor, who died at the age of ninety four, and who was chiefly instrumental in bringing the Pattern here always boasted with pride how \"he brought the dead Pattern back again to life\"M. Heffernan. N.Y.October, 1934.\n", "school_info": "School: Cnoc na gCaiseal (B.)", "metadata": [{"Location:": "Knocknagashel, Co. Kerry", "Teacher:": "\nMícheál Ua hErnáin\n"}, {"Collector": "Micheál Heffernan", "Gender": "male", "Occupation": "teacher", "Address": "Knocknagashel, Co. Kerry"}, {"Language": "English"}]}, "4701705/4694413/4760439": {"title": "Faction Fight in this Area Long Ago", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0170, Page 0428", "Page 0428"], "url": "https://www.duchas.ie/en/cbes/4701705/4694413/4760439", "text": "\nFaction fights were a feature at every fair in this area until about 40 years ago. They were generally indulged in by opposing townlands. Certain townlands bore continual enmity towards other townlands. This prejudice continued until about 20 years ago.On the day of a fair, the young men of the townland rallied forth in fever, most armed with ash sticks, others with blackthorns. As evening approached, the rival parties came into conflict and a battle royal ensued. Police were generally drafted into the town in which the fair was held. Sometimes they drew their batons and charged the combatants, who promptly forgot their grievances against each other, and mutually attacked the police. After the rout of the police, the original combatants either fraternised, or resumed their interrupted battle. Tubbercurry Co. Sligo was a noted centre of these faction fights. Nowadays things are different. The young boys and girls - neatly dressed - come in and spend a few hours at the fair, and then go home quietly.\n", "school_info": "School: Curraigh (B.)", "metadata": [{"Location:": "Curry, Co. Sligo", "Teacher:": "\nPeadar Ó Braonáin\n"}, {"Collector": "Peter Brennan", "Gender": "male", "Occupation": "múinteoir"}, {"Language": "English"}]}, "4758476/4747248/4779939": {"title": "Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0250, Page 267", "Page 267"], "url": "https://www.duchas.ie/en/cbes/4758476/4747248/4779939", "text": "\n24. Faction FightsThis district in old times (up to 60 years ago) was famous for faction fighting. The families engaged were the Beirnes (local) and the Carneys (chiefly from Elphin district) They fought wherever they met, fairs, markets Blessed Well +c. A favourite warcry with them was, \"Twelve O'clock and no blood spilt.\" Those families are the most numerous around here there being at least thirty families of each name.\n\n\n\n26. There is scarcely a family around but has a nickname, although the most of them are English appellationsThe term \"Faireach\" is applied to the Carney family of Curach Criach. There is an old tale of one of them being chased by the Evil One when returning from a dance. She was escorted by this gentleman from the dance and it is said she took a handkerchief from him. There were others with them and on crossing some field, they all ran for a ditch. Some one said \"first over, and then devil take the hindmost\" The Carney girl looked\n(continues on next page)\n", "school_info": "School: Cluain Uí Chuinn", "metadata": [{"Location:": "Cloonyquin, Co. Roscommon", "Teacher:": "\nMícheál Mac Floinn\n"}, {"Informant": "John Beirne", "Gender": "male", "Age": "70", "Address": "Killynagh More, Co. Roscommon"}, {"Language": "English"}]}, "4706346/4704684/4780017": {"title": "Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0444, Page 461", "Page 461"], "url": "https://www.duchas.ie/en/cbes/4706346/4704684/4780017", "text": "\nThe following is an account of a local faction fight which I got from Mr. Daniel Dowling (Parish Clerk) some time ago:- \"In 1803 there was a faction fight at Clogher Church. The  Church was then an old thatched building, near Mrs O'Connor's.  A Carmody woman was taken by force for marriage by Spillane from Killarney. But he was caught before he got home, dispossessed of the young lady and warned never to come to the parish again. The Slatterys of O'Brennan brought him in again to dare the Carmodys. Hence the fight. -The priest said that the man who gave the 1st blow would regret it. It was Slattery who gave it and he was killed in the fight. Against the Slatterys were the Carmodys, Learys, Butlers and Leens. The Protestants came to help the Clogher men, but were late for the fight. As the old church was desecrated by the fight it was abandoned and a new one was built at Ballydwyer. It may in fact be said that the Penal Days terminated in the parish at the whack of a blackthorn at the \"Battle of Clogher\" as I often heard the old people call it.A more remarkable faction fight was that which occurred at Móin a' Mhuilínn Co Limerick. This fight lives on in poetry which I give in the next Page.I may say that I collected this near Feale's Bridge in a district (Caher) between Feale's Bridge and Abbeyfeale in the year 1924 - with the help of Paddy McCarthy N.T.  Abbeyfeale\n(continues on next page)\n", "school_info": "School: O'Brennan, Baile Mhic Ealgóid, Tráighlí", "metadata": [{"Location:": "Tonreagh Lower, Co. Kerry", "Teacher:": "\nPádraig Ó Loingsigh\n"}, {"Informant": "Mr Daniel Dowling", "Gender": "male", "Occupation": "clerk"}, {"Language": "English"}]}, "4706346/4704685/4780021": {"title": "Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0444, Page 462", "Page 462"], "url": "https://www.duchas.ie/en/cbes/4706346/4704685/4780021", "text": "\n(continued from previous page)\nwho brought me to the house of Mr. Doody who lived in an isolated place near Caher Village. A remnant of Irish seemed at that time to have lingered in the locality and it seemed to be a district rich in folklore.Here is the account of \"Bruidhean  Móna Mhuilinn\"  which to my mind is an account of a famous faction fight. Mr. McCarthy has in all probability  given an account of it already to the folklore society. In case he has not I now respectfully forward the same.\n", "school_info": "School: O'Brennan, Baile Mhic Ealgóid, Tráighlí", "metadata": [{"Location:": "Tonreagh Lower, Co. Kerry", "Teacher:": "\nPádraig Ó Loingsigh\n"}, {"Language": "Irish"}]}, "4706346/4704688/4780032": {"title": "Bruíon Mhóin an Mhuilinn", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0444, Page 465", "Page 465"], "url": "https://www.duchas.ie/en/cbes/4706346/4704688/4780032", "text": "", "school_info": "School: O'Brennan, Baile Mhic Ealgóid, Tráighlí", "metadata": [{"Location:": "Tonreagh Lower, Co. Kerry", "Teacher:": "\nPádraig Ó Loingsigh\n"}, {"Language": "Irish"}]}, "4758487/4747924/4780130": {"title": "Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0842, Page 019", "Page 019"], "url": "https://www.duchas.ie/en/cbes/4758487/4747924/4780130", "text": "\nFaction fights were common in this district about fifty or sixty years ago.When a fair or market took place the leader went to a wood and got a load of ash plants and then divided them in the market place or fair green.One crowd was called the O'Sheas and the other Holdens.\n", "school_info": "School: Tobar na Brón, Piltown", "metadata": [{"Location:": "Tobernabrone, Co. Kilkenny", "Teacher:": "\nBríd Paor\n"}, {"Language": "English"}]}, "4758487/4747926/4780141": {"title": "Field Name", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0842, Page 021", "Page 021"], "url": "https://www.duchas.ie/en/cbes/4758487/4747926/4780141", "text": "\n(continued from previous page)\nThe reidhceachThe well fieldThe course bog.\n\n\n\nThe Sheas of Mullinbeg and the Holdens of acre.The Keefe's of Turkstown and the Sheas of Ballylynch.The Curravats and Seanvats Co. Waterford.\n\n\n\nTommy ScovhalNed LaogisTom the hundredRichard fear boctTom the turneyJames DoranJimmy nawNeddy the CullieRichard trickJohn the Weaver\n(continues on next page)\n", "school_info": "School: Tobar na Brón, Piltown", "metadata": [{"Location:": "Tobernabrone, Co. Kilkenny", "Teacher:": "\nBríd Paor\n"}, {"Language": "English"}]}, "4723877/4721417/4780212": {"title": "A Faction Fight", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0961, Page 170", "Page 170"], "url": "https://www.duchas.ie/en/cbes/4723877/4721417/4780212", "text": "\nA faction fight took place on the 12th of July 1870 at Shanco near Emyvale. It was between the Orangemen and the Catholics. An Orangeman named Mc Mahon came out while the fight was going on. He had a rifle in his hand. His cry was \"death or victory\". He was shot himself from Knockam's hill. A woman who witnessed the fight would not tell who fired the shot that killed Mc Mahon. She was kept in gaol for a year.\n\n\n\nThe Lake Woman of Tully. Once upon a time there was a man named Grey who lived near Tully Lake. He was very poor and he lived alone on a farm of land but had neither horse nor cow nor wife. One morning he got up very early and went for\n(continues on next page)\n", "school_info": "School: Cluain Cátha", "metadata": [{"Location:": "Cloncaw, Co. Monaghan", "Teacher:": "\nP. Ó Hanluain\n"}, {"Informant": "Hugh Hugh", "Relation": "parent", "Gender": "male", "Age": "71", "Address": "Mullaliss, Co. Monaghan"}, {"Language": "English"}]}, "4742148/4740489/4780557": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0771, Page 121", "Page 121"], "url": "https://www.duchas.ie/en/cbes/4742148/4740489/4780557", "text": "\nThere seem to have been faction fights in connection with the Pattern of Carbury in years gone by. The opposing parties were People of Carbury and the district north-west of it.V     People of Allen and Allenwood districtsThey have been discintinued upwards of forty-five years.\n", "school_info": "School: Derinturn (B.), Carbury", "metadata": [{"Location:": "Derrinturn, Co. Kildare", "Teacher:": "\nD. Ó Hódhráin\n"}, {"Language": "English"}]}, "4758489/4748130/4780639": {"title": "A Faction Fight at a Regatta", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0842, Page 225", "Page 225"], "url": "https://www.duchas.ie/en/cbes/4758489/4748130/4780639", "text": "\n[-]\n(continues on next page)\n", "school_info": "School: Piltown (B.)", "metadata": [{"Location:": "Pilltown, Co. Kilkenny", "Teacher:": "\nPeadar Ó Maolchaoin\n"}, {"Collector": "Cecil Roche", "Gender": "male", "Age": "13", "Address": "Pilltown, Co. Kilkenny"}, {"Informant": "Thomas Cuddihy", "Gender": "male", "Age": "50", "Occupation": "clerk", "Address": "Pilltown, Co. Kilkenny"}, {"Language": "English"}]}, "4758483/4747717/4780978": {"title": "Local Prejudice", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0840, Page 168", "Page 168"], "url": "https://www.duchas.ie/en/cbes/4758483/4747717/4780978", "text": "\nLong ago great illfeeling existed between the people of Dournane and Ardera in the parish of Mooncoin. On all public occasions blows were exchanged. There is still a spirit of rivalry. You may here the expression, \"Up Ardera and Down Dournane.\"\n\n\n\nFaction fight are still remembered between the Dournane and Ardera men. They ceased about 60 years ago.\n\n\n\nLocally a great past time was a game called \"Betchell.\" You stood on one leg and moved a stone with that leg section to section of a square.[Drawing]\n", "school_info": "School: Mooncoin, Waterford", "metadata": [{"Location:": "Mooncoin, Co. Kilkenny", "Teacher:": "\nJ. Mc Carthy\n"}, {"Collector": "Pat Fripps", "Gender": "male", "Age": "13", "Address": "Grange, Co. Kilkenny"}, {"Informant": "John Fripps", "Gender": "male", "Age": "72", "Address": "Grange, Co. Kilkenny"}, {"Language": "English"}]}, "4758483/4747717/4780980": {"title": "Local Prejudice", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0840, Page 168", "Page 168"], "url": "https://www.duchas.ie/en/cbes/4758483/4747717/4780980", "text": "\nLong ago great illfeeling existed between the people of Dournane and Ardera in the parish of Mooncoin. On all public occasions blows were exchanged. There is still a spirit of rivalry. You may here the expression, \"Up Ardera and Down Dournane.\"\n\n\n\nFaction fight are still remembered between the Dournane and Ardera men. They ceased about 60 years ago.\n\n\n\nLocally a great past time was a game called \"Betchell.\" You stood on one leg and moved a stone with that leg section to section of a square.[Drawing]\n", "school_info": "School: Mooncoin, Waterford", "metadata": [{"Location:": "Mooncoin, Co. Kilkenny", "Teacher:": "\nJ. Mc Carthy\n"}, {"Collector": "Pat Fripps", "Gender": "male", "Age": "13", "Address": "Grange, Co. Kilkenny"}, {"Informant": "John Fripps", "Gender": "male", "Age": "72", "Address": "Grange, Co. Kilkenny"}, {"Language": "English"}]}, "4758483/4747717/4780984": {"title": "Local Prejudice", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0840, Page 168", "Page 168"], "url": "https://www.duchas.ie/en/cbes/4758483/4747717/4780984", "text": "\nLong ago great illfeeling existed between the people of Dournane and Ardera in the parish of Mooncoin. On all public occasions blows were exchanged. There is still a spirit of rivalry. You may here the expression, \"Up Ardera and Down Dournane.\"\n\n\n\nFaction fight are still remembered between the Dournane and Ardera men. They ceased about 60 years ago.\n\n\n\nLocally a great past time was a game called \"Betchell.\" You stood on one leg and moved a stone with that leg section to section of a square.[Drawing]\n", "school_info": "School: Mooncoin, Waterford", "metadata": [{"Location:": "Mooncoin, Co. Kilkenny", "Teacher:": "\nJ. Mc Carthy\n"}, {"Collector": "John Lennon", "Gender": "male", "Age": "14", "Address": "Grange, Co. Kilkenny"}, {"Informant": "Mrs Walsh", "Gender": "female", "Age": "54", "Address": "Ballincurra, Co. Kilkenny"}, {"Language": "English"}]}, "4758459/4746151/4783732": {"title": "The Closing of Kilmurry Chapel", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0245, Page 122", "Page 122"], "url": "https://www.duchas.ie/en/cbes/4758459/4746151/4783732", "text": "\nBefore the \"Bad Times\" Baslic was a parish in itself and has its own parish priest. Now it is part of the parish of Ogulla & Baslic, having a parish priest in Tulsk and two curates one living at Kilmurry and the other at Killina, the other(north-eastern) portion of the parish.After the \"Bad Times\" about 1852 or so the population of the parish of Baslic was very much reduced by famine, fever and emigration, and so the Most Revd Dr. Browne the Bishop of Elphin, decided to no longer recognise Baslic as a parish, and to join it to the parish of Tibohine (Frenchpark and Belanagore). The Belanagare priest was to come to Kilmurry and say one mass every Sunday. When the people of Baslic heard this they were displeased and determined to protest, in every way possible, against being deprived\n(continues on next page)\n", "school_info": "School: Castleplunkett", "metadata": [{"Location:": "Castleplunket, Co. Roscommon", "Teacher:": "\nSéamus Ó Domhnaill\n"}, {"Collector": "S.S. Ó Dómhnaill", "Gender": "male"}, {"Informant": "Domnick Kelly", "Gender": "male", "Age": "75", "Address": "Lisheen, Co. Roscommon"}, {"Language": "English"}]}, "4713239/4710483/4785096": {"title": "Faction Fighting", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0452, Page 324", "Page 324"], "url": "https://www.duchas.ie/en/cbes/4713239/4710483/4785096", "text": "", "school_info": "School: Tuairín Chathail (B.)", "metadata": [{"Location:": "Tooreencahill, Co. Kerry", "Teacher:": "\nDiarmuid Ó Cróinín\n"}, {"Collector": "Batt Cronin", "Gender": "male", "Address": "Reaboy, Co. Kerry"}, {"Informant": "Jerry T. Cronin", "Gender": "male", "Age": "80", "Address": "Reaboy, Co. Kerry"}, {"Language": "English"}]}, "4742067/4732296/4786014": {"title": "Faction Fight at Aughnacloy", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0959, Page 350", "Page 350"], "url": "https://www.duchas.ie/en/cbes/4742067/4732296/4786014", "text": "\nWhat was known as \"the big fight\" at Aughnacloy, to distinguish it from the lesser affrays constantly occurring at fairs and markets, took place on 30th October 1818. The fight arose from ill-feeling between the Tyrone and Truagh ( Co Monaghan )  men over some Protestants that had been beaten at Armagh races, and apparently the orange party were determined, if opportunity offered, to avenge it at the Aughnacloy races. Towards evening an hour before dark, about the time of the \"saddle races\" i.e., the race for which a saddle was first prize, the distubance commenced. A Roman Catholic or two were beaten on Aughnacloy street, and there was promiscous stone throwing between the parties, which continued over Tully hill as far as Tully bridge. The Cannteel men were leaders on the protestant side, and a number of the Aughnacloy Yeomanry who had been called out as a special guard to preserve order at the races, being provided with arms and ammunitions, joined their co-religionists. They pursued the county Monaghan men as far as Tully bridge, but when the Truagh\n(continues on next page)\n", "school_info": "School: Killybrone", "metadata": [{"Location:": "Killybrone, Co. Monaghan", "Teacher:": "\nP. Coyle\n"}, {"Collector": "P. Coyle", "Occupation": "teacher", "Address": "Skinnahergna, Co. Monaghan"}, {"Informant": "Mr Edward Mc Kenna", "Gender": "male", "Address": "Killybrone, Co. Monaghan"}, {"Language": "English"}]}, "4742167/4741550/4814541": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0775, Page 030", "Page 030"], "url": "https://www.duchas.ie/en/cbes/4742167/4741550/4814541", "text": "\nThe parish priest in Allen during the mission in 1886 was Fr. O'Farrell. The missioner priest's means were Fr. Dowling, Fr. Philolia, and Fr. O'Reilly.\n\n\n\nThe bonfire in Ballyteague used to be on the 24th June (St John's Eve.)\n\n\n\nA red-haired woman is unlucky to meet in the morning or (on)  starting on a journey.\n\n\n\nThere was a great faction fight in Littletown between Ballyteague and Allenwood. They used to fight through the fields. Ballyteague won.\n\n\n\nThere used to be a fair in Kilmeague in a field called the \"fair green\" now owned by Miss Gregg, Kilmeague.\n\n\n\nA man named Thomas Farrell kept a hedge-school in Ballyteague.\n\n\n\nWhite spots on the nails are meant to be (called) \"gifts\"  A gift on the thumb\n(continues on next page)\n", "school_info": "School: Allenwood, Robertstown", "metadata": [{"Location:": "Allenwood, Co. Kildare", "Teacher:": "\nSeán Ó Clúmháin\n"}, {"Collector": "Marcella Ennis", "Gender": "female", "Address": "Grangeclare West, Co. Kildare"}, {"Informant": "Mr Pat Cleary", "Gender": "male"}, {"Language": "English"}]}, "4742167/4741550/4814543": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0775, Page 030", "Page 030"], "url": "https://www.duchas.ie/en/cbes/4742167/4741550/4814543", "text": "\nThe parish priest in Allen during the mission in 1886 was Fr. O'Farrell. The missioner priest's means were Fr. Dowling, Fr. Philolia, and Fr. O'Reilly.\n\n\n\nThe bonfire in Ballyteague used to be on the 24th June (St John's Eve.)\n\n\n\nA red-haired woman is unlucky to meet in the morning or (on)  starting on a journey.\n\n\n\nThere was a great faction fight in Littletown between Ballyteague and Allenwood. They used to fight through the fields. Ballyteague won.\n\n\n\nThere used to be a fair in Kilmeague in a field called the \"fair green\" now owned by Miss Gregg, Kilmeague.\n\n\n\nA man named Thomas Farrell kept a hedge-school in Ballyteague.\n\n\n\nWhite spots on the nails are meant to be (called) \"gifts\"  A gift on the thumb\n(continues on next page)\n", "school_info": "School: Allenwood, Robertstown", "metadata": [{"Location:": "Allenwood, Co. Kildare", "Teacher:": "\nSeán Ó Clúmháin\n"}, {"Collector": "Marcella Ennis", "Gender": "female", "Address": "Grangeclare West, Co. Kildare"}, {"Informant": "Mr Pat Cleary", "Gender": "male"}, {"Language": "English"}]}, "4742167/4741550/4814545": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0775, Page 030", "Page 030"], "url": "https://www.duchas.ie/en/cbes/4742167/4741550/4814545", "text": "\nThe parish priest in Allen during the mission in 1886 was Fr. O'Farrell. The missioner priest's means were Fr. Dowling, Fr. Philolia, and Fr. O'Reilly.\n\n\n\nThe bonfire in Ballyteague used to be on the 24th June (St John's Eve.)\n\n\n\nA red-haired woman is unlucky to meet in the morning or (on)  starting on a journey.\n\n\n\nThere was a great faction fight in Littletown between Ballyteague and Allenwood. They used to fight through the fields. Ballyteague won.\n\n\n\nThere used to be a fair in Kilmeague in a field called the \"fair green\" now owned by Miss Gregg, Kilmeague.\n\n\n\nA man named Thomas Farrell kept a hedge-school in Ballyteague.\n\n\n\nWhite spots on the nails are meant to be (called) \"gifts\"  A gift on the thumb\n(continues on next page)\n", "school_info": "School: Allenwood, Robertstown", "metadata": [{"Location:": "Allenwood, Co. Kildare", "Teacher:": "\nSeán Ó Clúmháin\n"}, {"Collector": "Marcella Ennis", "Gender": "female", "Address": "Grangeclare West, Co. Kildare"}, {"Informant": "Mr Pat Cleary", "Gender": "male"}, {"Language": "English"}]}, "4742167/4741550/4814546": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0775, Page 030", "Page 030"], "url": "https://www.duchas.ie/en/cbes/4742167/4741550/4814546", "text": "\nThe parish priest in Allen during the mission in 1886 was Fr. O'Farrell. The missioner priest's means were Fr. Dowling, Fr. Philolia, and Fr. O'Reilly.\n\n\n\nThe bonfire in Ballyteague used to be on the 24th June (St John's Eve.)\n\n\n\nA red-haired woman is unlucky to meet in the morning or (on)  starting on a journey.\n\n\n\nThere was a great faction fight in Littletown between Ballyteague and Allenwood. They used to fight through the fields. Ballyteague won.\n\n\n\nThere used to be a fair in Kilmeague in a field called the \"fair green\" now owned by Miss Gregg, Kilmeague.\n\n\n\nA man named Thomas Farrell kept a hedge-school in Ballyteague.\n\n\n\nWhite spots on the nails are meant to be (called) \"gifts\"  A gift on the thumb\n(continues on next page)\n", "school_info": "School: Allenwood, Robertstown", "metadata": [{"Location:": "Allenwood, Co. Kildare", "Teacher:": "\nSeán Ó Clúmháin\n"}, {"Collector": "Marcella Ennis", "Gender": "female", "Address": "Grangeclare West, Co. Kildare"}, {"Informant": "Mr Pat Cleary", "Gender": "male"}, {"Language": "English"}]}, "4742167/4741550/4814547": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0775, Page 030", "Page 030"], "url": "https://www.duchas.ie/en/cbes/4742167/4741550/4814547", "text": "\nThe parish priest in Allen during the mission in 1886 was Fr. O'Farrell. The missioner priest's means were Fr. Dowling, Fr. Philolia, and Fr. O'Reilly.\n\n\n\nThe bonfire in Ballyteague used to be on the 24th June (St John's Eve.)\n\n\n\nA red-haired woman is unlucky to meet in the morning or (on)  starting on a journey.\n\n\n\nThere was a great faction fight in Littletown between Ballyteague and Allenwood. They used to fight through the fields. Ballyteague won.\n\n\n\nThere used to be a fair in Kilmeague in a field called the \"fair green\" now owned by Miss Gregg, Kilmeague.\n\n\n\nA man named Thomas Farrell kept a hedge-school in Ballyteague.\n\n\n\nWhite spots on the nails are meant to be (called) \"gifts\"  A gift on the thumb\n(continues on next page)\n", "school_info": "School: Allenwood, Robertstown", "metadata": [{"Location:": "Allenwood, Co. Kildare", "Teacher:": "\nSeán Ó Clúmháin\n"}, {"Collector": "Marcella Ennis", "Gender": "female", "Address": "Grangeclare West, Co. Kildare"}, {"Informant": "Mr Pat Cleary", "Gender": "male"}, {"Language": "English"}]}, "4742167/4741550/4814548": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0775, Page 030", "Page 030"], "url": "https://www.duchas.ie/en/cbes/4742167/4741550/4814548", "text": "\nThe parish priest in Allen during the mission in 1886 was Fr. O'Farrell. The missioner priest's means were Fr. Dowling, Fr. Philolia, and Fr. O'Reilly.\n\n\n\nThe bonfire in Ballyteague used to be on the 24th June (St John's Eve.)\n\n\n\nA red-haired woman is unlucky to meet in the morning or (on)  starting on a journey.\n\n\n\nThere was a great faction fight in Littletown between Ballyteague and Allenwood. They used to fight through the fields. Ballyteague won.\n\n\n\nThere used to be a fair in Kilmeague in a field called the \"fair green\" now owned by Miss Gregg, Kilmeague.\n\n\n\nA man named Thomas Farrell kept a hedge-school in Ballyteague.\n\n\n\nWhite spots on the nails are meant to be (called) \"gifts\"  A gift on the thumb\n(continues on next page)\n", "school_info": "School: Allenwood, Robertstown", "metadata": [{"Location:": "Allenwood, Co. Kildare", "Teacher:": "\nSeán Ó Clúmháin\n"}, {"Collector": "Marcella Ennis", "Gender": "female", "Address": "Grangeclare West, Co. Kildare"}, {"Informant": "Mr Pat Cleary", "Gender": "male"}, {"Language": "English"}]}, "4742069/4732494/4818169": {"title": "Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0460, Page 150", "Page 150"], "url": "https://www.duchas.ie/en/cbes/4742069/4732494/4818169", "text": "\nFaction Fights1. A faction fight took place at Molahiffe about eighty years ago.  The Brosnans, Larkins, Allens and Corcoran fought against the Mac Gillacuddy, Mearas, Burkes, Dalys, Sullivans and Connors.The Connors (liath) and the Larkins were cousins and were buried in the same graves in Aglish Churchyard.  When Jack Larkin, a robber, died, the Connors tried to prevent the Larkins of burying him in any one of the graves, but the Larkins hunted them out of the graveyard and buried the corpse.On their way home from Aglish the Larkins were attacked at Rockfield Cross by the Connor faction.  Daithín Na bhFoithre (Dave Larkin, Firies) was struck on the head and badly wounded.  Con Bacach Meara was the man who struck him.  That stroke ended the fight at Rockfield Cross.After this fight both parties made preparations to meet at Molahiffe Fair.  This fair is held annually at Molahiffe.  Seán Liath Connor, from Rath, Firies  was the leader of the Connor faction.  On the fair morning he had a barrel of whiskey on top of the \"Rock\" at Molahiffe.  All his supporters got\n(continues on next page)\n", "school_info": "School: Cnoc an Doire (B.)", "metadata": [{"Location:": "Knockaderry, Co. Kerry", "Teacher:": "\nDomhnall Ó Seaghdha\n"}, {"Informant": "Con Shea", "Gender": "male", "Age": "81", "Address": "Boolasallagh, Co. Kerry"}, {"Language": "English"}]}, "4798653/4787160/4818450": {"title": "Factions-Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0232, Page 048", "Page 048"], "url": "https://www.duchas.ie/en/cbes/4798653/4787160/4818450", "text": "\n4824. Faction-fights.The parish of Ardcarne was divided into two parts Cootehill and Crossna. The two parts after fought fights at a place known as Cryanstown. The people at those fights used sticks for fighting as well as their fists. If one man quarrelled with another he would not fight with him then but would wait till the fight at CyransTown. Blood was often spelled st those fights. Some men trained their sons to fight with sticks in order that they would be able to fight well. The fights were held on the first of April and the first of October. A man named Glynn was killed at one of the fights. This quite them down a bit.At one time there was a terrible fight at Cryanstown. It was the first day of April and all the men from Cootehall and Crossna had gathered for the fight. The fight started at about ten o'clock. The men fought with sticks and their fists. The fight continued for half an hour and most of the men were bleeding. There was a great boxer in Crossma at the time named James Conway. He was at the fight and was making great progress being everyone this fought with him. In the midst of the fight he met a man named Byrne, from Cootehill,\n(continues on next page)\n", "school_info": "School: Leamh-choill", "metadata": [{"Location:": "Drumsillagh, Co. Roscommon", "Teacher:": "\nCáit Ní Ghadhra\n"}, {"Language": "English"}]}, "4758573/4755883/4922960": {"title": "A Faction Fight", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0865, Page 177", "Page 177"], "url": "https://www.duchas.ie/en/cbes/4758573/4755883/4922960", "text": "\nThere is only one faction-fight remembered. It took place at a bridge named \"Gleann a'mhurloal\". One one occasion some men from Firoda and men from Ballinakill were coming from a funeral in Ballinakill and a dispute arose among them about a football match. On gleann a'mhurloal there was a battle fought between them. When they were fighting the women started also.\n\n\n\nOn Richard Coogan's farm of lower Firoda. There is a rushy field in it on one side of it there is a green patch of land and a rush never grew on it. That is because mass was said on it.. in the penal days.\n", "school_info": "School: Firoda", "metadata": [{"Location:": "Firoda Upper, Co. Kilkenny", "Teacher:": "\nDáithí Ó Meachair\n"}, {"Language": "English"}]}, "4758573/4755883/4922962": {"title": "A Faction Fight", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0865, Page 177", "Page 177"], "url": "https://www.duchas.ie/en/cbes/4758573/4755883/4922962", "text": "\nThere is only one faction-fight remembered. It took place at a bridge named \"Gleann a'mhurloal\". One one occasion some men from Firoda and men from Ballinakill were coming from a funeral in Ballinakill and a dispute arose among them about a football match. On gleann a'mhurloal there was a battle fought between them. When they were fighting the women started also.\n\n\n\nOn Richard Coogan's farm of lower Firoda. There is a rushy field in it on one side of it there is a green patch of land and a rush never grew on it. That is because mass was said on it.. in the penal days.\n", "school_info": "School: Firoda", "metadata": [{"Location:": "Firoda Upper, Co. Kilkenny", "Teacher:": "\nDáithí Ó Meachair\n"}, {"Collector": "Michael Coady", "Gender": "male"}, {"Informant": "Patrick Coady", "Gender": "male", "Age": "59"}, {"Language": "English"}]}, "4769998/4765263/4931675": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0826, Page 191", "Page 191"], "url": "https://www.duchas.ie/en/cbes/4769998/4765263/4931675", "text": "\n(continued from previous page)\nthe road. The priest told him he would never be caught because the Landlord was too unjust to live. The man was never arrested for murder.\n\n\n\nLong ago there was very often fights among the people. These fights were made known at all the people and a crowd always gathered to see the fight. The people of this parish on the Glenkit mountain where many of these fights took place. The place of the fights can still be pointed out. Some old people can still remember these fights and witnessed them.\n\n\n\nOn the road between Cappanara and Camross there is a tree called the Monument Tree. This tree is in Derry. Long ago a man was killed here. He was found one morning killed under a car. His son was with him and said that something unseen frightened the horse. The place where he was killed can still be seen,\n\n\n\nOnce there lived in this parish a priest\n(continues on next page)\n", "school_info": "School: Camross, Mountrath", "metadata": [{"Location:": "Camross, Co. Laois", "Teacher:": "\nPádraig Ó Heifernáin\n"}, {"Collector": "Patrick Guilfoyle", "Gender": "male", "Age": "13", "Address": "Carrowreagh, Co. Laois"}, {"Informant": "William Guilfoyle", "Relation": "parent", "Gender": "male", "Age": "60", "Address": "Carrowreagh, Co. Laois"}, {"Language": "English"}]}, "4769998/4765263/4931686": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0826, Page 191", "Page 191"], "url": "https://www.duchas.ie/en/cbes/4769998/4765263/4931686", "text": "\n(continued from previous page)\nthe road. The priest told him he would never be caught because the Landlord was too unjust to live. The man was never arrested for murder.\n\n\n\nLong ago there was very often fights among the people. These fights were made known at all the people and a crowd always gathered to see the fight. The people of this parish on the Glenkit mountain where many of these fights took place. The place of the fights can still be pointed out. Some old people can still remember these fights and witnessed them.\n\n\n\nOn the road between Cappanara and Camross there is a tree called the Monument Tree. This tree is in Derry. Long ago a man was killed here. He was found one morning killed under a car. His son was with him and said that something unseen frightened the horse. The place where he was killed can still be seen,\n\n\n\nOnce there lived in this parish a priest\n(continues on next page)\n", "school_info": "School: Camross, Mountrath", "metadata": [{"Location:": "Camross, Co. Laois", "Teacher:": "\nPádraig Ó Heifernáin\n"}, {"Collector": "Patrick Collier", "Gender": "male", "Age": "13", "Address": "Carrowreagh, Co. Laois"}, {"Informant": "Michael Dunne", "Relation": "unknown", "Gender": "male", "Age": "50", "Address": "Clash, Co. Laois"}, {"Language": "English"}]}, "4769998/4765297/4932007": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0826, Page 225", "Page 225"], "url": "https://www.duchas.ie/en/cbes/4769998/4765297/4932007", "text": "\nOnce there was a man coming home late in the night. He met a spirit in white and it asked him what had him out as late in the night. He was going in, in his own gate and he was beaten black and blue. When he went home he saw something  in the kitchen. When he went to bed it disappeared from him. After a while he saw something black in the bed. He got afraid and he came down to the kitchen and the doors flew open. After tht a big storm came and no one else heard it. He got a mass said and nothing else appeared to him.\n\n\n\nIn olden times in Upperwoods there  were fierce faction fights and it was quite common then to hear of people being killed. There was a faction fight in Camross graveyard when the walls of the present chapel were only three feet high with the result that it had - so tradition says - had to be consecrated again. There were also three public houses or as they were then called 'sheebens'. Before the belfry was built, the door was in the end where the present archway exists; and when the priest was saying mass he could see the fellows drinking at Dooley's Public house.\n(continues on next page)\n", "school_info": "School: Camross, Mountrath", "metadata": [{"Location:": "Camross, Co. Laois", "Teacher:": "\nPádraig Ó Heifernáin\n"}, {"Collector": "Frank Tynan", "Gender": "male", "Age": "8", "Address": "Camross, Co. Laois"}, {"Informant": "Thomas Tynan", "Relation": "parent", "Gender": "male", "Age": "61", "Address": "Camross, Co. Laois"}, {"Language": "English"}]}, "4922319/4869611/4932364": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0600, Page 087", "Page 087"], "url": "https://www.duchas.ie/en/cbes/4922319/4869611/4932364", "text": "\n(continued from previous page)\nhad no fixed abode. He was a harness maker. In Kilrush he used to get all his leather. One day a friend of his in Klmihil was going to town with a horse, and car. John was walking, and when his friend arrived in town John had his leather bought, and was ready to return home, having beaten the horse and car.\n\n\n\nThere used be great fighting here about fifty years ago. The boys of Cranny and Shessive claimed to be strong and active and well scienced in the use of the blackthorn stick So on various occasions they challenged the men of Tullycrine, and the west who were also well able to stand a great fight. It was a cruel, savage custom, as many of them got badly hurt. There was no victory for either party at any time for they only succeeded in maiming and wounding each other.\n\n\n\nThere were many faction fights in this locality long ago. A party of the Reidys from Cranny used to fight with a party of the Keatings from Kilrush. They fought fiercely at the races of Kilrush with blackthorn sticks, and clenched fists. Tom Reidy struck one of the Keatings with a black-thorn stick and left him half-dead on the road. Tom Reidy lay in hiding for a good while until Keating\n(continues on next page)\n", "school_info": "School: Drumdigus (C.), Kilmurry McMahon", "metadata": [{"Location:": "Drumdigus, Co. Clare", "Teacher:": "\nMáire, Bean Uí Ghormáin\n"}, {"Collector": "Bridie Hollaran", "Gender": "female", "Address": "Derrynalecka, Co. Clare"}, {"Informant": "Mrs Brogan", "Gender": "female", "Age": "80", "Address": "Derrynalecka, Co. Clare"}, {"Language": "English"}]}, "4922319/4869611/4932371": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0600, Page 087", "Page 087"], "url": "https://www.duchas.ie/en/cbes/4922319/4869611/4932371", "text": "\n(continued from previous page)\nhad no fixed abode. He was a harness maker. In Kilrush he used to get all his leather. One day a friend of his in Klmihil was going to town with a horse, and car. John was walking, and when his friend arrived in town John had his leather bought, and was ready to return home, having beaten the horse and car.\n\n\n\nThere used be great fighting here about fifty years ago. The boys of Cranny and Shessive claimed to be strong and active and well scienced in the use of the blackthorn stick So on various occasions they challenged the men of Tullycrine, and the west who were also well able to stand a great fight. It was a cruel, savage custom, as many of them got badly hurt. There was no victory for either party at any time for they only succeeded in maiming and wounding each other.\n\n\n\nThere were many faction fights in this locality long ago. A party of the Reidys from Cranny used to fight with a party of the Keatings from Kilrush. They fought fiercely at the races of Kilrush with blackthorn sticks, and clenched fists. Tom Reidy struck one of the Keatings with a black-thorn stick and left him half-dead on the road. Tom Reidy lay in hiding for a good while until Keating\n(continues on next page)\n", "school_info": "School: Drumdigus (C.), Kilmurry McMahon", "metadata": [{"Location:": "Drumdigus, Co. Clare", "Teacher:": "\nMáire, Bean Uí Ghormáin\n"}, {"Collector": "Josephine O' Leary", "Gender": "female", "Address": "Cross Beg, Co. Clare"}, {"Informant": "Patrick Lorigan", "Gender": "male", "Age": "72", "Address": "Cross Beg, Co. Clare"}, {"Language": "English"}]}, "4922319/4869612/4932378": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0600, Page 088", "Page 088"], "url": "https://www.duchas.ie/en/cbes/4922319/4869612/4932378", "text": "\n(continued from previous page)\ngot all night.\n\n\n\nThe Hennessys and Hehirs were two great factions who engaged in many a fight. One of the Hennessys was called \"The Bully Hennessy\". They lived in Lissycasey. The Hehirs who were always their opponents were natives of Shyan. Once, at the Tullycrine Races, they fought a great battle. Many of them were wounded both Hennessys and Hehirs but there were no law proceedings as it was not the etiquette of the thing to call in any outsiders to interfere. The \"Bully Hennessy\" went to America and soon the gang broke up. Tom Hehir is still in Shyan.\n\n\n\nMartin Reidy of Crossderry and Richard Spellissy of Scariff were two famous faction fighters. One day there was a horse-fair in Spancihill and Spellissy and four other comrades of his challenged Martin Reidy to fight them. The Reidy man was very strong and he was engaged in a few faction fights before that. He took off his coat and vest Then he got a black-thorn stick and started beating Spellissy and his comrades single-handed. The Spellissy were having the victory at first, but after a few neighbours joined Reidy he was victorious. The result of that faction fight was fatal for Spellissy. Martin Reidy struck Spellissy a mortal blow on the head. The Ready man was \"in his\n(continues on next page)\n", "school_info": "School: Drumdigus (C.), Kilmurry McMahon", "metadata": [{"Location:": "Drumdigus, Co. Clare", "Teacher:": "\nMáire, Bean Uí Ghormáin\n"}, {"Collector": "Mary Halloran", "Gender": "female", "Address": "Binvoran, Co. Clare"}, {"Informant": "Patrick Ferguson", "Gender": "male", "Age": "74", "Address": "Drumdigus, Co. Clare"}, {"Language": "English"}]}, "4922319/4869612/4932383": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0600, Page 088", "Page 088"], "url": "https://www.duchas.ie/en/cbes/4922319/4869612/4932383", "text": "\n(continued from previous page)\ngot all night.\n\n\n\nThe Hennessys and Hehirs were two great factions who engaged in many a fight. One of the Hennessys was called \"The Bully Hennessy\". They lived in Lissycasey. The Hehirs who were always their opponents were natives of Shyan. Once, at the Tullycrine Races, they fought a great battle. Many of them were wounded both Hennessys and Hehirs but there were no law proceedings as it was not the etiquette of the thing to call in any outsiders to interfere. The \"Bully Hennessy\" went to America and soon the gang broke up. Tom Hehir is still in Shyan.\n\n\n\nMartin Reidy of Crossderry and Richard Spellissy of Scariff were two famous faction fighters. One day there was a horse-fair in Spancihill and Spellissy and four other comrades of his challenged Martin Reidy to fight them. The Reidy man was very strong and he was engaged in a few faction fights before that. He took off his coat and vest Then he got a black-thorn stick and started beating Spellissy and his comrades single-handed. The Spellissy were having the victory at first, but after a few neighbours joined Reidy he was victorious. The result of that faction fight was fatal for Spellissy. Martin Reidy struck Spellissy a mortal blow on the head. The Ready man was \"in his\n(continues on next page)\n", "school_info": "School: Drumdigus (C.), Kilmurry McMahon", "metadata": [{"Location:": "Drumdigus, Co. Clare", "Teacher:": "\nMáire, Bean Uí Ghormáin\n"}, {"Collector": "Mary Neylon", "Gender": "female", "Address": "Binvoran, Co. Clare"}, {"Informant": "Patrick Lorigan", "Gender": "male", "Age": "72", "Address": "Cross Beg, Co. Clare"}, {"Language": "English"}]}, "4922319/4869613/4932386": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0600, Page 089", "Page 089"], "url": "https://www.duchas.ie/en/cbes/4922319/4869613/4932386", "text": "\n(continued from previous page)\nkeeping\" for three months after. The police were searching for him, but they failed to find him. He afterwards stole away to America.\n\n\n\nThere was an old school convenient to the Protestant Church in Kilmurry. It was a \"Souper School. There was a fairly good building in which the school was held and the ruins of it are yet to be seen. A Mr. Hunt taught there. This was in the bad times when Catholics were induced to sent their children to such schools in order to be fed with soup and bread. Although the poor people were very badly in need of assistance very few of them sent their children to the soup school and in a short time it had to be discontinued.\n\n\n\nBefore the National schools were built the school-masters used to teach their pupils at the back of the hedges on in remote mountain glens and for that reason the school-masters were known as the hedge schoolmasters. There were many of these school throughout the country in olden times. There was a hedge school in Benvoran, the teacher was Tadhg Ryan. He used to teach his pupils reading, writing, and arithmetic. There was no need for teaching them Irish as it was the spoken\n(continues on next page)\n", "school_info": "School: Drumdigus (C.), Kilmurry McMahon", "metadata": [{"Location:": "Drumdigus, Co. Clare", "Teacher:": "\nMáire, Bean Uí Ghormáin\n"}, {"Collector": "Lena Daly", "Gender": "female", "Address": "Kilmurry McMahon, Co. Clare"}, {"Informant": "Michael Mc Namara", "Gender": "male", "Age": "68", "Address": "Derrynalecka, Co. Clare"}, {"Language": "English"}]}, "4921960/4913618/4938649": {"title": "Leaba Thaidhg", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0487, Page 482", "Page 482"], "url": "https://www.duchas.ie/en/cbes/4921960/4913618/4938649", "text": "\nLong ago in Glensharrold a battle was fought between two political sections of the local people in a certain meadow.  The battle went on and one man was killed.  So his comrades only buried him hurriedly in the meadow.  There is a hump in the meadow which can be seen up to this day it is supposed to be the grave of Taidg.  That is how the meadow got its name, which means the bed of Taidg.  After a long time some men dreamt that there was gold hidden there.  So people came digging hoping to make their fortune.  The digging went on night after night until they found bones, the diggers ran away and never came near Leaba Thaidhg since.The above was related by Thomas Moore -aged 67 years - He is native of Glensharrold, lives quite near the field mentioned above.  He was told the story by his mother also a native of Glensharrold.  He died about 10 yrs ago aged 90.  The \"Political\" parties were the \"Blacks\" - those who paid their rents to the Landlords + the \"Whites\" those who would not.  The Landlords were the root of all the trouble between these parties.\n", "school_info": "School: Carrickerry, Árd-achadh", "metadata": [{"Location:": "Carrigkerry, Co. Limerick", "Teacher:": "\nCaitlín, Bean Uí Chonaill\n"}, {"Collector": "Kathleen O Connell", "Gender": "female", "Age": "12", "Address": "Glensharrold, Co. Limerick"}, {"Informant": "Thomas Moore", "Gender": "male", "Age": "67", "Address": "Glensharrold, Co. Limerick"}, {"Language": "English"}]}, "4723869/4720845/4941269": {"title": "Local Place Names", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0953, Page 295", "Page 295"], "url": "https://www.duchas.ie/en/cbes/4723869/4720845/4941269", "text": "\nLogwid Hill, so called from the colour of the spring that ouses out of it. Logwid was a dye by the people of this country forty years ago. Minerals abound in small quantities in the hill which is situated in James Traver's farm in the townland of Calliagh in Aghabog County Monaghan.Armagh HillArmagh Hill is so called, on account of a slight skirmish which ten men fought. The Armagh men won the fight against the Monaghan men. This hill situated in the townland of Drumsheeny County Monaghan.\n", "school_info": "School: Threemilehouse", "metadata": [{"Location:": "Three Mile House, Co. Monaghan", "Teacher:": "\nI. Mc Eneaney\n"}, {"Language": "English"}]}, "4723869/4720932/4941323": {"title": "Historical Tradition", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0953, Page 382", "Page 382"], "url": "https://www.duchas.ie/en/cbes/4723869/4720932/4941323", "text": "\nThis district is not rich in historical tradition. There are no accounts of battles that were fought. Occasionally there were challenge fights to settle some disputes between neighbours. The best contested of all these was between the boykes + McSutees, but a priest came on the scene + made them end it.During the Penal Days the people went to Drumsnett Graveyard to hear Mass and a priest was mudered here while saying Mass. During the Famine the potato crop failed and the sufferings of the people was acute. Some relief was got from the porridge houses and some well-to do farmers sold corn and food to the starving neighbours.When the Land War was raging the people of this locality were agitating to have the rents reduced but no event If any report since took place in this district during this period.\n", "school_info": "School: Threemilehouse", "metadata": [{"Location:": "Three Mile House, Co. Monaghan", "Teacher:": "\nI. Mc Eneaney\n"}, {"Language": "English"}]}, "4921985/4915451/4943604": {"title": "Faction Fight", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0494, Page 151", "Page 151"], "url": "https://www.duchas.ie/en/cbes/4921985/4915451/4943604", "text": "\nLong ago there was a faction fight in Brosna between the Lanes and the Curtains. The Curtains were from Brosna and the Lanes were from Cahir Lane.  There was a woman of the Lanes who had nine sons, she was the strongest woman in the parish and she was six feet tall, and she was nicknamed Máire Mór na Muinge. Herself and her husband and her nine sons took part in the fight. They fought with sticks and stones. There was a hole in the stick with a thong running through it this thong was twisted around the wrist to prevent the stick from falling when they got a stroke in the hand. Máire was all day drawing stones to the Lanes, and in the evening she took off one of her stockings filled it with stones to beat the Curtains, she knocked out two or three of them with the stocking. They drove the Curtains across the Cladhadach and beat them. In the evening they took Máire on their shoulders through the village for she was the best help they had in the fight\n", "school_info": "School: Mín na Cille, Mainistir na Féile", "metadata": [{"Location:": "Meenkilly, Co. Limerick", "Teacher:": "\nAindrias Ó Dúnadhuighe\n"}, {"Collector": "Tadhg Mac Cárthaigh", "Gender": "male", "Address": "Caher (Lane), Co. Limerick"}, {"Informant": "(name not given)", "Relation": "grandparent", "Gender": "female"}, {"Language": "English"}]}, "4921985/4915452/4943605": {"title": "Faction Fighting", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0494, Page 152", "Page 152"], "url": "https://www.duchas.ie/en/cbes/4921985/4915452/4943605", "text": "\nA faction fight that became famous throughout the county Limerick was one between the Collins family of the bounds of Ketty and the Macks of Grogeen. Some dispute got up between the two parties and it is said that there were as many as a hundred people on each side. Scarcely a fair day- race day- or pattern day would pass that these two parties would not have a fight. One day the fight began between the two parties and the Macks had a woman and she was called Nóra-Na-Slighe and she used to do nothing but picking sticks for the Macks. The Macks beat the Collins family back to Kerry, and up to fifty of their men got wounded. The parties used no firearms but sticks, stones and lead. It was often said that this woman Nóra-Na-Slighe was able to beat two of Collins party she was supposed to be the strongest and bravest woman in the district.\n", "school_info": "School: Mín na Cille, Mainistir na Féile", "metadata": [{"Location:": "Meenkilly, Co. Limerick", "Teacher:": "\nAindrias Ó Dúnadhuighe\n"}, {"Collector": "Pádraig Ó Conaill", "Gender": "male", "Address": "Meenkilly, Co. Limerick"}, {"Informant": "Thomas O Connell", "Gender": "male"}, {"Language": "English"}]}, "4921985/4915507/4943675": {"title": "Faction Fight", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0494, Page 207", "Page 207"], "url": "https://www.duchas.ie/en/cbes/4921985/4915507/4943675", "text": "", "school_info": "School: Mín na Cille, Mainistir na Féile", "metadata": [{"Location:": "Meenkilly, Co. Limerick", "Teacher:": "\nAindrias Ó Dúnadhuighe\n"}, {"Collector": "Tadhg Mac Carthaig", "Gender": "male", "Address": "Caher (Lane), Co. Limerick"}, {"Informant": "Tim Mc Carthy", "Gender": "male"}, {"Language": "English"}]}, "4921986/4915530/4945041": {"title": "A Hidden Treasure", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0494, Page 230", "Page 230"], "url": "https://www.duchas.ie/en/cbes/4921986/4915530/4945041", "text": "\n(continued from previous page)\nare ye doing there ? They told their story. He said there was no use in searching, that they'ed never find it in the dark. He told them to come to his house, (for) which was nearby, for a light. They went with him and (when) they returned the stone was gone , and when they never found trace or tidings of the money from that day to this.\n\n\n\nThis is the name given to a field on the farm of Dan P. Riordan of Port, quite adjacent to the ancient castle of Purt, and was the scene of many a bloody battle in the days of the Faction Fights when the two rival parties of North Kerry (the Cooleens and the Black Mulvihills) used to cross swords for supremacy. The fairs were transferred to the town of Abbeyfeale about a mile away some years ago. Two of the established fairs still have the name the \"Purt Fairs\" [ ] the 15th of December and the July Fair.\n\n\n\nThere were miniature battles between gangs of men from different districts - the only objective being simply a trial of strength. In these districts we had two North Kerry contingents. The Cooleens and the Black Mulvanhills and many\n(continues on next page)\n", "school_info": "School: Cnoc na Sná (B.), Mainistir na Féile", "metadata": [{"Location:": "Knocknasna, Co. Limerick", "Teacher:": "\nDáithí Ó Conchobhair\n"}, {"Collector": "D. O Conor", "Gender": "male", "Occupation": "múinteoir"}, {"Language": "English"}]}, "4921976/4914793/4945222": {"title": "Local Fairs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0492, Page 119", "Page 119"], "url": "https://www.duchas.ie/en/cbes/4921976/4914793/4945222", "text": "\nThe local fairs are held in the town of Newscastle West or in the town of Abbeyfeale. Long ago the fairs were held about a mile out from the town of Abbeyfeale. There was a great fair held every [?] of December about a mile out from the town of Abbeyfeale, it was called the \"Purt fair\", because it was over looking Purt castle and often this field was thronged with people until it would be dark at night.A great deal of faction fighting was carried on. The weapons used were blackthorn sticks and often the thorns would never be cut. Some people would carry two sticks and some would ride on horse-back. On those days there was no law and no one to stop rows\n(continues on next page)\n", "school_info": "School: Templeglantine (B.)", "metadata": [{"Location:": "Templeglentan, Co. Limerick", "Teacher:": "\nMaitiú Ó Duilleáin\n"}, {"Collector": "Dáthaí O Cáthail", "Gender": "male", "Address": "Inchabaun, Co. Limerick"}, {"Language": "English"}]}, "4922203/4860313/4946136": {"title": "Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0551, Page 212", "Page 212"], "url": "https://www.duchas.ie/en/cbes/4922203/4860313/4946136", "text": "\nThe faction fights in this district nearly all had part with the \"Shanavests\" and the \"Carawats.\" The great grand father of one of the school children a man named Hayes fought and shouted at fairs for the \"Shanavests.\"\n", "school_info": "School: Cill na Coille (Kilemakill), An Teampoll Mór", "metadata": [{"Location:": "Kilmakill, Co. Tipperary", "Teacher:": "\nCáit, Bean Uí Gríobhta\n"}, {"Collector": "Joseph Griffin", "Gender": "male", "Address": "Kilmakill, Co. Tipperary"}, {"Informant": "Mrs Stapleton", "Gender": "female", "Address": "Kilmakill, Co. Tipperary"}, {"Language": "English"}]}, "4922203/4860314/4946244": {"title": "Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0551, Page 213", "Page 213"], "url": "https://www.duchas.ie/en/cbes/4922203/4860314/4946244", "text": "\nAnother faction fight began between Stapleton's and another They had an argument over eggs. One of the women's hens used to lay out in the ditch. This woman gathered the eggs every day. On a certain day she got no eggs in the nest and she said it was her neighbour took the eggs. Her neighbour said it was the magpies took them. She was not believed and then the faction fight began.\n", "school_info": "School: Cill na Coille (Kilemakill), An Teampoll Mór", "metadata": [{"Location:": "Kilmakill, Co. Tipperary", "Teacher:": "\nCáit, Bean Uí Gríobhta\n"}, {"Collector": "Mary Ryan", "Gender": "female", "Address": "Manselstown, Co. Tipperary"}, {"Informant": "Mrs Hayes", "Gender": "female", "Address": "Manselstown, Co. Tipperary"}, {"Language": "English"}]}, "4921996/4916610/4948335": {"title": "Old Roads", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0497, Page 324", "Page 324"], "url": "https://www.duchas.ie/en/cbes/4921996/4916610/4948335", "text": "\nThe Clashers so called from \"Clash\" now Killacolla were at enmity with a section here at Ballygran. Their arrival\n(continues on next page)\n", "school_info": "School: Béal Átha Grean", "metadata": [{"Location:": "Ballyagran, Co. Limerick", "Teacher:": "\nDónall Ó Cuill\n"}, {"Informant": "Pat Madigan", "Gender": "male", "Age": "65", "Address": "Moanabricka, Co. Cork"}, {"Language": "English"}]}, "4921996/4916610/4948345": {"title": "Old Roads", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0497, Page 324", "Page 324"], "url": "https://www.duchas.ie/en/cbes/4921996/4916610/4948345", "text": "\nThe Clashers so called from \"Clash\" now Killacolla were at enmity with a section here at Ballygran. Their arrival\n(continues on next page)\n", "school_info": "School: Béal Átha Grean", "metadata": [{"Location:": "Ballyagran, Co. Limerick", "Teacher:": "\nDónall Ó Cuill\n"}, {"Language": "English"}]}, "4921996/4916611/4948363": {"title": "'The Clashers are Coming'", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0497, Page 325", "Page 325"], "url": "https://www.duchas.ie/en/cbes/4921996/4916611/4948363", "text": "\n(continued from previous page)\nusually meant a fight and hence the saying \"The Clashers are coming\". However I believe the advent of the Clashers was usually for indulgence in strong drink which helped to stir up the fighting spirit.\n\n\n\nFaction fights were common occurrences here up to 60 years ago. The most famous fights took place at the fair of the well which was held in Miss O'Brien's field about a quarter of a mile from Ballygran on the road to Castletown. The fair was held on the 11th Feb and people used to come from all the districts within 20 miles of the place. It was last held about 60 years ago. This fair never passed without its faction fight. All would be quietness till the signal a red sod of turf was thrown up and someone shouted \"Three years\". He was at once answered by an opponent with the shout \"Four Years\". In\n(continues on next page)\n", "school_info": "School: Béal Átha Grean", "metadata": [{"Location:": "Ballyagran, Co. Limerick", "Teacher:": "\nDónall Ó Cuill\n"}, {"Informant": "Ned Walsh", "Gender": "male", "Age": "65", "Address": "Croghteen, Co. Limerick"}, {"Language": "English"}]}, "4921996/4916613/4948420": {"title": "Faction Fights - The Fair of the Well", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0497, Page 327", "Page 327"], "url": "https://www.duchas.ie/en/cbes/4921996/4916613/4948420", "text": "\n(continued from previous page)\nand stayed at Greens next door to the School.  He had a bundle of rods for his faction.  Whatever happened they did not turn up and the old fellow stayed above in the loft until the fair was over and the opposing faction gone.They also tell of a fine strapping stranger at the fair of the Well who on being asked what faction he was with said, toying with his ash plant \"oh I only came for a puck about\".\n\n\n\nThe great Race Day for this district and for all places for 20 miles around was the Race Day of Banogue. Races were held on an ideal course near Banogue, Croom.\n\n\n\nCross Country matches were common. A football match then meant taking\n(continues on next page)\n", "school_info": "School: Béal Átha Grean", "metadata": [{"Location:": "Ballyagran, Co. Limerick", "Teacher:": "\nDónall Ó Cuill\n"}, {"Language": "English"}]}, "4921997/4916645/4948700": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0497, Page 359", "Page 359"], "url": "https://www.duchas.ie/en/cbes/4921997/4916645/4948700", "text": "\nSome faction fights took place at an old Annual Fair called the Fair of the Well in this parish between the \"three years\" on one side and \"the four years\" on the other.  That fair has been discontinued for about 60 years and was famous in its time.  Beside the usual buying and selling of animals there were athletic contests held, also dancing.  It was held on the 11th February.The well in one of the fields where the Fair was held, is called St. Gobnets well probably the same saint mentioned in the Ballyvourney district of Co. Cork.The Fair of the Well was also famous for match-making\n", "school_info": "School: Castletownconyers, Ráthluirc", "metadata": [{"Location:": "Castletown, Co. Limerick", "Teacher:": "\nSeán Ó Brosnacháin\n"}, {"Language": "English"}]}, "4922076/4850220/4949487": {"title": "A Fair in Cluggin and Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0518, Page 173", "Page 173"], "url": "https://www.duchas.ie/en/cbes/4922076/4850220/4949487", "text": "\nA fair in Cluggin and Faction Fights.There was a fair held in Cluggin long ago.It was held on the 18th of May.  There were many things sold there such as sweets and sugar sticks.One day an argument arose.  Some said that a bull was three years old and others said that the bull was a four year old.The fight arose.  There were two parties there.They were called the three year olds and the four year olds.Ond day the four year olds nearly killed the three year olds, and from this developed the great faction fight s known as the followers of the three year old and the four year old.  Fights were common at all meetings and at the Fair of Cluggin men and women took sides, and a man was killed.  At a mission in Nicker the leaders of both sides were brought inside the rails and old enemies were made friends.  At this time the G.A.A. was established and a football team with members drawn from both sides united the parties and silenced the \"party cries\".\n", "school_info": "School: Brackile, Pallasgreen", "metadata": [{"Location:": "Brackyle, Co. Limerick", "Teacher:": "\nLiam Ó Cinnéide\n"}, {"Collector": "Pat Ryan", "Gender": "male"}, {"Language": "English"}]}, "4922041/4921289/4950119": {"title": "The Old Fair of Ardpatrick", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0509, Page 207", "Page 207"], "url": "https://www.duchas.ie/en/cbes/4922041/4921289/4950119", "text": "\nThe fair green was in the angle made by the old road (previously referred to) with the road which runs from Ardpatrick upper cross to Kilmallock. The site is for the most part occupied at present by a labourer's cottage & plot.The old fair green had no boundary fences & I believe no fences lay between it & the roads at the time. This was a famous fair & is referred to in the song 'Priosún Cluáin Meala'.Faction fights took place here, the offending parties being the 'three year olds' & the 'four year olds'. A tragic occurrence put a stop to these fights & as far as I could gather to the fair also. A blacksmith who lived at this cross & whose brother was injured at the fair took a hammer & followed the agressors overtaking them somewhere on the road to Kilmallock. With the hammer he struck & killed a man, and a great outcry was the result. The clergy spoke against the fights & factions & this ended the business.As regards the factions I myself saw an old man said to be nearly 90 'wheeling a stick about his head and shouting out a war cry about a 'three year old'. This happened shortly after my coming here, in say 1903 or 1904. Some 'lads' had annoyed the old man by shouting out the opposite slogan.\n", "school_info": "School: Árd Phádraig", "metadata": [{"Location:": "Ardpatrick, Co. Limerick", "Teacher:": "\nPilib Ó Conaill\n"}, {"Language": "English"}]}, "4742123/4738058/4950319": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0474, Page 220", "Page 220"], "url": "https://www.duchas.ie/en/cbes/4742123/4738058/4950319", "text": "\nPádraig Ó Súilleabháin Innse BháidhtheMícheál Ua Módhráin   Caol a Phréacháin d’innis1. San mbliadhain 1825 a bhí an bruighean déidheannach aca i Máighistir Gaoithe agus ní dubhrathas aon Aifreann istig sa séipéal an Domhnach san.  Bhí feirm ag Bait Thaidhg Uí Shúilleabháin i Máighistir Gaoithe an t-am sin.  Muinntir Churráin anuas ó Chúmastabha agus Málainn agus Ceannuaig a bhí ag troid le muínntir Shúilleabháin.   (Suilleabhánaig a bhóirín) ó’n dtaobh eile do’n chnoc ó Máistir Gaoithe.  Díospóireacht a éirig eatortha i dtig óil an Domhnach roimis sin féachaint ciacu acu an cine bfearr riamh.  Bhuaileadar am a chéile ar an gcnocán lastuas de’n séipéal an maidin Domhnaig shin roimh Aifreann agus bataí droighin éile ag gach neach díobh   Iall ag gach fear ar an mbata ar eagla go snapfaí an bata uaidh sa ngleic.  Bhí na Súilleabhánaig ag buadhachtaint agus thiomáineadar an dream eile siar go Cúinnne Máighréide agus soir ar an dtaobh sheas don séipéal agus annsan tháinig camtha ó Barra na Aoine de mhuinntir Shéaghdha ag cabhrughadh le muinntir Curráin agus thiomáineadar muinntir Shúilleabháin ar gcúl arís.  Tháinig an Sagart agus chuir sé deire leis an dtroid acht ní leómfadh sé iad a leigint isteach sa séipéal ag éisteacht Aifrinn ar eagla nuair a bhí an fraoch ortha chun a chéile go dtosnóchaidís ar a chéile istig sa séipéal agus go ndoirtfí fuil ann.  Is ar leac cairrge ar thalamh Bhatt Thaidhg ar léigheadh an t-Aifreann an lá san.  Níor mharbhuigheadh aoinne sa troid seo acht basgadh a lán.      Níl aon amhras mar gheall ar fhírinne an sgéil seo mar is duine a bhí i láthair ag an dtroid agus é 'na gharsún a innis an sgéal do’n bhfear a innis domhsa é.  Bé ainm an fhir a bhí i láthair an troda\n(continues on next page)\n", "school_info": "School: Cill Mac Ciarainn", "metadata": [{"Location:": "Kilmackerrin East, Co. Kerry", "Teacher:": "\nSeán Ó Cathasaigh\n"}, {"Collector": "Pádraig Ó Suilleabháin", "Gender": "male", "Address": "Inchinvauty, Co. Kerry"}, {"Informant": "Mícheál Ua Mádhráin", "Gender": "male", "Address": "Kealafreaghane West, Co. Kerry"}, {"Language": "Irish"}]}, "4922121/4854108/4950837": {"title": "Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0530, Page 323", "Page 323"], "url": "https://www.duchas.ie/en/cbes/4922121/4854108/4950837", "text": "\n24 Faction Fights(a) In the district the Mearas and Carrolls were the chief factionists.  Ceist é seo: Were the faction fights an imitation of the duels of the \"gentry\" at the time?  Challenges were given and accepted by individuals.  Sometimes one would now-a-days hear the comment \"he was a mean faction-fighter\" referring to someone who did not fight according to the rule, or who took an advantage of an opponent.About 1840 Meara (Gearailt) Shanavalla, Carrigahorig and Carroll Ballinderg, Borrisokane had a dispute and quarrel over some matter.They decided to settle the business in a fight.  The day and place were decided on - the yearly Kyleagoona Races.In those days Kyleagoon (near Borrisokane) was a famous race-course, and people from Galway, Nenagh and far off places were accustomed to come to the famous races.  People of the locality walked long distances to these races as there were no cars then not to speak of bicycles.Meara came to Kylegoona that day with his friends, and to his delight he met his opponent Carroll.  The fight began and the men fought with blackthorn sticks and loaded butts.  Meara was by far the better fighter and he gave a savage beating to Carroll, leaving him half-dead on the field.\n(continues on next page)\n", "school_info": "School: Tír-Dhá-Ghlas (Terryglass)", "metadata": [{"Location:": "Terryglass, Co. Tipperary", "Teacher:": "\nSeán Ó Gliasáin\n"}, {"Informant": "Mrs Darcy", "Gender": "female", "Address": "Ballinderry, Co. Tipperary"}, {"Language": "mixed"}]}, "4922121/4854109/4950839": {"title": "Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0530, Page 324", "Page 324"], "url": "https://www.duchas.ie/en/cbes/4922121/4854109/4950839", "text": "\n(continued from previous page)\nTo celebrate the event the winner and his friends got drunk.  They marched home across the bog singing and shouting.Mrs. Darcy Ballinderry, Borrisokane.  Other particulars given already.\n\n\n\n(b.) In the faction-fighting days there was an old enmity between the parishes of Kilbarron and Terryglass.  The factionists meeting at a fair in Borrisokane fought up and down the street for hours - the Terryglass men being headed by Meara Gearailt.  Finally Kilbarron routed their opponents, driving them out of the town on to the Terryglass road.  Meara got knocked and rolled in the muddy street, so that his own followers did not know him.A man named Doheny, from Monsea, Nenagh (who appeared to be fighting on the Kilbarron side) coming up to Meara who was covered with mud called out:\"Do you know Meara Gearailt, the man whose teeth I knocked out\".\"I do\" replied Gearailt \"for here he is\".They then lay to it with heavy blackthorns, and Meara had his full revenge.Brigid Parkinson, Slevoyre, Borrisokane.  Other particulars already given.These faction fights appear to have ceased about 60 years ago.  Even at the Kylegoona Races faction-fighting was gradually dying out.\n", "school_info": "School: Tír-Dhá-Ghlas (Terryglass)", "metadata": [{"Location:": "Terryglass, Co. Tipperary", "Teacher:": "\nSeán Ó Gliasáin\n"}, {"Informant": "Brigid Parkinson", "Gender": "female", "Address": "Slevoir, Co. Tipperary"}, {"Language": "English"}]}, "4922034/4920796/4955301": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0507, Page 289", "Page 289"], "url": "https://www.duchas.ie/en/cbes/4922034/4920796/4955301", "text": "\n(continued from previous page)\nthere, and be sure I got my \"fairings\".I was reared 'till I was about twelve years, with my grandfather, and 'twas with him I first went there.  I remember to see maybe a dozen pig's heads, laid out, boiled at the end of the counter in W.---B----'s tent.  He was a fine man, and a great man, and was always the leader in the faction fight.  an uncle or maybe a grandson of his, led a crowd of men to Drummin fair one time, and the Priest of Croom, or maybe to be right, of Drommin itself, spoke against the faction fighting, and faction parties, the Sunday before the fair.He said not to go there, and a lot more, but anyway, the man I am telling you about led his faction, and he was the first to climb over the ditch of the fair field.  The yeomen were there, and when they saw him come in, they fired and shot him dead.  There was often bloody work at Glenogra, and 'twas worse at Drummin, but they are both gone now. (Micheal O'Connell, 71 bhliadhain )\n\n\n\nand again:  \"There used to be tents there from Croom and Bruff, from Athlacca and Fedamore, from Ballybrood itself, and ould Thady Halpin from Cahernorry used to have one there\"- at Glenogra fair(M.O'C)\n\n\n\nIf my mother was milking a heifer, that would be inclined to pull up her right hind leg, and so make it hard to milk her, she would only say \"Korthig!\"   -ceartuighDan Kelly.Bánóg\n", "school_info": "School: Cromadh (B.)", "metadata": [{"Location:": "Croom, Co. Limerick", "Teacher:": "\nDáithí Ó Ceanntabhail\n"}, {"Language": "English"}]}, "4922034/4920796/4955303": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0507, Page 289", "Page 289"], "url": "https://www.duchas.ie/en/cbes/4922034/4920796/4955303", "text": "\n(continued from previous page)\nthere, and be sure I got my \"fairings\".I was reared 'till I was about twelve years, with my grandfather, and 'twas with him I first went there.  I remember to see maybe a dozen pig's heads, laid out, boiled at the end of the counter in W.---B----'s tent.  He was a fine man, and a great man, and was always the leader in the faction fight.  an uncle or maybe a grandson of his, led a crowd of men to Drummin fair one time, and the Priest of Croom, or maybe to be right, of Drommin itself, spoke against the faction fighting, and faction parties, the Sunday before the fair.He said not to go there, and a lot more, but anyway, the man I am telling you about led his faction, and he was the first to climb over the ditch of the fair field.  The yeomen were there, and when they saw him come in, they fired and shot him dead.  There was often bloody work at Glenogra, and 'twas worse at Drummin, but they are both gone now. (Micheal O'Connell, 71 bhliadhain )\n\n\n\nand again:  \"There used to be tents there from Croom and Bruff, from Athlacca and Fedamore, from Ballybrood itself, and ould Thady Halpin from Cahernorry used to have one there\"- at Glenogra fair(M.O'C)\n\n\n\nIf my mother was milking a heifer, that would be inclined to pull up her right hind leg, and so make it hard to milk her, she would only say \"Korthig!\"   -ceartuighDan Kelly.Bánóg\n", "school_info": "School: Cromadh (B.)", "metadata": [{"Location:": "Croom, Co. Limerick", "Teacher:": "\nDáithí Ó Ceanntabhail\n"}, {"Informant": "Dan Kelly", "Gender": "male", "Address": "Banoge, Co. Limerick"}]}, "4922122/4854200/4956756": {"title": "Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0530, Page 451", "Page 451"], "url": "https://www.duchas.ie/en/cbes/4922122/4854200/4956756", "text": "\n1. Mrs Darcy.  2. Ballinderry, Borrisokane.  3. About 50.  4. Dressmaker.  5. Ballinderry.  6. Her mother.  7. About 35 years ago.  8. About 50 years.  9. Ballinderry.  10. 1934.About one hundred years ago there were in the parish of Terryglass two great faction-fighting families the Mearas of Shanavalla, Carrigahorig and the Carrolls of Ballinderry.  There was a long standing dispute between the two parties.  They finally decided to fight out the matter at the annual Kylagoona races.In those days Kyleagoona was a noted race-course, and people from Galway, Nenagh and other distant places were accustomed to come to the famous races.  All people from the locality flocked there - walking long distances as there were no cars not to speak of bicycles.Meara and his friends came in strong numbers to the races to enjoy the day and finish the fight; Carroll with his backers was there too.When the challengers met the fight began.  The men fought with blackthorn sticks and loaded butts.  Meara was by far the better fighter and he gave a savage beating to Carroll leaving him half-dead on the field.To celebrate the event the winner and his friends got drunk.  They marched home across the bog to Shanavalla singing and shouting.\n", "school_info": "School: Tír-Dhá-Ghlas (Terryglass)", "metadata": [{"Location:": "Terryglass, Co. Tipperary", "Teacher:": "\nSeán Ó Gliasáin\n"}, {"Informant": "Mrs Darcy", "Gender": "female", "Age": "circa 50", "Occupation": "dress-maker", "Address": "Ballinderry, Co. Tipperary"}, {"Language": "English"}]}, "4922122/4854201/4956758": {"title": "Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0530, Page 452", "Page 452"], "url": "https://www.duchas.ie/en/cbes/4922122/4854201/4956758", "text": "\n1. Brigid Parkinson.  2. Slevoyre.  3. 64.  4. Farmer.  5. Slevoyre.  6. Grandfather.  7. About 50 years.  8. About 70 years.  9. Slevoyre.  10. 1934.(b) In the faction-fighting days - about 1840 - there was an old enmity between the parishes of Kilbarron and Terryglass.  On one occasion the factionists met at the fair of Borrisokane.  They fought up and down the street for hours.  Finally Kilbarron routed their opponents driving them out of the town on to the Terryglass road.Meara (Gearailt) the leader of the Terryglass men got knocked down in the melee and rolled in the muddy street so much so that his own followers did not recognise him.A man named Doheny, Monsea, Nenagh was the chief fighting man on the Kilbarron side.  Coming up to the mud-covered Meara he called out in challenge:\"Do you know Meara Gearailt, the man whose teeth I knocked out?\"\"I do, for here he is.\"They then lay to it with heavy blackthorns, and Meara well won back the day.Faction-fights ceased about sixty years ago.  Even at Kyleagoona races they were gradually dying out.\n", "school_info": "School: Tír-Dhá-Ghlas (Terryglass)", "metadata": [{"Location:": "Terryglass, Co. Tipperary", "Teacher:": "\nSeán Ó Gliasáin\n"}, {"Informant": "Brigid Parkinson", "Gender": "female", "Age": "64", "Occupation": "farmer", "Address": "Slevoir, Co. Tipperary"}, {"Language": "English"}]}, "4922055/4847980/4957319": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0512, Page 213", "Page 213"], "url": "https://www.duchas.ie/en/cbes/4922055/4847980/4957319", "text": "\n(continued from previous page)\nto turn the people to the Protestant religion. During the famine period they built a 'soup-house' at Knocknacorrig, or as it is commonly called, Dark Island. The poor people of course drank the soup gratefully, but in the course of a few years when conditions brightened, they turned away quickly from the Protestant soup.One Cornelius Ryan of Tipperary was deemed a rebel circa 1640. His property was confiscated and handed over to Erasmus Smith, and later on given to his two daughters. One of them married an O'Brien of Arra, and the other a Barry of Buttevant. Those are the Smith Barry's and the Smith O'Brien's that we have heard so much of for the past forty years. They were the chief means of having Tipperary town as it is at present.\n", "school_info": "School: Cnoc Cairn, Imleach Iubhair", "metadata": [{"Location:": "Knockcarron, Co. Limerick", "Teacher:": "\nTomás Ó Dúthaigh\n"}, {"Language": "English"}]}, "4922055/4847994/4957470": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0512, Page 227", "Page 227"], "url": "https://www.duchas.ie/en/cbes/4922055/4847994/4957470", "text": "\nThe Fitzgeralds of Knockcarron, my own ancestors, were nicknamed the \" Gleidire's \"One fair-night in Emly, a factions began between the \"three-year-olds\" and the \"four-year-olds.\"My great-grandfather, Robert Fitzgerald, Lackelly, Emly, and adherent of the \"three-year-olds\" defeated single-handed, the entire opposing faction, and chased them a half mile from the village with a blackthorn cudgel.\n\n\n\nAny reference to unpopular leaders in our Irish history draws the following comment from the old people locally:-\"Seamus an Chac' a chaill Éireann\"in reference to King James II\n\n\n\nIn former times    when a pig was killed, the bodalach was kept and hung on the hob. This was afterwards used to clean up boots and other footwear. Leather cleaned thus, was supposed to be impervious to water.\n\n\n\nLocal old people say that a tailor is only the ninth part of a man, from being always hunched up on his table. They also classify \" tailors and schoolmasters \" as being \" cracked \"  ( light-headed )\n", "school_info": "School: Cnoc Cairn, Imleach Iubhair", "metadata": [{"Location:": "Knockcarron, Co. Limerick", "Teacher:": "\nTomás Ó Dúthaigh\n"}, {"Language": "mixed"}]}, "4922055/4847994/4957472": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0512, Page 227", "Page 227"], "url": "https://www.duchas.ie/en/cbes/4922055/4847994/4957472", "text": "\nThe Fitzgeralds of Knockcarron, my own ancestors, were nicknamed the \" Gleidire's \"One fair-night in Emly, a factions began between the \"three-year-olds\" and the \"four-year-olds.\"My great-grandfather, Robert Fitzgerald, Lackelly, Emly, and adherent of the \"three-year-olds\" defeated single-handed, the entire opposing faction, and chased them a half mile from the village with a blackthorn cudgel.\n\n\n\nAny reference to unpopular leaders in our Irish history draws the following comment from the old people locally:-\"Seamus an Chac' a chaill Éireann\"in reference to King James II\n\n\n\nIn former times    when a pig was killed, the bodalach was kept and hung on the hob. This was afterwards used to clean up boots and other footwear. Leather cleaned thus, was supposed to be impervious to water.\n\n\n\nLocal old people say that a tailor is only the ninth part of a man, from being always hunched up on his table. They also classify \" tailors and schoolmasters \" as being \" cracked \"  ( light-headed )\n", "school_info": "School: Cnoc Cairn, Imleach Iubhair", "metadata": [{"Location:": "Knockcarron, Co. Limerick", "Teacher:": "\nTomás Ó Dúthaigh\n"}, {"Language": "mixed"}]}, "4922055/4847994/4957473": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0512, Page 227", "Page 227"], "url": "https://www.duchas.ie/en/cbes/4922055/4847994/4957473", "text": "\nThe Fitzgeralds of Knockcarron, my own ancestors, were nicknamed the \" Gleidire's \"One fair-night in Emly, a factions began between the \"three-year-olds\" and the \"four-year-olds.\"My great-grandfather, Robert Fitzgerald, Lackelly, Emly, and adherent of the \"three-year-olds\" defeated single-handed, the entire opposing faction, and chased them a half mile from the village with a blackthorn cudgel.\n\n\n\nAny reference to unpopular leaders in our Irish history draws the following comment from the old people locally:-\"Seamus an Chac' a chaill Éireann\"in reference to King James II\n\n\n\nIn former times    when a pig was killed, the bodalach was kept and hung on the hob. This was afterwards used to clean up boots and other footwear. Leather cleaned thus, was supposed to be impervious to water.\n\n\n\nLocal old people say that a tailor is only the ninth part of a man, from being always hunched up on his table. They also classify \" tailors and schoolmasters \" as being \" cracked \"  ( light-headed )\n", "school_info": "School: Cnoc Cairn, Imleach Iubhair", "metadata": [{"Location:": "Knockcarron, Co. Limerick", "Teacher:": "\nTomás Ó Dúthaigh\n"}, {"Language": "mixed"}]}, "4922055/4847994/4957474": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0512, Page 227", "Page 227"], "url": "https://www.duchas.ie/en/cbes/4922055/4847994/4957474", "text": "\nThe Fitzgeralds of Knockcarron, my own ancestors, were nicknamed the \" Gleidire's \"One fair-night in Emly, a factions began between the \"three-year-olds\" and the \"four-year-olds.\"My great-grandfather, Robert Fitzgerald, Lackelly, Emly, and adherent of the \"three-year-olds\" defeated single-handed, the entire opposing faction, and chased them a half mile from the village with a blackthorn cudgel.\n\n\n\nAny reference to unpopular leaders in our Irish history draws the following comment from the old people locally:-\"Seamus an Chac' a chaill Éireann\"in reference to King James II\n\n\n\nIn former times    when a pig was killed, the bodalach was kept and hung on the hob. This was afterwards used to clean up boots and other footwear. Leather cleaned thus, was supposed to be impervious to water.\n\n\n\nLocal old people say that a tailor is only the ninth part of a man, from being always hunched up on his table. They also classify \" tailors and schoolmasters \" as being \" cracked \"  ( light-headed )\n", "school_info": "School: Cnoc Cairn, Imleach Iubhair", "metadata": [{"Location:": "Knockcarron, Co. Limerick", "Teacher:": "\nTomás Ó Dúthaigh\n"}, {"Language": "English"}]}, "4758525/4751686/5009425": {"title": "Famine Period 1846-'7-'8", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0852, Page 203", "Page 203"], "url": "https://www.duchas.ie/en/cbes/4758525/4751686/5009425", "text": "\n(continued from previous page)\nof Tullahought was employed by Meehan to cook and sell it. The boilers the Stirabout was cooked in are still at John Crowleys (the Mill). He was the present Pat Carroll's grand father. There does not seem to be much else remembered locally. It does not seem to have been too bad in this area.\n\n\n\nTwo local ones were the Holdens and the Longs. \"Where are you from? I'm from the mountains.'Who will you join? I'll join the Holdens.'Where are you from? I'm from the bogs.Who will you join I'll join the Longs.\"Above parties often fought each other and there seems to be one famous fight remembered locally. It was fought about 1820 on 'Scough hill'. The above fighters fought side by side against the Badoírs (faction fighters) from Carrick-on Suir. The Badoírs were joined by the quarry miners as a fierce battle ensued. The Holdens and Longs won the fight as they maneuvered the Badoírs to the lower side of them and got them down the hill below Maloneys pub. The hero of the fight was 'Whaley' from the quarries (with the Badoírs). He kept a 'Sheabeen' at the stone bridge in the quarries.Another section of fights were the 'Shay-a-Varts' and the 'Con-a-Barts'  (Corabhath)  little is known of them; they probably belonged to an earlier period.There were two sections of the 'Whiteboys'. Shay-a-Varts Curraheen, Co. Tipp. Con-a-Barts Kilmacoliver, Co Kilkenny, they fought at Whaleys shebeen in quarry before 1800  17-?\n", "school_info": "School: Kilmacoliver, Piltown", "metadata": [{"Location:": "Kilmacoliver, Co. Kilkenny", "Teacher:": "\nRistéard Ó Faoláin\n"}, {"Language": "English"}]}, "4742038/4730052/5009852": {"title": "Story of Bayswell", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0869, Page 151", "Page 151"], "url": "https://www.duchas.ie/en/cbes/4742038/4730052/5009852", "text": "\nThere lived in Bayswell a man named Delaney who was a Protestant and the priest was continually trying to get him to turn Catholic but he would not. When Delaney was dying the priest came to him and asked him again to turn Catholic. Delaney refused to listen to him and the priest went out. His servant boy was waiting for him outside and the boy told him that he had seen a black man going into the house. The priest said that was the devil and that he had gone into Delaney.\n\n\n\nLong ago there used to be a pattern in Eark on Michaelmas Day. On one pattern day people named Cody  and Phelan were in it and they were enemies. One of the Phelans said \"I dont see old \"Plover\" Cody here\". Cody's son was near and he said \"Well if he's not the young \"plover\" is here. They began to fight and one of the Phelans shot Cody. There was never a pattern in Eark after.\n", "school_info": "School: Crosspatrick, Johnstown", "metadata": [{"Location:": "Crosspatrick, Co. Kilkenny", "Teacher:": "\nP. Ó Foghlú\n"}, {"Collector": "M. Grady"}, {"Informant": "M. Grady", "Age": "83"}, {"Language": "English"}]}, "4742038/4730052/5009857": {"title": "Story of Bayswell", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0869, Page 151", "Page 151"], "url": "https://www.duchas.ie/en/cbes/4742038/4730052/5009857", "text": "\nThere lived in Bayswell a man named Delaney who was a Protestant and the priest was continually trying to get him to turn Catholic but he would not. When Delaney was dying the priest came to him and asked him again to turn Catholic. Delaney refused to listen to him and the priest went out. His servant boy was waiting for him outside and the boy told him that he had seen a black man going into the house. The priest said that was the devil and that he had gone into Delaney.\n\n\n\nLong ago there used to be a pattern in Eark on Michaelmas Day. On one pattern day people named Cody  and Phelan were in it and they were enemies. One of the Phelans said \"I dont see old \"Plover\" Cody here\". Cody's son was near and he said \"Well if he's not the young \"plover\" is here. They began to fight and one of the Phelans shot Cody. There was never a pattern in Eark after.\n", "school_info": "School: Crosspatrick, Johnstown", "metadata": [{"Location:": "Crosspatrick, Co. Kilkenny", "Teacher:": "\nP. Ó Foghlú\n"}, {"Collector": "M. Grady"}, {"Informant": "M. Dwyer"}, {"Language": "English"}]}, "4922063/4848954/5010303": {"title": "Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0514, Page 179", "Page 179"], "url": "https://www.duchas.ie/en/cbes/4922063/4848954/5010303", "text": "\nFaction fightsKilbehenny against Cooleregan80 years ago\n\n\n\nFolk Cures and CharmsCahill's blood supposed to cure Anthony's Fire.\n", "school_info": "School: Coill Beithne (C.), Baile Mhistéala", "metadata": [{"Location:": "Kilbeheny, Co. Limerick", "Teacher:": "\n-\n"}, {"Language": "English"}]}, "4922063/4848954/5010305": {"title": "Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0514, Page 179", "Page 179"], "url": "https://www.duchas.ie/en/cbes/4922063/4848954/5010305", "text": "\nFaction fightsKilbehenny against Cooleregan80 years ago\n\n\n\nFolk Cures and CharmsCahill's blood supposed to cure Anthony's Fire.\n", "school_info": "School: Coill Beithne (C.), Baile Mhistéala", "metadata": [{"Location:": "Kilbeheny, Co. Limerick", "Teacher:": "\n-\n"}, {"Language": "English"}]}, "4922154/4856707/5012410": {"title": "Wakes and Funerals", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0538, Page 235", "Page 235"], "url": "https://www.duchas.ie/en/cbes/4922154/4856707/5012410", "text": "\n(continued from previous page)\nfields and hills. I heard of a funeral go from Murroe to Templederry on foot some few were on horseback.Then about 50 years ago hearses were introduced.The priests at funerals wore tall hats with a linen band on them and also a linen band over one shoulder and under the opposite arm.\n\n\n\nIn every town and village there were generally two factions who were bitterly opposed to each other & met generally at fairs where they had a fight hard and bitter & there was hardly any fight without a couple of heads being broken or perhaps some one being killed.The two factions in Newport were very famous & were the Coffeys & the Ryans (Riaskawallas).In Borrisoleigh they were called The Magpies and The Black Hens - those were the Stapletons , & Kinnanes & Ryans and Kellys.The factions in Cappawhite were known by the names 'Three - years old'\n(continues on next page)\n", "school_info": "School: Killoscully, Newport", "metadata": [{"Location:": "Killoscully, Co. Tipperary", "Teacher:": "\nMrs. Julia Bourke\n"}, {"Language": "English"}, {"Location": "Jail Street"}]}, "4758491/4748349/5012517": {"title": "The Blood Field", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0843, Page 141", "Page 141"], "url": "https://www.duchas.ie/en/cbes/4758491/4748349/5012517", "text": "\nThere is a field in Baile na Mac called the blood-field. Long ago there was a battle fought there between two rival Irish clans. The slaughter was terrible and blood flowed all over the field. A priest said that the mark of that fatal battle would always be seen on the field. If you go into the field you will see a red shade on everything in it. When you go out of it you will see no red shade.\n", "school_info": "School: Kilmacow (B.)", "metadata": [{"Location:": "Kilmacow, Co. Kilkenny", "Teacher:": "\nP. Ó Loingsigh\n"}, {"Collector": "James Walsh", "Gender": "male", "Address": "Dangan, Co. Kilkenny"}, {"Informant": "John Hickey", "Gender": "male", "Age": "80", "Occupation": "farmer"}, {"Language": "English"}]}, "4922159/4857029/5015331": {"title": "Faction Fighting", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0539, Page 240", "Page 240"], "url": "https://www.duchas.ie/en/cbes/4922159/4857029/5015331", "text": "\nIn days gone by there was a good deal of faction fighting in the South of Ireland. The factions around Newport were the Reaskawallahs and the Coffeys. The former were so called because they came from a townslands near Doon called Reaskawallah. Their leader was John Ryan, generally called \"Shawn Lucash\". John was a powerful man, and had led his men in many a hard fought fight. One Coffey of Newport was chief of the Coffeys.The origin of their feud was as in most other cases, lost in antiquity. The members of opposite factions who happened to live near each other lived peacefully together, except on occasions when they met expressly for fight. Fairs were the usual battlefields, though at times, a special hour and place was fixed for a battle. One of these fights took\n(continues on next page)\n", "school_info": "School: Tulach Sheasta, Clochair na Trócaire", "metadata": [{"Location:": "Newport, Co. Tipperary", "Teacher:": "\nSr Bertrand\n"}, {"Collector": "Teresa Browne", "Gender": "female"}, {"Informant": "Michael Coffey", "Gender": "male", "Age": "circa 32", "Occupation": "labourer", "Address": "Annaholty, Co. Tipperary"}, {"Language": "English"}]}, "4922143/4856180/5015395": {"title": "Curreeny Fair", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0537, Page 017", "Page 017"], "url": "https://www.duchas.ie/en/cbes/4922143/4856180/5015395", "text": "\nIt is said there used to be a fair held in Curreeny about 5 centuries ago. It was held on the top of John Ryan's (Larry) hill, about 1/4 mile south of Curreeny church. At that time all Curreeny, Shanagorth and Knockahopple, was a commonage and the people used to gather up the cattle off the commonage the day before the fair. It was held only once a year. At that time it was customary to have faction fights and a few men were usually killed as a result of the fight. To prevent such murdering the fair was discontinued.At that time there was a widow, Mrs Ryan living near Curreeny. She went to France and after receiving the necessary education her son was ordained. It is said he wrote an article or a poem about the \"Fair of Curreeny\" but even the oldest inhabitants never heard the words, nor saw a copy of the article.\n", "school_info": "School: Curreeny, Dolla, Nenagh", "metadata": [{"Location:": "Curreeny, Co. Tipperary", "Teacher:": "\nJames Conlon\n"}, {"Language": "English"}]}, "4742038/4730083/5018425": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0869, Page 182", "Page 182"], "url": "https://www.duchas.ie/en/cbes/4742038/4730083/5018425", "text": "\nOnce upon a time a woman died and her knees were cocking up in the bed as she could not straighten them and when the people were laying her out, they had to put a stone on her knees to straighten them. One night all the people were at the wake and there was one boy in the room who knew about the stone upon the woman's knees and when he was going to go home he went over to the side of the woman's bed to say a few prayers and he gave a little shove to the stone and it slid off the woman's knees and up they went in the bed. The people got scared and ran out of the room and the man had to sit down to laugh at the trick he had played.\n\n\n\nThere was a tree in the Country Tipperary and a voice used to be heard saying \"Cá paghainn\" when someone was passing. One night a man was passing and the voice said \"Cá paghainn\" The man answered \"Where will you go but to heaven where we all hope to go with the help of God.\" The voice was never heard after that.\n\n\n\nThere was a woman living in Fertagh and she was fond of stealing. One night she stole a lamb and killed it and eat it. The priest came the next day and asked her\n(continues on next page)\n", "school_info": "School: Crosspatrick, Johnstown", "metadata": [{"Location:": "Crosspatrick, Co. Kilkenny", "Teacher:": "\nP. Ó Foghlú\n"}, {"Collector": "N. Norton"}, {"Informant": "Dan Healy", "Gender": "male"}, {"Language": "English"}]}, "4742038/4730083/5018432": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0869, Page 182", "Page 182"], "url": "https://www.duchas.ie/en/cbes/4742038/4730083/5018432", "text": "\nOnce upon a time a woman died and her knees were cocking up in the bed as she could not straighten them and when the people were laying her out, they had to put a stone on her knees to straighten them. One night all the people were at the wake and there was one boy in the room who knew about the stone upon the woman's knees and when he was going to go home he went over to the side of the woman's bed to say a few prayers and he gave a little shove to the stone and it slid off the woman's knees and up they went in the bed. The people got scared and ran out of the room and the man had to sit down to laugh at the trick he had played.\n\n\n\nThere was a tree in the Country Tipperary and a voice used to be heard saying \"Cá paghainn\" when someone was passing. One night a man was passing and the voice said \"Cá paghainn\" The man answered \"Where will you go but to heaven where we all hope to go with the help of God.\" The voice was never heard after that.\n\n\n\nThere was a woman living in Fertagh and she was fond of stealing. One night she stole a lamb and killed it and eat it. The priest came the next day and asked her\n(continues on next page)\n", "school_info": "School: Crosspatrick, Johnstown", "metadata": [{"Location:": "Crosspatrick, Co. Kilkenny", "Teacher:": "\nP. Ó Foghlú\n"}, {"Collector": "M. Grady"}, {"Informant": "Mrs Dwyer", "Gender": "female"}]}, "4922245/4863826/5020892": {"title": "Na Bruíontóirí - The Faction Fighters", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0563, Page 131", "Page 131"], "url": "https://www.duchas.ie/en/cbes/4922245/4863826/5020892", "text": "\n\"Na Bruidheantóirí\"   (The Faction Fighters)Carabhat  agus  Sean-BheistTá  caoga bliain ann anois ó bhí an dá dhream sin i gcoinnibh a chéile agus go nimhneach is oth liom a radh i mBaile an Gharrdha.\"Carabhat tugadh ar dhream acu agus \"Sean-Bheist\" ar an dream eile agus bhí \"port\" speisialta a spreagaidís nuair chasaidís ar a chéile.Bhíodh aonac i mBaile an Gharrdha an uair úd agus ní théigheadh  feirmeóir ar an aonach gan bata droighin nó bunán  n-a ghlaic.  Bhí biotáile  saor an t-am sin agus nuair bhíodh na bruidheantóirí  ar meisge nó maith go leór d'éirigheadh an troid eatorra.An t-Athair Pilib Mach Gearailt an sagart paróiste bhí i mBaile an Gharrdha le na linn agus théigheadh sé ar an aonach i ndeire  an lae agus thógadh sé na bataí uatha. Bhí seomra 'na thigh agus \"seomra na mBunán\" a tugadh air  toisg an lín bataí a bhailigh sé. Sar a théigheadh sé abhaile chuireadh sé an ruaig ar na bruidheantóirí.Seo iad cuid des na daoine a ghaibh páirt sna bruidheanta:Ó Meachair, Corcráin, Ó Brian, Cróchach, Fox.   (Sionnach)Do buaileadh Seóirse Ó Meachair sa cheann le bata droighin  i mbruidhean éigin agus briseadh\n(continues on next page)\n", "school_info": "School: Baile an Gharrdha (B.)", "metadata": [{"Location:": "Ballingarry, Co. Tipperary", "Teacher:": "\nTomás Lotrail\n"}, {"Language": "Irish"}]}, "4922245/4863866/5021082": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0563, Page 171", "Page 171"], "url": "https://www.duchas.ie/en/cbes/4922245/4863866/5021082", "text": "", "school_info": "School: Baile an Gharrdha (B.)", "metadata": [{"Location:": "Ballingarry, Co. Tipperary", "Teacher:": "\nTomás Lotrail\n"}, {"Informant": "Patrick Phelan", "Gender": "male", "Address": "Ballingarry, Co. Tipperary"}, {"Language": "English"}]}, "4922245/4863868/5021094": {"title": "Shanavest Jig - Caravat Jig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0563, Page 173", "Page 173"], "url": "https://www.duchas.ie/en/cbes/4922245/4863868/5021094", "text": "\nShanavest Jig (Music sheet drawn)Caravat Jig(Music sheet drawn)\n", "school_info": "School: Baile an Gharrdha (B.)", "metadata": [{"Location:": "Ballingarry, Co. Tipperary", "Teacher:": "\nTomás Lotrail\n"}, {"Language": "English"}]}, "4922285/4867255/5022660": {"title": "A Fairy Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0577, Page 089", "Page 089"], "url": "https://www.duchas.ie/en/cbes/4922285/4867255/5022660", "text": "\n(continued from previous page)\nbeing carried away by the Good People. When Jack went out he found that his steed had vanished and he had to walk from Coffey's all the way home. When he got up next morning he found he was lame and remained in that condition for the rest of his life.\n\n\n\nIn olden times fairs used not to be held in towns as they are to-day, but instead they were held in a field in some district. In Ballyhurst in a place about two and a half miles away from this school there was an important Fair Field. This field is on the main road from Tipperary to Kilfeacle and about a quarter of a mile from the latter place. It is in Mr. Gavin's farm.\n(continues on next page)\n", "school_info": "School: Currach Púir (Curraghpoor), Dún na Sgíath", "metadata": [{"Location:": "Curraghpoor, Co. Tipperary", "Teacher:": "\nLiam Ó Duibhir\n"}, {"Collector": "Mary O' Dwyer", "Gender": "female", "Address": "Ballinard, Co. Tipperary"}, {"Informant": "Mr James O' Dwyer", "Relation": "parent", "Gender": "male", "Age": "57", "Address": "Ballinard, Co. Tipperary"}, {"Language": "English"}]}, "4922285/4867257/5022661": {"title": "Three Year Olds", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0577, Page 091", "Page 091"], "url": "https://www.duchas.ie/en/cbes/4922285/4867257/5022661", "text": "\nThe brutal custom of faction fighting was continued in this county up to about half a century ago. Cappawhite a village about five miles from here was the principal centre of these fights. For some years the parties who took part in these fights were known as the \"Three Year Olds\" and the\"Four Year Olds.\"The origin of these names goes back to a dispute which arose between two individuals as to the probable age of a bull. One argued that the anumal was a \"Three Year Old\" and the othr maintained that he was a \"Four Year Old.\"As they were both very obstinate in their opinions the argument soon got heated, and it ended in blows.As a result of this quarrel these two people became deadly enemies and later each person was backed up by his own friends and relations, and these untimately constituted the two great factions.\n", "school_info": "School: Currach Púir (Curraghpoor), Dún na Sgíath", "metadata": [{"Location:": "Curraghpoor, Co. Tipperary", "Teacher:": "\nLiam Ó Duibhir\n"}, {"Collector": "Mary Farrell", "Gender": "female", "Address": "Donaskeagh, Co. Tipperary"}, {"Informant": "Mr L. O' Dwyer", "Gender": "male", "Age": "55", "Address": "Attybrick, Co. Tipperary"}, {"Language": "English"}]}, "4922285/4867258/5022662": {"title": "Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0577, Page 092", "Page 092"], "url": "https://www.duchas.ie/en/cbes/4922285/4867258/5022662", "text": "\nBetween forty and fifty years ago a great faction fight took place on the Race-course in Cashel. The annual race meeting was being held there on that day, and as a consequnce an enormous crowd was present. The parties engaged were the Ryan (Harrys) and the Daverns.While the third race was in progress the melee started. It lasted for over half an hour, and ash plants and loading butts were freely used. One of the Ryans died as the result of a serious wound which he received in that fight.Another faction fight took place in a field about three quarters of a mile from here in the townsland of Lacken. This field is now on Mr. Denis Hogans farm. A race meeting was in progress here also when the fighting started. it was not of very huge dimensions and there were no very serious casualties.\n", "school_info": "School: Currach Púir (Curraghpoor), Dún na Sgíath", "metadata": [{"Location:": "Curraghpoor, Co. Tipperary", "Teacher:": "\nLiam Ó Duibhir\n"}, {"Collector": "Teresa Ryan", "Gender": "female", "Address": "Clonmaine, Co. Tipperary"}, {"Informant": "Mr Patrick Coman", "Gender": "male", "Age": "60", "Address": "Kilfeakle, Co. Tipperary"}, {"Language": "English"}]}, "4922285/4867259/5022663": {"title": "A Faction Fight", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0577, Page 093", "Page 093"], "url": "https://www.duchas.ie/en/cbes/4922285/4867259/5022663", "text": "\nAbout sixty years ago at a rece meeting which was held in a field which is near the cross of Clonoulty a barbarous faction fight was suddenly started. The Burkes were one of the contending parties in this fight and hey fought a fierce battle. Numerous casualties occured at this fight, and much blood was shed. Ever since the field is known as the \"Field of the Blood.\"On the following Sunday at Mass the outrage was condemned by the parish priest of the place. He cursed the Burkes and said that in a few years one could shout against them at their own place and that there would be none of them left to answer.\n", "school_info": "School: Currach Púir (Curraghpoor), Dún na Sgíath", "metadata": [{"Location:": "Curraghpoor, Co. Tipperary", "Teacher:": "\nLiam Ó Duibhir\n"}, {"Collector": "Gus Flanagan", "Gender": "male", "Address": "Drishane, Co. Tipperary"}, {"Informant": "Mrs Margaret Flanagan", "Relation": "parent", "Gender": "female", "Age": "46", "Address": "Drishane, Co. Tipperary"}, {"Language": "English"}]}, "4922261/4865187/5022883": {"title": "Cruatan", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0571, Page 337", "Page 337"], "url": "https://www.duchas.ie/en/cbes/4922261/4865187/5022883", "text": "\nTimcheall chéad blian ó shóin bhí dhá scata fear san áit seo, a bhí síorraidhe ag troid eatorra féin, ar a cuirtear na \"Seanabheists\" agus na \" Carabhats\". Sé an fáth go gcuireadh na h-ainmneacha sin ortha mar go raibh \"baníní\" á gcaitheamh i gcomhnaidhe ag na \"Seanabheista\" agus carabhait ag na \"Carabhts\". Do bhiodh cómhadhla acu ag \"bearna-an-faoin\" tamall beag ón \"bee hive\", acht is ar an droichead i gCaisleán Nua a thoideadar. Do throideadh siad 'na mbeirtibh le bataí móra, ar nós gach troid fadó agus uair amháin do mharbhuig duine des na \"Carabhatas\" ó Cúl na Gréine Pádín Ó Domhnall a bhí 'na \"Seanabhest\".\n", "school_info": "School: An Caisleán Nua (C.), Cluain Meala", "metadata": [{"Location:": "Newcastle, Co. Tipperary", "Teacher:": "\nSiobhán Ní Chochláin\n"}, {"Language": "Irish"}]}, "4922249/4864118/5052150": {"title": "Shaun Lahan", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0565, Page 102", "Page 102"], "url": "https://www.duchas.ie/en/cbes/4922249/4864118/5052150", "text": "\nShawn LeahanLong ago the people of Carrick used hold a fair at Carrick-Beg hill.  A man named Shaun Lahan used attend this fair.  He had a big stick and an old top-coat which he used drag after him.  One day a man was at the fair.  He met Shaun Lahan who had the big stick and the top-coat and Shaun said to the man \"twelve o'clock and not a drop of blood spilled yet.\"  He hit the man and killed him and his sons are living still.Told to me byLaurence Dowley,Carrick-BegCarrick-on-Suir.\n\n\n\nStoryOnce upon a time there was an old Jarvey man going to the races of Thurles.  He met four men carrying a coffin on the road.  They stopped him and put up the coffin and got up themselves.  They kept going on until they came to a cross-roads and told him to stop.  They got to wait until they came back.  They brought the coffin into a graveyard and came back without the coffin.  They got up again and told him to keep driving on.  As he was driving on he looked behind him and to his great surprise he found that the\n(continues on next page)\n", "school_info": "School: Scoil na mBráthar, Carraig na Siúire", "metadata": [{"Location:": "Carrick-on-Suir, Co. Tipperary", "Teacher:": "\nAn Br. Ó Mocháin\n"}, {"Informant": "Laurence Dowley", "Gender": "male", "Address": "Carrickbeg, Co. Tipperary"}, {"Language": "English"}]}, "4922240/4863513/5053819": {"title": "Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0562, Page 204", "Page 204"], "url": "https://www.duchas.ie/en/cbes/4922240/4863513/5053819", "text": "\nThe parish of Ballingarry was long noted for the virulence of its faction fights. The two factions were \"Caravats\" and \"Shanavests\".The \"Caravat\" war cry was \"Stokes, Croke and Corcoran\". These were the leaders of that party. The \"Shanavests\" invariably called their forces together with the cry of \"Pollard, St John and Rochfort\". These were the leading families in the \"Shanavest\" party. It will be noted that only one of them bears an Irish clan name CORCORAN.In Earlshill and  Ballyphilip the leading Shanavests were St Johns and one of these, owing to his great prowess in battle was nicknamed \"Sean a Cogadh\".The \"gooseberry\" fair in Ballingarry on the 23rd of July was always chosen as a day a trial of strength between the two parties. Crowds flocked into the  \"Fair Green\" on that day whose sole business was fighting.There were at this time about two hundred men employed in the mines in Earlshill and all these took a holiday on that day\n(continues on next page)\n", "school_info": "School: Lios na mBroc", "metadata": [{"Location:": "Lisnamrock, Co. Tipperary", "Teacher:": "\nSéamus Ó Cinnéide\n"}, {"Language": "English"}]}, "5054078/4879576/5054443": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0631, Page 078", "Page 078"], "url": "https://www.duchas.ie/en/cbes/5054078/4879576/5054443", "text": "\nThere was once an old woman whose husband died. One day a man came in sympathising with her. He said it was very sad, and she answered him and said \" it was a very great sad\". \" Look at that old hag in the corner,\" meaning her mother. \" She is one hundred years. God is a queer man that wouldn't take her and leave me my poor man but the first thing that runned into His head that is the one He is bound to sweep\".\n\n\n\nLong ago there used to be great faction fights at fairs and meetings. One fair day at Kilkee my great great grand uncle Pat McInerney from Dysart near Kilrush had a big crows to meet a crowd from Kilkee. A cousin of his named Scanlon was with the Kilkee crowd. McInerney and Scanlon met and McInereny won. Scanlon gave a hand and word that he would meet him and he would fight (him)\n(continues on next page)\n", "school_info": "School: Cuar an Chláir (B)", "metadata": [{"Location:": "Cooraclare, Co. Clare", "Teacher:": "\nLiam Ó Lioghda\n"}, {"Informant": "Mrs Mary Gorman", "Gender": "female", "Address": "Brisla East, Co. Clare"}, {"Language": "English"}]}, "4922322/4869937/5054813": {"title": "Folklore - Faction Fighters", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0601, Page 178", "Page 178"], "url": "https://www.duchas.ie/en/cbes/4922322/4869937/5054813", "text": "\nAbout the year 1823 there lived in Shyan a very strong tribe called the O'Gradys. One evening the leader was coming from Kilrush when the Darcys and the Behans of Cooraclare attacked him and put him to flight. Behan was a feather-manager and one day O'Grady caught him and took the bag of feathers off him and beat it against a rock until there were showers of feathers falling through the country. About the year 1880 there lived two tribes called the Hennessys and Reillys. They often fought against each other. One day they fought in Kilmihil and Hennessy cut the\n(continues on next page)\n", "school_info": "School: Liathdruim, Cill Mhichíl", "metadata": [{"Location:": "Leitrim, Co. Clare", "Teacher:": "\nP. Ó Conbhaidhe\n"}, {"Collector": "Michael King", "Gender": "male", "Address": "Sheeaun, Co. Clare"}, {"Informant": "Mr Michael Donlan", "Gender": "male", "Address": "Cahercannavan, Co. Clare"}, {"Language": "English"}]}, "4922333/4870990/5055904": {"title": "The Factory Cross", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0606, Page 015", "Page 015"], "url": "https://www.duchas.ie/en/cbes/4922333/4870990/5055904", "text": "\nThere is a cross about half a mile from the school on the main Ennis Kildysart road. People around call it the \"Factory Cross\", but it should really be \"The Factionary Cross\". Long ago large crowds of people used to gather there and after visiting the local public house, they used assemble at the cross and start to argue and have faction fights.\n\n\n\nIn 1580 the Castle of Cragbrien in the parish belonged to Conor Mac Gillareagh (now Gallery) and the Castle of Ballycorick Béal Átha an Comhraidh (the mouth of the confluence of the waters) belonged to Teige O Brien, son of Conor, first Earl of Thomond and ancestor of the O'Briens of Ballycorick.\n\n\n\nThis church yard is situated a short distance from Ballynacally. It is well preserved.A little way from it, stands the castle\n(continues on next page)\n", "school_info": "School: Lisín, Baile na Caillighe", "metadata": [{"Location:": "Lisheen, Co. Clare", "Teacher:": "\nMáire, Bean Uí Ríordáin\n"}, {"Language": "English"}]}, "4922333/4870990/5055906": {"title": "The Factory Cross", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0606, Page 015", "Page 015"], "url": "https://www.duchas.ie/en/cbes/4922333/4870990/5055906", "text": "\nThere is a cross about half a mile from the school on the main Ennis Kildysart road. People around call it the \"Factory Cross\", but it should really be \"The Factionary Cross\". Long ago large crowds of people used to gather there and after visiting the local public house, they used assemble at the cross and start to argue and have faction fights.\n\n\n\nIn 1580 the Castle of Cragbrien in the parish belonged to Conor Mac Gillareagh (now Gallery) and the Castle of Ballycorick Béal Átha an Comhraidh (the mouth of the confluence of the waters) belonged to Teige O Brien, son of Conor, first Earl of Thomond and ancestor of the O'Briens of Ballycorick.\n\n\n\nThis church yard is situated a short distance from Ballynacally. It is well preserved.A little way from it, stands the castle\n(continues on next page)\n", "school_info": "School: Lisín, Baile na Caillighe", "metadata": [{"Location:": "Lisheen, Co. Clare", "Teacher:": "\nMáire, Bean Uí Ríordáin\n"}, {"Language": "mixed"}]}, "4922334/4871115/5058082": {"title": "Faction Fighting", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0606, Page 176", "Page 176"], "url": "https://www.duchas.ie/en/cbes/4922334/4871115/5058082", "text": "\nAbout forty or fifty years ago it was a usual thing faction fighting to be at fairs. The Lavalla boys and Ballynacally boys used fight together against the Lissycasey lads. They used meet at every fair and used have terrible fights.One day they met at the fair of Ballynacally and they had the greatest fight that was ever seen. They fought with ash plants that they had prepared before hand. They used have them over the smoke for a long time. The Hennessys were the chief men from Lisscasey. They were big, strong, able men. The Conlans and Considines from Lavalla and Mick Toole and Paddy Shalloo from Ballynacally were the best men on the Ballyncally side. The day they fought at the fair of Ballynacally the Lissycasey boys were beaten and bady wounded. Some of the Lissycasey lads were nearly killed from the wounding they had got. Mick Toole from Ballynacally was able for any of the Hennessy's This man still lives in Ballynacally hail and hearty.\n(continues on next page)\n", "school_info": "School: Pitfield, Inis", "metadata": [{"Location:": "Cloondrinagh, Co. Clare", "Teacher:": "\nTomás Ó Maonaigh\n"}, {"Collector": "Patrick Conlan", "Gender": "male", "Address": "Lavally, Co. Clare"}, {"Informant": "James Conlan", "Relation": "parent", "Gender": "male", "Age": "60", "Address": "Lavally, Co. Clare"}, {"Language": "English"}]}, "4922334/4871116/5058084": {"title": "Faction Fighting", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0606, Page 177", "Page 177"], "url": "https://www.duchas.ie/en/cbes/4922334/4871116/5058084", "text": "\n(continued from previous page)\nThe other men are dead in AmericaWhere ever the met they foughtwhether they were drunk or not\n\n\n\nThere was a great rivalry and bad blood between the boys of Leamnaleaha and the boys of Fenagh One night when the Leamnaleaha boys were going to a Kilrush fair they met some of the Fenagh boys at Tullycrine. Then the fight started and while they were fighting the cattle went into a bog. They fought with big sticks and the Fenagh were badly wounded. It was a terrible fight; all their clothes were torn and there was blood running from some of them. Then they started looking for the cattle but they had a great job in getting them.\n", "school_info": "School: Pitfield, Inis", "metadata": [{"Location:": "Cloondrinagh, Co. Clare", "Teacher:": "\nTomás Ó Maonaigh\n"}, {"Collector": "P. Garry"}, {"Informant": "Dan Conlan", "Gender": "male", "Address": "Ballynacally, Co. Clare"}, {"Language": "English"}]}, "4922334/4871117/5058087": {"title": "A Faction Fight", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0606, Page 178", "Page 178"], "url": "https://www.duchas.ie/en/cbes/4922334/4871117/5058087", "text": "\nAbout forty or fifty years ago faction fighting was very common among the people.Patrick Gavin, now living near the church-yard of Kilchreest, Ballynacally, used go to Chamber's house, in the village of Ballynacally, every night.The Ballynacally lads did not want him to be going down there, and they told him they would kill him if he walked the road.So, from that on, he had to cross the fields every night.This night he asked my uncle, Jack Gavin, Thomas Hehir and a few more men to accompany him to Ballynacally.They agreed, and when they reached Ballynacally they walked the street in front of Chamber's house.The Ballynacally lads rushed out, and a great fight followed.The guards were then living in Ballynacally, but they were afraid to come near, as stones were flying in every direction.\n(continues on next page)\n", "school_info": "School: Pitfield, Inis", "metadata": [{"Location:": "Cloondrinagh, Co. Clare", "Teacher:": "\nTomás Ó Maonaigh\n"}, {"Collector": "Kathleen O' Dea", "Gender": "female", "Address": "Lavally, Co. Clare"}, {"Informant": "Pat Gavin", "Relation": "relative (other than parent or grandparent)", "Gender": "male", "Age": "60", "Address": "Lavally, Co. Clare"}, {"Language": "English"}]}, "4922336/4871323/5072721": {"title": "Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0606, Page 446", "Page 446"], "url": "https://www.duchas.ie/en/cbes/4922336/4871323/5072721", "text": "\nSome years ago the Darragh crowd and a man by the name of Seán óg were coming home from Ennis. On their way home the Faction fight began and all the crowd gathered around Seán óg and started beating him with black thorn sticks.After having a good fight Seán óg lay down on the road and pretended to be dead a so the crowd said to each other that \"I suppose he is dead\" and they went away and left him on the road.When Seán óg saw that they were gone out of sight he arose and ran as fast as he could (and he could) and he reached Bansha before them.The following day Seán óg went to the barrack and summoned them. The day the court was on the whole crowd went to Sixmilebridge court and Seán óg met them there. The whole crowd of them started talking and they abused Seán óg over sommoning them and said\n(continues on next page)\n", "school_info": "School: Fergus View, Lissycasey", "metadata": [{"Location:": "Caherea, Co. Clare", "Teacher:": "\nPádraig Mac Gearaidh\n"}, {"Collector": "Catherine Clancy", "Gender": "female", "Age": "15", "Address": "Caherea, Co. Clare"}, {"Informant": "Thomas Clancy", "Relation": "parent", "Gender": "male", "Age": "65", "Occupation": "farmer", "Address": "Caherea, Co. Clare"}, {"Language": "English"}]}, "4723835/4717431/5072794": {"title": "Local Fairs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0940, Page 060", "Page 060"], "url": "https://www.duchas.ie/en/cbes/4723835/4717431/5072794", "text": "\nIn the year 1825, a fight arose at the fair of Shercock between the Catholics and the Protestants. It started in a public house owned by a man called Wimp. The catholics were beating the protestant crowd out of the town when the word went out to the Yoemen of what was taking place. They rode to the town and opened fire on the catholics, and according to tradition many catholics were left dead and dying on the site of the present Protestant church and graveyard. This was afterwards afterwards called by the catholics of the district \"the murdering fair\", and by the protestants it was called \"the fighting fair.\"\n", "school_info": "School: Corracharra", "metadata": [{"Location:": "Corracharra, Co. Monaghan", "Teacher:": "\nBrian Mac Aodha\n"}, {"Collector": "Peig Ní Loingsigh", "Gender": "female", "Address": "Lisnadarragh, Co. Monaghan"}, {"Language": "English"}]}, "4922393/4877473/5076701": {"title": "Fighting", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0624, Page 228", "Page 228"], "url": "https://www.duchas.ie/en/cbes/4922393/4877473/5076701", "text": "\nThe leaders of two factions were Martin Egan and Michael Macnamara met at the station-house in Craggaknock.  MartinEgan gave a blow of a weapon to him in the plot form of Craggknock and left him unconscious.  About seveno clock in the evening this happened and he only lived until morning. Doctor Sexton that was attending him.\n\n\n\nTwo batches of wren boys met at Quilty cross one day.  They had a fight between them.  One of the men got killed by the name of Thady Anglim.  The man that killed him was Shanahan.  That issixty years ago.  His age was forty years.\n", "school_info": "School: Cluain an Droma, Mullach", "metadata": [{"Location:": "Cloonadrum, Co. Clare", "Teacher:": "\nBrian Ó Huiginn\n"}, {"Collector": "Máire Nic Chonsaidín", "Gender": "female", "Address": "Cloghauninchy, Co. Clare"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "male", "Address": "Cloghauninchy, Co. Clare"}, {"Language": "English"}]}, "4922393/4877473/5076702": {"title": "Fighting", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0624, Page 228", "Page 228"], "url": "https://www.duchas.ie/en/cbes/4922393/4877473/5076702", "text": "\nThe leaders of two factions were Martin Egan and Michael Macnamara met at the station-house in Craggaknock.  MartinEgan gave a blow of a weapon to him in the plot form of Craggknock and left him unconscious.  About seveno clock in the evening this happened and he only lived until morning. Doctor Sexton that was attending him.\n\n\n\nTwo batches of wren boys met at Quilty cross one day.  They had a fight between them.  One of the men got killed by the name of Thady Anglim.  The man that killed him was Shanahan.  That issixty years ago.  His age was forty years.\n", "school_info": "School: Cluain an Droma, Mullach", "metadata": [{"Location:": "Cloonadrum, Co. Clare", "Teacher:": "\nBrian Ó Huiginn\n"}, {"Collector": "Máire Ní Chonsaidín", "Gender": "female", "Address": "Cloghauninchy, Co. Clare"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "male"}, {"Language": "English"}]}, "4922344/4872152/5078581": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0608, Page 304", "Page 304"], "url": "https://www.duchas.ie/en/cbes/4922344/4872152/5078581", "text": "\n(continued from previous page)\n304 The Kilmaley people have always a big black stick or log for the fire an Christmas eve\n\n\n\n25     The hurlers of Kilmaley used to wear green caps.Frost's Inch ,Kilmaley was a meeting place .Mary Kelly a local dressmaker used to make the caps.24 The Commane's and Cahills fought over land in Ballymacooda .The last faction fight took place over 30 years ago.25 Ass races at Átha Ghleanna in Connolly about 70 years agoBowling used to be practised along the roads in Kilmaley .The Wood in Knockatonna was a famous meeting place on Sundays.2 Nuair is gainne an biadh seadh is cóir é riar\n", "school_info": "School: Cill Mháille (C.), Inis", "metadata": [{"Location:": "Kilmaley, Co. Clare", "Teacher:": "\nNóra Ní Asaoid\n"}, {"Language": "mixed"}]}, "5044803/5040152/5083557": {"title": "A Party Fight", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0968, Page 453", "Page 453"], "url": "https://www.duchas.ie/en/cbes/5044803/5040152/5083557", "text": "", "school_info": "School: Tiercahan", "metadata": [{"Location:": "Tircahan, Co. Cavan", "Teacher:": "\nP. Ó Riain\n"}]}, "5044804/5040234/5083584": {"title": "Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0969, Page 075", "Page 075"], "url": "https://www.duchas.ie/en/cbes/5044804/5040234/5083584", "text": "\nFaction fights were common in this district. One party was called '' Mollies '' and the other '' Tets ''The fights usually took place on fair days. For some time before sticks were cut-usually ash plants-and the heads were filled with leadThey were called '' loaded butts ''On one occasion the parties challenged each other. They gathered on the 3rd Sunday of July at a place called the Play Banks at the foot of Ben mountain. Both sides were well armed with loaded butts. The fight began at about 5 o ' clock in the evening and lasted for an hour and a half. Some of the men were so badly injured that they never recovered properly.After that fight people never wished to go back to Ben mountain on that particular Sunday which was called Billberry\n(continues on next page)\n", "school_info": "School: Uragh (C.)", "metadata": [{"Location:": "Uragh, Co. Cavan", "Teacher:": "\nE. Mc Caffrey\n"}, {"Informant": "Mrs Bella Mc Hugh", "Gender": "female", "Age": "94", "Address": "Swanlinbar, Co. Cavan"}, {"Language": "English"}]}, "5044841/5043362/5095842": {"title": "Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0978, Page 478", "Page 478"], "url": "https://www.duchas.ie/en/cbes/5044841/5043362/5095842", "text": "\nIn the year 1920 there was a row at a dance in \"Pat Paddys\" of Behey between the Sinn Feins and the Hibernians.  The Sinn Feins put out the  Hibs from the dance, and in October that same year there was a dance in Hylands of Drumnaveigh and the two parties were there and they raised a terrible row.  They fought outside first and they broke up a gate and hit other with bits of it.  There was a potato field beside the house and some of them hid in the furrows and the other parties were crossing over them and they did not know they were hiding there.  Then they went into the house and they hit other with the crooks and sticks and they threw the coals from the fire at each other.    Any of the girls that could got out on the windows.  The crowd ran to the room and fought round a table of delph and broke the most of them.  During the row one man got under a churn , and another was at a pot of rice, while another\n(continues on next page)\n", "school_info": "School: Stravicnabo", "metadata": [{"Location:": "Stravicnabo, Co. Cavan", "Teacher:": "\nMichael Kelly\n"}, {"Collector": "Maeve Fay", "Gender": "female", "Address": "Drumnaveagh, Co. Cavan"}, {"Language": "English"}]}, "5044841/5043365/5095857": {"title": "Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0978, Page 481", "Page 481"], "url": "https://www.duchas.ie/en/cbes/5044841/5043365/5095857", "text": "\n(continued from previous page)\nFor poor big Phil was in his last,Says the grand old dame Brittania.\n\n\n\nIn the year 1920 there was a dance in Hylands and when all the people was in that they had asked there came a crowd of men from below Lavey strand called the Hibernians or the A,O,H men, they crowded into the house and began to call name's to the sinn feins and the two parties fell out and they hit other with sticks and the tongs and crooks and someone hit the lamp and the light went out and the \"Hibs' rushed to the door and went outside then the sinn Feins put all the furniture in the house to the door and when the Hibs saw they could not get in on the door they broke a gate and battered the windows with it and tried to get in but the sinn Feins was every side of the windows\n(continues on next page)\n", "school_info": "School: Stravicnabo", "metadata": [{"Location:": "Stravicnabo, Co. Cavan", "Teacher:": "\nMichael Kelly\n"}, {"Collector": "Brigid Smith", "Gender": "female", "Address": "Stravicnabo, Co. Cavan"}, {"Language": "English"}]}, "5044841/5043366/5095860": {"title": "Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0978, Page 481A", "Page 481A"], "url": "https://www.duchas.ie/en/cbes/5044841/5043366/5095860", "text": "\n(continued from previous page)\nwith crooks, tongs, and sticks and if any of the hibs put in their head they would get it cut they forced the door but could not get in and one of the sinn Feinn men hit a man of the \"hibs\" with a crook on the head and cut it and somebody ran for the priest Fr Tom Brady and when he came in the morning the Sinn Feinn men would not let the priest in and when he heard about the fight he went home.  When the fight began the girls rushed for the door and windows and men hid in under the beds and one man hid in a churn.  The men that was under the bed stole a pot of rice and ate it.  Then there was a song made called \"Hylands dance\".\n\n\n\nThe years after 1916 republickinism  was very low in Lavey.  The Sinn Fein was down the leaders who were not\n(continues on next page)\n", "school_info": "School: Stravicnabo", "metadata": [{"Location:": "Stravicnabo, Co. Cavan", "Teacher:": "\nMichael Kelly\n"}, {"Collector": "John Sheridan", "Gender": "male", "Address": "Moher, Co. Cavan"}, {"Language": "English"}]}, "5070822/5067579/5098612": {"title": "Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1011, Page 264", "Page 264"], "url": "https://www.duchas.ie/en/cbes/5070822/5067579/5098612", "text": "\nSixty or seventy years ago factions fights were very common in this district. The yeomanry who were supposed to keep law and order, were mostly Protestant, and many fights occured between them and their Catholic neighbours. The Ribbonmen and the Fenians also engaged in faction fights. The Ribbonmen used to come from Killenkere district across the hill called \"Pidgeon's Brae\", dressed in knee-britches white shirts and green ties. The Fenians came from the opposite direction, Shercock and Knockbride. They used to meet at the edge of the town and attack one another with stones and ashplants, and people were often seriously wounded. The present genera -\n(continues on next page)\n", "school_info": "School: Bailieboro (C.)", "metadata": [{"Location:": "Bailieborough, Co. Cavan", "Teacher:": "\nBean Uí Cheallaigh\n"}, {"Collector": "Peggy Sheridan", "Gender": "female", "Address": "Corkish, Co. Cavan"}, {"Informant": "Miss B. Farrelly", "Gender": "female", "Address": "Bailieborough, Co. Cavan"}, {"Language": "English"}]}, "4921942/5053565/5111280": {"title": "Historic - Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0482, Page 306", "Page 306"], "url": "https://www.duchas.ie/en/cbes/4921942/5053565/5111280", "text": "\nHistoric.24.  Faction Fights. -  The centres were Shanagolden, Ardagh, Glin and Stonehall.  The families were fireballs, mcMahons, O'Briens, Mulqueens, Leahys, Ryans.  A man called Ryan as killed in Shanagolden.  These parties were called \"Three year olds\" and \"Four year olds\".  Parnell came into public life and the Irish people were organised and discontinued the faction fighting.\n\n\n\nHistoric - Shanagolden.29. Shanagolden. - (Post town of this school) had all its own little industries, spinning and weaving and flax growing. There is still in use in the neighbourhood some linen which was grown and manufactured in Shanagolden. One of the tablecloths won first prize at Limerick show two years ago. Shanagolden was also the home of shoemakers, coopers and Latin masters. Bishop Hanlon R.I.P. was taught Latin by one of its teachers. Young boys with their mothers came as scholars. They lived in the families houses , some of them remained and married into the families with whom they resided.Goat's St. - A group of about a dozen houses was the home of the labourers of this place. The remains of the little cabins may be seen West of Tubrid house and at the entrance to Mullagh House - formerly an R.I.C. barracks. The women were industrious and devoted their time to weaving and spinning, and lived comfortably. A story is told that an orphan boy was once seen to have played pitch and toss with with sovereigns found in the cabin walls.\n", "school_info": "School: Nutgrove", "metadata": [{"Location:": "Mullagh, Co. Limerick", "Teacher:": "\nEmily Ní Aonghusa\n"}, {"Language": "English"}]}, "4921942/5053565/5111284": {"title": "Historic - Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0482, Page 306", "Page 306"], "url": "https://www.duchas.ie/en/cbes/4921942/5053565/5111284", "text": "\nHistoric.24.  Faction Fights. -  The centres were Shanagolden, Ardagh, Glin and Stonehall.  The families were fireballs, mcMahons, O'Briens, Mulqueens, Leahys, Ryans.  A man called Ryan as killed in Shanagolden.  These parties were called \"Three year olds\" and \"Four year olds\".  Parnell came into public life and the Irish people were organised and discontinued the faction fighting.\n\n\n\nHistoric - Shanagolden.29. Shanagolden. - (Post town of this school) had all its own little industries, spinning and weaving and flax growing. There is still in use in the neighbourhood some linen which was grown and manufactured in Shanagolden. One of the tablecloths won first prize at Limerick show two years ago. Shanagolden was also the home of shoemakers, coopers and Latin masters. Bishop Hanlon R.I.P. was taught Latin by one of its teachers. Young boys with their mothers came as scholars. They lived in the families houses , some of them remained and married into the families with whom they resided.Goat's St. - A group of about a dozen houses was the home of the labourers of this place. The remains of the little cabins may be seen West of Tubrid house and at the entrance to Mullagh House - formerly an R.I.C. barracks. The women were industrious and devoted their time to weaving and spinning, and lived comfortably. A story is told that an orphan boy was once seen to have played pitch and toss with with sovereigns found in the cabin walls.\n", "school_info": "School: Nutgrove", "metadata": [{"Location:": "Mullagh, Co. Limerick", "Teacher:": "\nEmily Ní Aonghusa\n"}, {"Language": "English"}]}, "4921942/5053674/5112693": {"title": "The Landlord", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0482, Page 414", "Page 414"], "url": "https://www.duchas.ie/en/cbes/4921942/5053674/5112693", "text": "\n(continued from previous page)\nSchool. He also gave evidence in the House of Commons, Devon Commission and in short time most all families were reinstated.\n\n\n\nThe emergency men of this locality were always quarrelling and on one occasion a Mr. Prenderville fought with my grand uncle Tom Casey. The results was the emergency man brought Casey to count. Mrs Walsh of Andlamin, Newbridge was principal witness. She got a cross examination and she got vexed with the judge. He asked her, \"What day did the fight commence.\" She said \"It was on a holiday in May and make whatever day you like out of it.\" The townland of Cooltomein and Newbridge were very upset with the emergency men. There was a police Carrack in Scant, Newbridge, Rathkeale, and about ten emergency men were going from Cooltomin, Shanagolden to Newbridge every day and the people were persecuted from them. The people were trying to make peace between the emergency men the names of the principal emergency men were Mr. Rocke and Mr. Darsy.\n", "school_info": "School: Nutgrove", "metadata": [{"Location:": "Mullagh, Co. Limerick", "Teacher:": "\nEmily Ní Aonghusa\n"}, {"Collector": "Bridie Casey", "Gender": "female", "Address": "Ballyane, Co. Limerick"}, {"Informant": "Mr John Casey", "Gender": "male", "Address": "Ballyane, Co. Limerick"}, {"Language": "English"}]}, "5009220/4999110/5122855": {"title": "Tintern Parish - St Martin's - Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0871, Page 004", "Page 004"], "url": "https://www.duchas.ie/en/cbes/5009220/4999110/5122855", "text": "\nThe Fair of Nash was renouned for faction fights.  Nash is a townsland six miles N. from St Leonards.  The 'Fair' has been discontinued. Why?After the opening of the Railroad between Wexford and Waterford (Southern line) Ballycullane having a station on the line was considered a more suitable place for a fair.  Meetings were held to forward the project and after much \"Red-Tape\" about 'Charters' etc, the powers-that-be allowed Ballycullane the 'Fair' on the surrender of the Charters for Nash and Tintern fairs that is to say two old fairs in the Parish viz. Nash fair and Tintern fair were superseded by the monthly fair of Ballycullane now.Great opposition to the project was put up by the village of Saltmills and the Hook parish in general, as Tintern fair was much more convenient for them.Roches and Mc Gunnips were the greatest faction fighters of Nash fair.\n", "school_info": "School: San Leonard, Ballycullane", "metadata": [{"Location:": "Saintleonards, Co. Wexford", "Teacher:": "\nMary B. Dunphy\n"}, {"Collector": "Mary B. Dunphy", "Gender": "female", "Occupation": "teacher"}, {"Language": "English"}]}, "5009111/4987870/5130345": {"title": "Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0743, Page 296", "Page 296"], "url": "https://www.duchas.ie/en/cbes/5009111/4987870/5130345", "text": "\nAbout seventy two years ago a man named Fox was in the October fair of Ballymore and he had a good blackthorn stick. He had a couple of cattle and he was selling them to a man from Ballymore. He was asking a good stiff price for them. It was getting late and Fox was just thinking about going home when he got a belt of a stick. He turned around and he hit another man and it was not that man that hit Fox with the belt that Fox gave him [?] disabled him and he had to be carried home and he never left his bed till his death about twenty years. His name was Joseph MacLoughlin from Killenboy.The people were preparing the plants on the day before the fair.\n", "school_info": "School: Ballymore (B.)", "metadata": [{"Location:": "Ballymore, Co. Westmeath", "Teacher:": "\nP.J. Cooney\n"}, {"Collector": "Thomas Grant", "Gender": "male", "Age": "14", "Address": "Shinglis, Co. Westmeath"}, {"Informant": "Thomas Noonan", "Gender": "male", "Address": "Duneel, Co. Westmeath"}, {"Language": "English"}]}, "5009288/5004750/5133099": {"title": "Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0888, Page 175", "Page 175"], "url": "https://www.duchas.ie/en/cbes/5009288/5004750/5133099", "text": "\nFaction FightsFaction fights between the townlands of Toberlownagh and Toberpatrick were in existence up to about seventy years ago.  It was the custom to put steel spikes like spurs on the toes of the boots before a faction fight.  The greatest fair of the year is for this district, that, held in Tinahely on the 8th of May.  The men of Toberpatrick and the men of Toberlownagh always fought at this fair with black thorn sticks, the spikes of which were well sharpened before hand.  Over a hundred years ago a Breen of Toberlownagh was killed at one of these faction fights and his body thrown over a ditch.  A Quayle of Toberpatrick  was supposed to have struck the fatal blow and he was pursued by the Toberlownagh men to the farmhouse at Curragh lawn where he was employed.  They set upon him in the yard and killed him with a churn dash.\n", "school_info": "School: Hollyfort", "metadata": [{"Location:": "Hollyfort, Co. Wexford", "Teacher:": "\nMabel Vaughan\n"}, {"Informant": "Mr Griffen", "Gender": "male", "Age": "83", "Address": "Tinahely, Co. Wicklow"}, {"Language": "English"}, {"Location": "Tinahely"}]}, "5009338/5008460/5134907": {"title": "The Fair of Moneyhore", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0901, Page 243", "Page 243"], "url": "https://www.duchas.ie/en/cbes/5009338/5008460/5134907", "text": "\nAbout two hundred years ago a fair was held each month in the townland of Moneyhore  Enniscorthy.Tere was a Public house in Moneyhore owned by Cloneys.The fair began at seven o' clock im the morning and lasted until dinner time.  After twelve o'clock  all the men would fight with sticks and drink in the public house.  The drinking and the fighting would last all night.  The children would put stones in their stockings and fight.One day a big man was going up where the pigs were selling.Seeing no fight he broke a shaft out of a car and began to fight.There was a mule who began kicking.  He let go the shaft and began kicking the mule and beat him.\n", "school_info": "School: Courtnacuddy", "metadata": [{"Location:": "Courtnacuddy, Co. Wexford", "Teacher:": "\nname not given\n"}, {"Collector": "Tom Bowe", "Gender": "male", "Age": "13", "Address": "Dranagh, Co. Wexford"}, {"Language": "English"}]}, "5009339/5008489/5135087": {"title": "An Oven of the Famine", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0901, Page 272", "Page 272"], "url": "https://www.duchas.ie/en/cbes/5009339/5008489/5135087", "text": "\nThere is a Finnian oven in our haggard. It is like the bottom of a lime kiln, lined inside with very big stones with little wee stones in between them. It is very wide & the stones appear to be black. It is about 4ft deep & 2 1/2 ft wide at the top. It gets narrow at the bottom. Eilis Leacy (12) Ballyelland told by her father that it is a Finnian oven. In Stafford's field (Ballyelland) there is an old rath. The round is there still & remains of a ditch inside. A light is supposed to be seen there very often after midnight.\n\n\n\nPat Hennessy (22) Davidstown told him by his father Michael Hennessey (50) Davidstown - told him by Nicholas Keating Ballinavarrey died 1918 aged 100.Faction fighting & Matchmaking took place at the fair of Moneyhore. Faction fights were between the people of one district & those of another between one parish & another & those of one barony and another. Fights were furious & often fatal.Champion faction fighters of this locality were:- Paddy Kearns, a faggot cutter and William Staunton - ex Crimean veteran, Boolabawn. The latter's niece Mrs Mary Breen, Boolabawn now resides in his house. Armed with blackthorn sticks they used to challenge two of the best men from the Duffrey, who boasted that \"a Duffry man would eat more bread and drink more beer than ten from Bantry or Shelmalier\". In every fight of the 2nd & 3rd decades of the 19th century, these men were the victors.\n", "school_info": "School: Davidstown", "metadata": [{"Location:": "Davidstown, Co. Wexford", "Teacher:": "\nMarion G. Brennan\n"}, {"Collector": "Eilís Leacy", "Gender": "female", "Age": "12", "Address": "Ballyeland, Co. Wexford"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "male", "Address": "Ballyeland, Co. Wexford"}, {"Language": "English"}]}, "5009339/5008489/5135093": {"title": "An Oven of the Famine", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0901, Page 272", "Page 272"], "url": "https://www.duchas.ie/en/cbes/5009339/5008489/5135093", "text": "\nThere is a Finnian oven in our haggard. It is like the bottom of a lime kiln, lined inside with very big stones with little wee stones in between them. It is very wide & the stones appear to be black. It is about 4ft deep & 2 1/2 ft wide at the top. It gets narrow at the bottom. Eilis Leacy (12) Ballyelland told by her father that it is a Finnian oven. In Stafford's field (Ballyelland) there is an old rath. The round is there still & remains of a ditch inside. A light is supposed to be seen there very often after midnight.\n\n\n\nPat Hennessy (22) Davidstown told him by his father Michael Hennessey (50) Davidstown - told him by Nicholas Keating Ballinavarrey died 1918 aged 100.Faction fighting & Matchmaking took place at the fair of Moneyhore. Faction fights were between the people of one district & those of another between one parish & another & those of one barony and another. Fights were furious & often fatal.Champion faction fighters of this locality were:- Paddy Kearns, a faggot cutter and William Staunton - ex Crimean veteran, Boolabawn. The latter's niece Mrs Mary Breen, Boolabawn now resides in his house. Armed with blackthorn sticks they used to challenge two of the best men from the Duffrey, who boasted that \"a Duffry man would eat more bread and drink more beer than ten from Bantry or Shelmalier\". In every fight of the 2nd & 3rd decades of the 19th century, these men were the victors.\n", "school_info": "School: Davidstown", "metadata": [{"Location:": "Davidstown, Co. Wexford", "Teacher:": "\nMarion G. Brennan\n"}, {"Informant": "Pat Hennessey", "Gender": "male", "Age": "22", "Address": "Davidstown, Co. Wexford"}, {"Language": "English"}]}, "5044726/5034759/5136667": {"title": "Historic - Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0917, Page 257", "Page 257"], "url": "https://www.duchas.ie/en/cbes/5044726/5034759/5136667", "text": "\nFaction fights took place in this district about fifty years ago.  One team fought another, they fought with blackthorn sticks, which used be left \"seasoning\" for a month be-fore each fight.  Mr John Burke of Knockraheen claims that he killed a tramp at Fiddler's Hotel now known as Ballinastow Cross roads which was a well known meeting place.  Patterns were also held in Glendalough, and at these patterns the wrestling matches used to take place.Up to 80 years ago a Pattern used to be held in Glendalough on the feast of St Kevin.People from different counties assembled there, it always wound up with Faction Fights\n", "school_info": "School: Annacarter", "metadata": [{"Location:": "Mullinaveige, Co. Wicklow", "Teacher:": "\nMary C. Mulligan\n"}, {"Language": "English"}]}, "5044613/5025804/5140502": {"title": "Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0810, Page 200", "Page 200"], "url": "https://www.duchas.ie/en/cbes/5044613/5025804/5140502", "text": "\nFaction fights were very common in the parish of Ballinahown. The Roughans of Ballinahown fought the men of Clonfinlough on one side and the men of Canlry on the other. The Races of Garrycastle, near Athlone was a favourite meeting place for rival factions. The men were all armed with black thorn sticks. Sometimes the thick ends were loaded with lead to make them heavier. The leaders on both sides collected their men and they fought until separated by police. At the last race meeting the rival parties were handcuffed together on the middle of the field. The parish priest of Moate dashed through the thick of the fight on his horse, slashing with his horse whip on all sides to try to separate the fighters.At the Fighting Hill in the parish of Shannonbridge, about a mile from Clonmacnoise the factions used to meet. It is said that a funeral procession often stopped, laid down the corpse and fought their rivals there.Faction fighting is dead out in this district for the last forty years.\n", "school_info": "School: Rashina, Athlone", "metadata": [{"Location:": "Rashinagh, Co. Offaly", "Teacher:": "\nS. Ó Cinnéide\n"}, {"Informant": "Mrs Maria Kennedy", "Gender": "female", "Address": "Cloncraff or Bloomhill, Co. Offaly"}, {"Language": "English"}]}, "5009314/5006651/5140577": {"title": "Local Fairs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0895, Page 229", "Page 229"], "url": "https://www.duchas.ie/en/cbes/5009314/5006651/5140577", "text": "\n(continued from previous page)\n229comes and makes the bargain. Then the buyer strikes the sellers hands to show their agreement, and then marks the animals with raddle.Sonny PierceBallyroebuck.Information about Clohamon fair recd from fatherMr. Wm Pierce,  Ballyroebuck.\n\n\n\nFaction fights occurred freely after Clohamon fair.  The different parties provided themselves with blackthorn sticks previous to the fair.  It is said it would not be Clohamon fair if it did not end with a fight.Told by John Kidd who heard same from his father the late Mr. KiddBallyrankinStrahart Ferns\n", "school_info": "School: Kilrush", "metadata": [{"Location:": "Ballynaberney, Co. Wexford", "Teacher:": "\nC. E. Kidd\n"}, {"Informant": "John Kidd", "Gender": "male", "Age": "33", "Occupation": "farmer", "Address": "Ballyrankin, Co. Wexford"}, {"Language": "English"}]}, "5044660/5029617/5141440": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0903, Page 055", "Page 055"], "url": "https://www.duchas.ie/en/cbes/5044660/5029617/5141440", "text": "\nIn the year 1888 there was a cock fight in Ballincoola about three miles from where I live. It was a challenge fight between New Ross and Graiguenamanagh There were game cocks and each cock was fitted with steel spurs. The fight lasted for about two hours, and when the cocks were not able to kill each other, it turned into a faction fight, with about three hundred men from each town, fighting with ash plants. The fight lasted for hours, and even at the present day, if a man from one town met a man from his rival town, and if one of them only put up his finger at the other, it would mean a row. On the pattern of St Mullins there is always a row between New Ross and Graiguenamanagh.\n", "school_info": "School: An Gleann, Graiguenamanagh", "metadata": [{"Location:": "Glynn, Co. Carlow", "Teacher:": "\nP. Ó Flaithbheartaigh\n"}, {"Collector": "Katty Dalton", "Gender": "female", "Age": "13", "Occupation": "miller", "Address": "St. Mullin's, Co. Carlow"}, {"Informant": "Terence Dalton", "Gender": "male", "Age": "19", "Address": "St. Mullin's, Co. Carlow"}, {"Language": "English"}]}, "5044739/5035629/5141721": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0920, Page 331", "Page 331"], "url": "https://www.duchas.ie/en/cbes/5044739/5035629/5141721", "text": "\n(continued from previous page)\n24. It is strange that the potion of this parish outside the school area is rich in accounts of faction fights whereas the contrary is the case here. The mountain sheep men - chiefly Byrnes - from Augharanagh were noted within a wide radius on fair days for their fighting propensities. There were continuous fights at fairs but they were really more drunken brawls with anyone + everyone rather than conflicts between factions or groups. There is a tradition though vague that the men from Kyle attacked the Augharanaghs in Augharanac + that the latter succeeded in killing all the fighters from Kyle to a man. There is also another vague but rather common tradition in the area regarding a rath in Carrigacroe out of which ferrets carried what were said to be human bones. The origin of the bones was explained by an alleged battle between the Wexford men + a local clan at that spot.\n(continues on next page)\n\n\n\nIts unlucky not to wash the vessels before you go to bedFind horse shoe with nail in it + you'll get money.\n", "school_info": "School: Rathmeage, Hackettstown", "metadata": [{"Location:": "Rathmeague, Co. Wicklow", "Teacher:": "\nPádraig Ó Tuathail\n"}, {"Language": "English"}]}, "5044674/5031012/5144544": {"title": "Blessed Wells", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0906, Page 042", "Page 042"], "url": "https://www.duchas.ie/en/cbes/5044674/5031012/5144544", "text": "\n(continued from previous page)\nMr Vigors, Bungage, Leighlinbridge but it has no such fame as St. Lazerian's well though formerly old people regarded it as blessed but the nearness of the fairies in Dinn Righ discounted all claims to holiness possessed by the well.\n\n\n\nIs a granite stone about 2 1/2 ft square sloping inwards and  having a square hole on top. This is on the main Carlow - Kilkenny road 1/4 mile from Leighlin. It really makes one corner of a triangular territory, which in older times could elect a member for Parliament. The other stone is at Wells near Royal Oak and the third in the hills beyond Old Leighlin. Written in Latin on the stone are the words \"Burgens Leighlinensis hic lapis est\" It got the name wart stone because it used contain in the hole at the top a green slimy water said by old people to be capable of curing warts.\n\n\n\nUntil a few years prior to the Great War faction fights were prevalent in Co. Carlow. The fair of Leighlin held on may 14th each year was regarded as pattern & fair combined and extra forces\n(continues on next page)\n", "school_info": "School: Ballinkillen, Muine Beag", "metadata": [{"Location:": "Ballinkillin, Co. Carlow", "Teacher:": "\nSeán Mac Domhnaill\n"}, {"Language": "English"}]}, "5044674/5031012/5144545": {"title": "Blessed Wells", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0906, Page 042", "Page 042"], "url": "https://www.duchas.ie/en/cbes/5044674/5031012/5144545", "text": "\n(continued from previous page)\nMr Vigors, Bungage, Leighlinbridge but it has no such fame as St. Lazerian's well though formerly old people regarded it as blessed but the nearness of the fairies in Dinn Righ discounted all claims to holiness possessed by the well.\n\n\n\nIs a granite stone about 2 1/2 ft square sloping inwards and  having a square hole on top. This is on the main Carlow - Kilkenny road 1/4 mile from Leighlin. It really makes one corner of a triangular territory, which in older times could elect a member for Parliament. The other stone is at Wells near Royal Oak and the third in the hills beyond Old Leighlin. Written in Latin on the stone are the words \"Burgens Leighlinensis hic lapis est\" It got the name wart stone because it used contain in the hole at the top a green slimy water said by old people to be capable of curing warts.\n\n\n\nUntil a few years prior to the Great War faction fights were prevalent in Co. Carlow. The fair of Leighlin held on may 14th each year was regarded as pattern & fair combined and extra forces\n(continues on next page)\n", "school_info": "School: Ballinkillen, Muine Beag", "metadata": [{"Location:": "Ballinkillin, Co. Carlow", "Teacher:": "\nSeán Mac Domhnaill\n"}, {"Informant": "John Redmond", "Gender": "male"}, {"Informant": "Mr Burke", "Gender": "male"}, {"Language": "English"}]}, "5044674/5031015/5144548": {"title": "Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0906, Page 045", "Page 045"], "url": "https://www.duchas.ie/en/cbes/5044674/5031015/5144548", "text": "\n(continued from previous page)\nmiles and at a cross roads had their second battle. The third fight took place at the village of Ballymurphy in Sth Co. Carlow and the fourth and last after the burial at Glynn.  This was the dead fighter honoured.\n\n\n\nFr Maher was P.P. of Glynn for 21 years from 1837 to '58.  Two of the faction groups in the locality had arranged to have a fight on the Sunday after Fr Maher's Mass.  The men came and brought their sticks but were at a loss to know how to conceal them till after Mass.  They eventually concealed the sticks in the legs of their trousers but found when in Church this prevented them from kneeling.  This fact was noted by many of the congregation and also by the sexton.When Mass was over the fighters awaited outside to allow the priest to depart for his home as it was rightly surmised he would pt a stop to this gory affair.  The sexton told Fr Maher in the vestry about the proposed fight and Fr Maher went into the Church again and prayer, then he went back to the sacristy and partook of his breakfast.  Shortly after a terrible rain and hailstorm broke over the district, so that\n(continues on next page)\n", "school_info": "School: Ballinkillen, Muine Beag", "metadata": [{"Location:": "Ballinkillin, Co. Carlow", "Teacher:": "\nSeán Mac Domhnaill\n"}, {"Informant": "John Redmond", "Gender": "male"}, {"Language": "English"}]}, "5044674/5031016/5144549": {"title": "Fr Maher of Glynn", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0906, Page 046", "Page 046"], "url": "https://www.duchas.ie/en/cbes/5044674/5031016/5144549", "text": "\n(continued from previous page)\nthe fight had to be abandoned.  The people attributed the hailstorm to the prayers of Fr Maher.\n\n\n\npeople even in this year 1938 will not touch a rath on their land. sheep may graze on it but no plough may touch it.The old tradition of bad luck following those who disturb the homes of the` good people`endures even to those enlightened  ones who scoff at fairies.John redmond told me a few interesting  stories about raths in the vicinity of the school. One is called ballinkillen rath.  In 98 two brothers named Pat and John Murphy lived near Kilkenny hill.  Pat said he would dig the rath in front of Redmond's house in ballinkillen.Immediately he stuck his spade into the soil of his rath  he became lame and had to stop working.His lameness remained with him whenever he was on irish soil but when he went abroad (as he did sometimes to study astronomy)his lameness departed, but returned again when he again put foot in his native land.\n", "school_info": "School: Ballinkillen, Muine Beag", "metadata": [{"Location:": "Ballinkillin, Co. Carlow", "Teacher:": "\nSeán Mac Domhnaill\n"}, {"Informant": "John Redmond", "Gender": "male"}, {"Language": "English"}]}, "5044663/5030055/5144705": {"title": "Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0903, Page 671", "Page 671"], "url": "https://www.duchas.ie/en/cbes/5044663/5030055/5144705", "text": "\nFaction fightsLong ago there was a faction fight between Newtown and Bahana at Graiguenamanagh. The men of Newtown were in the town of Graigue and the others were on the bridge and would not let the Newtown men out.After a while a man named John Murray of Newtown came out and they all came after him and followed the others to the crossroads in Bahana and beat them there.There was a fight in Ballyglisheen between two families O'Byrnes and Murphys. The place where they fought is still called the Bull Ring. There was a man named Jim Cummins and he was killed there. The families of Murphys beat the Byrnes. The fighting was discontinued about ninety or one hundred years ago.\n\n\n\nWhen a person dies they are laid out on a table or a bed.  They are waking two days and two nights.  Long ago two men and two wemon went to every wake\n(continues on next page)\n", "school_info": "School: Inch, Borris", "metadata": [{"Location:": "Clanagh, Co. Carlow", "Teacher:": "\nMichael J. O'Donoghue\n"}, {"Collector": "Brigid Foley", "Gender": "female", "Address": "Gowlin, Co. Carlow"}, {"Informant": "Owen Foley", "Gender": "male", "Address": "Gowlin, Co. Carlow"}, {"Language": "English"}]}, "4921670/4888845/5151121": {"title": "Old Fairs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0319, Page 031", "Page 031"], "url": "https://www.duchas.ie/en/cbes/4921670/4888845/5151121", "text": "\nPatricks day, March 28th.John's day, July 5th. or 6th.Laurence's day, August 21st.Catherine's day, December 5th or 6th.There were two public houses in Spittle, and after the fair, 'twas at Spittle the Barryroe people used end their faction fighting. There was no public house closing then, and Fr. Ned used come down with a big stick - a faich of a spade - to send the people home. One time he was sending a crowd home - they were down by the Bandon bridge and one of the Reens over was in the crowd. Don't know whether Fr. Ned hit Reen, but the latter had some spite to him as he was put off the church gate for not paying\n(continues on next page)\n", "school_info": "School: Tigh Molaga (C.)", "metadata": [{"Location:": "Timoleague, Co. Cork", "Teacher:": "\nMáire, Bean Uí Shithigh\n"}, {"Language": "mixed"}]}, "4798785/4798350/5151382": {"title": "In Penal Times", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0307, Page 089", "Page 089"], "url": "https://www.duchas.ie/en/cbes/4798785/4798350/5151382", "text": "\nThe period between 1695 and 1829 is especially known ad the \"Penal days\" when Catholics suffered horrible persecution. They were not allowed to practice their religion or to educate teir children. The Catholics should receive the Sacrament according to Protestant rite. During this period smuggling went on everywhere. There were many priests killed during this time. There were two priests killed during this time. There were two priests killed in the townland of Knoc. They were buried in Kilgarriff and the grave is still open. It is said that the grave was closed, but it used be opened always the following morning. In most places there are markes on stones and rocks and it is supposed that mass was said in those places. While the priest was saying Mass there used to be people watching for fear the priest and congregation would be attacked.\n", "school_info": "School: Ros Mór, Béal Átha Fhinghín", "metadata": [{"Location:": "Rossmore, Co. Cork", "Teacher:": "\nMichéal Ó Corcora\n"}, {"Collector": "Michael Donovan", "Gender": "male", "Address": "Derryvreen, Co. Cork"}, {"Language": "English"}]}, "4811628/4803859/5152083": {"title": "Cruatan", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0283, Page 349", "Page 349"], "url": "https://www.duchas.ie/en/cbes/4811628/4803859/5152083", "text": "\nJust about 80 years ago a dwelling house owned by Jack O Leary Coosane was completely burned. Flax  was left over the fire by night. The Flax 'caught fire' and got on to the thatch. The occupants barely escaped. They saved some clothes and money. The rest of their belongings was burned. The mother, Husb and two young children rushed out naked and watched the fire do its work. Three horses in the stable were burned alive. All their neighbours helped to build  a new house for them. They got no compensation etc for the damage\n\n\n\nSuas le dathad blian o thoin bhí faction fight ar Cnocan na bPíopaí (no of pipes left there after fight) Tá an áit seo suidhte timceall 2 mhíle ar an dtaobh theas do Inchageelah agus 3 míle ar an dtaobh thoir de Sliabh Seithe (place is 8 miles east of this school) Do bhí Dúarmuid O Laoghaire ó Gleann Uí Cearney (Local) agus a dhaoine muintearda ag troid i gcoinnibh na Farrels ó Tulac (Local place)Bhí 20 Farrels agus 16 de Muinntear Laoghaire\n(continues on next page)\n", "school_info": "School: Macha na gClaidhe", "metadata": [{"Location:": "Maughanaclea, Co. Cork", "Teacher:": "\nCathal Ó Macháin\n"}, {"Informant": "Denis O' Leary", "Gender": "male", "Age": "56", "Address": "Cousane, Co. Cork"}, {"Language": "English"}]}, "4921646/4887518/5152933": {"title": "A Haunted House", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0314, Page 012", "Page 012"], "url": "https://www.duchas.ie/en/cbes/4921646/4887518/5152933", "text": "\n(continued from previous page)\naway from you. You do as you ^ bid but immediately on unnatural shriek rens the air and your cap or coat is blown back to you. You look awe-struck at your guide and he beckons you to follow him on your outward journey.\n\n\n\nIn olden times faction fights were a common sight. At Coachford some seventy years ago faction fights between the rival families of the Healys and the Murphys were frequent. Usually these fights took place on Sunday immediately after 12 oclock Mass. Friends as well as relatives of these two families participated in the fight. The only weapons used were bottles and ash plants. One of these fights was in progress on a particular occasion when a well-known gentleman resident of the district who was watching it from a safe distance decided to stop it. Mr Hayes, the gentleman, mounted a big black horse and with a tarred cabbage stump in his hand rode through the ranks of both duellists pointing the\n(continues on next page)\n", "school_info": "School: Pádraig Naofa, Droichead Banndan", "metadata": [{"Location:": "Bandon, Co. Cork", "Teacher:": "\nPádraig Ó Faoláin\n"}, {"Collector": "Jeremiah Reardon", "Gender": "male", "Age": "16", "Address": "Bandon, Co. Cork"}, {"Language": "English"}]}, "4921697/4890924/5153050": {"title": "Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0326, Page 023", "Page 023"], "url": "https://www.duchas.ie/en/cbes/4921697/4890924/5153050", "text": "\nThe only faction fights remembered here are the great fights between the Lynches and Twomeys in Ballyvourney.  All their relatives, friends, and partisans took part, especially on Whitsunday, a pattern day in Ballyvourney village (Ballymakeery) in honour of Gobnait Naomhtha, whose church, holy well and grave are at Gortnatubrid, a mile or so to the west.  The fighting ceased sixty years ago\n\n\n\n26.There are several families of Kellehers.  Kelleher Cnoc; Kelleher Buidhe; Kelleher Sceach; Kelleher Darby; Kelleher Pad Jacks; Kelleher Joany; Twohigs Johnny, (these latter are Twohigs.) Not far away are Murphy Stuaic, Murphy Black, Murphy Deirbh. There are also Kellehers called Conablach: Hand-basket; Pid; Cúl Bán; and Bagún  There are Dan Den Thaidhg, Jerry Joany, Dan Johnny, Den Johnny, Pats Pad Jack, Dan Buidhe, etc. In Carriganima Church once of the stained-glass windows was inserted (paid for) by \"Jeremiah Kelleher (Cnoc)\" as the inscription on it shows. Kelleher is the most common surname in the parish of Clondrohid.\n", "school_info": "School: Scoil na Móna Fliche (Moanflugh)", "metadata": [{"Location:": "Moanflugh, Co. Cork", "Teacher:": "\nDiarmuid Ó Deasmhumhnaigh\n"}, {"Language": "English"}]}, "4921697/4890924/5153052": {"title": "Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0326, Page 023", "Page 023"], "url": "https://www.duchas.ie/en/cbes/4921697/4890924/5153052", "text": "\nThe only faction fights remembered here are the great fights between the Lynches and Twomeys in Ballyvourney.  All their relatives, friends, and partisans took part, especially on Whitsunday, a pattern day in Ballyvourney village (Ballymakeery) in honour of Gobnait Naomhtha, whose church, holy well and grave are at Gortnatubrid, a mile or so to the west.  The fighting ceased sixty years ago\n\n\n\n26.There are several families of Kellehers.  Kelleher Cnoc; Kelleher Buidhe; Kelleher Sceach; Kelleher Darby; Kelleher Pad Jacks; Kelleher Joany; Twohigs Johnny, (these latter are Twohigs.) Not far away are Murphy Stuaic, Murphy Black, Murphy Deirbh. There are also Kellehers called Conablach: Hand-basket; Pid; Cúl Bán; and Bagún  There are Dan Den Thaidhg, Jerry Joany, Dan Johnny, Den Johnny, Pats Pad Jack, Dan Buidhe, etc. In Carriganima Church once of the stained-glass windows was inserted (paid for) by \"Jeremiah Kelleher (Cnoc)\" as the inscription on it shows. Kelleher is the most common surname in the parish of Clondrohid.\n", "school_info": "School: Scoil na Móna Fliche (Moanflugh)", "metadata": [{"Location:": "Moanflugh, Co. Cork", "Teacher:": "\nDiarmuid Ó Deasmhumhnaigh\n"}, {"Language": "English"}]}, "4921624/4885982/5163496": {"title": "Faction Fighting", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0309, Page 115", "Page 115"], "url": "https://www.duchas.ie/en/cbes/4921624/4885982/5163496", "text": "", "school_info": "School: Cnoc Sceach, An Léim", "metadata": [{"Location:": "Knockskagh, Co. Cork", "Teacher:": "\nSs. Mac Carrthaigh\n"}, {"Language": "English"}]}, "4921631/4886487/5164139": {"title": "Faction Fighting", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0311, Page 071", "Page 071"], "url": "https://www.duchas.ie/en/cbes/4921631/4886487/5164139", "text": "", "school_info": "School: Béal Átha Fhinghín (B.)", "metadata": [{"Location:": "Ballineen, Co. Cork", "Teacher:": "\nBeircheart Seártan\n"}, {"Language": "mixed"}]}, "4798767/4796633/5164305": {"title": "Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0299, Page 435", "Page 435"], "url": "https://www.duchas.ie/en/cbes/4798767/4796633/5164305", "text": "", "school_info": "School: Doire Clathach", "metadata": [{"Location:": "Derryclogh Upper, Co. Cork", "Teacher:": "\nÉamonn Mac Firbisigh\n"}, {"Informant": "Jeremiah W. O' Driscoll", "Gender": "male", "Address": "Drimoleague, Co. Cork"}, {"Language": "English"}]}, "5162170/5160583/5164596": {"title": "More Traditions - Tea", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0947, Page 027", "Page 027"], "url": "https://www.duchas.ie/en/cbes/5162170/5160583/5164596", "text": "\nOn this night the people left their houses because    they were afraid that their dwellings would be blown down. They went into the hedges and ditches and held on by the bushes. When wind had died down the farmers crops were all mixed and then trouble began when farmers started picking out their own hay and corn. It often resulted in rows and quarrels.\n", "school_info": "School: Killyfargy", "metadata": [{"Location:": "Killyfargy, Co. Monaghan", "Teacher:": "\nB. Ó Mórdha\n"}, {"Collector": "Michael Moore", "Gender": "male"}, {"Informant": "Owen Smith", "Gender": "male", "Age": "82", "Address": "Corrinary, Co. Monaghan"}, {"Informant": "Mrs Smith", "Gender": "female", "Address": "Corrinary, Co. Monaghan"}, {"Language": "English"}]}, "5162170/5160583/5164597": {"title": "More Traditions - Tea", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0947, Page 027", "Page 027"], "url": "https://www.duchas.ie/en/cbes/5162170/5160583/5164597", "text": "\nOn this night the people left their houses because    they were afraid that their dwellings would be blown down. They went into the hedges and ditches and held on by the bushes. When wind had died down the farmers crops were all mixed and then trouble began when farmers started picking out their own hay and corn. It often resulted in rows and quarrels.\n", "school_info": "School: Killyfargy", "metadata": [{"Location:": "Killyfargy, Co. Monaghan", "Teacher:": "\nB. Ó Mórdha\n"}, {"Collector": "Michael Moore", "Gender": "male"}, {"Informant": "Owen Smith", "Gender": "male", "Age": "82", "Address": "Corrinary, Co. Monaghan"}, {"Informant": "Mrs Smith", "Gender": "female", "Address": "Corrinary, Co. Monaghan"}, {"Language": "English"}]}, "5162170/5160604/5164712": {"title": "More Traditions and Customs - A Local Poet", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0947, Page 040", "Page 040"], "url": "https://www.duchas.ie/en/cbes/5162170/5160604/5164712", "text": "\n(continued from previous page)\nround the different homes of the parish and he would make a bod song on anyone that wouldn't receive him. Anyone that received him kindly he praised them in a poem. Here are two lines of a poem of his:\"Minister Thompson was a noble Presbyta,and never disgraced the coat he was paid to wear.\"Where the present Protestant church stands there used to be a Catholic church. It was a long low thatched building. Where the present wall of Scotshouse Protestant Church now stands a man died during the famine.\n\n\n\nCut the fine juicy tops of blackthorns and the tops of briars, pound them and put them in clean water and boil them. Strain them then and take the juice. This is said to be a great cure for it.\n\n\n\nTullaghalow means in English the burned hill. This is how it got its name. When the English were coming round to gather tax off the Irish, the people rose against them, put them into a barn and burned them and the barn.The last faction fight in this district was to take place on Victory's hill about forty-five years ago. The battle was to take place on a hunting day. The parties had actually arrived but the fight was cancelled. The leaders of the opposing factions was Jemmie Klen from New[?] and [?] Walsh\n(continues on next page)\n", "school_info": "School: Killyfargy", "metadata": [{"Location:": "Killyfargy, Co. Monaghan", "Teacher:": "\nB. Ó Mórdha\n"}, {"Collector": "Michael Moore", "Gender": "male"}, {"Informant": "John Mac Donald", "Gender": "male", "Address": "Tullaghaloyst, Co. Monaghan"}, {"Language": "English"}]}, "5162170/5160661/5165195": {"title": "Clones Old Fair", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0947, Page 097", "Page 097"], "url": "https://www.duchas.ie/en/cbes/5162170/5160661/5165195", "text": "", "school_info": "School: Killyfargy", "metadata": [{"Location:": "Killyfargy, Co. Monaghan", "Teacher:": "\nB. Ó Mórdha\n"}, {"Collector": "Michael Moore", "Gender": "male"}, {"Informant": "Peter Mac Mahon", "Gender": "male", "Age": "circa 100", "Occupation": "police officer", "Address": "Cloncumber, Co. Monaghan"}, {"Language": "English"}]}, "5162170/5160716/5165407": {"title": "The Story of Maghera Old Church", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0947, Page 152", "Page 152"], "url": "https://www.duchas.ie/en/cbes/5162170/5160716/5165407", "text": "", "school_info": "School: Killyfargy", "metadata": [{"Location:": "Killyfargy, Co. Monaghan", "Teacher:": "\nB. Ó Mórdha\n"}, {"Language": "English"}]}, "4798788/4798528/5166453": {"title": "Naomh Fachtna Pátrún Ruis", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0308, Page 117", "Page 117"], "url": "https://www.duchas.ie/en/cbes/4798788/4798528/5166453", "text": "\nDuine des na Naomhaibh b'iongantaighe a b'eadh Naomh Fachtna. Rugadh i gCo. Chorcaighe é sa' sémhadh aois. Tugadh Mac Mongach mar ainm air go minic - b'fhéidir go bhfuair sé an tainm sin ó n-a athair nó b'fhéidir go raibh an tainm sin air ó lá a bhreithe mar rugadh é agus a lán gruaige ar a cheann do réir an sgéil. Nuair bhí sé óg bhí sé fé churam Naoimh Íte agus gan dabht 'sí a mhúin na suibhaileidhe (1) móra a bhí í gcroidhe an fhir óig nuair d'fhás sé suas. Tar éis tamaill do chaitheamh fé chúram Íte chuaidh sé go coláiste a bhí ag Loch Eirce in aice Corcaighe. Ag fágáint na scoile sin dhó chuir sé ar bun Mainistir Mholana in aice Eochaille ach tamaillín 'na dhiaidh sin d'fhill sé go dtí a áit dhuthchais agus chuir sé ar bun an coláiste clúmhail sin, Coláiste Ruis. 'Sa  tsean-aimsir tugadh Ros Ailitir ar an gcoláiste mar gheall ar na sluaighte mac léighinn a thagadh ann ó gach áird 'sa domhan.Áit an-oireamhnach do Coláiste is eadh  Ros mar tá sé suidhte cois na fairrge, ag\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire, Ros Ó gCairbre", "metadata": [{"Location:": "Ross Carbery, Co. Cork", "Teacher:": "\nAn tSr. Áilbe\n"}, {"Collector": "Eibhlín Ní Donnabháin", "Gender": "female"}, {"Language": "Irish"}]}, "4921741/4902202/5167464": {"title": "Faction Fights at Fairs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0353, Page 054", "Page 054"], "url": "https://www.duchas.ie/en/cbes/4921741/4902202/5167464", "text": "\nIn former years there was a band of men in a place called Tureenamaor and they used come to Newmarket fairs to meet other parties from Meelin or elsewhere to fight. They had ash-plants loaded with lead at the root, and yet in the district the fierce fights waged between the different parties are spoken of. Sometimes there was no reason for the fight, but they fought for the love of fighting.   They were so famous and their coming to the town was such an event that a story is told of an account book of an old lady who kept a public house in Newmarket when viewed after her death contained the item:- Two pints to Free Thady the day Tureenamaor band was in town. Free Thady Sullivan being a prominent member of the Turrenamaor band was in town\n", "school_info": "School: Áth Treasna (C.)", "metadata": [{"Location:": "Newmarket, Co. Cork", "Teacher:": "\nMáire, Bean Uí Mhurthile\n"}, {"Collector": "Bríghid Ní Dubhdha", "Gender": "female", "Address": "Coolagh, Co. Cork"}, {"Informant": "Mr J. Doody", "Gender": "male", "Address": "Coolagh, Co. Cork"}, {"Language": "English"}]}, "5162170/5160729/5168636": {"title": "The Fenians", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0947, Page 165", "Page 165"], "url": "https://www.duchas.ie/en/cbes/5162170/5160729/5168636", "text": "", "school_info": "School: Killyfargy", "metadata": [{"Location:": "Killyfargy, Co. Monaghan", "Teacher:": "\nB. Ó Mórdha\n"}, {"Language": "English"}]}, "4921764/4904940/5177749": {"title": "Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0358, Page 509", "Page 509"], "url": "https://www.duchas.ie/en/cbes/4921764/4904940/5177749", "text": "\nI do not propose to go deeply into the actual fight itself as it has been dealt with already in Book I pages 135-138, but the seriousness of this tragic period in the story of the district could never be realised. The enmity roused subsided when the Land War grew in intensity and the political factions again revived it somewhat, for supporters of the All for Ireland League and the Irish Party were mainly the  old Gearaltach and Daithíneach  brigades. -  The party animosity got another death-blow in the years 1919-21, but subsequent events again saw the old rivals ranged on the opposing 'camps'. In this year 1938 there is a spirit of fraternity and good-will, without any great impelling force like a Land War or Freedom movement, behind it. It is the outcome of wise and democratic rule - of good laws, of better acts, and of their impartial promulgation.It is impossible to place the date of the beginning of this Gearaltach and Daithíneach Faction Fight but it was in being before 1850 for Fr. Edward Fitzgerald who was Parish Priest from 1844 to 1850 was styled Sagart a' Bhata and was a noted Gearaltach. He is reputed to have used his blackthorn with good ?  effect on several occasions - but always on the Daitíneach boys].\n(continues on next page)\n", "school_info": "School: Cnoc na Groighe (B.), Ráth Mhór", "metadata": [{"Location:": "Knocknagree, Co. Cork", "Teacher:": "\nDíarmuid Ó Muimhneacháin\n"}, {"Collector": "Díarmuid Ó Múimhneacháin", "Gender": "male", "Occupation": "príomhoide"}, {"Language": "mixed"}]}, "4921831/4910134/5183731": {"title": "Historical Event - Peter O'Neill Crowley", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0375, Page 399", "Page 399"], "url": "https://www.duchas.ie/en/cbes/4921831/4910134/5183731", "text": "\nPeter O’Neill Crowley was a native of Ballymacoda, Co. Cork. He was a member of the Fenian Organisation and was one of its most daring and active workers. He was a farmer by occupation but he often left the plough to take part in operations against the British posts in Ireland.On one of these occasions, on the 5th March 1867, Peter O’Neill Crowley, helped in the capture of Knockadoon Coastguard Station, Co. Cork.. Immediately word of the capture was sent out parties of soldiers went to comb the district and capture the raiders.Crowley thought it safer  to leave that place and seek a secure retreat. With that intent, he, with a companion John McClure, decided to come to Kilclooney Wood, Knockanevin, Co. Cork. They reached the wood safely and found shelter there during the day and at night they slept in a farmer’s house close to the wood.The secret of their hiding place was well kept and the two men were in the locality some weeks before information reached the military in Mitchelstown, Co. Cork. It is thought that someone in the district informed as to their whereabouts. Early one morning, Crowley and his companion\n(continues on next page)\n", "school_info": "School: Knockanevin", "metadata": [{"Location:": "Knockanevin, Co. Cork", "Teacher:": "\nSeán Ó Crosáin\n"}, {"Collector": "J. Crosbie", "Address": "Knockanevin, Co. Cork"}, {"Informant": "John Ronan", "Gender": "male", "Age": "83", "Occupation": "farmer", "Address": "Knockanevin, Co. Cork"}, {"Language": "English"}]}, "4921811/4894709/5185328": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0370, Page 229", "Page 229"], "url": "https://www.duchas.ie/en/cbes/4921811/4894709/5185328", "text": "\nJeremiah Curtin of Ballymacmoy, Killavullen (aged 79 years) informs me that great enmity existed between the people of Killavullen parish and thier neighbours of Castletownroche, in former years. Many a hurling a football match was played between  them and the ball was always thrown up between them in a field now known as \"The Móin\" . This field is in the farm now occupied by Mr Jeremiah Owens of Monanimy. No rules existed then, the ball could be carried, tripping was allowed, and all methods fair or foul were tolerated. Two men lost their lives in this field in matches played in this way. In one case one man struck an other in the head with his hurley owing to a spleen that existed between them.This field called \"th Móins\" is rarely ploughed as it is supposed to be a \"haunted\" one. When ploughed some years ago, the ploughman spent a considerable time in bed afterwards due, as was said to his\n(continues on next page)\n", "school_info": "School: Cill an Mhuilinn, Malla", "metadata": [{"Location:": "Killavullen, Co. Cork", "Teacher:": "\nDonncha Magner\n"}, {"Informant": "Jeremiah Curtin", "Gender": "male", "Age": "79", "Address": "Ballymacmoy, Co. Cork"}, {"Language": "English"}]}, "4921811/4894711/5185476": {"title": "Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0370, Page 231", "Page 231"], "url": "https://www.duchas.ie/en/cbes/4921811/4894711/5185476", "text": "\nKilcummer, in the parish of Castletownroche, was famous for its great faction fights. At this place a fair was held yearly in July and here the fighting families congregated. At this time match making \"for marriage was a simple matter. It wasn't fortunes land or stock that mattered but the strength of the factions.Jeremiah Curtin, of Ballymacmoy, informs me that months prior to the fair the blackthorn sticks were being prepared. Nothing was required to start a \"row\" but throw a \"sop\" at one of the rivals.The famous factions of this district were the Kirbys and the CurtinsFaction fighting in this district has discontinued over eighty years.\n", "school_info": "School: Cill an Mhuilinn, Malla", "metadata": [{"Location:": "Killavullen, Co. Cork", "Teacher:": "\nDonncha Magner\n"}, {"Informant": "Jeremiah Curtin", "Gender": "male", "Address": "Ballymacmoy, Co. Cork"}, {"Language": "English"}]}, "4921855/4910621/5189160": {"title": "Faction Fighting in the Olden Times in this Parish", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0381, Page 420", "Page 420"], "url": "https://www.duchas.ie/en/cbes/4921855/4910621/5189160", "text": "", "school_info": "School: Ráth Chormaic (C.)", "metadata": [{"Location:": "Rathcormack, Co. Cork", "Teacher:": "\nMáiréad Ní Chonchobhair\n"}, {"Language": "English"}, {"Location": "Ballinwillin"}]}, "5177655/5177545/5192024": {"title": "An Old Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0599, Page 540", "Page 540"], "url": "https://www.duchas.ie/en/cbes/5177655/5177545/5192024", "text": "\nAbout 60 years ago there existed in Co. Limerick two factories called the three year olds and the four year olds. At every fair and race meeting the day would end up in a free fight often lasting for hours and in which the women would join the men of their clan the women using a stocking with a boulder of stone shoved into it and the men were using stout blackthorns. The fight would start by one of the clan shouting at his loudest his own name the name of his clan and the names of members of the clan. The mention\n(continues on next page)\n", "school_info": "School: An Páirtín", "metadata": [{"Location:": "Parteen, Co. Clare", "Teacher:": "\nCiarán Ó Ceallaigh\n"}, {"Language": "English"}]}, "4921871/4897501/5192323": {"title": "Brehon Laws", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0385, Page 226", "Page 226"], "url": "https://www.duchas.ie/en/cbes/4921871/4897501/5192323", "text": "\nNo. 21. Brehon Laws etcThe Brehon laws do not seem to have been observed in this district.No 22 Nil.No 23 Nil.\n\n\n\nNo 24 Faction-fights. etc.Those have not taken place in living memory in this parish, but old people remember seeing faction fights in Bartlemy, near Rathcormac. There were two parties the  \"Eoghanaighs\"(Aherne's) of Bartlemy, and the Walshe's of Watergrasshill. The two parties met at Bartlemy Fair on 19th September every year and fought there. The men carried sticks attached to their wrists with a leather thong and nails were driven into the stick here and there.There was another fair on 4th Sept. at which the Tinker-fighters met. The women filled their stockings with stones and beat the men with them.\n\n\n\nNo 25 Sports & Pastimes etc.Hurling matches were played across the country from one field to another.No tradition of ancient sports or pastimes remain.\n", "school_info": "School: An Clochar, Carraig Thuathail", "metadata": [{"Location:": "Carrigtohill, Co. Cork", "Teacher:": "\nAn tSr. Celestine\n"}, {"Collector": "An tSr. Celestine", "Gender": "female"}, {"Informant": "John Grey", "Gender": "male", "Age": "74", "Occupation": "postman", "Address": "Carrigtohill, Co. Cork"}, {"Language": "English"}]}, "4921878/4898060/5195018": {"title": "The Fair Field of Ballylea", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0387, Page 102", "Page 102"], "url": "https://www.duchas.ie/en/cbes/4921878/4898060/5195018", "text": "\n(continued from previous page)\n\"Maggie Lanagan\" and \"Bravo Kate\" used dance one in each of the tents.  They had a fright of porter.  Stakes were put in the ground and a huge fire of furze was lit.  People danced around the fire.  Young girls were taken by the hand and should jump the fire three times.  Old women had shawls and long clay pipes.  The young people brought big stones for the old women to sit on and \"moguard\" was shaken over the fire.  The people used keep some of the moguard until the next year, and when anyone was sick they put it on them.  Going home the people carried the burned sticks and threw them into the gardens for luck.\n\n\n\nFaction fighting was very common at these fairs.  The fights were principally between the Aherns from Barthlemy and the Buckleys and Riordans from Lisgoold.There were in existence 3 powerful sticks used in those fights named Tomás na Fola; [?];\n(continues on next page)\n", "school_info": "School: Léim Lárach, Carraig Thuathail", "metadata": [{"Location:": "Leamlara, Co. Cork", "Teacher:": "\nSeán Ó Nia (Meville?)\n"}, {"Collector": "J.C. Neville", "Gender": "male", "Occupation": "teacher"}, {"Language": "English"}]}, "5162149/5158859/5197753": {"title": "The Fair of Glynn", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0655, Page 010", "Page 010"], "url": "https://www.duchas.ie/en/cbes/5162149/5158859/5197753", "text": "\nGlynn is situated in the parish of Windgap in County Waterford. Every year on Ascension Day a fair was held there. Cattle were sold there and other goods. When the buying and selling was over, sports of all kinds were held horse racing, high jumping and other games. There were tents there where drink was sold. When the sports were over two political parties known as the Carrarats and the Sean-Bhests used to fight with seasoned blackthorn sticks which they had up the chimneys for some weeks beforehand so they would be hard. What made them fight mostly was that they had drink taken. The fair ceased to be held sixty years ago.\n", "school_info": "School: An Charraig Bheag, Carraig na Siúire", "metadata": [{"Location:": "Carrickbeg, Co. Waterford", "Teacher:": "\nSeán Ó Comhraidhe\n"}, {"Collector": "Ned Hahessy", "Gender": "male"}, {"Informant": "Mr Michael Boland", "Gender": "male", "Address": "Portnaboe, Co. Waterford"}, {"Language": "English"}, {"Location": "Glen Lower"}]}, "5162140/5157973/5199912": {"title": "Landlords", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0613, Page 208", "Page 208"], "url": "https://www.duchas.ie/en/cbes/5162140/5157973/5199912", "text": "\n(continued from previous page)\n[-]\n\n\n\nThere was a man named Frawley who lived in Kilcross and he was a rentwarner for the following landlords, Finnucane, O'Callaghan and Cunningham. There were people evicted above Corofin. All their furniture was put out on the roadside and the children also. The children were so young that they were delighted to have the furniture thrown out on the roadside and were making cubby-houses.You would hear the older people crying in the field not knowing where to go for the night.\n\n\n\nThere used to be terrible fights with sticks at every fair and race meeting long ago. There was a hurling match in Fountain between Cill na Móna and\n(continues on next page)\n", "school_info": "School: Tamhnach, Inis", "metadata": [{"Location:": "Toonagh, Co. Clare", "Teacher:": "\nProinnsias Gordún\n"}, {"Collector": "Michael Leahy", "Gender": "male", "Address": "Erinagh More, Co. Clare"}, {"Informant": "John Leahy", "Relation": "parent", "Gender": "male", "Age": "49", "Address": "Erinagh More, Co. Clare"}, {"Language": "English"}]}, "5162140/5157973/5199929": {"title": "Landlords", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0613, Page 208", "Page 208"], "url": "https://www.duchas.ie/en/cbes/5162140/5157973/5199929", "text": "\n(continued from previous page)\n[-]\n\n\n\nThere was a man named Frawley who lived in Kilcross and he was a rentwarner for the following landlords, Finnucane, O'Callaghan and Cunningham. There were people evicted above Corofin. All their furniture was put out on the roadside and the children also. The children were so young that they were delighted to have the furniture thrown out on the roadside and were making cubby-houses.You would hear the older people crying in the field not knowing where to go for the night.\n\n\n\nThere used to be terrible fights with sticks at every fair and race meeting long ago. There was a hurling match in Fountain between Cill na Móna and\n(continues on next page)\n", "school_info": "School: Tamhnach, Inis", "metadata": [{"Location:": "Toonagh, Co. Clare", "Teacher:": "\nProinnsias Gordún\n"}, {"Collector": "Michael Leahy", "Gender": "male", "Address": "Erinagh More, Co. Clare"}, {"Informant": "John Leahy", "Relation": "parent", "Gender": "male", "Age": "49", "Address": "Erinagh More, Co. Clare"}, {"Language": "mixed"}]}, "5162108/5154855/5200850": {"title": "A Faction Fight", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0246, Page 102", "Page 102"], "url": "https://www.duchas.ie/en/cbes/5162108/5154855/5200850", "text": "\n[-]\n(continues on next page)\n", "school_info": "School: Trian", "metadata": [{"Location:": "Trien, Co. Roscommon", "Teacher:": "\nMícheál Dyar\n"}, {"Collector": "Mary Gilligan", "Gender": "male", "Address": "Clooncah, Co. Roscommon"}, {"Informant": "Seumas Ó Cochlann", "Gender": "male", "Age": "60", "Address": "Clooncah, Co. Roscommon"}, {"Language": "mixed"}]}, "5162108/5154857/5200865": {"title": "A Faction Fight", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0246, Page 104", "Page 104"], "url": "https://www.duchas.ie/en/cbes/5162108/5154857/5200865", "text": "\n[-]\n(continues on next page)\n", "school_info": "School: Trian", "metadata": [{"Location:": "Trien, Co. Roscommon", "Teacher:": "\nMícheál Dyar\n"}, {"Collector": "Bertha Winston", "Gender": "female", "Address": "Clooncran, Co. Roscommon"}, {"Informant": "Mártan Ó Conchubhair", "Gender": "male", "Age": "80", "Occupation": "feirmeoir", "Address": "Cloonkeen, Co. Roscommon"}, {"Language": "English"}]}, "4921760/4904236/5215714": {"title": "Faction Fight", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0357, Page 098", "Page 098"], "url": "https://www.duchas.ie/en/cbes/4921760/4904236/5215714", "text": "\nThe principal faction fight of this area was that of the Daheen's and the Gearloughs. It originated sometime in the 18th Century somewhere around Cullen. A man named Fitzgerald was guilty of a criminal offence against some member of the family of one David OConnor. OConnors son beat him at the Chapel gate at Cullen on the Sunday following. On Lateran Day Fitz-gerald brought on his faction. Blows were struck, men fell on both sides and a faction fight ensued, which lasted for between 100 + 150 years. It ceased at the Land war of the 80's.    This story was given by J.D. OLeary Lyreaowen.Domhnaill a Leanbh and Díarmuid Feirc lived in an old house in Clounts They were two Daithíneac fighters They used to be fighting against the Gearalraig. They used to fight with ash plants\n", "school_info": "School: Carrigaline, Ráth Mhór", "metadata": [{"Location:": "Carrigaline, Co. Cork", "Teacher:": "\nEibhlín, Bean Mhic Conchoille\n"}, {"Informant": "J.D. O' Leary", "Gender": "male", "Address": "Lyredaowen, Co. Cork"}, {"Language": "English"}]}, "4921762/4904470/5218844": {"title": "Faction Fighting", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0357, Page 332", "Page 332"], "url": "https://www.duchas.ie/en/cbes/4921762/4904470/5218844", "text": "", "school_info": "School: Cnoc na Groighe (B.), Ráth Mhór", "metadata": [{"Location:": "Knocknagree, Co. Cork", "Teacher:": "\nDiarmuid Ó Muimhneacháin\n"}, {"Collector": "Seán Ó Cróinín", "Gender": "male", "Address": "Scrahan, Co. Cork"}, {"Informant": "John O' Connell", "Relation": "grandparent", "Gender": "male", "Age": "80", "Address": "Scrahan, Co. Cork"}, {"Language": "English"}]}, "4921762/4904471/5218845": {"title": "Faction Fighting", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0357, Page 333", "Page 333"], "url": "https://www.duchas.ie/en/cbes/4921762/4904471/5218845", "text": "", "school_info": "School: Cnoc na Groighe (B.), Ráth Mhór", "metadata": [{"Location:": "Knocknagree, Co. Cork", "Teacher:": "\nDiarmuid Ó Muimhneacháin\n"}, {"Collector": "Cornelius Linehan", "Gender": "male", "Address": "Knockyhena, Co. Cork"}, {"Collector": "John C. Linehan", "Gender": "male", "Address": "Knockyhena, Co. Cork"}, {"Informant": "Dan Buckley", "Gender": "male", "Age": "70", "Address": "Knockyhena, Co. Cork"}, {"Language": "English"}]}, "4921762/4904472/5218846": {"title": "Faction Fighting", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0357, Page 334", "Page 334"], "url": "https://www.duchas.ie/en/cbes/4921762/4904472/5218846", "text": "\n(continued from previous page)\nUmeraboy received a blow in the eye from Dan Casey of Knocknagree.  Dan was taken to court and asked why he hit the man.  He said \"What brought him to the fair with a soft skull\".  He got a month in jail.  A man named \"Gaiscideac\" O'Keeffe started the flight each day.\n\n\n\nThere lived at one time in Killarney a notorious man by the name of Bill MacCarthy.  He was about six feet in height and had a broken hip.  He was never beaten till he came to Knocknagree.One fairday about sixty years ago he came with the Daly clan from Kilsorcon and being unable to get any man to fight him he started punching a big horse.  Every fighting man in the place ran from him, he looked so terrible with his yellow baffety shirt and corduroy trousers.  He was a \"baitín\" boy by the Dalys and would kill a person for two pints of porter.  One day he paid for\n(continues on next page)\n", "school_info": "School: Cnoc na Groighe (B.), Ráth Mhór", "metadata": [{"Location:": "Knocknagree, Co. Cork", "Teacher:": "\nDiarmuid Ó Muimhneacháin\n"}, {"Collector": "Michael Murphy", "Gender": "male", "Address": "Shanbally, Co. Cork"}, {"Informant": "James Riordan", "Gender": "male", "Age": "20", "Address": "Scrahan, Co. Cork"}, {"Language": "English"}]}, "4921762/4904473/5218847": {"title": "Faction Fighting", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0357, Page 335", "Page 335"], "url": "https://www.duchas.ie/en/cbes/4921762/4904473/5218847", "text": "\n(continued from previous page)\nhis fighting. Con Totely the famous Shanballa highway-man struck him with his stirrup iron and broke all the teeth in the front of his mouth.\n\n\n\nThe principal men partaking in the fight were:William, John, Darby and Andy Sheehan, Tureencahill.  Patsy and Jack Sheehan. TureengarbhJohn Sheehan and his two sons Dan\n(continues on next page)\n", "school_info": "School: Cnoc na Groighe (B.), Ráth Mhór", "metadata": [{"Location:": "Knocknagree, Co. Cork", "Teacher:": "\nDiarmuid Ó Muimhneacháin\n"}, {"Collector": "Timothy O' Sullivan", "Gender": "male", "Address": "Nohaval Upper, Co. Cork"}, {"Informant": "Timothy Long", "Gender": "male", "Age": "68", "Address": "Nohaval Lower, Co. Cork"}, {"Language": "mixed"}]}, "4921762/4904473/5218848": {"title": "Faction Fighting", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0357, Page 335", "Page 335"], "url": "https://www.duchas.ie/en/cbes/4921762/4904473/5218848", "text": "\n(continued from previous page)\nhis fighting. Con Totely the famous Shanballa highway-man struck him with his stirrup iron and broke all the teeth in the front of his mouth.\n\n\n\nThe principal men partaking in the fight were:William, John, Darby and Andy Sheehan, Tureencahill.  Patsy and Jack Sheehan. TureengarbhJohn Sheehan and his two sons Dan\n(continues on next page)\n", "school_info": "School: Cnoc na Groighe (B.), Ráth Mhór", "metadata": [{"Location:": "Knocknagree, Co. Cork", "Teacher:": "\nDiarmuid Ó Muimhneacháin\n"}, {"Collector": "Liam O' Herlihy", "Gender": "male", "Address": "Knocknagree, Co. Cork"}, {"Collector": "D. Hickey", "Gender": "male", "Address": "Knockyhena, Co. Cork"}, {"Informant": "Mrs Sheehan", "Gender": "female", "Age": "86", "Address": "Knocknagree, Co. Cork"}, {"Language": "English"}]}, "4921762/4904474/5218849": {"title": "Faction Fighting", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0357, Page 336", "Page 336"], "url": "https://www.duchas.ie/en/cbes/4921762/4904474/5218849", "text": "\nCon \"Toatly\" Mahony Shanballa and Jack Casey of Lacka were both Daithíns. Jack beat seven men at Knocknagree fair. Tadg Betty Murphy, a Daithín cleared all the Geraltaigh out of the fair at Knocknagree.A man named Driscoll was killed at Dromagh fair.\n", "school_info": "School: Cnoc na Groighe (B.), Ráth Mhór", "metadata": [{"Location:": "Knocknagree, Co. Cork", "Teacher:": "\nDiarmuid Ó Muimhneacháin\n"}, {"Collector": "Hugh Mc Carthy", "Gender": "male", "Address": "Knocknagree, Co. Cork"}, {"Informant": "David Murphy", "Gender": "male", "Age": "84", "Address": "Knocknagree, Co. Cork"}, {"Language": "English"}]}, "4921762/4904475/5218850": {"title": "Faction Fighting", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0357, Page 337", "Page 337"], "url": "https://www.duchas.ie/en/cbes/4921762/4904475/5218850", "text": "", "school_info": "School: Cnoc na Groighe (B.), Ráth Mhór", "metadata": [{"Location:": "Knocknagree, Co. Cork", "Teacher:": "\nDiarmuid Ó Muimhneacháin\n"}, {"Collector": "Diarmuid Ó Muinmheacháin", "Gender": "male", "Occupation": "múinteoir"}, {"Informant": "Patrick T. O' Connor", "Gender": "male", "Age": "78", "Address": "Farrankeal, Co. Cork"}, {"Language": "English"}]}, "5274069/5271240/5274410": {"title": "Folklore - Fighting", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0592F, Page 09_004", "Page 09_004"], "url": "https://www.duchas.ie/en/cbes/5274069/5271240/5274410", "text": "\n4                  30 th June 1938                 Folklore. Long ago there was a good deal of fighting at fairs.This faction fighting was worst when the Irish people became divided in the time of the Mc Carthyites and Parnellites.            The weapons they used were blackthorn sticks .And plants were also used and they were put up the chimney to season so that they last along time.\n(continues on next page)\n", "school_info": "School: Drumandoora N.S.", "metadata": [{"Location:": "Drumandoora, Co. Clare", "Teacher:": "\nLiam Mac Aodhaire, Liam Airley\n"}, {"Collector": "Dannie Mac Mahon", "Gender": "male", "Address": "Drumandoora, Co. Clare"}, {"Informant": "Jermiah Tuohy", "Gender": "male", "Address": "Fahy, Co. Clare"}, {"Language": "English"}]}, "5274069/5271293/5282795": {"title": "Folklore - Faction Fighting", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0592F, Page 10_049", "Page 10_049"], "url": "https://www.duchas.ie/en/cbes/5274069/5271293/5282795", "text": "\nThere are special beliefs attached to horses when being sold If grey horses haven't a dark spot in part of their body's it is said they carry a man's life.One day a farmer was buying a grey horse and he searched all over the horse for a dark spot but he got no trace of it and he shook his head and said he would buy it for any money. The owner of the hores knew what was troubling the buyer and he \"you need not be afraid of her she has done her work already\" meaning the horse had already killed a man\n(continues on next page)\n", "school_info": "School: Drumandoora N.S.", "metadata": [{"Location:": "Drumandoora, Co. Clare", "Teacher:": "\nLiam Mac Aodhaire, Liam Airley\n"}, {"Collector": "Chris Brody", "Gender": "male", "Address": "Killanena, Co. Clare"}, {"Informant": "Mr John Moloney", "Gender": "male", "Address": "Killanena, Co. Clare"}, {"Language": "English"}]}, "5274069/5271308/5282805": {"title": "Folklore - Fighting at Fairs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0592F, Page 11_005", "Page 11_005"], "url": "https://www.duchas.ie/en/cbes/5274069/5271308/5282805", "text": "\nLong ago when people went to fair they took a big stick with them.When an argument arose between parties over the price of the cattle it often led to a faction fight in which the backers of both parties were engaged.These fights were most common when the split took place between the McCarthyites and the Parnellites.They used to have a big bundle of ash-plants and the one the best top they would bring to the fair with them.They used to have the plants\n(continues on next page)\n", "school_info": "School: Drumandoora N.S.", "metadata": [{"Location:": "Drumandoora, Co. Clare", "Teacher:": "\nLiam Mac Aodhaire, Liam Airley\n"}, {"Collector": "Chriss Brody", "Gender": "male", "Address": "Killanena, Co. Clare"}, {"Informant": "Mr John Moloney", "Gender": "male", "Address": "Killanena, Co. Clare"}, {"Language": "English"}]}, "5274069/5271310/5282808": {"title": "Folklore - Faction Fighting", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0592F, Page 11_007", "Page 11_007"], "url": "https://www.duchas.ie/en/cbes/5274069/5271310/5282808", "text": "\nThere is a fair usually held in Gort every month ,and very often in olden times fights took place at these fairs.The argument usually arose between two parties, over the price of cattle. It often led to a faction fight in which the backers of both parties engaged.These faction fights were most common when the split took place between the Mc Carthy-ites and the Parnellitis. In the olden times the people used to be very careful that the cattle would not have a bad leg\n(continues on next page)\n", "school_info": "School: Drumandoora N.S.", "metadata": [{"Location:": "Drumandoora, Co. Clare", "Teacher:": "\nLiam Mac Aodhaire, Liam Airley\n"}, {"Collector": "Chriss Brody", "Gender": "male", "Address": "Killanena, Co. Clare"}, {"Informant": "Mr Michael Brody", "Gender": "male", "Address": "Killanena, Co. Clare"}, {"Language": "English"}]}, "5274069/5271365/5282986": {"title": "Folklore - Faction Fighting", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0592F, Page 12_051", "Page 12_051"], "url": "https://www.duchas.ie/en/cbes/5274069/5271365/5282986", "text": "\n51                21st.June 1938.                        Folklore In the fairs long ago there used to be terrible fighting .                Any little difference would beat two parties and they would rise a row a person had a blind cow for instance ,and he sold her to another man and the man to whom he sold the cow discovered that she was blind he would gather a crowd from his own district and fight against the other mans party so that was the way he got back his money .\n", "school_info": "School: Drumandoora N.S.", "metadata": [{"Location:": "Drumandoora, Co. Clare", "Teacher:": "\nLiam Mac Aodhaire, Liam Airley\n"}, {"Collector": "Annie Moloney", "Gender": "female", "Address": "Killanena, Co. Clare"}, {"Informant": "Mr John Moloney", "Gender": "male", "Address": "Killanena, Co. Clare"}, {"Language": "English"}]}, "5274069/5271513/5283061": {"title": "Folklore - Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0592F, Page 16_021", "Page 16_021"], "url": "https://www.duchas.ie/en/cbes/5274069/5271513/5283061", "text": "\nAbout some 60 or 70 years ago it was a usual thing for different parties to indulge in what was called faction fights. The object was to know which party was the strongest. The parties and their friends would assemble at the fair and market and then two of the opposing parties would start the fight. Then each parties friends including the women would take sides and then the fight would start in earnest.\n(continues on next page)\n", "school_info": "School: Drumandoora N.S.", "metadata": [{"Location:": "Drumandoora, Co. Clare", "Teacher:": "\nLiam Mac Aodhaire, Liam Airley\n"}, {"Collector": "Bridie Mac Mahon", "Gender": "female", "Address": "Fahy, Co. Clare"}, {"Informant": "John Woods", "Gender": "male", "Address": "Fahy, Co. Clare"}, {"Language": "English"}]}}