{"4921788/4907245/5178268": {"title": "The Battle of Knocknanuss 1647", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0365, Page 092", "Page 092"], "url": "https://www.duchas.ie/en/cbes/4921788/4907245/5178268", "text": "\nLord Taffe was at this time in charge of the Irish troops in the South and would not fight Inichiquin who was in charge of the confedate army and both armies met at Knocknanuss on November 13th 1647. The Irish lines extended from Garrison near Kilbrin to Buttevant. Inchiquin had placed his best regiments opposite Alister Mac Donnell's men whom he greatly feared. The Irish on the right wing attacked and drove the English to the walls of Mallow.Alister Mac Donnell was second in command of the Irish army. Taffe charged and captured Inchiquin's camp and drove the English to the walls of Mallow. Taffe's soldiers pillaged the camp and became drunk and disorderly and refused to fight. Taffe from his place saw that Mac Donnell was in danger. Some of the officers said they would go to his aid. Taffe was jealous of Alister Mac Donnell and said he would shoot the first man who went to his Aid.Mac Donnell then charged and also Inchiquin. Some of the Irish soldiers and officers treacherously\n(continues on next page)\n", "school_info": "School: Baile Theas (C.), Malla", "metadata": [{"Location:": "Ballyhass, Co. Cork", "Teacher:": "\nBríd Bean Uí Dhála\n"}, {"Language": "English"}]}, "4921788/4907247/5178271": {"title": "Alister Mac Donnell", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0365, Page 094", "Page 094"], "url": "https://www.duchas.ie/en/cbes/4921788/4907247/5178271", "text": "\nAllister MacDonnell also met his death there.Death of McDonnell. When all the fighting was over he was giving his horse a drink at a place called Lackenleigh. He was clothed in slate armour and when he bent down the plates lifted and exposed his back.It happened that an English soldier named Samuel was lying in the rushes. The soldier  seeing the unprotected part drove the sword through the warrior's back and he fell dead off his horse.The man who killed Mac Donnell is said to have been the owner of a small landed property near Charleville which has long since passed away from name and family although some of the latter still reside in the neighbourhood. About fifty years ago a great great grandson of this man locally remembered as \"Thade of Kanturk\" but his real name was Timothy O'Callaghan was employed as a farm labourer near Buttevant. Alister Mac Donnell's body was buried in the townland of Rathmaher in a kithcen garden. An ash tree grows where he was buried. Here his body lay for three days until it was removed to\n(continues on next page)\n", "school_info": "School: Baile Theas (C.), Malla", "metadata": [{"Location:": "Ballyhass, Co. Cork", "Teacher:": "\nBríd Bean Uí Dhála\n"}, {"Language": "English"}]}, "4921787/4907076/5179045": {"title": "Cath Cnoc na nOs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0364, Page 290", "Page 290"], "url": "https://www.duchas.ie/en/cbes/4921787/4907076/5179045", "text": "", "school_info": "School: Baile Theas (B.), Malla", "metadata": [{"Location:": "Ballyhass, Co. Cork", "Teacher:": "\nTadhg Ó Hanluain\n"}, {"Informant": "Mr James O' Connell", "Gender": "male", "Age": "83", "Address": "Knocknanuss, Co. Cork"}, {"Language": "Irish"}]}, "4921787/4907079/5179049": {"title": "Knocknanuss", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0364, Page 293", "Page 293"], "url": "https://www.duchas.ie/en/cbes/4921787/4907079/5179049", "text": "\n\"Knocknanuss the hill of sighs,High cairn above a lovely tomb,They named thee in a day of gloomTo women's wailing doleful cries\".IIDaughter and mother, maid and wife,They came when wars red work was done,Mourning for father, lover, son,The gory swath of battle strifeIIILike spectres in the shadows moved,Stooping to scan a pallid face,Peering through scars and blood to trace,The features of the men they lovedIVFor I have told an aged old tale,Long have both loved and lover slept,And pulseless dust those eyes that wept,And hearts that break in moan and wail.VAh grief of love! Thou hast no power,To match with death else those would rise,And life leap back to glazed eyes,And touch and cry of love that hour.VIAnd oft in Autumn winds tis said,When evening spreads her ebon screen,One yet may hear the ghostly keen,Of women waiting for their dead.\n", "school_info": "School: Baile Theas (B.), Malla", "metadata": [{"Location:": "Ballyhass, Co. Cork", "Teacher:": "\nTadhg Ó Hanluain\n"}, {"Informant": "Reverend P. Mackessy", "Gender": "male"}, {"Language": "English"}]}, "4921787/4907080/5179060": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0364, Page 294", "Page 294"], "url": "https://www.duchas.ie/en/cbes/4921787/4907080/5179060", "text": "\nThere is a hill in the parish of Castlemagner called Knocknanuss. It rises up suddenly from a small river which runs by the north west side. It is a long low hill and it is about three miles from Kanturk. The word Knocknanuss has three meanings namely the hill of the bushes, the hill of the fawn, and the hill of the weasels. It is about five hundred feet in height. The slope is gradual on the southern side but it is very steep on the northern side. It is arable land for I suppose \"the red rain makes the grass grow\" In the year 1641 there was a rising in Ireland Lord Inchiquin was in command of the English troops in the south. Lord Taffe was in command of the Confederates that is the real Irish and the old Anglo Normans. Owen Roe was general of the Spanish army. He came over from Spain and took command of the Irish army and he had an European reputation. He was a nephew of the great Hugh O'Neill. He was coming down from the north to fight Cromwell. He died at Cavan having been poisoned by an English spy. Morrough the Burner was doing great slaughter in Munster and had put one hundred priests to death at Cashel. The Papal Nuncio was angry at this. Lord Taffe at this time would not fight Inchiquin and both armies met at Knocknanuss on November 13th 1647 The Irish lines extended from Garrison near Kilbrin to Buttevant. Inchiquin had placed his best regiment opposite Alister Mac Donnell's men whom he greatly feared. The Irish on the right wing attacked and drove the English to the walls of Mallow. Alister Mac Donnell was second in command of the Irish army. Taffes soldiers pillaged the camp and became drunk and disorderly and refused to fight. Taffe from his place saw that Mac Donnell was in danger. Some of the officers said they would go to his aid. Taffe was jealous of Alister Mac Donnell and he said he would shoot the first man who would go to his aid. Mac Donnell then charged and also Inchiquin Some of the Irish soldiers and officers ran away when they saw Inchiquin charging and left Alister Mac Donnell and his army to be cut down. Inchiquin's soldiers\n(continues on next page)\n", "school_info": "School: Baile Theas (B.), Malla", "metadata": [{"Location:": "Ballyhass, Co. Cork", "Teacher:": "\nTadhg Ó Hanluain\n"}, {"Informant": "Mr James O' Connell", "Gender": "male", "Age": "83", "Address": "Knocknanuss, Co. Cork"}, {"Informant": "Owen J. Bourke", "Gender": "female", "Address": "Kanturk, Co. Cork"}, {"Informant": "Mr J. Sheehan", "Gender": "male", "Address": "Ballygrady North, Co. Cork"}, {"Language": "English"}]}, "4921813/4894931/5181536": {"title": "Knocknanuss", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0371, Page 195", "Page 195"], "url": "https://www.duchas.ie/en/cbes/4921813/4894931/5181536", "text": "", "school_info": "School: Baile Caisleáin an Róistigh (B.)", "metadata": [{"Location:": "Castletownroche, Co. Cork", "Teacher:": "\nPádraig Ó Luineacháin\n"}, {"Language": "English"}, {"Location": "Knocknanuss"}]}}