{"4427838/4348977/4438074": {"title": "Araid an Bhraoinín", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0096, Page 203", "Page 203"], "url": "https://www.duchas.ie/en/cbes/4427838/4348977/4438074", "text": "\nAirid An BhraoinínAirid a chur Muire faoi shuilibh a Mic ar bhruth ar bhraoinín ar chalg ar chaithnín ar dhusta bothair, ná ar ghreamhar móna ar sgealb de chloich, ar sgealb de chrann ar fhionn nó ar at, tarraigh a Colm Chille agus tabhair an anachan leat.Tar-éis an paidir seo a rádh abairsea tracht [ abair seacht] bpaidir seacht n-Aibhe Máire agus cré in onóir Do Dhia agus do Mhuire agus do righ an Domhnaigh mhiorbhuilte le biseach agus foirthín a thabhairt do’n té a bhfuiltear a deanamh na h-airideacht seo do.Roimhe nó tar eis an phaidir lion do bhéal le h-uisge. Caith amach an t-uisge as do bhéal agus más dusta ná deanach atá in do shúil chifidh tú é ins an uisge a’ chaithtear amach.  Is féidir an airid seo a dheanamh aon lá de’n t-seachtmhain acht deirtear go mbionn sé i bhfad níos éifeachtaighe é a dheanamh Diardaoin roimh luighe na gréine. Geobhann fear déanta na h-airide íocaidheacht éigin cúpla\n(continues on next page)\n", "school_info": "School: Teach Chaoin (B.)", "metadata": [{"Location:": "Tagheen, Co. Mayo", "Teacher:": "\nSéamus Ó Maoilearca\n"}, {"Collector": "Séamus Ó Maoilearca", "Gender": "male"}, {"Language": "Irish"}]}, "4427930/4358793/4454974": {"title": "Cure for Sore Eyes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0117, Page 57", "Page 57"], "url": "https://www.duchas.ie/en/cbes/4427930/4358793/4454974", "text": "\na green creeper which grows on some houses is called house-lick and is used as a cure for sore eyes.  It has sa very thick leaf out of which juice is squeesed and then applied to the eye while saying \"Cure of Cureable \" three times\n\n\n\nYears ago in the times of the fairies there lived an old man named Thomas and his wife Nancy. They were very poor. One evening as they sat beside the fire a kind of fairy came to them and said \"that they were to have three wishes and whatever they asked for, it would be granted.\"  They were delighted and sat on the fire planning what they would wish for.  Thomas thought he would wish for heaps and heaps of gold and Nancy intended to wish to have a lovely new house to live in.  But they decided to wish for nothing until next day. Just as they were preparing to go to bed Nancy looked at the fire and she said \"Well that is a lovely fire it is a shame to let it go waste I wish I had an oat meal cake ready to cook it.  As soon as she said the words an oat meal cake rested on her nose and to their grief they could not get if off after tugging and pulling at the cake for some time. they decided that their last wish\n(continues on next page)\n", "school_info": "School: Páirc Íseal (B.)", "metadata": [{"Location:": "Lowpark, Co. Mayo", "Teacher:": "\nSeán Ó Caiside\n"}, {"Language": "English"}]}, "4428221/4386924/4456910": {"title": "Old Cures - A Sore Eye", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0795, Page 100", "Page 100"], "url": "https://www.duchas.ie/en/cbes/4428221/4386924/4456910", "text": "\nCatch a sparrow; split it in two; put it up to the eye.Mr. Hanlon Rathcoole cured his eye in this way. He fell on a stick an injured his eye. It was cured when he applied a split sparrow on it. Miss Muthare told me about this cure.\n\n\n\nTo stop bleeding from a cut, a cobweb was applied. This stopped the bleeding.\n", "school_info": "School: Palmerstown", "metadata": [{"Location:": "Palmerston, Co. Dublin", "Teacher:": "\nMrs Tuohy\n"}, {"Informant": "Miss Mulhare", "Relation": "unknown"}, {"Language": "English"}]}, "4428325/4395008/4460555": {"title": "(Ortha) Leigheas an Dúileadáin", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1046, Page 11", "Page 11"], "url": "https://www.duchas.ie/en/cbes/4428325/4395008/4460555", "text": "\nBhí fear gallda ina chomhnuidhe i Málainn Móir darbh ainm de Roibeaird Morra. Tráthnóna amháin las Roibeaird a phíopa agus chuaidh amach da chaitheamh. Bhí galadh maith ann agus nuair a bhí sé ag dul thart binn an toighe shéid an ghaoth an aibhleóg a bhruigh sé síos i gcionn a phíopa, agus chuaidh giota de'n aibhleóg dhearg isteach ina shúil. Bhí a shúil an nimhneach agus ní rabh sé ábalta rud ar bith a fheiceáil leithi, agus bhí pian iongantacht ann fosta.An oidhche sin níor chodluigh sé néall. D'éirigh sé ar maidin agus chuaidh sé amach fan teach. Thug buachaill aimsir na comharsan fa dear é, agus d'fhiafruigh do goidé bhí cearr leis. D'innis Roibeaird do, fá mar tharluigh le 'na shúil.Gabh annsoir Shéaimín Ó Beirne i nGleann Mhálanna arsan buachaill tá leigheas léigheas (órtha) an dúileadáin aige. Bhí Séaimín ina chomhnuidhe míle nó míle go leith ó theach Roibeaird agus bhí a shúil comh dona sin nach rabh sé abalta dul fhad leis, acht chualaidh nighean Roibeaird an rud a d'innis an buachaill do a h-athair agus go brathach leithi agus níór bhain sí a méar de a sróin go rabh sí i dtoigh Séaimín Chiteóige.Bhí Seaimín agus a bhean na shuidhe cois\n(continues on next page)\n", "school_info": "School: An Mhálainn Bheag", "metadata": [{"Location:": "Malin Beg, Co. Donegal", "Teacher:": "\nMáire Ní Bheirn, Seosamh Ó Baoighill\n"}, {"Informant": "Anna Morra", "Gender": "female", "Age": "75", "Address": "Malin More, Co. Donegal"}, {"Language": "Irish"}]}, "4427940/4359390/4461535": {"title": "Sore Throat", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0119, Page 303", "Page 303"], "url": "https://www.duchas.ie/en/cbes/4427940/4359390/4461535", "text": "\nRoasted potatoes put into a stocking and around the neck cures a sore throat. Warm water and salt is gurgled in  mouth for a few minutes. Course salt put into a pan and well [?] is put into a woollen stocking and [?] around the neck.\n\n\n\nThe juice of the 'buachaill an tíghe' when [/] and applied to sore eyes is supposed to cure them. Sore eyes bathed in cold black tea are [?] of itch.Rub a stye in the eye with the [?] which is in the mouth in the morning. Prick the stye with a thorn.\n", "school_info": "School: Ceann Breac (C.)", "metadata": [{"Location:": "Canbrack, Co. Mayo", "Teacher:": "\nMrs Ruane, Mrs Ruane\n"}, {"Language": "English"}]}, "4427942/4359620/4462007": {"title": "Cure for Dust in the Eye", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0119, Page 509", "Page 509"], "url": "https://www.duchas.ie/en/cbes/4427942/4359620/4462007", "text": "\nCure for Dust in the Eye. There's no more tender organ in the whole human body than the eye. The eyes are sunk away in two hollows in the head protected by strong bones and by the eyelids at the approach of the slightest danger to them the eyelids close to shut out the danger. When anything does get in, the eye itself does its best to get rid of the foreign matter by floating it away out. Sometimes however try as it may it cannot succeed in getting rid of the trouble and recourse must be had to other means. Of course nowadays we go to the doctor or nurse.In olden times however the person who got dust or other foreign matter in the eye was brought to the house of a knowledgeable man who had the \"cure\" who was skilled in such matter.\n(continues on next page)\n", "school_info": "School: Lios Dubh (B.)", "metadata": [{"Location:": "Lisduff, Co. Mayo", "Teacher:": "\nProinnsias Mac Cuinn\n"}, {"Collector": "Micheál Ó Láimhín", "Gender": "male", "Address": "Lisduff, Co. Mayo"}, {"Language": "English"}]}, "4463715/4374067/4463812": {"title": "A Cure for Sore Eyes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0149, Page 129", "Page 129"], "url": "https://www.duchas.ie/en/cbes/4463715/4374067/4463812", "text": "\nA Cure for Sore Eyes.Sore eyes can be cured in the following way:-Every morning for nine mornings in succession wash them carefully with cold tea without either milk or sugar in it.This treatment cured my neighbour, Brian Hegarty who suffered much from sore eyes two or three years ago.Annie T. Mc Hugh, Derry Hillagh, Castle Hill, Ballina, Co. Mayo.Obtained from Mrs John Mc Huch, Derryhillagh, Castle Hill, Ballina, Co. Mayo.\n", "school_info": "School: Ráth Coille", "metadata": [{"Location:": "Rathkell, Co. Mayo", "Teacher:": "\nAindrias Ó Mórdha\n"}, {"Collector": "Annie T. Mc Hugh", "Gender": "female", "Address": "Derryhillagh, Co. Mayo"}, {"Informant": "Mrs John Mc Hugh", "Gender": "female", "Address": "Derryhillagh, Co. Mayo"}, {"Language": "English"}]}, "4428114/4379451/4465333": {"title": "Leigheasanna chun Do Shúile a Leigheas", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0642, Page 230", "Page 230"], "url": "https://www.duchas.ie/en/cbes/4428114/4379451/4465333", "text": "\nDá mbeadh té istigh agat in cupán ar feadh na h-oidhche agus ar maidin buair a bheadh tú chun do breacfast a itheadh, an té do cimilt de'd súile. Caithfeá é sin a dhéanamh ar feadh trí lá as diadh a chéile. Dá mbeadh an stiff a bheadh laistigh de'n ubh nuair a bheadh sé leath beirthe agus é sin do cimilt de'd shúile agus tamaill bheadh siad leighiste.\n\n\n\nDá mbeadh neanntóga agus gráinne mine agat agus é do bheiriú agus nuair a bheadh siad beiruighthe í do chur in píosa éadaigh agus é do chur le'd dhrom agus é d'fhágaint ann go dtí go mbeadh sé dróidhte agus annsan bheadh sé leighiste.\n\n\n\nD'airigh mé seal an oidhche fé dheire mar gheall ar fearaibh a chuaidh ag iascaireacht oidhche Naomh Mártan. Dubhairt gach aoinne leotha gan dul amach sa bhfarrge mar aon bád beag a théigheann amach ag iascaireacht Oidhche Naomh Mártan báithfidhe iad. Ní rabhadar i bhfad amuigh nuair a d'éirigh stoirm úathbhásach agus do bháthadh na daoine agus do dheineadh brus de'n mbád. Níor chuaidh aoinne amach sa bhfarrge ag iascaireacht oidhche\n(continues on next page)\n", "school_info": "School: Maol an Chóirne, An Rinn", "metadata": [{"Location:": "Mweelahorna, Co. Waterford", "Teacher:": "\nPilib Ó Foghlú\n"}, {"Collector": "Máire Ní Churraoin", "Gender": "female", "Age": "13", "Address": "Ballynacourty South, Co. Waterford"}, {"Informant": "Mártan Ó Mathghamhna", "Gender": "male", "Age": "54", "Address": "Ringville, Co. Waterford"}, {"Language": "Irish"}]}, "4428252/4388517/4466295": {"title": "Local Cures", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1027, Page 092", "Page 092"], "url": "https://www.duchas.ie/en/cbes/4428252/4388517/4466295", "text": "\n(continued from previous page)\nNettles boiled and the water in which they are boiled in drunk, is a good cure for “nettle rash” or “hay fever.”\n\n\n\nLong ago the cure for sore eyes was to wash them in cold tea. The cure for ringworm is to get living worms and let them crawl over the spot and they will take the disease with them.\n", "school_info": "School: Cill Barúin", "metadata": [{"Location:": "Kilbarron, Co. Donegal", "Teacher:": "\nSéan C. Ó Ciaráin\n"}, {"Collector": "Lily Vaughan", "Gender": "female", "Address": "Portnason, Co. Donegal"}, {"Informant": "Edward Vaughan", "Relation": "parent", "Gender": "male", "Address": "Portnason, Co. Donegal"}, {"Language": "English"}]}, "4427996/4365815/4469068": {"title": "Gach Lot agus A Leigheas", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0132, Page 275", "Page 275"], "url": "https://www.duchas.ie/en/cbes/4427996/4365815/4469068", "text": "\n(continued from previous page)\ndun-busladh: Fataí rósta a chur leis.\n\n\n\nnailecín = Preabann siad lé dris é.Dian in a chluas = Cuireann siad \"glycerine\" isteach i spunóg agus téithear e' agus cuirtear isteach ins an gcluais éDéithín Sé an rud is cionntach leis na' ag tógáil mheadhchain trom. Daineann siad naoi nó deich gcinn de luachair agus deanann siad chaca beag agus cuirtear grcis coinneal ar an luachair agus saitheann siad síos ins an gcáca iad Lasann siad iad agus fágann siad an cáca ar béal do ghoile agus cuirreann gloine anuas os cionn an cáca\n\n\n\nEladh nillóg duchán:- Snaite olna a cuir tré cluasa na gcaorach le uisge a tabhairt as na suileRaithneal a bruith agus an sugh a tabhairt don chaora.\n", "school_info": "School: Gaoth Sáile", "metadata": [{"Location:": "Gweesalia, Co. Mayo", "Teacher:": "\nSorcha, Bean Uí Ghamhnáin\n"}, {"Language": "Irish"}]}, "4427999/4366315/4469271": {"title": "Araid an Bhraoinín leis an Salachar a Bhaint as Do Shúil", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0133, Page 284", "Page 284"], "url": "https://www.duchas.ie/en/cbes/4427999/4366315/4469271", "text": "\nSeacht bpaidreacha, seacht n-aibhé Máire agus cré a chur suas go Rí na n-airideaca leis an anachain a thabhairt leis.Airid a chuir Muire ar shúil a MicAr bhruth, ar bhraoinín, ar chealg, ar chaithnín.Ar sgailg de cloich no ar sgailg dhe chrann.Ar speadar mónadh, ar dhust an bhóthair.Ar ribe cinn, ar fhionn nár cat.Tar a Cholm Cille is tabhair an anachan leat.Béidh cupán uisge ar an mbord agat.agus chómh luath is a déarfas tú \"Tar a Cholm Cille is tabhair an anachan leat\" cuirfidh tú séideadh fa'n uisge agus tóigfidh tú blogam de. Annsin caithfidh\n(continues on next page)\n", "school_info": "School: Beannchor Iorrais", "metadata": [{"Location:": "Bangor, Co. Mayo", "Teacher:": "\nMícheál Mac Énrí\n"}, {"Collector": "Eibhlín Ní Mhaoilearca", "Gender": "female", "Address": "Cloontakilla, Co. Mayo"}, {"Informant": "Antoine Ó Maoilearca", "Address": "Cloontakilla, Co. Mayo"}, {"Language": "Irish"}]}, "4428000/4366405/4471418": {"title": "Deireann na Seandaoine Paidir nuair atá Drochaicíd ag Dul thart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0133, Page 373", "Page 373"], "url": "https://www.duchas.ie/en/cbes/4428000/4366405/4471418", "text": "\n(continued from previous page)\nDia agus an Mhaighdéan Glórmar.Mo dhaoine  a thabhairt slán amuigh  agus a istigh.A shabhal ar droch aicideacha agus ó anachan na bliadhna.\n\n\n\nA Mhuire, Mhuire Mháthair Dé.Ta mo shuil go donaA Mhuire, Mhuyire Mháthair Dé.Tá mo shuil go dona.\n\n\n\nDfráilim m'anam duit a ThighearnaAr do dheis láimh a Mhuire BhánThighearna go raibh m'anam.Is na trí h-Aingle is aoirde\n(continues on next page)\n", "school_info": "School: Dubhloch", "metadata": [{"Location:": "Doolough, Co. Mayo", "Teacher:": "\nEibhlín Bean Uí Shioradáin\n"}, {"Collector": "Mártan Ó hEifrín", "Gender": "male", "Address": "Doolough, Co. Mayo"}, {"Informant": "Seán Ó hEifrín", "Relation": "parent", "Gender": "male", "Age": "50", "Address": "Doolough, Co. Mayo"}, {"Language": "Irish"}]}, "4428039/4371074/4474715": {"title": "Cures - Sore Eyes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0143, Page 203", "Page 203"], "url": "https://www.duchas.ie/en/cbes/4428039/4371074/4474715", "text": "\nWhen one's eyes are sore if you wash them with spring water, cold, out of the well, they will cease to be sore. Black tea also cures sore eyes.\n\n\n\nOne night a priest was going out on a sick call. Long ago the mode of convenience that mostly everybody had either horse-back or side-cars. The motor-cars were very scarce and expensive, besides the roads were very bad at this time.This priest took his boy with him to drive him on his side-car. They were passing\n(continues on next page)\n", "school_info": "School: Teampall Mhuire", "metadata": [{"Location:": "Carbad Beg, Co. Mayo", "Teacher:": "\nEithne, Bean Uí Mhaonghaille\n"}, {"Language": "English"}]}, "4428258/4389379/4476917": {"title": "Cure for Sore Eyes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1029, Page 36", "Page 36"], "url": "https://www.duchas.ie/en/cbes/4428258/4389379/4476917", "text": "\nHouse-lick (local name) a herb which grows on this gable of farm houses if applied to sore eyes will cure them. (Note)- It is believed in this district that the house in which “house lick” is growing will never be burned. No 2. There is another herb, called locally “Eye weed” The juice pressed from the stalk of this herb into the sore eyes can cure them.\n\n\n\nNo 3. ForTake ten thorns, (known locally as “stobs”) throw one away. and each day for 9 days daub the eye with one of the remaining nine throwing it in the fire after doing so. While applying the thorn to the eye In the Name of the Father etc. is said\n", "school_info": "School: Behey", "metadata": [{"Location:": "Behy, Co. Donegal", "Teacher:": "\nMeadhbh, Bean Uí Dhochartaigh\n"}, {"Language": "English"}]}, "4428258/4389379/4476918": {"title": "Cure for Sore Eyes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1029, Page 36", "Page 36"], "url": "https://www.duchas.ie/en/cbes/4428258/4389379/4476918", "text": "\nHouse-lick (local name) a herb which grows on this gable of farm houses if applied to sore eyes will cure them. (Note)- It is believed in this district that the house in which “house lick” is growing will never be burned. No 2. There is another herb, called locally “Eye weed” The juice pressed from the stalk of this herb into the sore eyes can cure them.\n\n\n\nNo 3. ForTake ten thorns, (known locally as “stobs”) throw one away. and each day for 9 days daub the eye with one of the remaining nine throwing it in the fire after doing so. While applying the thorn to the eye In the Name of the Father etc. is said\n", "school_info": "School: Behey", "metadata": [{"Location:": "Behy, Co. Donegal", "Teacher:": "\nMeadhbh, Bean Uí Dhochartaigh\n"}, {"Language": "English"}]}, "4428167/4383167/4504783": {"title": "Tobar na Súl - Tubbersool (Eye Well)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0783, Page 129", "Page 129"], "url": "https://www.duchas.ie/en/cbes/4428167/4383167/4504783", "text": "\nTubbersool (Eye Well)V convenient to this place.In centre of an orchard.Drains itself into another well situated along roadside.White thorn bush.Local tradition - Cromwell, when visiting Gormonston Castle, came to well and profaned it by washing his feet in it. He also allowed his horse to pollute well. The well dried up and remained so for many years. A priest visited the place some time after and blessed this well. Immediately the water returned and today it is overflowing.As in Balscadden- people use this water for eye troubles.Mr Howard living nearby supplied me with above information. He has it handed down from his grandfather dating back over 100 years.Same map as other well.\n", "school_info": "School: Balscadden", "metadata": [{"Location:": "Balscaddan, Co. Dublin", "Teacher:": "\nP. Ó Séaghdha, Francis Shaw\n"}, {"Collector": "P. Ó Séaghdha", "Gender": "male", "Occupation": "príomhoide"}, {"Informant": "Mr Howard", "Gender": "male"}, {"Language": "English"}]}, "4497723/4344687/4505815": {"title": "Dust in the Eye", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0086, Page 93", "Page 93"], "url": "https://www.duchas.ie/en/cbes/4497723/4344687/4505815", "text": "\nDUST IN THE EYEIf a person had dust in their eye round Newport Mayo in the olden times and if the eye was swollen and red and painful he went to a man named Dennis Sweeney who lived at Barrack Hill, Newport, Mayo. This man Sweeney got a glass of pure water and a lighted candle and he utled some incantations. The afflicted person had to come three days in succession and then on the third day the dust would come out and Sweeney would show it to a person in the water.\n\n\n\nTHE ROSEThe Rose was a big red lump which appeared somewhere on the body. This Denis Sweeney (see dust) had a cure for this also. He prepared a concoction, some of the ingredients being unsalted butter and herbs which he grew specially in his garden. This was applied to the rose and the lump disappeared.\n\n\n\n(continued from previous page)\n93pulling both ends of the string has been made will loosen out. The loosening of the knot over the animals back was believed to loosen the knot in which the worm was and so a cure was effected.\n", "school_info": "School: Skerdagh, Newport", "metadata": [{"Location:": "Skerdagh Lower, Co. Mayo", "Teacher:": "\nJames Deffely\n"}, {"Language": "English"}]}, "4493706/4412846/4528523": {"title": "Folk Cures and Charms - Consumption", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1096, Page 228", "Page 228"], "url": "https://www.duchas.ie/en/cbes/4493706/4412846/4528523", "text": "\n(continued from previous page)\nperson was \"sound and well today\".Bernard McBride asked him did he know what cured him and he said he did - that the cure was to swallow a live frog. McBride said that he must have been a brave man if he swallowed a frog, and the other replied that it was not so hard as it seemed that in the harvest time there are always tiny little frogs to be found, sometimes no bigger than the nail of one's finger and that a specimen really small could be swallowed alive quite easily.He said that the cure was certain, that he vouched for it from his own personal experience, because the case he had mentioned as having completely recovered on using this remedy was his own father, who, as a young man, in the last stages of consumption, was given this prescription and in desperation tried it - with the amazing result stated.\n\n\n\nThe local name for the plant\n(continues on next page)\n", "school_info": "School: Dubhais", "metadata": [{"Location:": "Dooish, Co. Donegal", "Teacher:": "\n-\n"}, {"Language": "English"}]}, "4493804/4422509/4539650": {"title": "Cures for Rheumatic Pains", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1123, Page 263", "Page 263"], "url": "https://www.duchas.ie/en/cbes/4493804/4422509/4539650", "text": "\n(continued from previous page)\nPut an eel skin on your back where the pains are;\n\n\n\nAnother cure for rheumatic's is to carry a few potatoes about in your pocket.\n\n\n\n(a)  A good cure for \"whoopingcough \" is to drink mares milk three times a day.(b)  Another is to go uder a donkey three times and eat bread from the donkey's mouth and the whooping cough will get better.\n\n\n\n(a)  A good cure for sore eyes is to take ten jags from a gooseberry bush and point nine of them at the eye, and then take the tenth and throw it away.\n\n\n\n(b)  Another cure is to wash your eyes with cold tea.  (c)  Take the top of cream and put sugar along with it and rub it on the sting,\n(continues on next page)\n", "school_info": "School: St Boden's, Culdaff", "metadata": [{"Location:": "Culdaff, Co. Donegal", "Teacher:": "\nDoiminic Ó Duibhne\n"}, {"Collector": "B. Philomena Deeny", "Gender": "female"}, {"Informant": "Lizzie Crampsey", "Gender": "female", "Address": "Culdaff, Co. Donegal"}, {"Informant": "Mrs Deeny", "Gender": "female"}, {"Language": "English"}]}, "4493804/4422509/4539652": {"title": "Cures for Rheumatic Pains", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1123, Page 263", "Page 263"], "url": "https://www.duchas.ie/en/cbes/4493804/4422509/4539652", "text": "\n(continued from previous page)\nPut an eel skin on your back where the pains are;\n\n\n\nAnother cure for rheumatic's is to carry a few potatoes about in your pocket.\n\n\n\n(a)  A good cure for \"whoopingcough \" is to drink mares milk three times a day.(b)  Another is to go uder a donkey three times and eat bread from the donkey's mouth and the whooping cough will get better.\n\n\n\n(a)  A good cure for sore eyes is to take ten jags from a gooseberry bush and point nine of them at the eye, and then take the tenth and throw it away.\n\n\n\n(b)  Another cure is to wash your eyes with cold tea.  (c)  Take the top of cream and put sugar along with it and rub it on the sting,\n(continues on next page)\n", "school_info": "School: St Boden's, Culdaff", "metadata": [{"Location:": "Culdaff, Co. Donegal", "Teacher:": "\nDoiminic Ó Duibhne\n"}, {"Collector": "Kathleen Deeny", "Gender": "female"}, {"Informant": "M. Doherty", "Gender": "unknown", "Address": "Culdaff, Co. Donegal"}, {"Language": "English"}]}, "4493698/4412159/4547152": {"title": "Ortha an Bhraoinín", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1094, Page 228", "Page 228"], "url": "https://www.duchas.ie/en/cbes/4493698/4412159/4547152", "text": "", "school_info": "School: An Árd Leathan", "metadata": [{"Location:": "Altlahan, Co. Donegal", "Teacher:": "\nPádraig Mac Ailin\n"}, {"Collector": "Pádraig Mac Ailin", "Gender": "male", "Occupation": "múinteoir"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "female", "Age": "69"}, {"Language": "Irish"}]}, "4547213/4414034/4547893": {"title": "The Cure for the Rose", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1099, Page 94", "Page 94"], "url": "https://www.duchas.ie/en/cbes/4547213/4414034/4547893", "text": "\nMrs Roseanna Doherty of Goland has the cure for the Rose. The Rose is a big red spot which is very sore and can come on any part of the body. It is very painful. Mrs Doherty's husband left her the cure. He was Francis Doherty and he died a few years ago.Mrs Doherty cured Tommy Boland. She went outside and got three lumps of clay. She took each lump of clay in turn, and rubbed it all over the pot. Each time Tommy made the Sign of the Cross. Mrs Doherty prayed at the same time. This was done on three different days. The Spot the Rose- then burst and healed up.\n\n\n\nMartin of meenashammer can take a mote out of any persons eye without touching that person at all. The person who gets a mote in his eye goes to Peter's house. Peter gets a clean bowl and puts clean cold water in it. Peter puts the bowl of water on the table and then kneels down beside it and prays. After 15 or 20 minutes praying peter stops an shows the bowl of water with the mote in it. The eye is then quite well.\n", "school_info": "School: Mín na Glaise (Meenglass)", "metadata": [{"Location:": "Meenglass, Co. Donegal", "Teacher:": "\nSíle, Bean Uí Mhaolagáin\n"}, {"Informant": "Peter Martin", "Gender": "male"}, {"Language": "English"}]}, "4605923/4602804/4642356": {"title": "The Cure of the Mote", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0202, Page 001", "Page 001"], "url": "https://www.duchas.ie/en/cbes/4605923/4602804/4642356", "text": "\nThe man who tells me this story is very old. He is 80 years old and his name is John Killkenny of Garvagh, Dromahair. He starts the story by saying hat there are many local cures but that there is a very peculiar one that is the cure of the mote. The person who has this cure lives in  Garvagh and his name is James Travers. The people say he is very successful. All that he requires while making this cure is a cup of water and he can show the mote in the water when he was the cure made. This man has  the cure a long time as he inherited it from his mother. Collected by Alice Dolan, Garvagh(?) Dromahais, Co. Lelim(?). Aged 15 yrs.\n", "school_info": "School: Kilavoggy", "metadata": [{"Location:": "Killavoggy, Co. Leitrim", "Teacher:": "\nSeán de Faoite\n"}, {"Collector": "Alice Dolan", "Gender": "female", "Age": "15", "Address": "Garvagh, Co. Leitrim"}, {"Informant": "John Kilkenny", "Gender": "male", "Age": "80", "Address": "Garvagh, Co. Leitrim"}, {"Language": "English"}]}, "4605923/4602807/4642360": {"title": "The Cure of the Strain", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0202, Page 003", "Page 003"], "url": "https://www.duchas.ie/en/cbes/4605923/4602807/4642360", "text": "\n(continued from previous page)\nperson cannot go into any house on the way home. When they go home they have to put the thread on the person who has any part of them strained. Any person who gets the cure made has to give Mrs. Flinn a shilling. The thread cannot be taken off for nine days until the swelling reduces. The thread is burned after nine days.The cure of the mote.My grand-mother Mrs. Annie Kearney Lullycolley Dromahais 74 years of age told me there's a cure for the mote in our district. Martin Travers had the cure of the mote. When he died he had to leave it to his wife. His wife left it to her son P Thomas Dromahais Co. Leitrim. The cure has to be given from husband to wife and from wife to son. The cure of the more cannot be made on Sundays. The cure of the mote can be made without the person going to the house. The cure of the mote is made by prayer and with spring. When the praters are over the more is seen floating on the spring water. Some people say that there's a cure in silk for\n\n\n\nMy Grand-mother Mrs. Annie Kearney Tullycolley Dromahair 74 years of age told me there's a cure for a mote in our district. Martin Travers had the cure of the mote. When he died he had to leave it to his wife. His wife left it to her son P Travers Dromahair Co. Leitrim. The cure has to be given from husband to wife and from wife to son. The cure of the mote  has to be made before sunset. The cure of the mote cannot be made on Sundays. The cure of the mote can be made without the person going to the house. The cure of the mote is made by prayer and with spring. When the prayers are over the mote is seen floating on the spring water. Some people say that there's a cure in silk for\n(continues on next page)\n", "school_info": "School: Kilavoggy", "metadata": [{"Location:": "Killavoggy, Co. Leitrim", "Teacher:": "\nSeán de Faoite\n"}, {"Collector": "Mary Brigid Clinton", "Gender": "female", "Age": "13", "Address": "Tullycoly, Co. Leitrim"}, {"Informant": "Mrs Annie Keavney", "Relation": "grandparent", "Gender": "female", "Age": "74", "Address": "Tullycoly, Co. Leitrim"}, {"Language": "English"}]}, "4605926/4603028/4644310": {"title": "A Cure for a Mote in the Eye", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0202, Page 221", "Page 221"], "url": "https://www.duchas.ie/en/cbes/4605926/4603028/4644310", "text": "\nA Cure for a Mote in the Eye 3:12:37Thomas Gallagher who lives in the townland of Gowlaun has the cure for a mote in the eye. His father left it to him before he died. The cure can be made on any day, but must be made before sunset.It is not necessary for the sufferer to be present when the cure is being made. It is through the prayers which the curer says that the mote is removed from the eye. I am sorry that I have never heard what prayers are said, but I think that it is a secret reserved for the curer only. 1. Farmer's son2. 18 yrs3. Born and reared and the accompanying addressAuthor: Bernard Kelly,Lisnagowan,Tawnylea P.OCo. Leitrim.\n", "school_info": "School: Craoibh Liath", "metadata": [{"Location:": "Creevelea, Co. Leitrim", "Teacher:": "\nMrs Doyle\n"}, {"Informant": "Bernard Kelly", "Gender": "male", "Age": "18", "Occupation": "farmer's son", "Address": "Lisnagowan, Co. Leitrim"}, {"Language": "English"}]}, "4613711/4611224/4644314": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0405, Page 042", "Page 042"], "url": "https://www.duchas.ie/en/cbes/4613711/4611224/4644314", "text": "\n(continued from previous page)\nSoot falling down: Rain is near at hand.\n\n\n\nBlack-tea if rubbed to sore eyes, would cure them.A spit if put under a stone for a pain in the side;If a child had the chin-cough and if a person met a man with a white horse and say to him, \"Man of the white horse what would cure the Chin-Cough\", and whatever the person would say, that would cure the child.Three drops of a blessed candle is dropped into the ear for a pain in it.Parrifin oil if drunk for lumps in the\n(continues on next page)\n", "school_info": "School: Cill Beathach", "metadata": [{"Location:": "Kilbaha Middle, Co. Kerry", "Teacher:": "\nTomás Ó Ceallacháin\n"}, {"Collector": "Eileen Shine", "Gender": "female"}, {"Informant": "John C. Shine", "Relation": "parent", "Gender": "male"}, {"Language": "English"}]}, "4649689/4647446/4650906": {"title": "Cure for Warts", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0211, Page 012", "Page 012"], "url": "https://www.duchas.ie/en/cbes/4649689/4647446/4650906", "text": "\n(continued from previous page)\n12knots and holds one of them.. While the knots are rotting the warts are also going.  This is believed to be a good cure.  Mrs McHugh lives in Drumaragh, Keshcarrigan.James Leddy 14..12..1937.\n\n\n\nA woman who lives in Mohill has a cure for a mote in the eye. First she gets a cup and saucer, and fills the cup with water. Then she kneels down and says prayers. When she has the prayers said, she takes a mouthful of water out of the cup, and throws it out of her mouth in on the saucer. Then the mote can easily be seen in the water on the saucer. This is a good cure, because Eugene Leddy got cured this way.\n", "school_info": "School: Ceis Carraigín", "metadata": [{"Location:": "Keshcarrigan, Co. Leitrim", "Teacher:": "\nTomás Mag Fhionnáin\n"}, {"Collector": "James Leddy", "Gender": "male", "Address": "Drumaragh, Co. Leitrim"}, {"Language": "English"}]}, "4649689/4647451/4651047": {"title": "The Cure of Erysipelas", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0211, Page 017", "Page 017"], "url": "https://www.duchas.ie/en/cbes/4649689/4647451/4651047", "text": "\n(continued from previous page)\nBrigie Doran 18-1-1938.                  Derrien Lloyd.           The cure of the worms              Patrick Killride Dumingna, has the following cure he gets the name of the child and its parents, and writes them down on paper. he says three Hail - marys and while doing so he folds the paper in the shape of an agnus dei which is sewed on the child clothes. this cure is made on Mondays and Thursdays.                  Kathleen Ginty 18-1-1938                      Drumaragh a cure for a mote in the eye.       a mote in the eye can be cured in the following way. pull one eyelid across the other three times and say \"Muire an Bainte \" each time, and the mote will go.        pat Bexrne Shanraw.\n\n\n\nThe Cure of the WormsPatrick Kilbride, Drumingna, has the following cure.  He gets the names of the child, and its parents, and writes them down on paper.  He says three Hail Marys, and while doing so he folds the paper in the shape of an Agnus Dei which is sewed on the child's clothes.  This cure is made on Mondays and Thursdays.  Kathleen Ginty 18..1..1938.Drumaragh.\n\n\n\nA cure for a mote in the eye.  A mote in the eye can be cured in the following way.  Pull one eyelid across the other three times, and say \"Muire an Bainte\" each time and the mote will go. Pat BeirneShanraw.\n", "school_info": "School: Ceis Carraigín", "metadata": [{"Location:": "Keshcarrigan, Co. Leitrim", "Teacher:": "\nTomás Mag Fhionnáin\n"}, {"Collector": "Pat Byrne", "Gender": "male", "Address": "Shanraw, Co. Leitrim"}, {"Language": "English"}]}, "4649698/4648290/4658931": {"title": "Cures - Whooping Cough", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0212, Page 372", "Page 372"], "url": "https://www.duchas.ie/en/cbes/4649698/4648290/4658931", "text": "\na) Go three times under an ass that was never rode.b) Drink ferret's leavings.c) Eat the leavings of a meal of a married couple of the same name.d) If you meet a man riding a grey horse, ask him for a cure for the whooping-cough, whatever he says is a cure will cure the child.\n\n\n\nLet the juice of House Leek fall into the eye.\n", "school_info": "School: Druim Áine", "metadata": [{"Location:": "Drumany (O'Brien), Co. Leitrim", "Teacher:": "\nPádhraic Mac Raghnaill\n"}, {"Collector": "Mai Doherty", "Gender": "female", "Address": "Drumroosk North, Co. Leitrim"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "female", "Age": "41"}, {"Language": "English"}]}, "4658462/4657968/4660575": {"title": "Local Cures - Sore Eyes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0229, Page 010", "Page 010"], "url": "https://www.duchas.ie/en/cbes/4658462/4657968/4660575", "text": "\nSore eyes- There are certain people through the country who have cures for different diseases such as the sprain, jaundice, Erysipelas etc. My grand aunt Miss Briggs who lives in Cloncoose in our house has the cure for sore eyes and it is called eyewater. First she gathers the green leaves of woodbine and boils it in a saucepan, when it is boiled she puts a grain of alum also a teaspoon of sugar in it. Then she puts it in bottles. When the person is using it, he or she puts a drop of it in the eye for a couple of days then it will begin to mend.\n", "school_info": "School: Maghachaidh (Newtowngore)", "metadata": [{"Location:": "Newtowngore, Co. Leitrim", "Teacher:": "\n-\n"}, {"Collector": "Louisa Lowry", "Gender": "female", "Address": "Clooncose, Co. Leitrim"}, {"Language": "English"}]}, "4672107/4670889/4672831": {"title": "Local Cures - Eye Trouble", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0171, Page 049", "Page 049"], "url": "https://www.duchas.ie/en/cbes/4672107/4670889/4672831", "text": "\nIf a person had sore eyes and to wash them with cold black tea they would get better. If a person had a stye on his eye he would get rid of it by getting ten thorns off a gooseberry bush and pointing nine of them to the stye and then throwing the tenth one in the fire.Skin diseases:- Unsalted butter and sulphur is a cure for eczema. If a person had the rose which is taken on the arms and legs he could cure it by rubbing a mixture of herbs and unsalted butter on the spot.Ring-wormThere lived in Dereens a woman named Mrs Wynn who had a cure for ring-worm. The person who wanted to be cured and the woman who had the cure would go out in the open air before sunrise and would go on their knees. Mrs Wynne would then draw her breath three times on the sore and say certain prayers. This had to be done on Monday and Thursday.\n", "school_info": "School: Cloonacool", "metadata": [{"Location:": "Cloonacool, Co. Sligo", "Teacher:": "\nSeán Ó Blioscáin\n"}, {"Collector": "Rita Davitt", "Gender": "female"}, {"Language": "English"}]}, "4678382/4674194/4687838": {"title": "Paidear le Rá dá Raghadh Smál id Shúil", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0418, Page 252", "Page 252"], "url": "https://www.duchas.ie/en/cbes/4678382/4674194/4687838", "text": "\nPaidear le rádh dá raghadh smál id' shuil.Tá rud fem' shúil ; Dia ó's mo chionn, Muire Mháthair ar a dhá glúin, is go mbainidh sibh an rud óm' shúil.\n\n\n\nPaidear roimh Dhul a chodhla chun ná beadh tromluighe ort.Anna, Máthair Muire; Muire Máthair Chríost, Eilisabet, Máthair Eóin Baiste, Crann ar a crochadh Críost, cuirimse iad san idir me a's chnaisde na leabthan, 'om shaoradh ar an dtromluighe.\n\n\n\nPaidéar le Rádh Lá Coille.Úrnaighthe a múineadh im leanbh dom féin Is me im' dhúiseacht le duthracht ar gairm na n-éan,Mo ghlúin dheas a leigint chúgham ag guidheachtaint chun Dé, Is chun an Úr Mhac a bhí go túirseach ag sileadh as an ngéig. Rí na nAsbol is na nAingeal is a bháb na gcléirRí na nAsbol do bhaisteadh 'na leanbh gan áireamh bliadhan,Miasma loirgimse ort a Mhic Athair na nGrast bí fial,Tabair an trócaire dom anam is maith dom ar dearnas riamh.\n", "school_info": "School: An Bloscaod Mór", "metadata": [{"Location:": "Great Blasket Island, Co. Kerry", "Teacher:": "\nMáire Nic Gearailt\n"}, {"Language": "Irish"}]}, "4701663/4690749/4706489": {"title": "The Wart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0156, Page 027", "Page 027"], "url": "https://www.duchas.ie/en/cbes/4701663/4690749/4706489", "text": "\n(continued from previous page)\non the wart and leave there united, until it falls off. Another is to rub raw potatoes on it. Another is to rub them with washing soda.\n\n\n\nOnly one in this district possesses this cure which he performs as follows.  Supposing you get a mote - say dust, sand, hayseed or such like, you go to him.  He then goes to one room and says some prayers.  He then comes down to where you are and has a look at your eye.  He then gets a vessel\n(continues on next page)\n", "school_info": "School: Caisleán Gael", "metadata": [{"Location:": "Castlegal, Co. Sligo", "Teacher:": "\nM. Ó Tiománaidhe\n"}, {"Informant": "Owen Leonard", "Gender": "male", "Age": "74", "Address": "Bunduff, Co. Leitrim"}, {"Language": "English"}]}, "4701665/4691091/4707831": {"title": "The Cure of the Mote", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0157, Page 035", "Page 035"], "url": "https://www.duchas.ie/en/cbes/4701665/4691091/4707831", "text": "\nThe Cure of the MoteThe cure of the mote is a common old cure which has been handed to us from our forefathers. The person making the cure gets a cupful of water and a saucer and holds the cupful of water in the right hand and holds the saucer in the left hand.  He says some prayers in Irish and takes a sip of water and spits it into the saucer.  He then looks sharply to see if there is anything like a mote in the water.If there is not a mote in the water, he continues praying until he sees some speck or dark particle in the water.  This dark particle in the water is said to be the mote and that the cure is now completed and it is successful and the mote is gone out of the eye.  That is what is done for the cure of the mote in the eye.  This cure is handed down from one person to another one of the opposite sex.Told by Dan McGowan, Drinaghan.Written in by Mary Margaret McGowan (age 13 years)\n", "school_info": "School: Druimín (Drummons)", "metadata": [{"Location:": "Drummans, Co. Leitrim", "Teacher:": "\nMártan Mac Gabhann\n"}, {"Collector": "Mary Maragaret Mc Gowan", "Gender": "female", "Age": "13"}, {"Informant": "Dan Mc Gowan", "Gender": "male", "Address": "Drinaghan, Co. Sligo"}, {"Language": "English"}]}, "4701699/4693663/4713455": {"title": "Local Cures - Mote in the Eye", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0169, Page 115", "Page 115"], "url": "https://www.duchas.ie/en/cbes/4701699/4693663/4713455", "text": "\nA mote in the eye was and is cured in this district by a man called Mr John Lynch Farniharpy, Skreen, Co, Sligo. The cure is:- get a cup and saucer take a drink of water and the man that has the cure says prayers and when he has finished the mote leaves the eye.\n\n\n\nToothache was and is cured in this district. The last boy that cured it was John Edie James. He got a frog and put him in his mouth and he never had toothache since that day. It was when going to school he got the frog.\n", "school_info": "School: Dún Flainn", "metadata": [{"Location:": "Doonflin Upper, Co. Sligo", "Teacher:": "\nSeán Ó Maolagáin\n"}, {"Language": "English"}]}, "4701749/4698691/4724933": {"title": "Jaundice", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0183, Page 415", "Page 415"], "url": "https://www.duchas.ie/en/cbes/4701749/4698691/4724933", "text": "\nThere is a plant known as the barberry tree which is a cure for yellow jaundice. The bark must be peeled off the tree and boiled in milk and when drank is a sure cure for this disease.\n\n\n\nA fasting spit is supposed to cure sore eyes or sore lips.\n", "school_info": "School: Knockminna", "metadata": [{"Location:": "Knockmoynagh, Co. Sligo", "Teacher:": "\nMáire Ní Scannláin\n"}, {"Informant": "Mr Peter Berreen", "Gender": "male", "Address": "Lavally, Co. Sligo"}, {"Language": "English"}]}, "4701657/4690240/4725385": {"title": "The Cure of the Mumps", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0155, Page 0548", "Page 0548"], "url": "https://www.duchas.ie/en/cbes/4701657/4690240/4725385", "text": "\nYears ago when a person was suffering from the \"Mumps\" somebody got an ass's halter and led the sick person to a three mearing water. Then the sick person drank three drinks of this water saying while doing so \"In the name of the Father, and of the Son, and of the Holy Ghost, Amen\" three times, namely one time for each drink.Within a day's time the sick person was completely cured.\n\n\n\nA man named Francis Healy who lives in the townland of Crearyheel, Parish of Ahamlish,\n(continues on next page)\n", "school_info": "School: Cliffoney (B.)", "metadata": [{"Location:": "Cliffony, Co. Sligo", "Teacher:": "\nPatrick Mc Hugh\n"}, {"Collector": "Patrick Mc Hugh", "Gender": "male", "Occupation": "múinteoir", "Address": "Cliffony, Co. Sligo"}, {"Informant": "Roddy Burns", "Gender": "male", "Age": "56", "Address": "Cloysparra, Co. Sligo"}, {"Language": "English"}]}, "4701685/4692575/4728184": {"title": "Local Cures - Sore Back", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0161, Page 170", "Page 170"], "url": "https://www.duchas.ie/en/cbes/4701685/4692575/4728184", "text": "\nAbout three miles from Ballyfarnon there is a holy well called Lossar.  At this there is a big flagstone resting on two others, each about a foot high.  Anyone going under this will never suffer from a sore back.                                   (W. Meehan)\n\n\n\n(a)  Cold tea                     (J. Monaghan)(b)  Wash a carrot, eat it raw, skins and all                                          (J. Sweeney)\n\n\n\nHold it in \"boiling\"  potato water                                                                    (Th. Lacey)\n\n\n\n(a)  Gargle with salt and water                                                    (P. McLoughlin)(b)  Garlic.  The skin of an eel  (Foley)                                         (J. Harte)\n\n\n\n(a)  Place the hand in a swiftly flowing stream                            (v. Conolly)(b)  Do                              (Beirne)\n\n\n\n(a)  The sufferer came to a man who made \"healing line\" which is a plain piece of twine, which the man makes charms over.  You bind it round the wrist and leave it there till cured.        (Fr. Devins)(b)  Let tap run over it.            (M. Hunt)\n", "school_info": "School: Scoil na mBráthar Sligeach (Sráid na Céibhe)", "metadata": [{"Location:": "Quay Street, Co. Sligo", "Teacher:": "\nAn Br. Ó Cearbhaill\n"}, {"Collector": "J. Monaghan"}, {"Collector": "J. Sweeney"}, {"Language": "English"}]}, "4701705/4694405/4760406": {"title": "Taking Lime out of the Eye", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0170, Page 0420", "Page 0420"], "url": "https://www.duchas.ie/en/cbes/4701705/4694405/4760406", "text": "\nAuthentic Story.About 65 years ago, Mrs. James Kennedy of Bunnacranagh, Curry, Co. Sligo, wife of James Kennedy N.J (who is now dead) received a small piece of lime in her eye. All efforts to remove it proved unavailing. Her son, John F. Kennedy, late principal of this school, then a young boy was sent to the neighbouring village of Fuel to consult a \"wise woman\" and invoke her help. Having heard the story, she took a basin of water, said words over it, and calling the young boy to the basin showed him the lime floating in the water. On arriving home, he found that his mother's eye was free from the speck of lime.Told my Miss Ethel Kennedy N.J Cowry Boy's S. who is a grand-daughter of the Mrs James Kennedy in question.\n", "school_info": "School: Curraigh (B.)", "metadata": [{"Location:": "Curry, Co. Sligo", "Teacher:": "\nPeadar Ó Braonáin\n"}, {"Collector": "Peter Brenann", "Gender": "male", "Occupation": "teacher"}, {"Informant": "Miss Ethel Kennedy", "Gender": "female"}, {"Language": "English"}]}, "4742145/4740418/4780138": {"title": "Hidden Treasure at the White Gates", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0771, Page 050", "Page 050"], "url": "https://www.duchas.ie/en/cbes/4742145/4740418/4780138", "text": "\n(continued from previous page)\nThe \"White Gates\" are between Clonard and Moyvalley and the old road mentioned is off the Dublin-Mullingar main road.\n\n\n\nThere is a stone in Anneville (near Longwood) and there is always water in it. This water cures warts. if you get a pin and dip it in the water and then stick it in the wart, after a short time the wart will disappear\n\n\n\nA Fly in the EyeThere is a woman in Longwood and if you get a piece of dirt or a fly in your eye she will remove it. All you have to do is write to her. When she gets the letter the piece of dirt will fall on it\n", "school_info": "School: Broadford, Moyvalley", "metadata": [{"Location:": "Broadford, Co. Kildare", "Teacher:": "\nDónall Ó Buachalla\n"}, {"Language": "English"}]}, "4742157/4740759/4780856": {"title": "Local Cures - Sore Eyes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0773, Page 019", "Page 019"], "url": "https://www.duchas.ie/en/cbes/4742157/4740759/4780856", "text": "\n1. Rub vaseline on a shut eye that is sore\n\n\n\n2. Wash with cold tea or Borax Lint\n\n\n\n3. For a stye, get nine goose berry thorns point them to the eye three times after each time you do it throw one away and say in the name of the Father and of the Son and of the Holy Ghost.\n\n\n\n4. Bathe your eyes every morning with spring water.\n\n\n\n5. Rub a wedding ring on a stye.\n\n\n\n6. Grit or sand in your eye put a drop of castor oil in corner of eye keep shut for 10 minutes\n\n\n\n7. Sore eyes bathe in St. Patrick's well Celbridge hang cloth on bush.8. Steep eyes in cold strong tea\n", "school_info": "School: Kildraught (2)", "metadata": [{"Location:": "Celbridge, Co. Kildare", "Teacher:": "\nE. Ní Armhultaigh\n"}, {"Informant": "Mr J. Byrne", "Gender": "male", "Address": "Newcastle, Co. Dublin"}, {"Language": "English"}]}, "4742157/4740759/4780857": {"title": "Local Cures - Sore Eyes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0773, Page 019", "Page 019"], "url": "https://www.duchas.ie/en/cbes/4742157/4740759/4780857", "text": "\n1. Rub vaseline on a shut eye that is sore\n\n\n\n2. Wash with cold tea or Borax Lint\n\n\n\n3. For a stye, get nine goose berry thorns point them to the eye three times after each time you do it throw one away and say in the name of the Father and of the Son and of the Holy Ghost.\n\n\n\n4. Bathe your eyes every morning with spring water.\n\n\n\n5. Rub a wedding ring on a stye.\n\n\n\n6. Grit or sand in your eye put a drop of castor oil in corner of eye keep shut for 10 minutes\n\n\n\n7. Sore eyes bathe in St. Patrick's well Celbridge hang cloth on bush.8. Steep eyes in cold strong tea\n", "school_info": "School: Kildraught (2)", "metadata": [{"Location:": "Celbridge, Co. Kildare", "Teacher:": "\nE. Ní Armhultaigh\n"}, {"Informant": "Mrs Anderson", "Gender": "female", "Address": "Celbridge, Co. Kildare"}, {"Language": "English"}]}, "4742157/4740759/4780859": {"title": "Local Cures - Sore Eyes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0773, Page 019", "Page 019"], "url": "https://www.duchas.ie/en/cbes/4742157/4740759/4780859", "text": "\n1. Rub vaseline on a shut eye that is sore\n\n\n\n2. Wash with cold tea or Borax Lint\n\n\n\n3. For a stye, get nine goose berry thorns point them to the eye three times after each time you do it throw one away and say in the name of the Father and of the Son and of the Holy Ghost.\n\n\n\n4. Bathe your eyes every morning with spring water.\n\n\n\n5. Rub a wedding ring on a stye.\n\n\n\n6. Grit or sand in your eye put a drop of castor oil in corner of eye keep shut for 10 minutes\n\n\n\n7. Sore eyes bathe in St. Patrick's well Celbridge hang cloth on bush.8. Steep eyes in cold strong tea\n", "school_info": "School: Kildraught (2)", "metadata": [{"Location:": "Celbridge, Co. Kildare", "Teacher:": "\nE. Ní Armhultaigh\n"}, {"Informant": "Mr Hogan", "Gender": "male", "Address": "Celbridge, Co. Kildare"}, {"Language": "English"}]}, "4742157/4740759/4780860": {"title": "Local Cures - Sore Eyes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0773, Page 019", "Page 019"], "url": "https://www.duchas.ie/en/cbes/4742157/4740759/4780860", "text": "\n1. Rub vaseline on a shut eye that is sore\n\n\n\n2. Wash with cold tea or Borax Lint\n\n\n\n3. For a stye, get nine goose berry thorns point them to the eye three times after each time you do it throw one away and say in the name of the Father and of the Son and of the Holy Ghost.\n\n\n\n4. Bathe your eyes every morning with spring water.\n\n\n\n5. Rub a wedding ring on a stye.\n\n\n\n6. Grit or sand in your eye put a drop of castor oil in corner of eye keep shut for 10 minutes\n\n\n\n7. Sore eyes bathe in St. Patrick's well Celbridge hang cloth on bush.8. Steep eyes in cold strong tea\n", "school_info": "School: Kildraught (2)", "metadata": [{"Location:": "Celbridge, Co. Kildare", "Teacher:": "\nE. Ní Armhultaigh\n"}, {"Informant": "Mr Doyle", "Gender": "male", "Address": "Celbridge, Co. Kildare"}, {"Language": "English"}]}, "4742157/4740759/4780861": {"title": "Local Cures - Sore Eyes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0773, Page 019", "Page 019"], "url": "https://www.duchas.ie/en/cbes/4742157/4740759/4780861", "text": "\n1. Rub vaseline on a shut eye that is sore\n\n\n\n2. Wash with cold tea or Borax Lint\n\n\n\n3. For a stye, get nine goose berry thorns point them to the eye three times after each time you do it throw one away and say in the name of the Father and of the Son and of the Holy Ghost.\n\n\n\n4. Bathe your eyes every morning with spring water.\n\n\n\n5. Rub a wedding ring on a stye.\n\n\n\n6. Grit or sand in your eye put a drop of castor oil in corner of eye keep shut for 10 minutes\n\n\n\n7. Sore eyes bathe in St. Patrick's well Celbridge hang cloth on bush.8. Steep eyes in cold strong tea\n", "school_info": "School: Kildraught (2)", "metadata": [{"Location:": "Celbridge, Co. Kildare", "Teacher:": "\nE. Ní Armhultaigh\n"}, {"Informant": "Mrs Anderson", "Gender": "female", "Address": "Celbridge, Co. Kildare"}, {"Language": "English"}]}, "4742157/4740759/4780862": {"title": "Local Cures - Sore Eyes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0773, Page 019", "Page 019"], "url": "https://www.duchas.ie/en/cbes/4742157/4740759/4780862", "text": "\n1. Rub vaseline on a shut eye that is sore\n\n\n\n2. Wash with cold tea or Borax Lint\n\n\n\n3. For a stye, get nine goose berry thorns point them to the eye three times after each time you do it throw one away and say in the name of the Father and of the Son and of the Holy Ghost.\n\n\n\n4. Bathe your eyes every morning with spring water.\n\n\n\n5. Rub a wedding ring on a stye.\n\n\n\n6. Grit or sand in your eye put a drop of castor oil in corner of eye keep shut for 10 minutes\n\n\n\n7. Sore eyes bathe in St. Patrick's well Celbridge hang cloth on bush.8. Steep eyes in cold strong tea\n", "school_info": "School: Kildraught (2)", "metadata": [{"Location:": "Celbridge, Co. Kildare", "Teacher:": "\nE. Ní Armhultaigh\n"}, {"Informant": "Master R. Flood", "Gender": "male", "Address": "Celbridge, Co. Kildare"}, {"Language": "English"}]}, "4742157/4740759/4780864": {"title": "Local Cures - Sore Eyes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0773, Page 019", "Page 019"], "url": "https://www.duchas.ie/en/cbes/4742157/4740759/4780864", "text": "\n1. Rub vaseline on a shut eye that is sore\n\n\n\n2. Wash with cold tea or Borax Lint\n\n\n\n3. For a stye, get nine goose berry thorns point them to the eye three times after each time you do it throw one away and say in the name of the Father and of the Son and of the Holy Ghost.\n\n\n\n4. Bathe your eyes every morning with spring water.\n\n\n\n5. Rub a wedding ring on a stye.\n\n\n\n6. Grit or sand in your eye put a drop of castor oil in corner of eye keep shut for 10 minutes\n\n\n\n7. Sore eyes bathe in St. Patrick's well Celbridge hang cloth on bush.8. Steep eyes in cold strong tea\n", "school_info": "School: Kildraught (2)", "metadata": [{"Location:": "Celbridge, Co. Kildare", "Teacher:": "\nE. Ní Armhultaigh\n"}, {"Informant": "Mrs Hamilton", "Gender": "female", "Address": "Celbridge, Co. Kildare"}, {"Language": "English"}]}, "4769972/4763383/4785068": {"title": "Boils", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0780, Page 242", "Page 242"], "url": "https://www.duchas.ie/en/cbes/4769972/4763383/4785068", "text": "\nBoils  Mix some salt sugar and a cabbage leaf and apply mixture to boil.\n\n\n\nWounds  An old cure for wounds is a weed called Bog Cotton which grows in the Bog. People had to use it long ago in the war to cure wounds.\n\n\n\nBlood Poison  There is a weed called \"Soldiers\" Plaintain. Squeeze the leaves of this plant in your hand and put the joice in the cut and it will be cured.\n\n\n\nSting of Nettles  Dock-leaf - saying Dockety, Dockety, take the sting of a nettle away.\n\n\n\nWhitlow  Rub it with a roasted potato.\n\n\n\nrub a roasted fig on it\n\n\n\napply some roasted salt in a black stocking\n\n\n\nsmoke off blessed turf is good.\n", "school_info": "School: Kilcullen (Convent)", "metadata": [{"Location:": "Kilcullen, Co. Kildare", "Teacher:": "\nNa Siúracha\n"}, {"Collector": "Patsy Dix", "Gender": "female"}, {"Language": "English"}]}, "4723871/4721010/4786314": {"title": "Those in Locality with Cure for Sprain", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0954, Page 067", "Page 067"], "url": "https://www.duchas.ie/en/cbes/4723871/4721010/4786314", "text": "\nThose in locality with cure of sprain:-1. Mick Caulfield, Derrynamph.2. Mary Meehan, Gola.3. Tommy Connolly (Wee) Derryarritt?\n\n\n\nCure for mote in the eye.1. John Cleirkin, Derrynamph.\n\n\n\nBefore shaving - make a sign of the Cross in the ashes, also sprinkle ashes on the fingers before taking up the razor.\n\n\n\nNoggin-making was a trade in itself and a cooper was unskilled in the art. The noggin was as large as a bowl and was tub shaped.It was bound with wooden hoops and had a vertical handle. The noggin was used as a milking vessel\n(continues on next page)\n", "school_info": "School: Cill an Charnáin", "metadata": [{"Location:": "Killycarnan North, Co. Monaghan", "Teacher:": "\nMrs Meehan\n"}, {"Language": "English"}]}, "4742056/4731349/4815577": {"title": "Cures - Toothache", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0957, Page 113", "Page 113"], "url": "https://www.duchas.ie/en/cbes/4742056/4731349/4815577", "text": "\nToothacheIf you throw each tooth over your left shoulder as it falls out you will never suffer from toothache.A cut.Get a dog to lick the cut.Place a clean cobweb over the wound.Wet brown paper and place it on the cut.Sore eyesBathe the eyes in Limewater or cold black tea first thing every morning.Ring wormRub the ring worm with a gold wedding ring.\n\n\n\nGet a dog to lick the cutPlace a clean cob web over the woundWet brown paper and place it on the cut\n\n\n\nBathe the eyes in Lime water or cold black tea first thing every morning.\n\n\n\nRub the ring worm with a gold wedding ring.\n", "school_info": "School: Monaghan (Christian Bros.)", "metadata": [{"Location:": "Monaghan, Co. Monaghan", "Teacher:": "\nM. Ó Floinn\n"}, {"Language": "English"}]}, "4742109/4736814/4816653": {"title": "Calves withs Worms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0471, Page 276", "Page 276"], "url": "https://www.duchas.ie/en/cbes/4742109/4736814/4816653", "text": "\nMake a certain knot three times over the calf.\n\n\n\nCumfry and Limber-wood was a great cure for sore eyes. But comfry was deadly poison to all domestic animals. It had to be grown and cultivated in gardens\n\n\n\nSugrues Plaster was a great cure for any mattery sore. It was made by my grandfather and he learned it from Michael Sugrue of Gleanagalough. The first one it cured was my great grandmotherIngredientsa piece of Mutton sueta quart of Linseed oila square of fancy Carbolic soap1/2 comb of honeyA piece of elm bark.\n(continues on next page)\n", "school_info": "School: Kilgobnet (C.)", "metadata": [{"Location:": "Kilgobnet, Co. Kerry", "Teacher:": "\nEibhlín, Bean Uí Fhoghladha\n"}, {"Language": "English"}]}, "4798695/4790899/4922426": {"title": "An Old Cure", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0244, Page 314", "Page 314"], "url": "https://www.duchas.ie/en/cbes/4798695/4790899/4922426", "text": "\nLong ago there were no doctors in Ireland the old people had a lot of cures.One of the cures were a  healing leaf. When a person has a sore it is a very good cure to put one of those leaves on the sore. It is a green leaf which grows in the fields and is supposed to be very good for any sore.\n\n\n\nIn the village of Clonbard there is a well. Many people go to this well to get their eyes washed because it is supposed to cure eyes. One day some gentlemen were out shooting and this particular man asked one of his servants what were the people coming to the well for and the servant told him the reason.The gentleman has a dog with one eye so they called him and washed his eyes and the dog recovered his sight. The owner of the dog lost his sight and was blind for the remainder of his days.\n", "school_info": "School: Cill Mhuire", "metadata": [{"Location:": "Kilmurry, Co. Roscommon", "Teacher:": "\nMáire, Bean Uí Ruairc\n"}, {"Informant": "M. Lavin", "Address": "Lissalway, Co. Roscommon"}, {"Language": "English"}]}, "4811582/4799037/4928127": {"title": "Local Cures", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0260, Page 245", "Page 245"], "url": "https://www.duchas.ie/en/cbes/4811582/4799037/4928127", "text": "\n(continued from previous page)\nAnnie Dowd, Cloonee, Ballymoe.\n\n\n\nThe March snow water is kept as a cure for sore eyes.A whitlow on one's finger is bathed in lamp oilRoasted chicken-weed is a cure for the mumps Long ago a mam with a white horse was asked to give a cure for the chin-cough and whatever he said was supposed to cure it. Another cure was to put a frog in a bottle and as the frog would be dying the chin-cough would be getting better A horse-hair was wound round a wart to cure it.Warm salt in a poultice is a cure for sore throats Warm wool dipped in castor-oil is a cure for a pain in the ear.The gall of a pig is good for a burn.Turpentine is good for a pain\n(continues on next page)\n", "school_info": "School: Drumatemple (C.)", "metadata": [{"Location:": "Drumatemple, Co. Roscommon", "Teacher:": "\nTreasa, Bean Uí Chuinn\n"}, {"Collector": "Annie Marnell", "Gender": "female", "Address": "Bookalagh, Co. Galway"}, {"Language": "English"}]}, "4922085/4850893/4946392": {"title": "Local Cures - Sore Hands", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0520, Page 191", "Page 191"], "url": "https://www.duchas.ie/en/cbes/4922085/4850893/4946392", "text": "\n(continued from previous page)\nwill go away.\n\n\n\nWhen you cut your finger hold it up over your head for ten minutes.\n\n\n\nIf a person has a sore eye he gets the tealeaves that are left after the tea, and puts them to it.  First, the eye is washed, and then the tealeaves are put to it, with a bandage.\n\n\n\nIf you have a sty in your eye,the old people say it will be better by looking out through a gold ring.  After looking through the ring then make a sign of the cross three times over\n(continues on next page)\n", "school_info": "School: Cappamore (B.)", "metadata": [{"Location:": "Cappamore, Co. Limerick", "Teacher:": "\nJames McCarthy\n"}, {"Collector": "P. O' Donoghue"}, {"Collector": "J. Mulcahy"}, {"Language": "English"}]}, "4922096/4852095/4946727": {"title": "Eye Cures", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0524, Page 004", "Page 004"], "url": "https://www.duchas.ie/en/cbes/4922096/4852095/4946727", "text": "\nThe old people believed that if you had sore eyes to look through a marrage ring three times and they would be cured There is a well in our field and they say that if you rubbed the water of this well to your eyes they would be cured if they were sore.They old people also believed that if you picked a sty with a gooseberrie thorn it would be curedIt is said if you bathe sore eyes in cold tea black it cures them.Some people say that a fasting-spit rubbed once every day for three days would cure sore eyes. Mary Mc guireBarrington's BrideLisnagryBo LimerickThere cures were told to me by:Mrs McGuireBarrington's BridgeLinsnagry Bo limerick\n", "school_info": "School: Ahane (C.) Lisnagry", "metadata": [{"Location:": "Ahane, Co. Limerick", "Teacher:": "\nL. T. Walsh\n"}, {"Collector": "Mary Mc Guire", "Gender": "female", "Address": "Barringtonsbridge, Co. Limerick"}, {"Informant": "Mrs Mc Guire", "Gender": "female", "Address": "Barringtonsbridge, Co. Limerick"}, {"Language": "English"}]}, "4811610/4801871/4947442": {"title": "Leigheasanna", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0276, Page 142", "Page 142"], "url": "https://www.duchas.ie/en/cbes/4811610/4801871/4947442", "text": "\nThe feochadán is good for measles. One day long ago a man was very bad with measles. He was a very poor, and could not pay a doctor to come to cure.His wife went out and dug a \"feocadán\" root. Sh brought it in and boiled it well. When all the root was boiled She gave the water of it to her husband. A few hours after the man was better.\n\n\n\n4/ If a person had sore eyes it is very good to bless them with your spit every morning before breakfast, They would cure. It is also a cure for sore eyes to bless them every morning.\n(continues on next page)\n", "school_info": "School: Cill Mhic Eoghain", "metadata": [{"Location:": "Kilmackowen, Co. Cork", "Teacher:": "\nDomhnall Ó Hurdail\n"}, {"Language": "English"}]}, "4922101/4852372/4948242": {"title": "Local Cures - Jaundice", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0525, Page 004", "Page 004"], "url": "https://www.duchas.ie/en/cbes/4922101/4852372/4948242", "text": "\nJaundice1. It was cured by boiling a certain weed out of a graveyard in water. Then give the liquid to the person with the disease.2. It was also cured by mixing goose droppings and stout together and drinking the mixturePeggy Halpin 16.11.1937\n\n\n\nCorns These were cured by steeping an ivy leaf in vinegar and applying it to the corn.Peggy Halpin 11.11.1937\n\n\n\nSore EyesThere were cured by getting a plant called robin-run-the-hedge. This was boiled in water and the person washed their eyes in the liquid. This is how sore eyes were cured. Bridget O'Connell22.11.1937\n", "school_info": "School: Domhnach Mór, Luimneach", "metadata": [{"Location:": "Donaghmore, Co. Limerick", "Teacher:": "\nAingeal Nic Aodha Bhuidhe\n"}, {"Collector": "Bridget O' Connell", "Gender": "female"}, {"Language": "English"}]}, "4922121/4854131/4950987": {"title": "Another Event of Later Date is Told Also", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0530, Page 346", "Page 346"], "url": "https://www.duchas.ie/en/cbes/4922121/4854131/4950987", "text": "\nA gentleman residing in Old Court began tunnelling operation for a ram drain in his residence. The work was begun near St. Columb's well (and the ground through which the work was being carried out was monastic land). Human bones were dug up during the operations. One day a pious farmer was passing by and seeing the human bones thrown in a desecrated heap cautioned the workers. He reminded them that evil would befall them for interfering with the site of the holy well. They replied that they had to do the work for their master, and hoped no misfortune would come to them on that account. The drain was never finished and he who was responsible for the work ended his days in insanity.\n\n\n\nAbout the year 1700 a man named Patrick Griffin owned the field where the eyewell is situated. In order to prevent the crowds of pilgrims from trespassing on his land he closed the well by shovelling earth into it.  Immediately he became blind.  About a month later his wife ordered him to re-open the well.  She led him down to it and when all the earth was removed from the closed well the man's sight was restored.Brigid Parkinson, Slevoyre, Terryglass\n", "school_info": "School: Tír-Dhá-Ghlas (Terryglass)", "metadata": [{"Location:": "Terryglass, Co. Tipperary", "Teacher:": "\nSeán Ó Gliasáin\n"}, {"Informant": "Brigid Parkinson", "Gender": "female", "Address": "Slevoir, Co. Tipperary"}, {"Language": "English"}]}, "4770004/4766042/4956479": {"title": "Cures in Olden Times - Sore Eyes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0828, Page 108", "Page 108"], "url": "https://www.duchas.ie/en/cbes/4770004/4766042/4956479", "text": "\n1; A person with a sore eye washed it night and morning with cold tea. Clay was steeped in buttermilk. This was allowed to settle and was then applied to the eye. For a stye the eye was pricked with a gooseberry thorn. A stye may also be removed by looking through a gold ring at a green leaf and making the Sign of the Cross with the ring over the eye for three mornings in succession. Of this cure I have had experience myself on several occasions.2; A cure for a sore eyes is clay which was steeped in buttermilk applied to them.3; A tea made from oaten meal is also a very good cure for sore eyes, when bathed frequently with it.\n", "school_info": "School: St John of God Convent, Rathdowney", "metadata": [{"Location:": "Rathdowney, Co. Laois", "Teacher:": "\nThe Sisters\n"}, {"Language": "English"}]}, "4922139/4856040/5012321": {"title": "Sore Eyes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0536, Page 249", "Page 249"], "url": "https://www.duchas.ie/en/cbes/4922139/4856040/5012321", "text": "\n1. A cure for sore eyes is wash with cold black tea.2. The water in which young ivy leave's have been boiled.3. A herb which grow's on a rock called stone crop when pounded and the juice extracted, the juice is used as a wash for sore eyes.\n\n\n\n1. Place a dockleaf over the sore on the lip.2. A blade of \"ribbed grass\" does equally well.\n", "school_info": "School: Ballinree, Nenagh", "metadata": [{"Location:": "Ballinree, Co. Tipperary", "Teacher:": "\nPatrick Ahern\n"}, {"Language": "English"}]}, "4922254/4864467/5021102": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0568, Page 138", "Page 138"], "url": "https://www.duchas.ie/en/cbes/4922254/4864467/5021102", "text": "\nMy townland is Ballynavin. The barony of of it is Iffa and Offa east. About seventy years ago there were 30 families living there and now there are only five. There was a man there named Jim Keane who was seventy years when he died. He was able to tell many Irish stories. He was not able to speak English. Ard Glass was its name before and it was changed to Ballynavin. Jim Keane composed a song about Ballynavin called the Gow Geal Bawn. There was a man named English killed near a gap in Ballynavin and the gap was called the English Gap.\n\n\n\nA cure for sore eyes is to pick the small flowers off Rose Mary bush put them in a bottle with a little water. Put the bottle where the south sun will shine on the bottle. Leave the bottle until the flowers are dissolved. Then rub it to the sore eyes and it is said that it will cure them.\n", "school_info": "School: Newtownanner, Cluain Meala", "metadata": [{"Location:": "Newtownanner Demesne, Co. Tipperary", "Teacher:": "\nProinnsias Ó Corcoráin\n"}, {"Collector": "Rita Cahill", "Gender": "female", "Address": "Newtownanner Demesne, Co. Tipperary"}, {"Informant": "Richard Cahill", "Relation": "parent", "Gender": "male", "Address": "Newtownanner Demesne, Co. Tipperary"}, {"Language": "English"}]}, "5008892/4964397/5081783": {"title": "Cures - Sore Feet", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0682, Page 053", "Page 053"], "url": "https://www.duchas.ie/en/cbes/5008892/4964397/5081783", "text": "\nCuresSore FeetBoil some potatoes, drain the water from them, and bathe the feet in the water when it is cool.Anna ReillyGot from: Andrew Dromgoole (80)Donore,Drogheda\n\n\n\nSore EyesGather some raspberry leaves and boil them, and bathe the eyes with the liquid.Anna ReillyGot from: Andrew Dromgoole (80)Donore, Drogheda\n\n\n\nA Stye on the EyeA stye on the eye can be cured by gooseberry thorns.  Get 10 gooseberry thorns and make the sign of the Cross on the eye with nine of them and throw the tenth one across the right shoulder.This must be done for 3 mornings in succession, and the person who does it must have both his parents living.Patrick CarryGot from: Mrs Mary Carry (42)Oldbridge,Drogheda\n\n\n\nSore MouthA posthumous child is said to have the cure of a sore mouth. He must blow his breath 3 times into the mouth of the affected. This is done on 3 mornings in succession, and both must be fasting.\n", "school_info": "School: Donore", "metadata": [{"Location:": "Donore, Co. Meath", "Teacher:": "\nMaighréad Nic Eóin\n"}, {"Collector": "Anna Reilly", "Gender": "female"}, {"Informant": "Andrew Drumgoole", "Gender": "male", "Age": "80", "Address": "Donore, Co. Meath"}, {"Language": "English"}]}, "4922387/4876576/5083369": {"title": "An Old Cure", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0622, Page 284", "Page 284"], "url": "https://www.duchas.ie/en/cbes/4922387/4876576/5083369", "text": "\n(continued from previous page)\nAll the flesh under the tumbler got cupped into the glass.She raised the flesh by means of the glass and worked up the boneThis had to be done for three days and at the end of that time the man was all right.Written by Arthur McKenzie who got this information from Michael Griffin, Postman, Flag Road. 65 yrs\n\n\n\nCure for sore-eyes.      8.2.38People say there is a blessed-well over in Kilcorcoran near Mike Honan's field.It is in the place that \"Micheál Cóimín\" the poet lived.This bledded well is dedicated to Saint Corcorcan.Any person that would go to that well and do two rounds, every Wednesday and Friday for a fortnight, and say three Hail Marys at each of the rounds would be cured.Written by Arthur McKenzie. got from Con Twomey, Church Street. 40 yrs\n", "school_info": "School: Sráid na Cathrach (B.)", "metadata": [{"Location:": "Milltown Malbay, Co. Clare", "Teacher:": "\nPádraig Ó Briain\n"}, {"Collector": "Arthur Mc Kenzie", "Gender": "male"}, {"Informant": "Con Lwoomey", "Gender": "male", "Age": "40", "Address": "Milltown Malbay, Co. Clare"}, {"Language": "English"}]}, "5080332/4879075/5084232": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0629, Page 336", "Page 336"], "url": "https://www.duchas.ie/en/cbes/5080332/4879075/5084232", "text": "\nDown in Vandeleur's wood there is a well dedicated to St. Senan and it is particularly noted for a cure for sore eyes. Colonel Vandeleur was a very big gentleman that owned half the country round. Being a protestant did not believe in the blessed well. When he heard the people saying there were cures performed he ordered his men to close up the well. Immediately the well was closed it sprung up at the other side and they failed to close it. About a dozen years ago five men of this parish were cured. One had sore eyes and after nine visits was cured. The second man had almost completely lost his sight and after a number of visits was cured also.\n", "school_info": "School: Knockerra (C.), Killimer", "metadata": [{"Location:": "Knockerra, Co. Clare", "Teacher:": "\nEibhlín Ní Cholgain\n"}, {"Collector": "Mai Power", "Gender": "female"}, {"Informant": "Bridget Nolan", "Relation": "relative (other than parent or grandparent)", "Gender": "female", "Age": "70", "Address": "Knockerra, Co. Clare"}, {"Language": "English"}]}, "5009212/4998377/5105416": {"title": "Sore Eyes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0770, Page 059", "Page 059"], "url": "https://www.duchas.ie/en/cbes/5009212/4998377/5105416", "text": "\n1. Stye.  Get ten gooseberry thorns  throw the tenth across your right shoulder. Point the other nine to the stye in the name of the Father, Son and Holy Ghost. 2. Make the sign of the cross on eye for nine mornings with a gold wedding ring. The stye will be gone by the ninth day. 3. Prick stye with nine gooseberry thorns nine times - throw away the thorns, when they are rotten the stye will be gone. 4. Sore eye. Rub a loch-a-leech to it.5. Cold in eyes - Bathe with cold black tea.\n", "school_info": "School: Monedarragh, Mostrim", "metadata": [{"Location:": "Monadarragh, Co. Longford", "Teacher:": "\nBean Uí Mhealláin\n"}, {"Language": "English"}]}, "5009214/4998701/5108111": {"title": "Oliver Goldsmith", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0770, Page 421", "Page 421"], "url": "https://www.duchas.ie/en/cbes/5009214/4998701/5108111", "text": "\n(continued from previous page)\nmoney he would earn playing his flute. One of his books which he wrote will never be forgotton namely \"She stoops to conquer.\"\n\n\n\nThere is a well about a mile outside summerhill in the county Meath known as the Moy well. Any person who suffers from a bad headache and takes a drink out of the well and drops a pin into it are cured immediately.\n\n\n\nMy father has the cure of sore eyes. With a certain liquid he makes, but cannot be mentioned.\n\n\n\nHe also has a cure for sufferers of Piles, he gathers a herb known as Pileworth which grows in woods and makes an ointment out of it. He also adds other mixtures.\n\n\n\nThere is a man named \"Kelly\" He lives near Ardagh in a place named \"Croshea\" He is a seventh son and has the cure of ringworm.\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire, Meathas Truim", "metadata": [{"Location:": "Edgeworthstown, Co. Longford", "Teacher:": "\nAn tSiúr Bernard\n"}, {"Language": "English"}]}, "5008958/4970670/5109052": {"title": "Old Cures - Sore Eyes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0699, Page 080", "Page 080"], "url": "https://www.duchas.ie/en/cbes/5008958/4970670/5109052", "text": "\nThere is supposed to be a cure for sore eyes at St. Johns well not far from Dunshaghlin. You are supposed to walk to the well and be there when the mist is rising from it, and bathe the eyes with the water on St.Johns eve around mid-night.Got the above from:Mr Rourke Trim Rd. NavanCo. MeathAge about 40 yrsWritten by: Maisie Rourke\n", "school_info": "School: Clochar Loreto, An Uaimh", "metadata": [{"Location:": "Navan, Co. Meath", "Teacher:": "\nAn tSr. M. Colm\n"}, {"Collector": "Maisie Rourke", "Gender": "female"}, {"Informant": "Mr Rourke", "Gender": "male", "Age": "40", "Address": "Academy Street, Co. Meath"}, {"Language": "English"}]}, "5070818/5067270/5110504": {"title": "Local Cures", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1010, Page 401", "Page 401"], "url": "https://www.duchas.ie/en/cbes/5070818/5067270/5110504", "text": "\nAny baby born with its feet coming foremost into the world had the cure of a sore back.\n(continues on next page)\n", "school_info": "School: The Vale (An Gleann)", "metadata": [{"Location:": "Leiter, Co. Cavan", "Teacher:": "\nS. Ó Brolcháin\n"}, {"Language": "English"}]}, "5008974/4972549/5111976": {"title": "Sore Eyes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0704, Page 299", "Page 299"], "url": "https://www.duchas.ie/en/cbes/5008974/4972549/5111976", "text": "\nA person suffering from sore eyes should get a cup of cold tea and rub it on the eyes.  This is supposes to cure sore eyes on the spot.\n\n\n\nLong ago a person suffering from a cut used to get a cob-web and put it on the cut. This stops the blood and also helps to heal the wound.\n\n\n\nA cure is if there is an old man named Welsh and if he pricked your finger and rub some blood on the wild fire.  This is said to be a very good cure.\n", "school_info": "School: Kilskeer (B.)", "metadata": [{"Location:": "Kilskeer, Co. Meath", "Teacher:": "\nMáirtín Ó Loingsigh, R. Ó Fithcheallaigh\n"}, {"Language": "English"}]}, "5008975/4972650/5112344": {"title": "Warts", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0704, Page 426", "Page 426"], "url": "https://www.duchas.ie/en/cbes/5008975/4972650/5112344", "text": "\n(continued from previous page)\nTo get nine Ivy leaves and put them in a manure heap and when they would begin to decay the warts would wither.\n\n\n\n35To get three different herbs and boil them and then take them.36Ground Ivy and seed of the buclans and O'Connells Ale.\n\n\n\n37There is a cure in a golf ring by rubbing it to the sore eye.38There is a cure in cold tea.\n", "school_info": "School: Kilskeer (C.)", "metadata": [{"Location:": "Kilskeer, Co. Meath", "Teacher:": "\nMáire, Bean Uí Fhithcheallaigh\n"}, {"Collector": "Nancy Smyth", "Gender": "female", "Address": "Cloncat, Co. Meath"}, {"Informant": "James Smyth", "Gender": "male", "Address": "Cloncat, Co. Meath"}, {"Language": "English"}]}, "5009089/4985532/5121618": {"title": "Cures - Cure of Cancer", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0738, Page 157", "Page 157"], "url": "https://www.duchas.ie/en/cbes/5009089/4985532/5121618", "text": "\n(continued from previous page)\nfor cancer.  He puts a certain plaster on the cancer and while putting on the plaster he says a prayer.\n\n\n\nCure for sore eyes.  Boil the leaves of the Marsh Mall and separate the leaves from the juice and rub the juice to your eyes.  Mrs Fagan, Ballyvade, Bunbrosna, Co. Westmeath.  She is twenty nine years of age..\n\n\n\nCure of whooping cough,  To eat the Ferets leavings.  Mrs Mac Murrough, Bunbrosna, Co. Westmeath\n\n\n\nMrs Mortagh, Cullenhue.  she says if you have a hic-cough to get mug of water and turn it round in a ring in front of your mouth and the hic-cough will be cured.\n\n\n\nPatrick Finnegan, Bunbrosna, Co. Westmeath says that if you put a linseed poultice to a boil it will be cured.\n\n\n\nCure for black leg in calves.  Thomas Dunleavy, Barratoger, Rathowen, Co. Westmeath got the following cure from his father (deceased).  The cure is Immediate the calf is born to take a drop of blood from the tip of her tail.  He is about fifty years of age.\n", "school_info": "School: Lacken and Leny", "metadata": [{"Location:": "Lackan, Co. Westmeath", "Teacher:": "\nS, Mac Shamhráin\n"}, {"Informant": "Mrs Fagan", "Gender": "female", "Age": "29", "Address": "Ballyvade, Co. Westmeath"}, {"Language": "English"}]}, "5009106/4987191/5122501": {"title": "Folklore Cures - Mumps", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0742, Page 139", "Page 139"], "url": "https://www.duchas.ie/en/cbes/5009106/4987191/5122501", "text": "\nIn this district and old man used to put the tacklings of an ass on the patient and drive him to a well convenient to his home and round the well three times, then back and remove the harness. The mumps disappeared in three days.\n\n\n\nAn old man named Paddy Hannan who lived in this district about fifty years ago had a cure for sore eyes.The patient came to his house and told him about the soreness in his eye and the length of time he was suffering. The patient was then told to sit down and wait.Paddy then took a mouthful of cold water and bringing an old saucepan with him went into a room and knelt down for about fifteen minutes. He then came out, spitting the the water out of his mouth into the saucepan saying\n(continues on next page)\n", "school_info": "School: Irishtown", "metadata": [{"Location:": "Milltown, Co. Westmeath", "Teacher:": "\nMargaret McNally\n"}, {"Collector": "Donal Fox", "Gender": "male", "Age": "12"}, {"Informant": "Mrs Mc Cormack", "Gender": "female", "Age": "70", "Occupation": "nurse", "Address": "Ballynacarrigy, Co. Westmeath"}, {"Language": "English"}]}, "5044751/5036289/5137804": {"title": "A Cure for Sore Eyes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0923, Page 101", "Page 101"], "url": "https://www.duchas.ie/en/cbes/5044751/5036289/5137804", "text": "\nTo cure sore eyes,get a gold ring and shake it at the sore for five minutes.It was said to be a perfect cure and the sore vanished in twenty four hours.\n\n\n\nCure for a sting of a wasp If you happen to get a sting of a wasp, here is a simple cure. Get a raw onion and cut in pieces and apply to the sting. Another simple cure is ordinary bag blue.\n", "school_info": "School: Carysfort, Arklow", "metadata": [{"Location:": "Arklow, Co. Wicklow", "Teacher:": "\nT. E. McAdoo\n"}, {"Collector": "Mary Chapman", "Gender": "female", "Address": "Askintinny, Co. Wicklow"}, {"Language": "English"}]}, "5044568/5023102/5143444": {"title": "Local Cures - Toothache", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0800, Page 157", "Page 157"], "url": "https://www.duchas.ie/en/cbes/5044568/5023102/5143444", "text": "\n156Toothache:- Visit the \"Priests Bush\" and rub the tooth with the leaves of the bush three nights running.The juice of the bark of the \"quick berry bush\" put into the tooth. If you were in the habit of shaving on Sunday and gave it up it would cure you.They would go to Father Moore's grave in Cloncrane and get apiece of gravel off the grave and put it to the tooth.\n\n\n\nSore eyes:- pointing a gooseberry thorn at them.\n\n\n\nMumps:- Roasted potatoes are good for them.\n\n\n\n\"Wild Fire\" or Fever:- Hang holly over the door\n\n\n\nNettle Sting:- Rub with dock leaf.\n\n\n\nHeadache:- Some people do not comb their hair during Holy Week to get better of headaches.\n\n\n\nBellyache:- The would rub goose grease on themselves night and morning.\n", "school_info": "School: Clonbullogue", "metadata": [{"Location:": "Clonbulloge, Co. Offaly", "Teacher:": "\nA. Fitzgerald\n"}, {"Language": "English"}]}, "4921646/4887511/5152923": {"title": "The Sore Eye Well", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0314, Page 005", "Page 005"], "url": "https://www.duchas.ie/en/cbes/4921646/4887511/5152923", "text": "\nThere is a well in the Town Park and it is called the Sore Eye Well. It is said that people have been cured there from time to time and hence its name.    Long ago when many visits were made to the well there was a passage from the road across the park to the well and through this passage the people went. At the side of the road there was a wicket which led to the passage. At that time the well was kept in perfect condition and at either side of the well there were two birch trees. In front of the well there were steps and on those steps the people prayed.   When a person came to the well to be cured he should come on nine mornings in succession and on each morning make one round. Each morning the person should recite the necessary prayers, bathe the eyes in the holy water, and then leave something at the well such as a coin or a button as was the custom. The person should be fasting each\n(continues on next page)\n", "school_info": "School: Pádraig Naofa, Droichead Banndan", "metadata": [{"Location:": "Bandon, Co. Cork", "Teacher:": "\nPádraig Ó Faoláin\n"}, {"Collector": "Michael Walsh", "Gender": "male", "Address": "Bandon, Co. Cork"}, {"Informant": "Mr Stephen Griffin", "Gender": "male", "Age": "52", "Occupation": "lorry driver", "Address": "Bandon, Co. Cork"}, {"Language": "English"}]}, "4921728/4894102/5187666": {"title": "Cures for Certain Diseases - Headache", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0350, Page 069", "Page 069"], "url": "https://www.duchas.ie/en/cbes/4921728/4894102/5187666", "text": "\nHeadache is often relieved or banished by taking a cup of strongly made tea.\n\n\n\nSore Eyes. If bathed with cold tea sore eyes are often relieved. The tea is such as would be left in the tea-pot after a meal. Thus there would be no milk or sugar.Sore eyes are also cured by making the Sign of the Cross on them with fasting spittle. This cure is always applied for Cré vour (?)The Sign of the Cross made with a Marriage Ring (Gold) will also cure a Cré vour (?) It would appear that some such rings are blessed for this purpose.Another cure for sore eyes is to bathe them with one's own urine.\n\n\n\nBleeding from the Nose is usually by laying flat on back. Another method is the reverse of this that is to bend the head forward when in a sitting posture. The blood will flow freely for a little while but will shortly form a clot which will prevent the flow in a short time. This method is much preferred by some as undoubtedly by the first method some blood must find its way into the stomach.\n(continues on next page)\n", "school_info": "School: Maoilinn (B.), Áth Treasna", "metadata": [{"Location:": "Meelin, Co. Cork", "Teacher:": "\nDiarmuid de Brún\n"}, {"Informant": "Mrs John P. Browne", "Gender": "female", "Address": "Meelin, Co. Cork"}, {"Language": "English"}]}, "4921707/4892310/5188648": {"title": "Nuair a Bheifeá Ag Dul Trasna Abhann", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0337, Page 164", "Page 164"], "url": "https://www.duchas.ie/en/cbes/4921707/4892310/5188648", "text": "\nAr eagla na h-abhann seo bheith doimhin a Ríg na faidhne ghlac mo lámh. Eagla na tuille seo bheith  tréan a Mhuire féac agus ná fág.\n\n\n\nTá dúradán im shúil, tá Día ós mo chionnAgus ta an Mhaighdean Ghlórmhar ar          dha glúinAg íarraidh on dúradán do bhaint as mo           shúil.\n", "school_info": "School: Baile Uí Bhuaig (B.)", "metadata": [{"Location:": "Ballyvoge, Co. Cork", "Teacher:": "\nMartias Ó Luasaigh\n"}, {"Collector": "Diarmuid Ó Céilleachair", "Gender": "male"}, {"Language": "Irish"}]}, "5177641/5175622/5196708": {"title": "Cures - Corns", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0596, Page 057", "Page 057"], "url": "https://www.duchas.ie/en/cbes/5177641/5175622/5196708", "text": "\n(continued from previous page)\n57.a penny to the part o the sock that was touching the corn.Every night he used to put a coating of pig's lard on the piece of linen and in this way he banished every corn he ever had.To put the skin of a raw potato to the corn for a few nights on going to bed.After a few applications the corn came out from the root on the skin.\n\n\n\n31.5. '38          Sore Eyes.To wash with an infusion got from  elder leaves.Fasting spit rubbed to the 'sty'nine days in succession in the name of the Father ,Son and Holy Ghost.To rub Holy Water especially Easter Holy Water to the sty.To rub a gold ring to the sty.To look through a married woman's wedding ring for the sty.To bath the eyes with cold strong  tea .People suffering from sore eyes used to stop up all night on the vigils of the feasts of Our Lady .At the blessed well near Kilmurrey Churchyard-\n", "school_info": "School: An Daingean, Cuinche", "metadata": [{"Location:": "Dangan, Co. Clare", "Teacher:": "\nStiofán Mac Clúin, Treasa Ní Chonmara\n"}, {"Language": "English"}]}, "5177641/5175623/5196712": {"title": "Cures - Chilblains", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0596, Page 058", "Page 058"], "url": "https://www.duchas.ie/en/cbes/5177641/5175623/5196712", "text": "\n58.30 : 5; 38.Cures Chilblains.to blister with turpentine.To immerse the affected parts in cold water.To bathe with hot water and salt.To apply washing blue. To rub with salt. To rub with ice or snow water.To rub with pickle that is the solution in which home bacon was cured.To rub with fasting spit but the spit must first be spat on the flag of the door and then taken up with thumb applied  to affected part .To rub with fresh butter .To rub with parrafin oil.\n\n\n\n31:5:38 Sore Eyes -continued.Sixmilebridge and  wash the eyes nine times in the well before day break.A paste made from a well solution of bluestone and lard .To pick the 'sty'with a gooseberry thorn.To wash with luke -warm milk .To wash with salt and soft water.\n", "school_info": "School: An Daingean, Cuinche", "metadata": [{"Location:": "Dangan, Co. Clare", "Teacher:": "\nStiofán Mac Clúin, Treasa Ní Chonmara\n"}, {"Language": "English"}]}, "5177649/5176659/5202118": {"title": "Leigheasanna - Consumption", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0598, Page 102", "Page 102"], "url": "https://www.duchas.ie/en/cbes/5177649/5176659/5202118", "text": "\n(continued from previous page)\nMullen plant - particulars not known.\n\n\n\nwhen fasting spit on hearth-stone. Put a gold ring to the spittle. Look out this ring & then rub the ring to eye, in the name of the Father, Son & H. Ghost. Do this for 6 successive mornings.Prick the stye with a gooseberry thorn.\n\n\n\nSore eyes (cold) - bathe in cold tea.Take a mouthful of new milk. Get a piece of white cloth. Wet portion of it with milk out of mouth. Rub to eye, rub eye lid up & down to let milk\n(continues on next page)\n", "school_info": "School: Meelick (B.)", "metadata": [{"Location:": "Meelick, Co. Clare", "Teacher:": "\nEoghan Ó Néill\n"}, {"Language": "English"}]}, "4798668/4788756/5215528": {"title": "Local Cures", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0238, Page 383", "Page 383"], "url": "https://www.duchas.ie/en/cbes/4798668/4788756/5215528", "text": "\n(continued from previous page)\nRing worm and scrofula are common complaints, which can be cured by the seventh son or daughter.When a seventh son or a seventh daughter is born, somebody goes out and digs for earthworms.  One of these is put into the child's hand and left there until it dies.  That child then has the sure of the above diseases ever afterwards.  Persons who have this cure can only put it into effect between sunrise and sunset on Mondays and Thursdays.  People suffering for these diseases often come long distances to be treated by a person having the cure.  Charlie Mc Dermot, Knockglass is the only person having the above cure in this district.\n\n\n\nMany people suffer from sore eyes of various kinds and in some districts there are wells the waters of which are reputed to cure such eyes when they are bathed in it.Such a well is known by the name of \"Tobar na Súil\" or \"The Eye Well\".  There is such a well in the district (see pages 63 + 64)The stye is an inflammation of the eyelid, which is cured locally in the following manner:-\n(continues on next page)\n", "school_info": "School: Baile na Mín", "metadata": [{"Location:": "Ballinameen, Co. Roscommon", "Teacher:": "\nTomás Ó Conchobhair\n"}, {"Language": "mixed"}]}, "5236104/5232522/5236915": {"title": "The Well of the Eyes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0417C, Page 01_009", "Page 01_009"], "url": "https://www.duchas.ie/en/cbes/5236104/5232522/5236915", "text": "\nTo the north-west of Ballyhergue there is a well close to the Shannon, called Glendahillon Well and there is an old story told about it. It is said there was a convent there and there were nuns living in it. Sea robbers came in and abused the nuns and were going to kill them but the nuns prayed to God for help, and the robbers were struck blind. Then the nuns took pity on them again and they said to the robbers that if they would leave them\n(continues on next page)\n", "school_info": "School: Glenderry", "metadata": [{"Location:": "Glenderry, Co. Kerry", "Teacher:": "\nPeadar Ó Gleathbhúir\n"}, {"Collector": "Micheal Gaynor", "Gender": "male", "Address": "Glenderry, Co. Kerry"}, {"Informant": "Tomas Gaynor", "Gender": "male", "Address": "Glenderry, Co. Kerry"}, {"Language": "English"}]}, "5236104/5232574/5236958": {"title": "The Well of the Eyes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0417C, Page 02_007", "Page 02_007"], "url": "https://www.duchas.ie/en/cbes/5236104/5232574/5236958", "text": "\nIn the north west of Ballyheigue there is a blessed well called Glendahillon[?] Well, and there is an old story told about it. It is said that there was a convent there long ago the remains can still be seen and there were nuns in it. It is said that a ship came in to the harbour and it was full of robbers. They said that they would kill the nuns, and they started praying and the robbers got blind. Then the nuns took pity on them and they told them to wash their eyes in the water and they got cured. People who have sore eyes go on\n(continues on next page)\n", "school_info": "School: Glenderry", "metadata": [{"Location:": "Glenderry, Co. Kerry", "Teacher:": "\nPeadar Ó Gleathbhúir\n"}, {"Collector": "Nicholas Higgins", "Gender": "male", "Address": "Glenderry, Co. Kerry"}, {"Informant": "John Higgins", "Gender": "male", "Address": "Glenderry, Co. Kerry"}, {"Language": "English"}]}, "5236104/5232631/5237134": {"title": "The Well of the Eyes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0417C, Page 03_014", "Page 03_014"], "url": "https://www.duchas.ie/en/cbes/5236104/5232631/5237134", "text": "\nTo the north of ballyheigue in a place called Glendshillon there is a holy well called St Brigid's well. St Brigid lived there in a convent with her nuns long ago. One night a ship came in and the crew went to the convent to kill the nuns.The nuns prayed to God for help, and as they did so the robbers were struck blind. The nuns took pity on them, and they told the robbers to bathe their eyes in the\n(continues on next page)\n", "school_info": "School: Glenderry", "metadata": [{"Location:": "Glenderry, Co. Kerry", "Teacher:": "\nPeadar Ó Gleathbhúir\n"}, {"Collector": "Pat Godley", "Gender": "male"}, {"Informant": "Richard Godley", "Gender": "male", "Age": "60", "Address": "Dromatoor, Co. Kerry"}, {"Language": "English"}]}, "5236104/5232684/5237402": {"title": "The Well of the Eyes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0417C, Page 04_011", "Page 04_011"], "url": "https://www.duchas.ie/en/cbes/5236104/5232684/5237402", "text": "\nTo the north of Ballyheigue in a place called Glenahillon there is a well called the \"well of the eyes\". Many cures have been effected here for people with sore eyes.Long go there was a big convent here and sea-robbers sailed in to the shore and the nuns and the Rev Mother prayed to God that the sea robbers woild not molest them. But the sea-robbers tore down the convents and went away. Again the robbers came and again the Rev. Mother prayed that\n(continues on next page)\n", "school_info": "School: Glenderry", "metadata": [{"Location:": "Glenderry, Co. Kerry", "Teacher:": "\nPeadar Ó Gleathbhúir\n"}, {"Collector": "Joseph Lucid", "Gender": "male"}, {"Informant": "John Corridon", "Gender": "male", "Age": "35", "Address": "Glenderry, Co. Kerry"}, {"Language": "English"}]}, "5236104/5232724/5237485": {"title": "The Well of the Eyes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0417C, Page 05_009", "Page 05_009"], "url": "https://www.duchas.ie/en/cbes/5236104/5232724/5237485", "text": "\nThere is a blessed in the north west of Ballyheigue called Glendahillon well. There is an old story told about it.It says that a ship once came in to the harbour there. Robbers were in it and they were going to rob the convent and kill the nuns. The nuns prayed for help to God. So help came to them and the robbers were struck blind. Then the nuns took pity on them and they told them to wash their eyes in that well. They did so and they got\n(continues on next page)\n", "school_info": "School: Glenderry", "metadata": [{"Location:": "Glenderry, Co. Kerry", "Teacher:": "\nPeadar Ó Gleathbhúir\n"}, {"Collector": "Con Hare", "Gender": "male"}, {"Informant": "Patrick Leen", "Gender": "male", "Age": "60", "Address": "Ballylongane, Co. Kerry"}, {"Language": "English"}]}, "5236104/5232772/5237569": {"title": "The Well of the Eyes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0417C, Page 06_011", "Page 06_011"], "url": "https://www.duchas.ie/en/cbes/5236104/5232772/5237569", "text": "\nTo the north side of Glenderry mountain there is blessed well in a place called Glenhallion. There is a little church-yard there where babies used be buried. There is a great cure in that well for any disease especially for bad sight, and for sore eyes also. Once there did a ship full of sea-robbers came to the cliff near the place where the well is. The robbers began to rob the church. Then the Rev mother and all the nuns prayed to God to save\n(continues on next page)\n", "school_info": "School: Glenderry", "metadata": [{"Location:": "Glenderry, Co. Kerry", "Teacher:": "\nPeadar Ó Gleathbhúir\n"}, {"Collector": "John Casey", "Gender": "male"}, {"Informant": "Willie Hanlon", "Gender": "male", "Address": "Tiershanaghan, Co. Kerry"}, {"Language": "English"}]}, "5236104/5232797/5237597": {"title": "The Well of the Eyes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0417C, Page 07_008", "Page 07_008"], "url": "https://www.duchas.ie/en/cbes/5236104/5232797/5237597", "text": "\nTo the north west of Ballyheigue there is a blessed well called Glendahillon well, and there is an old story told about it. It is said that there was a convent there long ago, and there were nuns in it. A ship came in to the harbour there, and it was full of robbers. They said that they would kill the nuns, but the Reverend mother prayed to God to help her.The robbers then came to the convent to kill them, but they were struck blind. Then they said if\n(continues on next page)\n", "school_info": "School: Glenderry", "metadata": [{"Location:": "Glenderry, Co. Kerry", "Teacher:": "\nPeadar Ó Gleathbhúir\n"}, {"Collector": "Willie Corridon", "Gender": "male"}, {"Informant": "Phil Corridon", "Gender": "male", "Age": "60", "Address": "Glenderry, Co. Kerry"}, {"Language": "English"}]}, "5236104/5232846/5237653": {"title": "The Well of the Eyes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0417C, Page 08_008", "Page 08_008"], "url": "https://www.duchas.ie/en/cbes/5236104/5232846/5237653", "text": "\nThere is a holy well in the north side of the Glen Dahillon mountain, People come there paying rounds for the good of their sight. There is a church there also but only for babies. There is a good cure in that well for any disease. Long ago there was a convent there and sea-robbers sailed into the shore and the nuns and the Rev Mother prayed to God that the sea robbers would not interfere with them.But the sea robbers tore down the convent and went away. Again the sea robbers\n(continues on next page)\n", "school_info": "School: Glenderry", "metadata": [{"Location:": "Glenderry, Co. Kerry", "Teacher:": "\nPeadar Ó Gleathbhúir\n"}, {"Collector": "Thomas Gaynor", "Gender": "male"}, {"Informant": "Thomas Gaynor", "Gender": "male", "Age": "42", "Address": "Glenderry, Co. Kerry"}, {"Language": "English"}]}, "5236104/5232903/5237830": {"title": "The Well of the Eyes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0417C, Page 09_013", "Page 09_013"], "url": "https://www.duchas.ie/en/cbes/5236104/5232903/5237830", "text": "\nAt the north of Ballyheigue in Glendahillon there is a blessed well, and there is a story connected with it. There is a hill near the well and on the top of it there is ruins of a chapel. One night there did a ship came in to the harbour, and the sailor said to the nuns that hey intended to kill them.  The nuns started praying and the Reverend mother prayed to God and at that minute the sailors were struck blind on the\n(continues on next page)\n", "school_info": "School: Glenderry", "metadata": [{"Location:": "Glenderry, Co. Kerry", "Teacher:": "\nPeadar Ó Gleathbhúir\n"}, {"Collector": "Patrick Higgins", "Gender": "male"}, {"Informant": "John Kirby", "Gender": "male", "Age": "56", "Address": "Glenderry, Co. Kerry"}, {"Language": "English"}]}, "5215809/5231747/5265808": {"title": "Cure for Sore Eyes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137F, Page 19_030", "Page 19_030"], "url": "https://www.duchas.ie/en/cbes/5215809/5231747/5265808", "text": "\nLong long ago there was an old woman living in Killeenacoff and it was said that she could cure people with sore eyes. One day a young man went to her and he told her (?) about his sore eyes. She told him to sit down on a chair and the man did as he was told. She got a cup and put some clean water into the cup. She told the man to stand up and to look into the cup of water and that he would see the dirt in the cup which was in his eyes. Ever after that his eyes never troubled him. I heard this story from James O'Malley Lanmore Liscarney P. Office, Westport.\n", "school_info": "School: Lankill", "metadata": [{"Location:": "Lankill, Co. Mayo", "Teacher:": "\nSeán Ó Cibhil\n"}, {"Collector": "Kitty Duffy", "Gender": "female", "Address": "Lanmore, Co. Mayo"}, {"Informant": "James O' Malley", "Gender": "male", "Address": "Lanmore, Co. Mayo"}, {"Language": "English"}]}, "5215809/5231753/5265816": {"title": "Cure for Sore Eyes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137F, Page 19_036", "Page 19_036"], "url": "https://www.duchas.ie/en/cbes/5215809/5231753/5265816", "text": "\nCure for sore eyesGet three thorns that would be on a hawthorn bush and point them three times to the sore eyes on Saturday and Thursday and the followiing Saturday again. Cure for pain in earGet a woollen cloth and boil nettles and put the juice of the nettles on the cloth and put it into the ear and the pain will go. Cure for sore throatCut up an onion and put it into a cup and put in three tablespoonfuls of sugar and put it on top of the onion and cover both of them well until the juice of the onion and sugar melt then take it.  Cure for pain in headCut up a piece of garlic and boil\n(continues on next page)\n", "school_info": "School: Lankill", "metadata": [{"Location:": "Lankill, Co. Mayo", "Teacher:": "\nSeán Ó Cibhil\n"}, {"Collector": "Kitty Duffy", "Gender": "female", "Address": "Lanmore, Co. Mayo"}, {"Informant": "John Duffy", "Gender": "male", "Address": "Mountbrown, Co. Mayo"}, {"Language": "English"}]}, "4921700/4891301/5278886": {"title": "An Bhean Sí", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0329, Page 093", "Page 093"], "url": "https://www.duchas.ie/en/cbes/4921700/4891301/5278886", "text": "", "school_info": "School: Sliabh Riabhach", "metadata": [{"Location:": "Slievereagh, Co. Cork", "Teacher:": "\nÉamonn Mac Suibhne\n"}, {"Language": "Irish"}]}, "4498641/4385215/5311782": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0790, Page 159", "Page 159"], "url": "https://www.duchas.ie/en/cbes/4498641/4385215/5311782", "text": "\nTold by Mr. Thomas ClarkeSandpittsCastleknockHe knew the well + saw the cures.Written by his daughter Patricia Clarke aged 11There was a well near the Sandpitts called the Rag Well. Long ago people with sore eyes came to the well and washed their eyes in the water with a piece of cloth and then hung it up on a bush over the well.When all the pumps in Castleknock went dry it was the only well that had water and the people came with their buckets for water. I am sorry to say it is now a pump.\n\n\n\nThere is a little plant\n(continues on next page)\n\n\n\nThere was a well near the Sandpitts called the Rag Well. Long ago people with sore eyes came to the well and washed their eyes in the water with a piece of cloth and then hung it up on a bush over the well.When all the pumps in Castleknock went dry it was the only well that had water and the people came with their buckets for water. I am sorry to say it is now a pump\n\n\n\nThere was a well near the Sandpitts called the Rag Well. Long ago people with sore eyes came to the well and washed their eyes in the water with a piece of cloth and then hung it up on a bush over the well.When all the pumps in Castleknock went dry it was the only well that had water and the people came with their buckets for water. I am sorry to say it is now a pump\n", "school_info": "School: St Brigid's, Castleknock", "metadata": [{"Location:": "Castleknock, Co. Dublin", "Teacher:": "\nMrs Thornton\n"}, {"Collector": "Patricia Clarke", "Gender": "female", "Age": "11", "Address": "Sandpits, Co. Dublin"}, {"Informant": "Mr Thomas Clarke", "Relation": "parent", "Gender": "male", "Address": "Sandpits, Co. Dublin"}, {"Language": "English"}]}}