{"4428091/4377512/4435777": {"title": "Scéal", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0636, Page 247", "Page 247"], "url": "https://www.duchas.ie/en/cbes/4428091/4377512/4435777", "text": "\nNuair a léigheann daoine cúntas ar cath Cluan Tarbh go raibh deire leis na Danair an úr úd ach ní raibh. Bhí cuid mór des na Danair ná raibh sa cath an úr úd, d=fhanadar sa mbaile ag faire ar a gcuid tighibh móra agus a cuid eile aca a bhí sa cogadh agus d'éalaigh as nuair bhí an troid dul ró-dhian. Tá cúntas cruinn mar a marbhuighead Brian Ború 'na campa an tráthnóna sin agus é ag tabhairt buidheacas do Dhia ar a glúna ar son and cabhair agus an cúnamh an lá úd chun an namhaid do dhíbirt. Tá cúntas eile ó bhéal na daoine anuas cughainn nuair a airigh siad gur marbhuidheach an Brianach do gaigh feirg mór iad agus gealladar dá chéile an tráthnóna san ná beadh codladh suan ná suanas maidin aca go mbeadh an Danair déanach dibhirte as Éireann. Dá réir sin tháinigh cuid mór aca le na chéile agus caitheadar oifigí agus captainí do thoghadh le cuir as a ceann. Bhí aon fhear amháin ann a thugadh in a captaín. Willamach Fic do'b ainm dó agus is air dtaimíd chun tráith. D'fhágadar Baile Átha Cliath agus ruaghadar agus marbhuightear na Danair\n(continues on next page)\n", "school_info": "School: Gleann Garbh, Lios Mór", "metadata": [{"Location:": "Glengarra, Co. Waterford", "Teacher:": "\nEibhlín Bean Uí Chaomháin\n"}, {"Language": "Irish"}]}, "4498838/4385818/4511355": {"title": "Brian Boru", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0792, Page 270", "Page 270"], "url": "https://www.duchas.ie/en/cbes/4498838/4385818/4511355", "text": "\nIn 1014 the body of Brian Boru was taken to a church in Swords Co. Dublin and he was waked there. As some soldiers were on their way to the wake they died and were buried by other soldiers in the mounds near the Church. Some say that money was buried with them and anyone who found the skeletons afterwards were told that it was unlucky.\n", "school_info": "School: Raheny (2)", "metadata": [{"Location:": "Raheny, Co. Dublin", "Teacher:": "\nMrs E. Perry\n"}, {"Language": "English"}]}}