{"4427994/4365665/4468752": {"title": "Tiormacht Mór", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0132, Page 126", "Page 126"], "url": "https://www.duchas.ie/en/cbes/4427994/4365665/4468752", "text": "", "school_info": "School: Dubhthuama", "metadata": [{"Location:": "Doohooma, Co. Mayo", "Teacher:": "\nMícheál Mac Támhais\n"}, {"Language": "Irish"}]}, "4493653/4407830/4519755": {"title": "A Heavy Snowfall", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1081, Page 188", "Page 188"], "url": "https://www.duchas.ie/en/cbes/4493653/4407830/4519755", "text": "\nIn the year 1877 in the month of October there was a heavy snowfall. When the people awoke in the morning they found that the snow was up over the windows and doors. So they had to dig the snow and make a road to the wells and to the cattle-houses. there was a great number of cattle and sheep lost.\n\n\n\nIn the year 1872 in the month of March there was a great flood All the land was flooded for about a mile along the river Lennon. The two bridges across the river, Dromore and Ballineed were covered with water. There were a few houses invaded with it.\n\n\n\nAbout forty-five years ago there was a Great Drought Period. The people had to carry water and put it on the corn, and the cattle were running through the fields half-mad for the want of water.\n", "school_info": "School: Ednacarnon", "metadata": [{"Location:": "Edenacarnan South, Co. Donegal", "Teacher:": "\nMáire, Bean Staráid\n"}, {"Collector": "Sarah Mc Geever", "Gender": "female", "Address": "Garrowcarry, Co. Donegal"}, {"Informant": "John Mc Geever", "Gender": "male", "Age": "50", "Address": "Garrowcarry, Co. Donegal"}, {"Language": "English"}]}, "4493653/4407829/4529158": {"title": "A Great Rainstorm", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1081, Page 187", "Page 187"], "url": "https://www.duchas.ie/en/cbes/4493653/4407829/4529158", "text": "\nOn the 23rd May 1902, there was a great rain storm. There was a lot of bridges tumbled. There is a little river running through Mr. James Gailey's farm. This river was stopped by the stones and the mud carried down by the water. The water turned across a field and made another river. This place is still to be seen.\n\n\n\nOn the 9th. April, 1915, there was a great snowstorm. In some glens the snow was twenty feet deep. It lay in glens and on hills for six weeks. Lots of cattle died as there could be no food got for them.\n\n\n\nIn the summer of 1918, there was a great drought period. All streams and wells went dry. Some people had to go with carts for water to give to cattle, and they had to go nearly a mile.\n", "school_info": "School: Ednacarnon", "metadata": [{"Location:": "Edenacarnan South, Co. Donegal", "Teacher:": "\nMáire, Bean Staráid\n"}, {"Collector": "Eliza Elliot", "Gender": "female", "Address": "Rathdonnell, Co. Donegal"}, {"Informant": "Mr William Mc Callum", "Gender": "male", "Age": "60", "Address": "Rathdonnell, Co. Donegal"}, {"Language": "English"}]}, "4566058/4563214/4569705": {"title": "Drought", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0025, Page 0027", "Page 0027"], "url": "https://www.duchas.ie/en/cbes/4566058/4563214/4569705", "text": "\nIn the summer of 1925 there was a drought, and the people of Bunnatubber and of the surrounding villages used to have to go nine or ten miles for water. It lasted for a month and the crops were on the point of failing when there came four days rain.\n", "school_info": "School: Caisleán  hAicéid", "metadata": [{"Location:": "Castlehacket, Co. Galway", "Teacher:": "\nS. Ó Floinn\n"}, {"Collector": "Mary Burke", "Gender": "female", "Address": "Bunatober, Co. Galway"}, {"Informant": "Edmond Burke", "Gender": "male", "Age": "53", "Address": "Bunatober, Co. Galway"}, {"Language": "English"}]}, "4623000/4622314/4630075": {"title": "A Great Storm", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0079, Page 134", "Page 134"], "url": "https://www.duchas.ie/en/cbes/4623000/4622314/4630075", "text": "\n(continued from previous page)\nit O Donnell's old house.\n\n\n\nThere was a period of drought in Ireland in the year 1864. All village wells were dried up and the bogs that were flooded all during the year, that never dried any other summer were as dry as the good land, and people had to travel miles for water. There was not a drier summer since then.There was a great drought in this village in 1901. All the hay was destroyed on the farmers and the potatoes grew secondly. The turf the farmers cut was split with the heat and there was not a well in the country but was dry and five people died from drinking bad water.\n(continues on next page)\n", "school_info": "School: Caisleán Nua (C)", "metadata": [{"Location:": "Newcastle, Co. Galway", "Teacher:": "\nMáire, Bean Uí Staic\n"}, {"Collector": "Eileen Donelon", "Gender": "female", "Age": "13", "Address": "Templemoyle, Co. Galway"}, {"Informant": "John Donelon", "Relation": "parent", "Gender": "male", "Address": "Templemoyle, Co. Galway"}, {"Language": "English"}]}, "4649691/4647613/4652255": {"title": "Great Flood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0211, Page 179", "Page 179"], "url": "https://www.duchas.ie/en/cbes/4649691/4647613/4652255", "text": "\n(continued from previous page)\nwere swept off Mullaghboy bog. Two calves of Matt Curran's, Drumcrumaun were drowned. A rick of hay was flooded out of Michael Mac Nulty's garden Selton.\n\n\n\nForty years ago a great snow storm lasted a fortnight in this district. Willie Earley, Shebeg and Patrick Redican, Letterfine were lost. The people could hardly leave their homes. They had to be continually shovelling away the snow from their doors. In some places it was piled up six feet against walls.\n\n\n\nAbout ninety years ago all this district was dried up. Great numbers of cattle and fowl died. This drought period lasted a month.\n\n\n\nAbout the year of 1837 there was a very severe storm in Ireland. It did great harm to the people. It knocked down a lot of haystacks and haysheds and blew the roofs off some houses. It drove the water out of Laura Lough up through the fields around it.\n", "school_info": "School: Coill Chláir", "metadata": [{"Location:": "Kilclare, Co. Leitrim", "Teacher:": "\nTreasa Ní Oibeacáin\n"}, {"Collector": "Annie Pagnam", "Gender": "female", "Address": "Seltan (McDonald), Co. Leitrim"}, {"Informant": "James Curan", "Gender": "male", "Age": "65", "Address": "Seltan (McDonald), Co. Leitrim"}, {"Language": "English"}]}, "4649688/4647408/4658707": {"title": "Great Drought", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0210, Page 547", "Page 547"], "url": "https://www.duchas.ie/en/cbes/4649688/4647408/4658707", "text": "\nIn the year 1911 there was a great drought. There was no rain from 30th May until the 16th October. All the wells were gone dry except Kiltoghert and a well in the Kilclare district. One day eleven horse carts met at Kiltoghert well at the same (time).\n", "school_info": "School: Kiltoghert", "metadata": [{"Location:": "Kiltoghert, Co. Leitrim", "Teacher:": "\nSeán Ó Fearghail\n"}, {"Collector": "Tessie Farrell", "Gender": "female", "Address": "Kiltoghert, Co. Leitrim"}, {"Informant": "Willie Farrell", "Gender": "female", "Address": "Kiltoghert, Co. Leitrim"}, {"Language": "English"}]}, "4658420/4653335/4666715": {"title": "A Great Drought", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0217, Page 287", "Page 287"], "url": "https://www.duchas.ie/en/cbes/4658420/4653335/4666715", "text": "\nThere was a great drought a few years ago. Everybody had to carry water a long way. Every place was dried up and water was only got in lakes and rivers. The water had to be carried for house use as well as for cattle and people had to drive cows a long distance to drink. In the town of Ballinamore and there         was only one pump and a great spring well and the pump went dry and the man sold the water at 2 pence per gallon. George DalyCloonboney\n\n\n\nThere was a hedge schools on Tessie McGushin's hill. It was siutated under a great tree in Summer and in a hut of Pat Fitzpatrick in the Winter. The teacher's name was Boxty Molloy. He taught   mostly Latin. He was reared in Moheraven. He used to cross the river home on stepping\n(continues on next page)\n", "school_info": "School: Cluain Tuirc (B.)", "metadata": [{"Location:": "Cloonturk, Co. Leitrim", "Teacher:": "\nSeán Ó Conchobhair\n"}, {"Informant": "George Daly", "Gender": "male", "Age": "78", "Address": "Cloonboniagh South, Co. Leitrim"}, {"Language": "English"}]}, "4678385/4674569/4683750": {"title": "An Doineann - Báisteach Throm agus Tuile", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0419, Page 267", "Page 267"], "url": "https://www.duchas.ie/en/cbes/4678385/4674569/4683750", "text": "\n(continued from previous page)\nbhfeórainn, timcheall trí fhichid bliain ó shoin.\n\n\n\nBhí triomach mór ann sa bhliain 1921. Lean an triomach ar feadh sé nó seacht de sheachtmhainí. Dhein sí ana-dhíobháil dos na barraí agus do's na prataí agus do'n bhféar.\n", "school_info": "School: Baile 'n Fhirtéaraigh (B.)", "metadata": [{"Location:": "Ballyferriter, Co. Kerry", "Teacher:": "\nMichael Ó Conchobhair\n"}, {"Collector": "Liam Bhúdhlaeir", "Gender": "male", "Address": "Ballyferriter, Co. Kerry"}, {"Informant": "Diarmuid Ó Curráin", "Gender": "male", "Address": "Ballinrannig, Co. Kerry"}, {"Language": "Irish"}]}, "4742135/4739221/4760375": {"title": "Seanscéal", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0477, Page 137", "Page 137"], "url": "https://www.duchas.ie/en/cbes/4742135/4739221/4760375", "text": "\nNuair a tagaidh spalla triomacht ar oileán na hÉireann, tá an talamh ró árd, ró thanaidhe, dóigheann sé agus loisgeann sé é. Ní fásann féar ná coirce. Ní fheadaidh sé é ná fiu na prátaí, dóightear iad. Ní bhíonn braon uisge ages na hainimidhthe. Bíonn an talamh ana thirim, agus bíonn na hainimidhte ag fághail bháis le aicíd go dtugann siad ribín tirim air. Bíonn an aicíd seo istig ina mbolg. Cuid aca leighistear le purgóid, thuille aca ná bhfeadhfadh iad a leigheas in aoncor.\n", "school_info": "School: Achadh Tiobraid", "metadata": [{"Location:": "Aghatubrid, Co. Kerry", "Teacher:": "\nTomás Ó Muircheartaigh\n"}, {"Language": "Irish"}]}, "4758458/4746048/4783028": {"title": "Old Proverbs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0245, Page 019", "Page 019"], "url": "https://www.duchas.ie/en/cbes/4758458/4746048/4783028", "text": "\n(continued from previous page)\nHe that grasps at too much looses all\n\n\n\nIn the year     1887 there was drought in Ireland. That year the ponds and lakes dried up, and a lot of cattle died for the want of water.The crops also failed and the people thought that there would be a famine. The same year the grass was almost  burned off the ground. The drought lasted about two months.\n", "school_info": "School: Cill Mhuire", "metadata": [{"Location:": "Kilmurry, Co. Roscommon", "Teacher:": "\nMáire, Bean Uí Ruairc\n"}, {"Informant": "Mrs Mc Garry", "Gender": "female", "Address": "Rathmoyle, Co. Roscommon"}, {"Language": "English"}]}, "4758458/4746068/4783101": {"title": "Drought", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0245, Page 039", "Page 039"], "url": "https://www.duchas.ie/en/cbes/4758458/4746068/4783101", "text": "\nThere was no great drought in Ireland since 1921. In that year all the ponds and streams of my district were dried up and there was no water to be found anywhere. The people used to drive their cattle over to the river in Tarmon which is almost two miles away. They had to bring water in barrels from the river for using at home. That river runs through the bog in Tarmon and joins the river Suck.\n", "school_info": "School: Cill Mhuire", "metadata": [{"Location:": "Kilmurry, Co. Roscommon", "Teacher:": "\nMáire, Bean Uí Ruairc\n"}, {"Informant": "Francis Mc Gann", "Gender": "male", "Address": "Lissalway, Co. Roscommon"}, {"Language": "English"}]}, "4798665/4788417/4823670": {"title": "The Big Wind 1839", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0238, Page 085", "Page 085"], "url": "https://www.duchas.ie/en/cbes/4798665/4788417/4823670", "text": "\n(continued from previous page)\nfailed in coming that time.  Mr. Oliver Grace of Mantua went part of the way but many trees were blown down on rhe road. He travelled in a carriage drawn by two horses. One of his horses ran against a tree and the horse was killed and Mr. Grace had to return.  Pikes of hay were scattered and many other damages were done. Houses were thrown and two or three people were killed in this locality.\n\n\n\nAbout fifty years ago there was a strong thunder storm.  It started at twelve o'clock and many people were in bed.  It awakened the heaviest sleeper.  It continued for many hours.  People thought that it was the end of the world.\n\n\n\nSixty years ago there was a great drought period. Every well and pond dried up in this locality only lake and people came for miles to get the water.\n\n\n\nPatrick Neary was a good weaver.  He lived in Carrowrea.  The women in the locality used to spin the wool into worsted and then bring it to him to be weaved into blankets and other clothing.  Thomas Dockery was a weaver also.\n\n\n\nMrs Beirne of Eden & Kinclare was a spinner.  She used to spin the wool and then got it weaved into blankets.  Some of those blankets are seen still.  They are very good ones.  She used also knit stockings from the wool she would spin herself.\n", "school_info": "School: Mantua", "metadata": [{"Location:": "Mantua, Co. Roscommon", "Teacher:": "\nPádraig Ó Beirn\n"}, {"Collector": "Shelia Harrington", "Gender": "female", "Address": "Edenan and Kinclare, Co. Roscommon"}, {"Informant": "Patrick Mulvihill", "Gender": "male"}, {"Language": "English"}]}, "4798698/4791145/4924403": {"title": "My Home District", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0252, Page 230", "Page 230"], "url": "https://www.duchas.ie/en/cbes/4798698/4791145/4924403", "text": "\n(continued from previous page)\nplace. There is no weed of any description in Bally-day only the one we see in Cargin which is a mile to the West.\n\n\n\nThe Droughts of Cargins, Tulsk, County Roscommon.The Droughts lived in cargins to near the end of the last Century immediately after the aforementioned Dan kelly. The household consisted of the Captain and his wife and the servants. There were no children as far as I can understand. Lady Drought was an accomplished horsewoman and many is the Sunday the old people saw her either Driving in her carriage or riding her horse to Divine Service in the little church that stands at Clashaganny Crossroads. She had the reputation of being a very kind hearted woman, she always ded the wild birds that nestled around there and I believe all the neighbours in the vicinity were at liberty to have the loan of any Books they fancied out of the library in Cargins. The Captain did not reign long as master of this beautiful home having departed from \"this vale of tears\" when in the\n(continues on next page)\n", "school_info": "School: Clashaganny", "metadata": [{"Location:": "Clashaganny, Co. Roscommon", "Teacher:": "\nAlbert Flanagan\n"}, {"Collector": "Michael John Connolly", "Gender": "male", "Address": "Manor, Co. Roscommon"}, {"Informant": "Rita Kelly", "Gender": "female"}, {"Language": "English"}]}, "4922197/4859961/4941426": {"title": "Local Heroes - Great Jumpers", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0550, Page 230", "Page 230"], "url": "https://www.duchas.ie/en/cbes/4922197/4859961/4941426", "text": "\n(continued from previous page)\nUpperchurch, Co Tipperary.  William Carroll, Borrisleigh, Co Tipperary and Pat Riordan, Rosmult, townland of Rosmult, parish of Drumbank, Co Tipperary.  The onlookers were very many.  Being among one of the best jumpers in Co Tipperary he won many prizes.\n\n\n\nFifty two years ago from July to the end of September there was a great drought. The people used to have to go three miles for water. The people knew that is was coming because there was a heavy snow-fall the year before. It is said that when there is a heavy snowfall that there will be a drought after it. No damage was done to stock because the people tried  to keep the water drawn with horses and cars.\n", "school_info": "School: An Drom (Drom Thurles)", "metadata": [{"Location:": "Drom, Co. Tipperary", "Teacher:": "\nPilib Ó Ó Muireadhaigh, Pádraig Ó Cléirigh\n"}, {"Collector": "Rita Cahill", "Gender": "female", "Address": "Drom, Co. Tipperary"}, {"Informant": "James Cahill", "Gender": "male", "Address": "Drom, Co. Tipperary"}, {"Language": "English"}]}, "4921993/4916206/4947084": {"title": "Drought", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0496, Page 286", "Page 286"], "url": "https://www.duchas.ie/en/cbes/4921993/4916206/4947084", "text": "\nIn the years 1918-1919 there was a great spell of dry weather or drought in Ireland. The crops were very poor for want of rain especially the potatoes. The hay crops were light and there was very little after-grass. Springs, pumps, and rivers went dry and people had to draw water great distances for cattle and household purposes.In some places they suffered very badly for want of water especially Knockaderry. They had to draw the water three or four miles. Now, there is a reservoir built on the top of a hill near Knockaderry and the water is piped into the village, and Rathkeale is also supplied by it. The farmers also get it piped into a cement trough for their cattle at so much per head.\n", "school_info": "School: Cill Mhíde (C.), Caisleán Nua", "metadata": [{"Location:": "Kilmeedy, Co. Limerick", "Teacher:": "\nEibhlín Ní Bhraonáin\n"}, {"Collector": "Annie O Sullivan", "Gender": "female", "Address": "Gortnacreha Lower, Co. Limerick"}, {"Informant": "Mrs O Sullivan", "Gender": "female", "Address": "Gortnacreha Lower, Co. Limerick"}, {"Language": "English"}]}, "4758508/4750069/4953863": {"title": "Great Snowstorms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0847, Page 443", "Page 443"], "url": "https://www.duchas.ie/en/cbes/4758508/4750069/4953863", "text": "\n(continued from previous page)\nthe snow. He walked along till he came to a drift and he saw a chimney into which he nearly walked.Written by George Lanigan, Cluen, Inistioge.Sixty years ago there was a great snowfall. It was fourteen feet high in some places and not as high in other places. People could not go out for anything. All the people had to dig the roads through the snow to go to town to get food. They also had to make paths to get to Mass. It was very hard weather on horses and cattle and sheep and a lot of them were lost.\n\n\n\nIn the year 1911 there was a great drought. There was no rain for three months. All the grass was burned off the ground. Every well and stream went dry and a great number of cattle and sheep died with the drought.All the corn got ripe very quickly and the grain was very small. The harvest was cut that year in July. All the fruit was ripe very early. There was a vine tree growing at a house in the district. There was never\n(continues on next page)\n", "school_info": "School: Clodiagh, Inistioge", "metadata": [{"Location:": "Inistioge, Co. Kilkenny", "Teacher:": "\nDónall Ó Donnchadha\n"}, {"Collector": "Elizabeth White", "Gender": "female", "Address": "Clodiagh, Co. Kilkenny"}, {"Language": "English"}]}, "4922034/4920814/4955489": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0507, Page 407", "Page 407"], "url": "https://www.duchas.ie/en/cbes/4922034/4920814/4955489", "text": "\n(continued from previous page)\nbehind the beast, and then drive the pin into the ground through the Cross.  Your beast will recover, but if she does 'twill fall on yourself or somebody belonging to you.  (A.-C.)\n\n\n\nThe Drought.The last time we had such a spell of dry weather was in 1886.  I remember it well; The cattle were out from being constantly on the march looking for a mouthful of grass.  The fields were red and barren.  The oats was no good, it had to be pulled up as it would not be mowed and if it could 'nself it couldn't be bound (into sheaves), it was that short.  The trees were green, but the bushes were hardly so.  The people missed the bird's song.  The ground dried so that I used to hear the earth fell into the rabbit burrows in Glenma (A green and pleasant glen by the Maigue in Banogue parish D.C.) but the ground was so split open with the drought that the rabbits were able to run into the splits.  I did not see that, but I used to hear 'em talking of it.  The potato stalks were dwarfed and stunted, but thanks be to God and his Holy Mother, the rain came in August.  Soft, thick rain and man and beast laughed with the relief it was.   The weather was that soft and good that the drops came on as if 'twas only June and praises to His Holy Name, God sent the following.(Continued on page 111)\n(continues on next page)\n", "school_info": "School: Cromadh (B.)", "metadata": [{"Location:": "Croom, Co. Limerick", "Teacher:": "\nDáithí Ó Ceanntabhail\n"}, {"Informant": "Daniel Cussen", "Gender": "male", "Age": "70"}, {"Language": "English"}]}, "4922060/4848672/5010197": {"title": "Thunder-Storm of 1913", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0513, Page 487", "Page 487"], "url": "https://www.duchas.ie/en/cbes/4922060/4848672/5010197", "text": "\n(continued from previous page)\nlightning ceased when the rain fell heavily.  Far into the night it rained.\n\n\n\nDrought 1923It was a very dry summer, and the people who cut turf out on the mountain got it saved beautifully.  The potatoes were very good, also the oats, and other crops.  Fruit was in abundance.\n", "school_info": "School: Anglesboro (C.), Baile Mhistéala", "metadata": [{"Location:": "Anglesborough, Co. Limerick", "Teacher:": "\nBean Uí Dhonnchadha\n"}, {"Language": "English"}]}, "4922060/4848675/5010203": {"title": "1921 Drought", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0513, Page 490", "Page 490"], "url": "https://www.duchas.ie/en/cbes/4922060/4848675/5010203", "text": "\nIn the years 1921, there was a great drought which lasted for months.  Rivers and streams dried up and cattle were without water.  Farmers had to draw water a distance of 4 miles.I, James Doran, happened to be working for a local farmer and my heart was often sore for the poor beasts bellowing for water.  In several\n(continues on next page)\n", "school_info": "School: Anglesboro (C.), Baile Mhistéala", "metadata": [{"Location:": "Anglesborough, Co. Limerick", "Teacher:": "\nBean Uí Dhonnchadha\n"}, {"Language": "English"}]}, "4922298/4868171/5019870": {"title": "A Period of Drought", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0580, Page 071", "Page 071"], "url": "https://www.duchas.ie/en/cbes/4922298/4868171/5019870", "text": "\nThere was a terrible drought in the year 1887. It hardly rained from the 1st February till the 18th October. A little rain fell early in July but that was all.The grass got burned up and the cattle got weak and died for the want of food and water. Any of them that lived were diseased and were  no use any more. The crops never came up and there were no potatoes.The farmers tried to sell the cattle rather than they to die in their hands. They were sold very cheap as the best cows were sold for £3 each. The calves were sold for a very little price, and all other farm animals were very cheap also.The earth dried up and big cracks appeared on the ground. Some of them were so big that handle of a spade could be shoved into them. Except in very few places there was no grass.Some people had land which held water. Those people were very well off and made a lot of money. They used to buy cattle from their neighbours for very little money.Meadowing rose to a very high price. Hay also rose to an extraordinary price. The hay of one small field about two acres was sold for nearly £100.Daniel BarryGurteen,Emly\n", "school_info": "School: Emly (B.)", "metadata": [{"Location:": "Emly, Co. Tipperary", "Teacher:": "\nTomás Ó Lachtnáin\n"}, {"Collector": "Daniel Barry", "Gender": "male", "Address": "Gorteen, Co. Tipperary"}, {"Informant": "William Mitchel", "Gender": "male", "Address": "Bartoose, Co. Tipperary"}, {"Language": "English"}]}, "4922259/4864983/5021534": {"title": "The Great Drought", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0571, Page 133", "Page 133"], "url": "https://www.duchas.ie/en/cbes/4922259/4864983/5021534", "text": "\nAbout the year 1887 there was a great drought. During this time very few crops grew and whatever grew were very poor. The grass was all burned, and all the streams, and wells were dried up.About half a mile outside Ardfinnan there is a small wood, and this wood was so turned, and dry that one match set the whole of it on fireThe country remained without rain from the 3rd February until the 6th September, and on that date we got the first drop of rain after six months.\n", "school_info": "School: Ardfinnan (B.), Cahir", "metadata": [{"Location:": "Ardfinnan, Co. Tipperary", "Teacher:": "\nW. J. Nugent\n"}, {"Collector": "Frank Brunnick", "Gender": "male", "Address": "Ardfinnan, Co. Tipperary"}, {"Informant": "Edmond Burke", "Gender": "male", "Age": "circa 64", "Address": "Ardfinnan, Co. Tipperary"}, {"Language": "English"}]}, "4922259/4864984/5021536": {"title": "The Great Drought", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0571, Page 134", "Page 134"], "url": "https://www.duchas.ie/en/cbes/4922259/4864984/5021536", "text": "\nThere was a great drought in the year 1887. The only crops that grew well were wheat, and potatoes. The oats, turnips and mangels failed.All ponds, and  streams  dried up, and water had to be brought from the river. The fields    were burned, and there was no grass. There was no rain from 3rd February to the 6th September.\n\n\n\nThere was a great storm in the year 1903. A great number of trees and houses were blown down. A good many people stayed out as they were afraid to stay in their homes.\n\n\n\nThere was a great snowstorm in the year 1826. There was no sign of it when the people were going to bed, and when they opened the doors in the morning the\n(continues on next page)\n", "school_info": "School: Ardfinnan (B.), Cahir", "metadata": [{"Location:": "Ardfinnan, Co. Tipperary", "Teacher:": "\nW. J. Nugent\n"}, {"Language": "English"}]}, "4922225/4862391/5022376": {"title": "Great Drought Periods", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0557, Page 488", "Page 488"], "url": "https://www.duchas.ie/en/cbes/4922225/4862391/5022376", "text": "\nGreat Drought Periods.The year Nineteen Hundred and Nineteen was one of the driest years we had for a long time there was scarcely any rain from May day until December of that year. All the ponds where cattle used to get water were dried up. People had to cart water and for household work, in parts of the country as far as eight miles. Where there were big numbers they had to be driven to the nearest river. A lot of cattle suffered from \"murrin\" and died, owing to not having water enough on the land. All the crops were very poor that year owing to the drought, corn was not worth cutting and hay on limestone land was so burned, that it could not be cut with a machine it was so short.\n", "school_info": "School: Cill Loiste (Killusty), Fíodh Árd", "metadata": [{"Location:": "Killusty North, Co. Tipperary", "Teacher:": "\nMáire, Bean Uí Mheacháir\n"}, {"Collector": "Patrick Butler", "Gender": "male", "Address": "Tullow, Co. Tipperary"}, {"Informant": "Pierce Butler", "Gender": "male", "Age": "48", "Address": "Tullow, Co. Tipperary"}, {"Language": "English"}]}, "4922225/4862449/5022511": {"title": "Great Drought Periods", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0557, Page 545", "Page 545"], "url": "https://www.duchas.ie/en/cbes/4922225/4862449/5022511", "text": "\nThe year Nineteen Hundred and Nineteeen was one of the driest years we had for a long time, there was scarcely any rain from May day 'till December of that year. All the ponds where cattle used to get water were dried up. People had to cart water to cattle, and for household work in parts of the country, as far as eight miles. Where there were big numbers they had to be driven to the nearest river. A lot of cattle suffered from \"murrin\" and died, owing to not having water enough   on the land.All the crops were very poor that year, corn was not worth cutting, and hay on limestone land was so burned that it could not be cut, it was so short.Pierce  Buter (48)Tullow KillustyFethard\n", "school_info": "School: Cill Loiste (Killusty), Fíodh Árd", "metadata": [{"Location:": "Killusty North, Co. Tipperary", "Teacher:": "\nMáire, Bean Uí Mheacháir\n"}, {"Collector": "Patrick Butler", "Gender": "male", "Address": "Tullow, Co. Tipperary"}, {"Informant": "Pierce Butler", "Gender": "male", "Age": "48", "Address": "Tullow, Co. Tipperary"}, {"Language": "English"}]}, "5070805/5065880/5096337": {"title": "Severe Weather - Snow", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1006, Page 037", "Page 037"], "url": "https://www.duchas.ie/en/cbes/5070805/5065880/5096337", "text": "\n(continued from previous page)\ntook horses and carts with heavy loads across it.\n\n\n\nAbout the year 1921 there came a very dry summer, people had to draw water for their animals miles from lakes as all wells or watering places dried up, this drought lasted the summer months and many animals died for the want of water, and crops were very poor in sandy or dry land because they had no water to make them grow.\n", "school_info": "School: Carrickgorman", "metadata": [{"Location:": "Carrickgorman, Co. Cavan", "Teacher:": "\nM. Fleming\n"}, {"Collector": "Dorcas Cox", "Gender": "female", "Address": "Corlurgan, Co. Cavan"}, {"Informant": "Mr Hugh Cox", "Gender": "male", "Age": "55", "Address": "Corlurgan, Co. Cavan"}, {"Language": "English"}]}, "5009302/5005879/5133864": {"title": "Great Drought Periods", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0892, Page 197", "Page 197"], "url": "https://www.duchas.ie/en/cbes/5009302/5005879/5133864", "text": "\n197During the early part of 1938 - lasting for 3 or 4 months - an unusual drought period occurred.  Nothing like it had occurred in living memory, the old people said.  Farmers were delayed in sowing their crops until it was practically too late to sow.  This drought seems to have been world-wide and it was feared that a world-wide famine was imminent.  However, rain came at last, almost too late.  Crops turned out better than was expected, but the rain which began then has lasted almost to the present date - 9th Jan. 1939 - with the result that farmers have had a very bad summer to ripen their crops, an autumn in which it was almost impossible to save their crops.  In addition to rain, there were occasional strong winds which wrought destruction on the grain crops.It was only by snapping at the odd fine periods and working hard overtime that some harvests were partially saved.  Some lost their harvests and in this locality - Bunclody district - the majority of the people have not yet taken out their potatoes.\n", "school_info": "School: Bunclody", "metadata": [{"Location:": "Bunclody, Co. Wexford", "Teacher:": "\nMáighréad, Bean Uí Dhuinnshéibhin\n"}, {"Language": "English"}]}, "4921609/4884699/5148946": {"title": "House Burnings", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0293, Page 059", "Page 059"], "url": "https://www.duchas.ie/en/cbes/4921609/4884699/5148946", "text": "\nMr Jeremiah O'Sullivan's house in Coolagh was burned by the Black and Tans as it was suspected that he was harbouring and helping members of the I.R.A. in his house, but afterwards he applied for compensation for the damage and it was granted to him and the house was re-built.Schull Union was burned by the I.R.A.  about June 1922 and it was not re-built since.\n\n\n\nA drought period occurred in the year 1857. It is called \"the dry summer\". Some people had to go  miles for fresh water. The rivers dried up and boggy ground split open.\n", "school_info": "School: Doirín an Lomáin", "metadata": [{"Location:": "Derreennalomane, Co. Cork", "Teacher:": "\nSeán de Barra\n"}, {"Collector": "Cornelius Moynihan", "Gender": "male", "Address": "Rathruane Beg, Co. Cork"}, {"Informant": "Mr C. Moynihan", "Relation": "grandparent", "Gender": "male", "Age": "75", "Address": "Rathruane Beg, Co. Cork"}, {"Language": "English"}]}, "4921605/4884133/5149441": {"title": "A Storm", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0291, Page 069", "Page 069"], "url": "https://www.duchas.ie/en/cbes/4921605/4884133/5149441", "text": "\n(continued from previous page)\nand big cracks were put in them, and they were filled with water. Some houses had big trees around them and they were torn down. Vincent KellyStation House\n\n\n\nThere was a great drought period in the year 1878. The drought lasted from April till November.All the rivers     and lakes of this district dried, and water could not be got anywhere except in spring wells.During the drought the farm animals were exhausted from the drought because they could not get any water.Michael MahonySkehanore\n", "school_info": "School: Béal Átha an Dá Chab", "metadata": [{"Location:": "Ballydehob, Co. Cork", "Teacher:": "\nRisteárd Ó Lighin\n"}, {"Collector": "Michael Mahony", "Gender": "male", "Address": "Skeaghanore East, Co. Cork"}, {"Informant": "Jerry Mahony", "Gender": "male", "Address": "Skeaghanore East, Co. Cork"}, {"Language": "English"}]}, "4921642/4887263/5152596": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0313, Page 116", "Page 116"], "url": "https://www.duchas.ie/en/cbes/4921642/4887263/5152596", "text": "\nThere was a drought here about 40 years ago which lasted for a couple of months. The grass and even the bushes withered.\n\n\n\nWhen Timothy Holland's grandfather was growing up (about 100 years ago) a teacher used to spend a few nights in that house each week teaching the Holland's and their neighbours. Then he used spend the remaining nights in another house a few miles distant or so and have his school there. After a few weeks the meeting place used be changed to another local house, probably William Driscoll's . The teacher never stayed too long in the same house. All Irish they spoke . Even Timothy Holland's mother was examined in her prayers and Catechism in Irish for confirmation about 75 years or more ago\n(continues on next page)\n", "school_info": "School: Boireann", "metadata": [{"Location:": "Burren, Co. Cork", "Teacher:": "\nEibhlín Ní Bhriain\n"}, {"Informant": "Timothy Holland", "Gender": "male", "Age": "61", "Occupation": "feirmeoir", "Address": "Clooncalla More, Co. Cork"}, {"Language": "English"}]}, "4921819/4909079/5182165": {"title": "Severe Weather - Drought 1819", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0373, Page 045", "Page 045"], "url": "https://www.duchas.ie/en/cbes/4921819/4909079/5182165", "text": "\nIn the summer of 1819, no rain fell for three months, and a great many old people died from the intense heat. It is said the river Funcheon ran dry this year.\n", "school_info": "School: Glanworth (B.)", "metadata": [{"Location:": "Glanworth, Co. Cork", "Teacher:": "\nLiam Ó Ríoghbhardáin\n"}, {"Collector": "Timothy Barry", "Gender": "male", "Address": "Ballylegan, Co. Cork"}, {"Informant": "Mr David Fitzgibbon", "Relation": "parent", "Gender": "male", "Age": "70", "Address": "Ballylegan, Co. Cork"}, {"Language": "English"}]}, "4921819/4909083/5182175": {"title": "Severe Weather - Drought - 1887", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0373, Page 049", "Page 049"], "url": "https://www.duchas.ie/en/cbes/4921819/4909083/5182175", "text": "\nThere was a long period of dry weather in 1887. Rivers and wells ran dry and the grass was brown and white in colour.\n", "school_info": "School: Glanworth (B.)", "metadata": [{"Location:": "Glanworth, Co. Cork", "Teacher:": "\nLiam Ó Ríoghbhardáin\n"}, {"Collector": "Timothy Barry", "Gender": "male", "Address": "Ballylegan, Co. Cork"}, {"Informant": "Mr David Fitzgibbon", "Gender": "male", "Age": "70", "Address": "Ballylegan, Co. Cork"}, {"Language": "English"}]}, "4678384/4674318/5193213": {"title": "An Doineann", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0419, Page 017", "Page 017"], "url": "https://www.duchas.ie/en/cbes/4678384/4674318/5193213", "text": "\n(continued from previous page)\nan mbaoghal ceadhna mar is geall le hártach an t-oileán seo.\n\n\n\nTimcheall leath chéad bliadhan ó shoin san Nodhlaig tháinig triomacht millteach. Ní geabhfá braon uisge dá dtabharfá do bheathadh air. Bhí trí nú ceathair de toibaireacha ann agus thriomuigheadar suas. Do chaitheadh (seana) mná agus fearaibh dul le na mbucaidí dá mhíle ó bhaile go dtí tobar nár triomuig riamh .i. tobar an \"Buailteóra\" chun biadh na Nodhlag a d'ollmhú. Do bhí an féar iompuighthe ruadh air na cnoic agus é iompuighthe bán air na páirceanna - gach rud spallta.\n\n\n\nCeathair nú cúig de bhliadhanta ó shoin bhí an aimsir go h-aoibhínn. Ba mór an seó an brothall. Lá amháin tháinig an doircheacht, do dhuibh na tighthe, do dhuibh an áit, do dhuibh an domhan. Do chaitheadh\n(continues on next page)\n", "school_info": "School: An Bloscaod Mór", "metadata": [{"Location:": "Great Blasket Island, Co. Kerry", "Teacher:": "\nMáire Nic Gearailt\n"}, {"Language": "Irish"}]}, "5008904/4965528/5238959": {"title": "The Year of the Great Drought", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0685, Page 216", "Page 216"], "url": "https://www.duchas.ie/en/cbes/5008904/4965528/5238959", "text": "\nIn the year 1887 there was a great drought in Ireland. All the wells, rivers, and streams, that were never known of to have gone dry, went dry in that year. A well at the back of Paddy Wiseman's house, never known of before by man to go dry went dry also. The oats grew about nine inches long, but there was plenty of grain on it. It was known to the poor people as the year of the great drought, or the year of the short oats. The oats was not long enough to tie bundles of itself. The people had to carry bundles of straw out to the fields in order to tie bundles of oats.\n", "school_info": "School: Whitecross, Julianstown", "metadata": [{"Location:": "Whitecross, Co. Meath", "Teacher:": "\nCriostóir Breathnach\n"}, {"Collector": "May Bird", "Gender": "female", "Address": "Ballygarth, Co. Meath"}, {"Informant": "Geo. King", "Address": "Julianstown, Co. Meath"}, {"Language": "English"}]}, "5235179/5225840/5244203": {"title": "An Doineann", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0086B, Page 07_052", "Page 07_052"], "url": "https://www.duchas.ie/en/cbes/5235179/5225840/5244203", "text": "", "school_info": "School: An Corrán/Currane", "metadata": [{"Location:": "Currane, Co. Mayo", "Teacher:": "\nMícheál P. Ó Gallachobhair\n"}, {"Collector": "Pádraig Ó Máille", "Gender": "male", "Address": "Gubnahardia, Co. Mayo"}, {"Informant": "Pádraig Ó Máille", "Relation": "grandparent", "Gender": "male", "Address": "Gubnahardia, Co. Mayo"}]}}