{"4427829/4348085/4455877": {"title": "Old Stories", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0094, Page 240", "Page 240"], "url": "https://www.duchas.ie/en/cbes/4427829/4348085/4455877", "text": "\nLong ago there lived seven monks in an island in Lough Con which is called Glass Island.  They had one cow which would fill any kind of a vessel however big with milk.  It is said that she was a fairy cow.A witch lived near where the monks lived and one day she heard about the cow that the monks had.  She said \"I will get a vessel that the cow will not fill.\"  No you will not the monks said. \"Yes I will said the witch so she went home and it was not long until she returned carrying a sieve in her hand.  The monks knew that the cow could not fill the sieve and the next day the cow died and every calf that she had also died.This is a story I heard about the round Tower of Turlough.  One day a lot of men gathered to-together outside the tower and a man said \"Any man who will throw a horse's bridle across the tower will get four shillings.\" It failed every man esccept [sic] the last one to throw the bridle across the tower.  The last man was a big strong man and he took the bridle and flung it across the tower.  The bridle had only fallen the other side when down rolled a big stone and fell on the hand of the man who threw the bridle across the tower and killed him.  The old people say that it is not right\n(continues on next page)\n", "school_info": "School: Grianán", "metadata": [{"Location:": "Greenans, Co. Mayo", "Teacher:": "\nMáiréad Bean Uí Riagáin\n"}, {"Collector": "Martin Timlin", "Gender": "male", "Address": "Gort, Co. Mayo"}, {"Language": "English"}]}, "4428146/4381697/4457557": {"title": "An Glas Gamhnach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0650, Page 107", "Page 107"], "url": "https://www.duchas.ie/en/cbes/4428146/4381697/4457557", "text": "\nTimpeall sé mhíle ar an dtaobh thiar de cathair Portláirge in áit ar a nglaotar an Cnoc Dubh tá carraig mór agus ar an gcarraig seo tá rian crúb bó agus stóil. Tamall beag isteach ón mbóthar atá an charraig seo agus tagann daoine ina sluaite ann ó gach áird chun í d'fheiscint.Tá scéal uaigneach i dtaobh na carraige seo ag na sean-daoine :Fadó seasadh bó ar a dtugtaí an Glas-Gamhnach ar an gcarraig seo agus tagadh daoine bochta ó gach áit sa cheanntair chun é a chrúadh. Crúadh gach éinne a dhóthain bainne uaithi agus líonadh sí gach arthrach ina gcrútaí í. Deireann na daoine go líonadh sí pé arthrach dá mhéad é. Seasadh sí i gcónaí ar an gcarraig agus ní raibh a fhios ag éinne cá gheibheadh sí bia. Is dócha gurab é Dia a chuir ann í chun bainne a thabhairt dos na daoine ná raibh bó ná gabhar aca le linn an droch-saol.Bhí sean-bhean ghrannda sanntach ina cónaí san áit agus chuir sí geall le comharsain di go dtabharfadh sí féin árthrach léi ná líonfadh an ghlas-gamhnach. Tháinigh sí chun an bó do crúadh agus iad a bhearfadh sí léi ná criathar! Bhí a fhios aici ná féadfadh an bó an criathar a líónadh agus thosnaigh sí á crúadh. D'oibrig sí léi agus an bainne ag imeacht trí thóin an chréichir gur thosnaigh siní na bó ag tabhairt fola. Chrom an bó ag scréacadh agus nuair chonaic sí a bainne ar an dtalamh chuir sí béic mí-nádúrtha aisti agus chuir chun siúl í agus í ag búirthigh. Ní fheadar éinne cá ndeachaidh sí ach ní fuarthas a tásg ná a tuarisc riamh ó shoin.\n", "school_info": "School: An Chill, Dúngarbhán", "metadata": [{"Location:": "Kill, Co. Waterford", "Teacher:": "\nTomás Breathnach\n"}, {"Collector": "Máiréad Tóirpí", "Gender": "female"}, {"Language": "Irish"}]}, "4428146/4381791/4457620": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0650, Page 165", "Page 165"], "url": "https://www.duchas.ie/en/cbes/4428146/4381791/4457620", "text": "\nThere is a lake about a half a mile from my house and the old people say that there is no bottom to it. They say it was there that the Glas Gamhnach rolled herself and the pond is to be seen there since. It was dry land before she rolled herself there.Tá mo teach i dtalamh Sheáin Uí Crotaig i mBréanainn, timpeall ceithre míle ar an dtaobh thiar den áit seo.\n", "school_info": "School: An Chill, Dúngarbhán", "metadata": [{"Location:": "Kill, Co. Waterford", "Teacher:": "\nTomás Breathnach\n"}, {"Collector": "Seumas Paor", "Gender": "male"}, {"Language": "mixed"}]}, "4428148/4381892/4458224": {"title": "Stories", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0650, Page 255", "Page 255"], "url": "https://www.duchas.ie/en/cbes/4428148/4381892/4458224", "text": "\nStoriesLong ago there were people liv-ing in Blacknock, near Kilmeaden,about seven miles from Waterford,and they had a good milking cow,and she died.So one day, a cow, and a calf, came to them, and this cow was a good milking cow.Any vessel that would be put underher, she would fill it.So one day, the servant brought out, a sieve, and the cow could not fill it,but the servant kept on milking her.So the cow and calf bawled, andran down the field, and were neverheard of again.There is a place in Blacknock\"called the cow's track\", where thefootsteps of the cow and the threeholes of the milking stool, are stillto be seen there.\n", "school_info": "School: Baile Uí Dhuibh, Kilmeaden", "metadata": [{"Location:": "Ballyduff West, Co. Waterford", "Teacher:": "\nCaitlín Madders\n"}, {"Language": "English"}]}, "4428067/4374573/4463332": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0150, Page 277", "Page 277"], "url": "https://www.duchas.ie/en/cbes/4428067/4374573/4463332", "text": "\nOnce upon a time there lived a man named Gobniu in Ireland. He had a wonderful cow. She used to graze from one end of Ireland to the other in one day. She had as much milk as ten cows. She was known everywhere as the cow of plenty. Now Balor of the evil eye set his heart on this fine animal, and he sent a man to steal it. The thief came in the dark of the night and he came quietly but he did not come quietly enough. Gobniu heard him, and he rose from his bed.\"Who is there\" he called and his voice like thunder. The thief crept away in the dark of the night, glad to escape with his life. Gobniu found his cow quite safe, but her magic halter was gone. The thief had carried\n(continues on next page)\n", "school_info": "School: Corra-bheagáin", "metadata": [{"Location:": "Corraveggaun West, Co. Mayo", "Teacher:": "\nPádhraic Mac Congamhna\n"}, {"Collector": "Rita Breslin", "Gender": "female", "Address": "Derrymannin, Co. Mayo"}, {"Informant": "John Breslin", "Gender": "male", "Address": "Derrymannin, Co. Mayo"}, {"Language": "English"}]}, "4428117/4379874/4463828": {"title": "Carraig an Ghlais Ghaibhneach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0643, Page 075", "Page 075"], "url": "https://www.duchas.ie/en/cbes/4428117/4379874/4463828", "text": "\nAr Cnoc an Phaoraigh atá an Carraig seo i bparóiste Baile Dubh. Cloch shleamhain mín atá inti. Tá trácht ar an nglas Ghaibhneach ar fuaid na Mumhan. Amach as an bhfarraige a tháinigh sí ag bun abha. Bhí laigh ag dul léi. Innistear dúinn gur ar máithe leis na daoine bochta a thagadh sí i dtír agus go líonadh sí gach coileán Rúidhte pé méad a bheadh ann. Bhí bean éigint ann nár chuir Dia ar a leas. Thug sí léithe criothar cun na glaise gagnaighe do clú. Ach nuair a chonaic an bó an cleas a bhí ag an mnaoi scaoil sí búir aiste agus seo amach chun farraige arís í.tá rian cos na bó go soiléar ins an gcloch. tá rian trí gcos an stóilín mar a mbíodh lucht crúidte ina shuí. Tá rian an buicéid go soiléar ag rian cos an larigh.Slinntreacha atá sa chloic tá an taobh dí atá ar thaoibh na gaoithe anoir, Síon idthe. Is féidir na shontreacha a bhriseadh leis an láimh. Is cosúil gur brácht an cloch tríd an talamh gur deineadh claochló uirthi agus gur caitheadh aníos láibh. Tá na mílte troig de bhonn cloc sa cnoc ceadna agus iad measctha go maith sa t-slí nárbh iongach go dteighfeadh an cloch. Is cosamhail leis gurb é sin an uair a tháinigh an gabhneach. Sé sin gur tháinigh sí sara raibh an fuaradh déanta ag an gcloich.Cow Rock a thugann muintir na h-áite ar an gCarraig seo.\n", "school_info": "School: Áird Mhór,  Eóchaill", "metadata": [{"Location:": "Ardmore, Co. Waterford", "Teacher:": "\nRisteárd Neancól\n"}, {"Language": "Irish"}]}, "4427991/4364955/4468142": {"title": "An Gobán Saor", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0131, Page 16", "Page 16"], "url": "https://www.duchas.ie/en/cbes/4427991/4364955/4468142", "text": "\n(continued from previous page)\nmhullach a chinn sa mbosca agus dhruid sí an chomhla air gur fhág sí ann é.Nuair a chualaidh Rí Shasana an sgéal faoi'n a mhac a bheith ceapaighthe leíg sé an gobán is a mhac abhaile agus niorbh fhada ina dhiaidh sin go raibh a mhac fein slán sabhailte sa mbaile aige aríst.\n\n\n\nBhí Rí in Éirinn fadó agus bhí trúir mac aige. Chuireadh sé amach duine aca gach lá ag faire ar an nglas geibhne bhí aige. Bhí an oiread sin draoidheachta ag baint leíthi, dá dtógthá do shúil dhí, bhí sí imhtighthe gan fios gan faisneis cá ndeachaidh sí. An chéad fear a chuaidh amach dá faire thug sé isteach maith go leór í. An dara fear a chuaidh amach thug seisean isteach maith go leór freisin. Acht chuaidh an fear\n(continues on next page)\n", "school_info": "School: Ceathrú Thaidhg", "metadata": [{"Location:": "Carrowteige, Co. Mayo", "Teacher:": "\nPádraig Mag Shamhráin, Pádhraic Ó Gacháin\n"}, {"Collector": "Pádhraic De Burca", "Gender": "male", "Address": "Portacloy, Co. Mayo"}, {"Informant": "Tomás De Burca", "Gender": "male", "Age": "46", "Address": "Portacloy, Co. Mayo"}, {"Language": "Irish"}]}, "4428041/4371631/4474682": {"title": "Leac Phoill na Bó Maóile", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0144, Page 448", "Page 448"], "url": "https://www.duchas.ie/en/cbes/4428041/4371631/4474682", "text": "", "school_info": "School: Teampall Mhuire", "metadata": [{"Location:": "Carbad Beg, Co. Mayo", "Teacher:": "\nEithne, Bean Uí Mhaonghaille\n"}, {"Collector": "Bridie Lynn", "Gender": "female", "Address": "Cartoon, Co. Mayo"}, {"Informant": "Mrs Lynn", "Relation": "unknown", "Gender": "female", "Address": "Cartoon, Co. Mayo"}, {"Language": "English"}]}, "4428060/4373721/4478127": {"title": "A Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0148, Page 367", "Page 367"], "url": "https://www.duchas.ie/en/cbes/4428060/4373721/4478127", "text": "\nOnce upon a time there were no cows in Ireland but red cows. One day when a farmer went into his field he saw a white cow among his cattle and he did not know where she came from. He left her in the field She was a very good cow for giving milk he keept here for a long time. She had a few calves which were white also. When the cow was getting old the farmer went to kill her. He went into the field to kill the cow. All the people gathered to see the white cow die. but when the farmer went to kill her, the cow and her calves rose in the air and went away But one did not go. She turned black and she was the first black cow ever seen in Ireland.\n", "school_info": "School: Ráth na mBeach", "metadata": [{"Location:": "Rathnamagh, Co. Mayo", "Teacher:": "\nR. Ó Gallchobhair\n"}, {"Collector": "Eamonn Mac Aindriú", "Gender": "male", "Address": "Knockadangan, Co. Mayo"}, {"Language": "English"}]}, "4493630/4405585/4514811": {"title": "Oirthear Dhumhaigh", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1074, Page 59", "Page 59"], "url": "https://www.duchas.ie/en/cbes/4493630/4405585/4514811", "text": "\n(continued from previous page)\nDubhairt an gabha go rabh cinnte\"Tá siad go láidir annseo anois\", arsa an coimthigheach, \" ach tiocfadih an lá nach mbéidh cuimhne ortha, nó duine a maoidheamh ortha.\"Anois nil duine de'n sloinne sa bhaile talaimh sin nó ó Ghaoth Dobhair go Leitir Cheanainn ach a'n duine amháin.\n\n\n\nDubhairt sé go mbéadh bádaí ag seoladh san aer, carrannaí ag dul ar na bealaighe móra gan beithidhigh agus an maide mullaigh ar Éirinn (wireless) agus go muirbhfidhe gach duine ó Dhoire go Cuan na nGall in-oidhche amháin.\"Mo thrí thruaighe, naoi n-uaire Toraigh ó thuaidh agus Éirinn\n(continues on next page)\n", "school_info": "School: Ceathramhadh Ceanainn (C.)", "metadata": [{"Location:": "Carrowcanon, Co. Donegal", "Teacher:": "\nÁine Ní Dhochartaigh\n"}, {"Collector": "Áine Ní Dhocartaigh", "Gender": "female"}, {"Informant": "Nuala Bean Uí Ghallchobhair, Nuala Ní Dubhgháin", "Gender": "female", "Occupation": "bean feirmeora", "Address": "Ballyness, Co. Donegal"}, {"Language": "Irish"}]}, "4493720/4414284/4527734": {"title": "Béaloideas - The Glas gCailín", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1100, Page 83", "Page 83"], "url": "https://www.duchas.ie/en/cbes/4493720/4414284/4527734", "text": "\nOnce upon a time I heard about a cow that came to Lismulladuff and she gave a quart of milk to every one [sic] who came and milked her every night and morning. The people called her the Glas Gcailín and she stayed at the Tobar Abhog. Some of the people fought about her and they were going to kill her. She walked down the road and all the calves that she had followed her and when she came the length of the Swilly she walked into it and was drowned.\n", "school_info": "School: Lios Mullaigh Dhuibh", "metadata": [{"Location:": "Lismullyduff, Co. Donegal", "Teacher:": "\nAodh Mac Giolla Eóin\n"}, {"Collector": "Róise Ní Ghionntaigh", "Gender": "female", "Address": "Killygordon, Co. Donegal"}, {"Informant": "Peter Mac Ginty", "Relation": "parent", "Gender": "male", "Age": "58", "Address": "Killygordon, Co. Donegal"}, {"Language": "English"}]}, "4493720/4414285/4527735": {"title": "Béaloideas - The Glas gCailín", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1100, Page 84", "Page 84"], "url": "https://www.duchas.ie/en/cbes/4493720/4414285/4527735", "text": "\nOnce upon a time I heard my mother say about a cow that came to Lismulladuff and she gave milk to the people. There was a man and his wife made up their minds to kill her. The morning there were going to kill her she went down the road and she walked until she came to Lough Swilly and she went in to the Swilly and was seen no more.\n", "school_info": "School: Lios Mullaigh Dhuibh", "metadata": [{"Location:": "Lismullyduff, Co. Donegal", "Teacher:": "\nAodh Mac Giolla Eóin\n"}, {"Collector": "Anna B. Ní Bhrían", "Gender": "female"}, {"Language": "English"}]}, "4569050/4566791/4573370": {"title": "An Old Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0034, Page 0206", "Page 0206"], "url": "https://www.duchas.ie/en/cbes/4569050/4566791/4573370", "text": "\nAn Old Story.In time of old, it is said, a troop of fairies used to play about the borders of an Irish lake. Eack fairy had golden hair and was beautiful to see as she tripped along through the meadows, in her bright green dress, leading a milk-white hound and driving before her a white cow whose coat shone like silver. One day a cow strayed from a fairy herd and was caught by an old farmer. He found her among his own cows and liked her colour, which was new to him. In those early times, we are told, the colour of all Irish cows was a mixture of red and white, old fairy cows were pure white, and there was not a black cow to be seen in all the land.\n(continues on next page)\n", "school_info": "School: Ganntaigh (Ganty)", "metadata": [{"Location:": "Ganty, Co. Galway", "Teacher:": "\nSorcha Bean Uí Chlúin\n"}, {"Informant": "Brian Uniacke", "Gender": "male", "Age": "58", "Occupation": "farmer", "Address": "Lissalondoon, Co. Galway"}, {"Language": "English"}]}, "4591086/4589252/4593396": {"title": "A Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0012, Page 038", "Page 038"], "url": "https://www.duchas.ie/en/cbes/4591086/4589252/4593396", "text": "\nThere was once a man and he was very poor. He had no cow for milk. One day he went out to the field weeping. Suddenly a small red man came before him and asked him why he was weeping. He said that his wife and his children would die for want of milk. The fairy said to him, \"Go in to the stable and you will find a cow in it.\" When the man went in to the stable he found a white cow. After a while he made up his mind to sell the cow. When he was bringing the cow to the fair she ran away down the mountains from him and disappeared.\n\n\n\nThere was a boy who was always going visiting. One night his parents told him not to go. He did not obey them and he went. He had a brother older than\n(continues on next page)\n", "school_info": "School: Leitre", "metadata": [{"Location:": "Lettera, Co. Galway", "Teacher:": "\nSeán Ó Reachtaire\n"}, {"Collector": "Willie Keaveny", "Gender": "male", "Address": "Polleighter, Co. Galway"}, {"Informant": "Mr Pat Keaveny", "Relation": "unknown", "Gender": "male", "Address": "Polleighter, Co. Galway"}, {"Language": "English"}]}, "4613671/4607057/4623991": {"title": "Trí Bhua an Fhir Shona", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0016, Page 163", "Page 163"], "url": "https://www.duchas.ie/en/cbes/4613671/4607057/4623991", "text": "\nTRÍ BHUAIBH AN FHIR SONA ( agus is fíor iad )Fence, Watching, EarlinessFál, Fáire agus Mochthoreacht(ie  a good ditch for fences; an eye to his business    and Rise early )\n\n\n\nTa ceithre buaib ag an gcat. 1/4 for 4 \" \" D'íoc sé ceitre buinn ar na 4 bhuaibh1. D'íoc sé ceithre buinn ar a chuig bainne gan uisge tríd.2. \" \" \" \" ar luch a fheiceál ins a dorchadas3. \" \"\" \" a theacht ar an luch in unas (gan fhios)4. \" \" \" \" aon ceó da bean a tighe sá bácad sí giobach in a díaifh a bheith aige.\n\n\n\nThis was a cow that was grazing all along the country side. There was no owner. Anybody could milk her for she was very quite. She never failed to fill the vessel of anyone who milked her. She seemed to be there to feed the poor & from the mercy of God. Of course 'the woman' had  to come & brought a sieve to milk her in, She didnt & couldnt fill it & never gave milk after. She then disappeared from this part of the country Uncle Patch _ RIP often and often told me this story about the Glassnach\n", "school_info": "School: Gort na Díogha", "metadata": [{"Location:": "Gortnadeeve West, Co. Galway", "Teacher:": "\nSéamus Ó Dochartaigh, Bean Uí Dhochartaigh\n"}, {"Language": "mixed"}]}, "4613671/4607057/4623992": {"title": "Trí Bhua an Fhir Shona", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0016, Page 163", "Page 163"], "url": "https://www.duchas.ie/en/cbes/4613671/4607057/4623992", "text": "\nTRÍ BHUAIBH AN FHIR SONA ( agus is fíor iad )Fence, Watching, EarlinessFál, Fáire agus Mochthoreacht(ie  a good ditch for fences; an eye to his business    and Rise early )\n\n\n\nTa ceithre buaib ag an gcat. 1/4 for 4 \" \" D'íoc sé ceitre buinn ar na 4 bhuaibh1. D'íoc sé ceithre buinn ar a chuig bainne gan uisge tríd.2. \" \" \" \" ar luch a fheiceál ins a dorchadas3. \" \"\" \" a theacht ar an luch in unas (gan fhios)4. \" \" \" \" aon ceó da bean a tighe sá bácad sí giobach in a díaifh a bheith aige.\n\n\n\nThis was a cow that was grazing all along the country side. There was no owner. Anybody could milk her for she was very quite. She never failed to fill the vessel of anyone who milked her. She seemed to be there to feed the poor & from the mercy of God. Of course 'the woman' had  to come & brought a sieve to milk her in, She didnt & couldnt fill it & never gave milk after. She then disappeared from this part of the country Uncle Patch _ RIP often and often told me this story about the Glassnach\n", "school_info": "School: Gort na Díogha", "metadata": [{"Location:": "Gortnadeeve West, Co. Galway", "Teacher:": "\nSéamus Ó Dochartaigh, Bean Uí Dhochartaigh\n"}, {"Language": "Irish"}]}, "4613671/4607057/4623993": {"title": "Trí Bhua an Fhir Shona", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0016, Page 163", "Page 163"], "url": "https://www.duchas.ie/en/cbes/4613671/4607057/4623993", "text": "\nTRÍ BHUAIBH AN FHIR SONA ( agus is fíor iad )Fence, Watching, EarlinessFál, Fáire agus Mochthoreacht(ie  a good ditch for fences; an eye to his business    and Rise early )\n\n\n\nTa ceithre buaib ag an gcat. 1/4 for 4 \" \" D'íoc sé ceitre buinn ar na 4 bhuaibh1. D'íoc sé ceithre buinn ar a chuig bainne gan uisge tríd.2. \" \" \" \" ar luch a fheiceál ins a dorchadas3. \" \"\" \" a theacht ar an luch in unas (gan fhios)4. \" \" \" \" aon ceó da bean a tighe sá bácad sí giobach in a díaifh a bheith aige.\n\n\n\nThis was a cow that was grazing all along the country side. There was no owner. Anybody could milk her for she was very quite. She never failed to fill the vessel of anyone who milked her. She seemed to be there to feed the poor & from the mercy of God. Of course 'the woman' had  to come & brought a sieve to milk her in, She didnt & couldnt fill it & never gave milk after. She then disappeared from this part of the country Uncle Patch _ RIP often and often told me this story about the Glassnach\n", "school_info": "School: Gort na Díogha", "metadata": [{"Location:": "Gortnadeeve West, Co. Galway", "Teacher:": "\nSéamus Ó Dochartaigh, Bean Uí Dhochartaigh\n"}, {"Language": "English"}]}, "4602723/4598455/4626437": {"title": "The Magic Cow", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0190, Page 022", "Page 022"], "url": "https://www.duchas.ie/en/cbes/4602723/4598455/4626437", "text": "\nThis country was at one time fortunate enough to possess a magic cow. The wonderful animal would fill any vessel that would be placed under her by the milker be the vessel be ever so large and that as often as anyone went to milk her. As might be expected she was no ordinary cow contented to eat the grass of one particular field or farm wherever she happened to be and to pass the winter in her owner's byre.This valuable animal would graze only in Crumpawn, drink only in Loughmarron and lie down to rest only in Uragh. She evidently had good taste in her choice though it entailed some walking on her part. Crumpawn, her grazing ground is situated at the south end of Glenade. As the name implies is a townland that appears to be hollowed out of the mountain and enclosed on three sides throw up the most succulent grass in this part of the country. Loughmarron is famed for its spring water. And the hills of Uragh are namely for how dry they are.\n", "school_info": "School: Ahanlish", "metadata": [{"Location:": "Aghanlish, Co. Leitrim", "Teacher:": "\nPádraig Ó Gallchobhair\n"}, {"Collector": "Pádraig Ó Gallchobhair", "Gender": "male", "Occupation": "teacher", "Address": "Aghanlish, Co. Leitrim"}, {"Language": "English"}]}, "4602717/4598053/4629134": {"title": "The Story of the Enchanted Cow", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0189, Page 014", "Page 014"], "url": "https://www.duchas.ie/en/cbes/4602717/4598053/4629134", "text": "\nA long time ago, there was a strange cow seen in Glenade. The story goes that she fed in Crumpawn where the best grazing for miles around is supposed to be. She drank of the water in Loughmarron because it is the purest and best in the Parish, and she slept on the dry hills of Uragh. It was said that this cow could vill any vessel that ever was put under her with milk. One day she arrived at the house of an old woman who had no cows to give her milk. She asked the cow for (sc) some milk and the cow answered that she would give her plenty. She brought out a barrel and the cow filled it. She then brought out every vessel in the house, and the cow filled them also. At last she became so wicked that she brought out\n(continues on next page)\n", "school_info": "School: Gleann Éada", "metadata": [{"Location:": "Glenade, Co. Leitrim", "Teacher:": "\nBean Uí Mhaolaith\n"}, {"Collector": "Bean Uí Mhaolaith", "Gender": "female", "Occupation": "teacher", "Address": "Mourne Beg, Co. Donegal"}, {"Informant": "Pat Gilroy", "Gender": "male", "Age": "40", "Occupation": "farmer", "Address": "Cloontyprughlish, Co. Leitrim"}, {"Language": "English"}, {"Location": "Crumpaun"}]}, "4622977/4619817/4629240": {"title": "An Fear agus na Ciseáin", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0074, Page 228", "Page 228"], "url": "https://www.duchas.ie/en/cbes/4622977/4619817/4629240", "text": "", "school_info": "School: Seanafarachán", "metadata": [{"Location:": "Shanafaraghaun, Co. Galway", "Teacher:": "\nSeán Mac An Ríogh\n"}, {"Collector": "Seán Mac an Ríogh", "Gender": "male", "Occupation": "múinteoir", "Address": "Tawnaleen, Co. Galway"}, {"Informant": "Tomás Seoighe, alternative name Tomás Sheáin Mhóir Seoighe", "Gender": "male", "Age": "57"}, {"Language": "Irish"}]}, "4649689/4647495/4651155": {"title": "St Patrick's Cow", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0211, Page 061", "Page 061"], "url": "https://www.duchas.ie/en/cbes/4649689/4647495/4651155", "text": "\n61Saint Patrick's CowOnce there was a cow on Slieve Anerin, and she was supposed to be Saint Patrick's cow.  Everyone could milk her, but no one could have her yield.  When a person would have her milked she would give the milk vessel a kick and spill the milk.A certain woman bet she would milk, and trick the cow, so she set out with a gallon and riddle to milk her.  She placed the riddle over the gallon and the cow could not see the milk.  When the woman had finished milking, the cow gave the woman a kick into a big hole (Pulthee).  In years after the woman's hands were seen at the end of a stream with the gallon on one hand and the riddle on the other.Jim Leddy,Drumaragh,10th..3..1938.\n", "school_info": "School: Ceis Carraigín", "metadata": [{"Location:": "Keshcarrigan, Co. Leitrim", "Teacher:": "\nTomás Mag Fhionnáin\n"}, {"Collector": "Jim Leddy", "Gender": "male", "Address": "Drumaragh, Co. Leitrim"}, {"Language": "English"}]}, "4658427/4654364/4659637": {"title": "The Wandering Cow", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0220, Page 142", "Page 142"], "url": "https://www.duchas.ie/en/cbes/4658427/4654364/4659637", "text": "\nThe Wandering Cow was supposed to go about the countryside providing milk for poor people. A field of Tom TReynolds' in Farnaught was supposed to be a favourite resort of hers. People when speaking about this field, always said it was great land and that the Wandering Cow used to be there.\n", "school_info": "School: Gortlitreach", "metadata": [{"Location:": "Gortletteragh, Co. Leitrim", "Teacher:": "\nSeosamh Mac Cionnaith\n"}, {"Collector": "Very Reverend P. Conefry", "Gender": "male", "Occupation": "priest", "Address": "Cloone, Co. Leitrim"}, {"Language": "English"}]}, "4605953/4605454/4682716": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0207, Page 524", "Page 524"], "url": "https://www.duchas.ie/en/cbes/4605953/4605454/4682716", "text": "\nOnce upon a time there lived in the townland of Stramore, a poor man , who was in a great distress,  for he had a large weak young family. He had not as much as a cow to supply the family with milk. Stramore townland is situated on the shore of Lough Allen. One day the man’s wife was surprised to see a nice black cow coming from the lake and making her way for the house, where this poor family lived. She came to the door, and indicated in some way that she wished to be milked.The woman milked the cow, and ever after that there was plenty of milk for the children and all.After some time the cow had a calf and in the course of time had several calves. After some years the farm was well stocked with cattle and the man of the house felt that he was no longer in poverty. One day as the woman of the house was milking the cow her husband was talking to her, and he stated to his wife that it would be advisable to sell some of the cattle, and as the cow was now getting old, she would be included among the beasts that he intended to sell.The woman said that would be all right, but that she would be lonely at parting with the old cow, that first came as such a great relief to them in their distress.In about half an hour after this conversation, the man was surprised to see the cow followed by all her offspring heading for the lake. Before he could reach them all had plunged into the water and had disappeared for ever from their sight, leaving the family as poor as ever.\n", "school_info": "School: Cormongan", "metadata": [{"Location:": "Cormongan, Co. Leitrim", "Teacher:": "\nSeán Mac Amhalghaidh\n"}, {"Collector": "Rose Mc Brien", "Gender": "female", "Address": "Sramore, Co. Leitrim"}, {"Informant": "Mr Michael Mulhair", "Gender": "male", "Age": "75", "Address": "Sramore, Co. Leitrim"}, {"Language": "English"}]}, "4678400/4677141/4683425": {"title": "An Glas Gaibhneach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0424, Page 295", "Page 295"], "url": "https://www.duchas.ie/en/cbes/4678400/4677141/4683425", "text": "\nAinm an té do thug.Mícheál Mach Gearailt, Baile na nGallDeirtear go dtáinigh an Glas Gaibhneach isteach ón bhfairrge i mBaile Uachtarach agus nár dhein sí stad ná staonadh go dtí gur srois sí Cillmaolceadar.Do bhí bean bocht ins an gCíll agus bhí carraig lasmuich dá tigh. Gearr sí dá pholl déágh ins an gcloich cómh cruinn le liothróid. Do tagadh an Glas Gaibhneach gach maidean agus do cruithadh an bean bocht an bainne isteach 'na beíste. Sa deire do culaidh Droch-fhear mar gheall ar an mbó agus do thaínigh sé an maidean so agus criathar aige.Do thosnuigh sé ag crúth na mbó. Do bhí sé ag crú agus ag crú go dtí gur fheách an bó siar. Connaich sí an bainne ar an dtalamh. Do thug sí speach agus do\n(continues on next page)\n", "school_info": "School: Scoil na mBráthar, An Daingean", "metadata": [{"Location:": "Dingle, Co. Kerry", "Teacher:": "\nAn Br. P. Ó hAragáin\n"}, {"Collector": "Breandán Mach Gearailt", "Gender": "male", "Address": "Ballynagall or Ballydavid, Co. Kerry"}, {"Informant": "Mícheál Mach Gearailt", "Gender": "male", "Address": "Ballynagall or Ballydavid, Co. Kerry"}, {"Language": "Irish"}]}, "4678400/4677268/4687876": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0424, Page 422", "Page 422"], "url": "https://www.duchas.ie/en/cbes/4678400/4677268/4687876", "text": "", "school_info": "School: Scoil na mBráthar, An Daingean", "metadata": [{"Location:": "Dingle, Co. Kerry", "Teacher:": "\nAn Br. P. Ó hAragáin\n"}, {"Collector": "Seán Ó hUallacáin", "Gender": "male", "Address": "Dingle, Co. Kerry"}, {"Informant": "Pádruig Ó hUallacaín", "Gender": "male", "Address": "Dingle, Co. Kerry"}, {"Language": "Irish"}]}, "4687715/4686630/4706386": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0434, Page 313", "Page 313"], "url": "https://www.duchas.ie/en/cbes/4687715/4686630/4706386", "text": "\nLong ago there was a cow in Kerry. She was called \"An Glasnaineach\". She used to go around to all the poor people and they used to milk her. No matter how big a vessel one brought for to milk the cow would fill it. After going around Kerry all day she used to come to Churchtown to sleep and on that account the place where she used sleep is called \"Leabadh na Bó\".One day when the cow was near Tralee a woman heard about her, and she said she would bring a vessel which the cow could not fill. So she brought a seive, she was milking the cow for a long time, and all the milk was flowing down the mountain. When the cow saw all the milk she gave a screech and disappeared, and was never seen afterwards.Scríobhnoir:-Tadhg Ó Seaghdha14 bliadhna DaoisCnochan Árd FhearaighScéulaidhe:-a athar, Séamus\n", "school_info": "School: Killorglin (B.)", "metadata": [{"Location:": "Killorglin, Co. Kerry", "Teacher:": "\nMl Ó Donnchadha\n"}, {"Collector": "Tadhg Ó Seaghdha", "Gender": "male", "Age": "14", "Address": "Killorglin, Co. Kerry"}, {"Informant": "Séamus Ó Seaghdha", "Relation": "parent", "Gender": "male", "Address": "Killorglin, Co. Kerry"}, {"Language": "English"}]}, "4713251/4711450/4714873": {"title": "Leaba na Bó Cross", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0455, Page 198", "Page 198"], "url": "https://www.duchas.ie/en/cbes/4713251/4711450/4714873", "text": "\nA short distance from the village of Beaufort in the parish of Taugh lies Leaba na Bó Cross. in that district there was an enchanted cow who used to give milk to the poor people of the district in the time of the Famine. If those people went to milk that cow every hour in the day, she would give plenty of milk. One clever man said that he would milk the cow dry, so he got a sieve, and he milked her through it, and from that day onwards, the cow was never seen or heard of.\n", "school_info": "School: Clochar na Trócaire", "metadata": [{"Location:": "Killarney, Co. Kerry", "Teacher:": "\nAn tSr. Aodán\n"}, {"Collector": "Éana Ní Laighin", "Gender": "female"}, {"Informant": "Bean Uí Laighin", "Gender": "female", "Address": "Listry, Co. Kerry"}, {"Language": "English"}, {"Location": "Beaufort"}]}, "4706327/4702839/4724238": {"title": "An Glas Gaibhneach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0440, Page 123", "Page 123"], "url": "https://www.duchas.ie/en/cbes/4706327/4702839/4724238", "text": "\nThe \"Glas Gaibhneach\" was a wonderful cow supposed to be in Bally Mc.Elligott during the famine. She is said to have slept in Shea's field on the river bank to the east of the house now occupied by Frank Hill in Arebella. No matter how large a vessel used when milking her she would fill it with milk. One day two women  had a bet. One said she would get a that the cow would not fill but the other did not agree. The vessel named in the bet was a sieve. The woman who was an obstinate one milked the cow till she fell dead. No more was heard of the cow since but while she lived she helped many a poor person.\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire, Tráighlí", "metadata": [{"Location:": "Tralee, Co. Kerry", "Teacher:": "\nAn tSr. Proinnsias\n"}, {"Collector": "Nancy Caball", "Gender": "female", "Address": "Strand Street, Co. Kerry"}, {"Informant": "Mrs Caball", "Gender": "female", "Address": "Strand Street, Co. Kerry"}, {"Language": "English"}]}, "4706331/4703356/4724936": {"title": "A Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0441, Page 010", "Page 010"], "url": "https://www.duchas.ie/en/cbes/4706331/4703356/4724936", "text": "\nDuring the bad times in Ireland when the people were almost starving, a cow came in from the sea every day and gave the people milk, and although she gave everybody enough she could never be milked dry.Every vessel which was under her, no matter how big, she would fill it. One day two women were talking about her. One said she would get a vessel which the cow would not be able to fill. When the cow came next day the woman got a sieve and called the other woman. She milked the cow into the sieve and all the milk fell through it on to the ground. The cow ran away bellowing to the sea, and was never heard of again.\n", "school_info": "School: St. Brendan's (C.), Blennerville", "metadata": [{"Location:": "Blennerville, Co. Kerry", "Teacher:": "\nMáire, Bean Uí Mhuircheartaigh\n"}, {"Language": "English"}]}, "4713233/4709779/4726450": {"title": "Historical Tradition", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0451, Page 052", "Page 052"], "url": "https://www.duchas.ie/en/cbes/4713233/4709779/4726450", "text": "\nIn olden days a cow is reputed to have fed the people in Beann árvo and Meentogues. Though she was milked about a dozen times a day her amount of milk never diminished. One day however a woman (a tailor's wife) milked her into a sieve and the cow died of grief to see her milk going for nothing in the ground. There is a man in Beann árvo who can point the fields she used to frequent.\n", "school_info": "School: Ráth Mhór (B.)", "metadata": [{"Location:": "Rathmore, Co. Kerry", "Teacher:": "\nDiarmuid Ó Cróinín\n"}, {"Collector": "Diarmuid Óg Ó Cróinín", "Gender": "male", "Age": "80"}, {"Informant": "Díarmuid Ó Brosnacháin", "Gender": "male", "Age": "80", "Address": "Meentoges, Co. Kerry"}, {"Language": "English"}]}, "4493630/4405576/4726505": {"title": "Oileán faoi Gheasa", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1074, Page 50", "Page 50"], "url": "https://www.duchas.ie/en/cbes/4493630/4405576/4726505", "text": "\n(continued from previous page)\nócadh sé ar uachtar; nó dá dtiocfadh le duine a chos a leagan air sgus beóleóg (aibhleóg dhearg) leis go mbrisfidhe an geas uaidh agus go bhfanóchadh sé ar uachtar.\n\n\n\nAn Ghlas-GaibhleannBhí gabha thíos i nDruim-na- Teineadh ( i bpáirc na mbrící) agus bhí bó aige-an Ghlas-ghaibhleann-agus nuair a d'éireóchadh an  féar gann ar  drumtaí Druim-na-Teineadh ag deireadh na bliadhna shnámhfadh sí anonn go h-Innis-Bó-Finne ar  maidin agus nuair a  thiocfadh an  t-am aice a theacht 'na bhaile bhuailfeadh an gabha tri bhuille ar an inneoir, agus mhoitheochadh sise thall é agus\n(continues on next page)\n", "school_info": "School: Ceathramhadh Ceanainn (C.)", "metadata": [{"Location:": "Carrowcanon, Co. Donegal", "Teacher:": "\nÁine Ní Dhochartaigh\n"}, {"Informant": "Nuala Bean Uí Ghallchobhair", "Gender": "female", "Occupation": "bean feirmeora", "Address": "Ballyness, Co. Donegal"}, {"Language": "Irish"}]}, "4701726/4696493/4743952": {"title": "A Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0179, Page 216", "Page 216"], "url": "https://www.duchas.ie/en/cbes/4701726/4696493/4743952", "text": "\nOne morning in the Spring time there went two or three men to Mrs Hyland turning sods. She did not expect themand had no meal to get their breakfast. She went out to the stack of oats for an armful She thrashed it and then dried the oatsWhen the oats was dry she took her quarn and ground it and made porridge and oat meal bread for their breakfast.\n\n\n\nA man named John Kilroy lived near Lough Allen. he was very poor and had no money to buy corn.One Winter's evening he and his wife were seated beside the fire. There came a smal cow to the street outside. The man hunted her away from the house but\n(continues on next page)\n", "school_info": "School: Bloomfield", "metadata": [{"Location:": "Lavally, Co. Sligo", "Teacher:": "\nSeosamh Ó Cathasaigh\n"}, {"Collector": "Kathleen Burke", "Gender": "female", "Address": "Riverstown, Co. Sligo"}, {"Language": "English"}]}, "4701726/4696493/4743972": {"title": "A Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0179, Page 216", "Page 216"], "url": "https://www.duchas.ie/en/cbes/4701726/4696493/4743972", "text": "\nOne morning in the Spring time there went two or three men to Mrs Hyland turning sods. She did not expect themand had no meal to get their breakfast. She went out to the stack of oats for an armful She thrashed it and then dried the oatsWhen the oats was dry she took her quarn and ground it and made porridge and oat meal bread for their breakfast.\n\n\n\nA man named John Kilroy lived near Lough Allen. he was very poor and had no money to buy corn.One Winter's evening he and his wife were seated beside the fire. There came a smal cow to the street outside. The man hunted her away from the house but\n(continues on next page)\n", "school_info": "School: Bloomfield", "metadata": [{"Location:": "Lavally, Co. Sligo", "Teacher:": "\nSeosamh Ó Cathasaigh\n"}, {"Collector": "Kathleen Burke", "Gender": "female", "Address": "Riverstown, Co. Sligo"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "male"}, {"Language": "English"}]}, "4742106/4736397/4759564": {"title": "Áitainmneacha", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0470, Page 314", "Page 314"], "url": "https://www.duchas.ie/en/cbes/4742106/4736397/4759564", "text": "", "school_info": "School: Cuileannach (C.)", "metadata": [{"Location:": "Cullenagh Upper, Co. Kerry", "Teacher:": "\nBríd, Bean Uí Chochláin\n"}, {"Collector": "Eibhlín Ní Laoghaire", "Gender": "female", "Address": "Carhoonahone, Co. Kerry"}, {"Informant": "Séamus Ó Conchubhair", "Gender": "male", "Address": "Carhoonahone, Co. Kerry"}, {"Language": "Irish"}, {"Location": "Carhoonahone"}]}, "4742107/4736508/4759972": {"title": "Leabaidh na Bó", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0470, Page 425", "Page 425"], "url": "https://www.duchas.ie/en/cbes/4742107/4736508/4759972", "text": "", "school_info": "School: Cuileannach (B.)", "metadata": [{"Location:": "Cullenagh Upper, Co. Kerry", "Teacher:": "\nPeadar Ó Cochláin\n"}, {"Collector": "(name not given)", "Occupation": "príomhoide"}, {"Informant": "Domhnall Ó Dubhghaill", "Gender": "male", "Age": "80", "Occupation": "feirmeoir", "Address": "Cappaganneen, Co. Kerry"}, {"Language": "Irish"}]}, "4701706/4694462/4760619": {"title": "Scéal", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0170, Page 0517", "Page 0517"], "url": "https://www.duchas.ie/en/cbes/4701706/4694462/4760619", "text": "\nBhí chuile dhuine dhá dhíbirt ag Naomh Brighid as an áit le na bó. Níor iarr sí ach an méid a chlúdóch a brat le h-aghaidh na bo. Dubhairt duine uasal go caithfeadh sí sin  a fhágáil. Sgar Brighid amach a brat annsin acht bhí an brath ag leathnú go raibh conndae beagnach tógtha aige. Tháinic bean mhalluidhthe agus dubhairt sí go mbeadh Éirinn ag Brighid sar i bhfad mara stopfaí an brat. Stop an bhrat annsin agus ní dheacha sé níos fuide. An bhó a bhí ag Naomh Brighid bhí an oiread bainne aice 's go líonfadh sí cuile soitheach dá driocfadh fúithí. Dubhairt an bhean malluighthe go gcuireadh sí h-éin soitheach fúithí nach líonfadh sí, agus sé an sórt soitheach a chur sí fúithí ná - criathar, agus ní raibh aon deóir de'n bhainne ag fanacht san gcriathar. Bhreathnuigh an bhó thairní, agus nuair chonnaic sí an bhainne ag imteacht na shrutháin ar an dralamh, thuit sí agus cailleadh í.\n", "school_info": "School: Curry (C.)", "metadata": [{"Location:": "Curry, Co. Sligo", "Teacher:": "\nBean Uí Chaomháin\n"}, {"Collector": "Máire S. Níc Dhuarcháin", "Gender": "female"}, {"Informant": "local name Jim Paddy Johnie ", "Gender": "male"}, {"Language": "Irish"}]}, "4706345/4704487/4779138": {"title": "The Glas Gaibhneach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0444, Page 244", "Page 244"], "url": "https://www.duchas.ie/en/cbes/4706345/4704487/4779138", "text": "\nThis was a very wonderful cow sent by \"God\" for the good of the poor during the wicked famine days. She was supposed to be of a white colour and with her it is said was a yearling calf.The cow was supposed to have come to tis district; fed in [?] [?] [?] to the west of Casteisland, in John Lynch's field also in Kerby ground at Baile on [?] near Tralee. She drank water from the well of Tobar ins Moll near Castle-island and from the well of [?[ near Tralee.Once a man and a woman had a bet. The man said that any vessel you chose to [?[ the cow into she would fill it. But the woman was bad minded and said that there was one vessel she would not fill. Then the woman fetched a sieve and started to milk the cow.When the cow looked and saw all her milk flowing around the place she left and after this the wonderful cow or the calf were never seen.\n", "school_info": "School: Nuadhchongbháil (Nohoval)", "metadata": [{"Location:": "Scart, Co. Kerry", "Teacher:": "\nSiobhán, Bean Uí Riada\n"}, {"Informant": "John Brosnan", "Gender": "male", "Age": "61", "Occupation": "farmer", "Address": "Glanbane, Co. Kerry"}, {"Language": "English"}]}, "4742078/4733478/4779548": {"title": "Old Turret Kemare", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0461, Page 564", "Page 564"], "url": "https://www.duchas.ie/en/cbes/4742078/4733478/4779548", "text": "\n(continued from previous page)\nhobby was making plans of the various battlefields where he fought. It was he called the Wood in the Back Domain ( old goal field ) Bunker's Hill.\n", "school_info": "School: Kenmare (B.)", "metadata": [{"Location:": "Kenmare, Co. Kerry", "Teacher:": "\nEoghan Ó Súilleabháin, Liam Mac Cuisín\n"}, {"Language": "English"}]}, "4723862/4720147/4784330": {"title": "Hidden Treasure", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0949, Page 119", "Page 119"], "url": "https://www.duchas.ie/en/cbes/4723862/4720147/4784330", "text": "\n(continued from previous page)\nlives up hill, and down brae. One was so frightened that he lay down in a field of corn and lay there unconscious for some moments. The wind continued until three men reached home and so the men never ventured back again to look for the treasure.\n\n\n\nLong ago there was a man living in Tonagh who had only one cow. One night the woman of the house went out to milk the cow. When she had one bucket filled the cow had still more milk. The woman took out three or four more bucket and filled them all. It was not long until all the women of the townland heard this and they flocked with pails to fill them. The last woman that came in supposed to have hurt her because when she was milking her the cow went away and is supposed to have been drowned but she never came back.\n", "school_info": "School: Tattenclave", "metadata": [{"Location:": "Tattintlieve, Co. Monaghan", "Teacher:": "\nB. Ní Chróinín\n"}, {"Collector": "Packie Mc Carvill", "Gender": "male", "Age": "14", "Address": "Drumhillagh, Co. Monaghan"}, {"Informant": "Peter Deighan", "Gender": "male", "Age": "76", "Address": "Drumhillagh, Co. Monaghan"}, {"Language": "English"}]}, "4713223/4709045/4813822": {"title": "An Glas Gaibneach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0449, Page 079", "Page 079"], "url": "https://www.duchas.ie/en/cbes/4713223/4709045/4813822", "text": "\nAn Glas GaibneachThis fair cow visited Cordal regularly for a number of years. She belonged to nobody, and usually made her appearance in Horans field in the townland of Cumangh. Several people milked her during the day and she never seemed to be milked. She had plenty for everybody till a spiteful old woman milked her into a sieve when she disappeared from the district.She was know to visit a farm in Baunvariscal also. Baunvariscal is about three miles due west of Castleisland on the road to Tralee.The story of the Glas Gaibneach is one of the most popular traditions in the parish.\n\n\n\n(continued from previous page)\na pocket of oats with them for their lunch.Dick Johnny Walsh, Kilmurry, Cordal.\n", "school_info": "School: Cill Mhuire (C.), Oileán Ciarraí", "metadata": [{"Location:": "Kilmurry, Co. Kerry", "Teacher:": "\nMáiréad Pléimeann\n"}, {"Informant": "Mrs Fleming", "Gender": "female", "Age": "71"}, {"Language": "English"}]}, "4713223/4709124/4814368": {"title": "The Glas Gaibhneach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0449, Page 158", "Page 158"], "url": "https://www.duchas.ie/en/cbes/4713223/4709124/4814368", "text": "\nLong long ago a cow went around to all the poor people. She would fill a bucket of milk morning and evening. Her colours were black and white. She was not an ordinary cow. She had long brown and white horns, and was very fat and big.She usually fed by the mountain near a stream which flows from the top of the mountain, and drank from a pure spring well. Lyre well,A women once bet another that she would give her a vessel which the cow would not fill The woman fetched a sand screen and put it under the cow, and began to milk her into this vessel for hours, The cow died before the woman had finished milking her,\n", "school_info": "School: Cill Mhuire (C.), Oileán Ciarraí", "metadata": [{"Location:": "Kilmurry, Co. Kerry", "Teacher:": "\nMáiréad Pléimeann\n"}, {"Collector": "Nora Hickey", "Gender": "female", "Age": "14", "Address": "Knockatee, Co. Kerry"}, {"Informant": "Dan Murphy", "Relation": "grandparent", "Gender": "male", "Age": "73"}, {"Language": "English"}]}, "4713225/4709263/4815309": {"title": "A Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0449, Page 296", "Page 296"], "url": "https://www.duchas.ie/en/cbes/4713225/4709263/4815309", "text": "\nYears ago in the famine days a fairy cow appeared near Castleisland. This cow was very valuable to the poor because she would fill a barrel or any other vessel according to the need of the household. One day an evil minded woman went to milk this cow; she took with her a strainer because she said she would carry a vessel that the cow would not fill. When she sat under the cow to milk her she disappeared and the place is now known as \"Kill cow.\"\n\n\n\nAbout two hundred years ago there lived in Carrigeen a family named Fitzgeralds. Those people were Landlords, they owned all the land around there, Carrigeen wood included. In those days horses' cars were very scarce, only the very rich could afford to buy them.There was a certain kind of tree growing in the wood; the Fitzgeralds made their\n(continues on next page)\n", "school_info": "School: Brosna (B.)", "metadata": [{"Location:": "Brosna, Co. Kerry", "Teacher:": "\nAonghus Ó Laochdha\n"}, {"Collector": "Ben Guiney", "Gender": "male", "Address": "Glantaunluskaha, Co. Kerry"}, {"Informant": "Maurice Roche", "Gender": "male", "Age": "76", "Address": "Glantaunluskaha, Co. Kerry"}, {"Language": "English"}]}, "4742102/4736059/4824304": {"title": "Place Names", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0469, Page 123", "Page 123"], "url": "https://www.duchas.ie/en/cbes/4742102/4736059/4824304", "text": "", "school_info": "School: Gort na Scairbhe", "metadata": [{"Location:": "Gortnaskarry, Co. Kerry", "Teacher:": "\nSeán Ó Cobhthaigh\n"}, {"Collector": "Máire Ní Fhoglúdha", "Gender": "female"}, {"Language": "English"}, {"Location": "Beaufort"}]}, "4798695/4790862/4841271": {"title": "Rathmoyle", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0244, Page 277", "Page 277"], "url": "https://www.duchas.ie/en/cbes/4798695/4790862/4841271", "text": "\nRathmoyle gets its name from a narrow rath that is in Mr Sweeneys field. There is supposed to be a pot of gold buried in that rath with an eel minding it. It is said that this eel goes to first Mass every Sunday. I you wanted to find the gold you would have to go there while the eel would be gone to mass. Then dig down a few feet untill you come to a flag and under this flag you would find the gold.\n\n\n\nGlaisdomhne means Gods cow. This cow used to travel three farm of the county Roscommon to give milk to the poor people. Those farms were Oran, Glenvela and Grallagh. She used to stay a fortnight in each of the farms. This cow could never be milked dry no matter how much milk was taken from her. One time she was in Glenvela an old woman said she would dry the cow. So one morning she brought a riddle and kept milking untill she flooded the valley and the cow was never seen again.\n", "school_info": "School: Cill Mhuire", "metadata": [{"Location:": "Kilmurry, Co. Roscommon", "Teacher:": "\nMáire, Bean Uí Ruairc\n"}, {"Informant": "James Dockory", "Gender": "male", "Address": "Glenvela, Co. Roscommon"}, {"Language": "English"}, {"Location": "Rathmoyle"}]}, "4798695/4790862/4841998": {"title": "Rathmoyle", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0244, Page 277", "Page 277"], "url": "https://www.duchas.ie/en/cbes/4798695/4790862/4841998", "text": "\nRathmoyle gets its name from a narrow rath that is in Mr Sweeneys field. There is supposed to be a pot of gold buried in that rath with an eel minding it. It is said that this eel goes to first Mass every Sunday. I you wanted to find the gold you would have to go there while the eel would be gone to mass. Then dig down a few feet untill you come to a flag and under this flag you would find the gold.\n\n\n\nGlaisdomhne means Gods cow. This cow used to travel three farm of the county Roscommon to give milk to the poor people. Those farms were Oran, Glenvela and Grallagh. She used to stay a fortnight in each of the farms. This cow could never be milked dry no matter how much milk was taken from her. One time she was in Glenvela an old woman said she would dry the cow. So one morning she brought a riddle and kept milking untill she flooded the valley and the cow was never seen again.\n", "school_info": "School: Cill Mhuire", "metadata": [{"Location:": "Kilmurry, Co. Roscommon", "Teacher:": "\nMáire, Bean Uí Ruairc\n"}, {"Language": "English"}]}, "4742098/4735635/4924254": {"title": "Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0468, Page 044", "Page 044"], "url": "https://www.duchas.ie/en/cbes/4742098/4735635/4924254", "text": "\n(continued from previous page)\nShe had many calves + gave milk whenever it was wanted. At last she grew old + the farmer made up his mind to kill her. When the day for the killing arrived all the neighbours gathered to see her die + when the farmer was about to strike the death-blow everybody heard a voice from outside call \"come home.\" So the cow + her calves flew into the air + were seen no more. One calf however did not seem to hear the call, + when the farmer looked at her she turned black. So after this black cows became plentiful in Ireland.Mrs. HusseySouth Gerah Sneem.\n\n\n\nIn a place called \"Leaḃa na bó near Beaufort there lived a fairy cow. She was called the poor man's cow + all the people of the neighbourhood who needed milk came to milk her. At last a wicked woman came along + made a bet that she wouldn't fill a certain vessel of milk. The people bet her that she would. So she took a \"riddle\" (an article for cleaning wheat, which resembled a strainer) + milked\n(continues on next page)\n", "school_info": "School: Snaidhm (C.)", "metadata": [{"Location:": "Sneem, Co. Kerry", "Teacher:": "\nMrs Palmer\n"}, {"Informant": "Jeremiah D. O Sullivan", "Gender": "male", "Age": "circa 80", "Address": "Slievenashaska, Co. Kerry"}, {"Language": "English"}]}, "4742098/4735636/4924256": {"title": "Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0468, Page 045", "Page 045"], "url": "https://www.duchas.ie/en/cbes/4742098/4735636/4924256", "text": "\n(continued from previous page)\nher into it. She continued at her all day until she disappeared altogether. She was so good to give milk that the people called her the \"Glas Gaiḃneaċ\"Jerh. D. O'SullivanSlievenashaska, Sneem.[about 80 yrs]\n\n\n\nCiacu is fearr sa' domainAn bó na an gabhar?Tá an bó go maith le bainne san SamhradhTá an gabhar go maith leis Acht bainne na gabhair san GeimhreadhNí bíonn se go deas.Mrs Hussey, (?)Sneem(bet: 70 & 80 yrs.)\n\n\n\nIs Fearr do dhuine bheith caoch na droch-súil do bheith aige\n\n\n\nHorses weren't clipped or sheep weren't shorn on Monday on account of \" lomadh an luain \", and cattle weren't changed from one place to another on Monday for the same  reason.\n", "school_info": "School: Snaidhm (C.)", "metadata": [{"Location:": "Sneem, Co. Kerry", "Teacher:": "\nMrs Palmer\n"}, {"Informant": "Mrs Hussey", "Gender": "female", "Age": "70 till 80", "Address": "Gearha, Co. Kerry"}, {"Language": "Irish"}]}, "4742098/4735636/4924260": {"title": "Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0468, Page 045", "Page 045"], "url": "https://www.duchas.ie/en/cbes/4742098/4735636/4924260", "text": "\n(continued from previous page)\nher into it. She continued at her all day until she disappeared altogether. She was so good to give milk that the people called her the \"Glas Gaiḃneaċ\"Jerh. D. O'SullivanSlievenashaska, Sneem.[about 80 yrs]\n\n\n\nCiacu is fearr sa' domainAn bó na an gabhar?Tá an bó go maith le bainne san SamhradhTá an gabhar go maith leis Acht bainne na gabhair san GeimhreadhNí bíonn se go deas.Mrs Hussey, (?)Sneem(bet: 70 & 80 yrs.)\n\n\n\nIs Fearr do dhuine bheith caoch na droch-súil do bheith aige\n\n\n\nHorses weren't clipped or sheep weren't shorn on Monday on account of \" lomadh an luain \", and cattle weren't changed from one place to another on Monday for the same  reason.\n", "school_info": "School: Snaidhm (C.)", "metadata": [{"Location:": "Sneem, Co. Kerry", "Teacher:": "\nMrs Palmer\n"}, {"Informant": "Mrs Hussey", "Gender": "female", "Address": "Gearha, Co. Kerry"}, {"Language": "Irish"}]}, "4742098/4735636/4924262": {"title": "Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0468, Page 045", "Page 045"], "url": "https://www.duchas.ie/en/cbes/4742098/4735636/4924262", "text": "\n(continued from previous page)\nher into it. She continued at her all day until she disappeared altogether. She was so good to give milk that the people called her the \"Glas Gaiḃneaċ\"Jerh. D. O'SullivanSlievenashaska, Sneem.[about 80 yrs]\n\n\n\nCiacu is fearr sa' domainAn bó na an gabhar?Tá an bó go maith le bainne san SamhradhTá an gabhar go maith leis Acht bainne na gabhair san GeimhreadhNí bíonn se go deas.Mrs Hussey, (?)Sneem(bet: 70 & 80 yrs.)\n\n\n\nIs Fearr do dhuine bheith caoch na droch-súil do bheith aige\n\n\n\nHorses weren't clipped or sheep weren't shorn on Monday on account of \" lomadh an luain \", and cattle weren't changed from one place to another on Monday for the same  reason.\n", "school_info": "School: Snaidhm (C.)", "metadata": [{"Location:": "Sneem, Co. Kerry", "Teacher:": "\nMrs Palmer\n"}, {"Language": "English"}]}, "4742098/4735713/4924358": {"title": "Wild Animals Seen in the Sea", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0468, Page 122", "Page 122"], "url": "https://www.duchas.ie/en/cbes/4742098/4735713/4924358", "text": "\n(continued from previous page)\noften washed in with the tide near the White Strand. There was a bone washed in there and it was the shape of an arch. It is now used as an archway over a gate in that locality and the two ends are coming to the ground and form pillars for the gate. Big lorries and cars can pass through this gateway. It is supposed to be the jaw bones of some huge sea-animal which had died.D. CroninThe Cottages Sneem[over 70]\n\n\n\nThere was a woman in this village and a red cow used to be with her own cows every day and she used not see her coming or see her going away and she used to be surprised because her own cows took no notice of her. One day she went driving her away from the cows and she disappeared. Mrs O'Sullivan was the name of the woman who owned the farm the cow used to inhabit.\n", "school_info": "School: Snaidhm (C.)", "metadata": [{"Location:": "Sneem, Co. Kerry", "Teacher:": "\nMrs Palmer\n"}, {"Informant": "Mrs Hussey", "Gender": "female", "Age": "circa 80", "Address": "Gearha, Co. Kerry"}, {"Language": "English"}]}, "4742091/4735048/4929735": {"title": "An Glas Gaibhne", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0466, Page 275", "Page 275"], "url": "https://www.duchas.ie/en/cbes/4742091/4735048/4929735", "text": "\nAn Ghlas GaibhneDeirtear gur le Lon de Thuath Dé Danann an bhó glas seo.Deirtear go dtálfadh an Ghlas an oiread bainne agus do chothuigheadh Lon féin, a chlann agus a seirbhísigh go léir. Dá brigh seo chuaidh a tuairisc ar fuid na dúthaighe.Níorbh fhuirist í ghoid, ámh, ón ngabhainn, mar do bhíodh duine ghá feighilt aige irith an lae, agus ins an oidhche théigheadh sí suas imeasc na gcnoc. Rud eile, bhíodh a crúba ar dtuathal ar slíghe is nár bhfhéidir d'aon-ne a tóir do leanamhaint.Fé dheire d'eirigh le ceannuraidh na bhFomórach í ghoid ó Lon.Deirtear gur mhair sí go aimsear na Féinne agus go dtáladh sí bainne dóibh go léir.Ins gach áit na mbídís ag cur fútha dheinidís cró don ghlais agus is mar seo a gheibhtear a h-ainm ina lán áiteanna ar fud na h-Éireann mar atá Árd na Glaise. Tugtar Glas Gaibhne ar aon bhuin a thálann mórán bainne an lá seo.\n", "school_info": "School: Bun Inbhir (Bunaneer)", "metadata": [{"Location:": "Bunaneer, Co. Kerry", "Teacher:": "\nSiobhán Ní Chonchubhar\n"}, {"Language": "Irish"}]}, "4758588/4757093/4935985": {"title": "Old Schools", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0933, Page 124", "Page 124"], "url": "https://www.duchas.ie/en/cbes/4758588/4757093/4935985", "text": "\n(continued from previous page)\npencils and on slates. There was a large flat stone used as a blackboard.\n\n\n\nThe following story was told to me by my mother; About four hundred years ago there lived a King named Manann who had a castle. He lived in the district of Donaghmoyne, Co. Monaghan. It is believed that this king knew magic. After he died there was a cow and a calf at his castle, and he said that this cow would give milk to everyone in the parish. For long afterwards the cow gave milk to everyone who\n(continues on next page)\n", "school_info": "School: Inniskeen", "metadata": [{"Location:": "Inishkeen, Co. Monaghan", "Teacher:": "\nLouis A. Duffy\n"}, {"Collector": "Joseph Brennan", "Gender": "male", "Address": "Lannat, Co. Monaghan"}, {"Informant": "Mrs Brennan", "Gender": "female", "Address": "Lannat, Co. Monaghan"}, {"Language": "English"}]}, "4742115/4737314/4937030": {"title": "Cé Bán", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0472, Page 463", "Page 463"], "url": "https://www.duchas.ie/en/cbes/4742115/4737314/4937030", "text": "", "school_info": "School: Curraichín (B.)", "metadata": [{"Location:": "Curraheen, Co. Kerry", "Teacher:": "\nSeán Ó Scothlaoich\n"}, {"Collector": "Donncadh Ó hEaluighthe", "Gender": "male", "Address": "Curraheen, Co. Kerry"}, {"Informant": "Uí Ealuighthe", "Relation": "parent", "Gender": "female", "Address": "Curraheen, Co. Kerry"}, {"Language": "Irish"}]}, "4811604/4800961/4938403": {"title": "An Gaibhlean Gabha", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0274, Page 180", "Page 180"], "url": "https://www.duchas.ie/en/cbes/4811604/4800961/4938403", "text": "\nThe Gaibhlean Gabha lived on a small island named Oileán Aolbhach. This island is situated at the southern end of the Dursey Sound. It is separated from the mainland, just at the Crow Head, by a deep narrow passage of water, broad enough for a rowing boat to pass through. The Gaibhlean was a smith and had a forge on the island. The remains of the forge may still be seen.  He had two apprentices working for him. One day the Gaibhlean was out to the mainland for messages. A strange man came to the forge and he told the apprentices to make a razor for him. He was covered with beard as he said that he did not shave for seven years.\n(continues on next page)\n", "school_info": "School: An Chathair Mhór", "metadata": [{"Location:": "Knockroe Middle, Co. Cork", "Teacher:": "\nDonncha Ó Súilleabháin\n"}, {"Collector": "John O' Sullivan", "Gender": "male", "Age": "15", "Address": "Cahermore, Co. Cork"}, {"Informant": "John O' Sullivan", "Relation": "parent", "Gender": "male", "Age": "48", "Address": "Cahermore, Co. Cork"}, {"Language": "English"}]}, "4811604/4800965/4938417": {"title": "An Gaibhlean Gabha agus an Glas Gaibhneach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0274, Page 184", "Page 184"], "url": "https://www.duchas.ie/en/cbes/4811604/4800965/4938417", "text": "\nI have heard that when the Gaibhlean Gabha was in Oileán Aolbhac that he used to come to Kilkinnihan for water to temper the steel. He used get the water in Fuarán a'Caoláin. This is a Fuarán noted for the excellent quality of its water. It is still used as a well and the Gaibhlean had to travel twelve miles before he had this water landed in 'leán Aolbhach As it was used for tempering the steel; my Uncle (who will be 93 years next March {March 1936}) tells that the old people called it Uisge Fabhairt   The Gaibhlean had a cow called the Glas Gaibhneach One day as she was travelling eastwards from 'leán Aolbhach in this parish she is said to have fed only in three fields and since then these three fields are pointed out as being land of surpassing fertility. She had such a flow of milk that no vessel was large enough to hold it. One day as she was being milked an old woman called the way and bet that she would get a vessel that the Glas Gaibhneac would not fill. She got a strainer and the cow was milked & milked into the strainer till at last seeing that she was outdone she bellowed and called to her progeny a young cow and a bull and the\n(continues on next page)\n", "school_info": "School: An Chathair Mhór", "metadata": [{"Location:": "Knockroe Middle, Co. Cork", "Teacher:": "\nDonncha Ó Súilleabháin\n"}, {"Collector": "Donnachadh Ó Súilleabháin", "Gender": "male"}, {"Language": "English"}]}, "4811606/4801253/4943628": {"title": "Scéal - The Glas Gaibhneach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0274, Page 472", "Page 472"], "url": "https://www.duchas.ie/en/cbes/4811606/4801253/4943628", "text": "\nLong ago there was a blacksmith living on a small farm in Garnish  The landlord evicted him and he went to live on a small island south east of Dursey Island.  Here he built a forge and he worked for the people of the parish.  He prayed to God each morning and evening for a cow.  One morning when he arose he saw a green cow coming towards him from the sea.  He drove her back twice but she came back each time.  It was published all through the parish but nobody came for the cow so the smith kept her.  This cow was a great milker and could fill and [?] any vessel that the smith had  Sometimes the cow went to a field in Dingle or to a field in Garnish, and sometimes she stayed on\n(continues on next page)\n", "school_info": "School: An Chluain", "metadata": [{"Location:": "Cloan, Co. Cork", "Teacher:": "\nTadhg Ó Cearbhaill\n"}, {"Collector": "Sighle Ní Súílleabháin", "Gender": "female", "Address": "Cloan, Co. Cork"}, {"Informant": "Diarmuid Ó hArrachtáin", "Gender": "male", "Age": "88", "Occupation": "feirmeoir", "Address": "Cahermeeleboe, Co. Cork"}, {"Language": "English"}]}, "4742041/4730191/4950975": {"title": "Caisleán Mannan", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0932, Page 004", "Page 004"], "url": "https://www.duchas.ie/en/cbes/4742041/4730191/4950975", "text": "\n(continued from previous page)\nmarcuigheacht ar each bhán thart timcheall na h-áite agus ar theacht amach leis na fir a bhí ag obair fuaireadar cloch mhór leathan ar bhárr an locha a chuir stad leis an obair ar feadh i bhfad. Tá iasrmaí de'n beagnach caithte leis an aimsir, ach pé sgéal é chuir an chloch mhór stad leis an obair.\n\n\n\nTá gleann mór in aice leis an áit seo ar a dtugtar “Lag na Leamhnachta” agus innsigheann sean daoine na h-áite sgéal breagh greannmhar fá dtaobh de. Bhí bó ann ar a dtugadh an Glás Gaibhneach. Ba le gabha ar dtúis. Bhí a cáil ar fud na h-Éireann le na raibh de bháinne aici. D’eirigh bean i geann thar chnuic agus chonnaic sí an bó ag deunamh uirthí treasna gualana an chnuic. D’aithnigh sí ar an bpoinnte í. Nuair a thainig an bhó comh fada léi, thug an bhean amach soitheach a bhí sa tigh ach níor bhféidir léi an bhó do tiormú. Tháinig dearg buile ar an mnaoi fá dheire thiar tháll agus isteach léi agus tug sí amach criathar. Lean uirthí ag bleagháin na mbó leis an gcriathar\n(continues on next page)\n", "school_info": "School: Drom Loiste", "metadata": [{"Location:": "Drumlusty, Co. Monaghan", "Teacher:": "\nSeán Ó Maoláin\n"}, {"Informant": "Aodh Ó Dubhthaig", "Gender": "male", "Age": "65", "Occupation": "feirmeoir", "Address": "Dundrockan, Co. Monaghan"}, {"Language": "Irish"}]}, "5074437/4878347/5074489": {"title": "An Bhó Dhubh", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0627, Page 215", "Page 215"], "url": "https://www.duchas.ie/en/cbes/5074437/4878347/5074489", "text": "\nUair amháin do thainig bó mór dubh isteach on bfairrge i gCeann Leime agus chuaidh sígo Carraig a' Cabaltaig. Gach maidean agus trathnóna théigheadh sí ó thig go tig agus thugadh sí go leor bainne do muintear an tighe. Biodh sí abalta aon arthach do lineadh is cuma cen meid a bhiodh ann acht ní leogfadh acht an ceann amhain do líonadh. La amháin nuair a chonnaic beirt bhan í ag teacht, d'eirig achrann eathorta mar gheall uirthi. Dubhairt cheann aca go bhfuigheadh si arthach nach líonadh si agus thug sí amach crithir agus thosnuig sí ag chruadh an bó isteach ann. Taréis neomat do leog an bó screach aisti agus do leim s i sios ar an crithir agus as go brath leithe amach ins an bfairrge aris agus ó shoin deireann na daoine gur miadh an rud bo crosta do choimead.\n", "school_info": "School: Cill Chaoi", "metadata": [{"Location:": "Kilkee, Co. Clare", "Teacher:": "\nAnraoi Ó Cathaláin\n"}, {"Collector": "Patrick Mc Guire", "Gender": "male"}, {"Informant": "Arthur Mc Guire", "Gender": "male", "Address": "Tullig, Co. Clare"}, {"Language": "Irish"}]}, "4922375/4875384/5075327": {"title": "An Glas Gaibhneach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0619, Page 073", "Page 073"], "url": "https://www.duchas.ie/en/cbes/4922375/4875384/5075327", "text": "\nLong ago there lived in Burren a smith named Lonn-mhach_Liamrhea. He had one leg and three hands, He won this cow from the King of Spain, He had three sons, the youngest had to mind the cow every day, One day he was making spears for his sons, When the youngest son came near the forge he heard the men saying I will keep this one and he hit the cow and she went to Spain, The smith was vexed and went to Spain for the cow, He had great trouble to get her back, He had  had to eat a firkin  and seven hundreds firkins of butter with the breath of his ear of lead and to\n(continues on next page)\n", "school_info": "School: Kilfenora (B.)", "metadata": [{"Location:": "Kilfenora, Co. Clare", "Teacher:": "\nP. Mag Fhloinn\n"}, {"Informant": "Seán Mac Eoin", "Gender": "male", "Address": "Cahermacon, Co. Clare"}, {"Language": "English"}]}, "4922375/4875417/5075427": {"title": "Seanráite", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0619, Page 106", "Page 106"], "url": "https://www.duchas.ie/en/cbes/4922375/4875417/5075427", "text": "\n(continued from previous page)\nhay while the sun shines.Three removes is as bad as a fire.A stitch in time save's nine.Live horse and you'll get grass.He that is not strong no good for him to be clever.\n\n\n\nBhí bean ann fadó agus bhí sí an-bhocht. Lá amain thainig fear agus diarr deoch bamne eirthi. Cé maibh aicí ach beagán tóh sí deoch dhó. Bhí sé an-bhuideach dí. Maidhin lá ar na bhárac connaich sí bó breág taobh amuig de'n dorais. Nuair a bhlíge sí í connaich sí go raibh niós mó bainne aicí ná aon bó eile ins an bparáiste. Ach bhí lucht amháin aicí\n(continues on next page)\n", "school_info": "School: Kilfenora (B.)", "metadata": [{"Location:": "Kilfenora, Co. Clare", "Teacher:": "\nP. Mag Fhloinn\n"}, {"Collector": "Eoin Ó Dochartaigh", "Gender": "male"}, {"Language": "Irish"}]}, "4922375/4875421/5075431": {"title": "Féilte na Bliana - May Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0619, Page 110", "Page 110"], "url": "https://www.duchas.ie/en/cbes/4922375/4875421/5075431", "text": "\n(continued from previous page)\nThey never bring it into the house. This branch is called the Summer branck.\n\n\n\nLong ago there was a poor man who was begging. He went into a farmers house for a drink of milk. He was very thirsty. This farmer had twenty cows. He fefused the begger for a drink of milk. Then he started off. When he saw a small far from him. He went into the house he asked for a drink of milk. The woman was very poor it was the way she used to buy milk from her nighbour but after all she gave him a drink of milk. Next morning when\n(continues on next page)\n", "school_info": "School: Kilfenora (B.)", "metadata": [{"Location:": "Kilfenora, Co. Clare", "Teacher:": "\nP. Mag Fhloinn\n"}, {"Language": "English"}]}, "4922375/4875424/5075436": {"title": "An Gobán Saor", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0619, Page 113", "Page 113"], "url": "https://www.duchas.ie/en/cbes/4922375/4875424/5075436", "text": "\n(continued from previous page)\nfair.  When she heard this she went to the lad.  She asked him what do you want.  I want money and the skin.  He went back to the father told him the story.  The two went to the town.  They were not long landed.  When the girl came up again she got a scissors and cut the wool off sold the wool brought home the skin.\n\n\n\nNaomh Bríghidh that first brought the glás gáibhneach to give milk to the poor people of Cárraich an Cóbalthaigh. This cow was owned by a smith in the place. This smith used to make swords and spears. The King of that place had three sons\n(continues on next page)\n", "school_info": "School: Kilfenora (B.)", "metadata": [{"Location:": "Kilfenora, Co. Clare", "Teacher:": "\nP. Mag Fhloinn\n"}, {"Collector": "Gearóid Ó Maoileoin", "Gender": "male"}, {"Language": "English"}]}, "4922375/4875429/5075439": {"title": "An Glas Gaibhneach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0619, Page 118", "Page 118"], "url": "https://www.duchas.ie/en/cbes/4922375/4875429/5075439", "text": "\n(continued from previous page)\nand she milked blood, She looked at the blood let three bellows and died, The track of her hoofs are to be seen in the flags near north Carron, She was an inchanted cow.\n\n\n\nLong ago there was a cow going around to the people giving them milk. It is said that the cow was milked into a strainer by a woman and the seven streams are there yet. There are lots of plants growing on the land. Thistle. Scutch grass is the worst of all. It speads around the land. There is lots of unlucky bushes on the land. Black\n(continues on next page)\n", "school_info": "School: Kilfenora (B.)", "metadata": [{"Location:": "Kilfenora, Co. Clare", "Teacher:": "\nP. Mag Fhloinn\n"}, {"Collector": "Mícheál Ó Callanáin", "Gender": "male"}, {"Language": "English"}]}, "4922375/4875431/5075442": {"title": "An Glas Gaibhneach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0619, Page 120", "Page 120"], "url": "https://www.duchas.ie/en/cbes/4922375/4875431/5075442", "text": "\n(continued from previous page)\ngiving milk. The people used say she was the best com in Ireland.\n\n\n\nThis was a famous cow that ust go around long ago. She was such a great milker that she was able to fill any bucket. One day as she was going over towards Carron she became very thirsty She went to a drain and took a drink out of it. So there is a cure in that water ever since. He track is to be seeing up in Ballygannor where she slept one night. One day while she was passing over the high Commons a woman that often heard about her. Came out with a bucket that she was not\n(continues on next page)\n", "school_info": "School: Kilfenora (B.)", "metadata": [{"Location:": "Kilfenora, Co. Clare", "Teacher:": "\nP. Mag Fhloinn\n"}, {"Collector": "Seán Ó Maolchaoine", "Gender": "male"}, {"Language": "English"}]}, "5044784/5037765/5081803": {"title": "Long Ago", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0963, Page 040", "Page 040"], "url": "https://www.duchas.ie/en/cbes/5044784/5037765/5081803", "text": "\nThat would be a favourite talk around the fire. \"Longo\". It was always undated and undefined. Sometimes it brought in a story of  Fionn McCool and a story of a local hero of a generation past. Sometimes the stories went back to the Dagda [?].Some ten years ago an old man was telling a story about the wonderful appetite a certain man had in olden times \"Longo\". It was pretty much the same as the description of the meals of the Dagda. Perhaps he had got it indirectly from books - anyway he never read it - or elikely it had come down as a folk tale. The story of Balor's cow is another of the stories of Long ago. Balor lent her to the people in Glengevlin. She would fill any vessel with milk however big and however often she was milked.\n(continues on next page)\n", "school_info": "School: Tullybrack", "metadata": [{"Location:": "Tullybrack, Co. Cavan", "Teacher:": "\nF. Maguire\n"}, {"Informant": "F. Maguire", "Gender": "unknown", "Address": "Altachullion Upper, Co. Cavan"}, {"Language": "English"}]}, "5044788/5038190/5082055": {"title": "Seanscéal", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0964, Page 038", "Page 038"], "url": "https://www.duchas.ie/en/cbes/5044788/5038190/5082055", "text": "\n(continued from previous page)\nmhór  chúaidh an súid seo súas án séimleoir. Cúpla lá indíaidh sín thóg sé á bean abáile agús cómhnúig sí go fadá índhiaidh sín. Deirtear  gur'b iad na sidheoga á thúg ár síubhal í.\n\n\n\nSometime ago there lived a blacksmith in the townland of Derrynatuon. He owned a cow and her name was \"Gas Gaiblín\". It is said that she used to travel to Longford and Meath and come home again at night to be milked. It has also been said that her udder was so large that it took a piece out of the mountain when coming home. The  Gap is still to be seen on the mountain.The ruins of the Forge is to be seen along the shannon and also the  ruins of an old mill which was working in those days. This is supposed to be the first forge that was built in Co. Cavan. The blacksmiths name was \"Geiblin Gab\". This is the way our parish derived the name Glangevlin which means the blacksmith's Glen. All townlands in Glangevlin are named in Irish. Curratavy means the land of rugged hills. Drumhuran  means the old cow's back. The townland of Crea means a seive in English. Legnagrow means  the wooded hollow. Mulley means a bray and upper mulley and lower mulley means the upper and lower bray. Gub means a birds beak.Pádraig Ó CuirnínRang a seacht\n", "school_info": "School: Curratavy", "metadata": [{"Location:": "Corratawy, Co. Cavan", "Teacher:": "\nE. Ó Gallchobhair\n"}, {"Collector": "Pádraig Ó Cuirnín", "Gender": "male"}, {"Language": "English"}]}, "5044794/5038928/5085290": {"title": "Strange Animals", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0965, Page 372", "Page 372"], "url": "https://www.duchas.ie/en/cbes/5044794/5038928/5085290", "text": "\nThere are many stories about fairies and there are people who believe in them too. In olden times a man tells that fairies used to be very plentiful in this district, and each fairy was a beautiful sight to see. One day a cow strayed from a fairy herd and was caught by an old farmer. He found her among his cows and liking her colour which was new to him he took charge of her. In those times we are told the colour of all Irish cows was a mixture of red and white and it is thought that only fairy cows were pure white and there was not a black cow to be seen in all the land. From that day onward the farmer grew richer. The fairy cow's milk was such as had never been tasted before. She gave milk to all who asked for it and as often in the day as was asked for it. The calves of this cow were snow white like herself and were finer than any others. But the old farmer was not very wise and neither was he grateful to the cow that brought him such wealth. He grew tired of her and he resolved to kill her for meat. The day for the killing soon arrived. The butcher was there with his axe and crowds of people gathered to see\n(continues on next page)\n", "school_info": "School: Corrabha (Curravagh)", "metadata": [{"Location:": "Curraghvah, Co. Cavan", "Teacher:": "\nname not given\n"}, {"Collector": "Brighid Ní Shiordan", "Gender": "female", "Address": "Carrick West, Co. Cavan"}, {"Informant": "Mr James Mc Goldrick", "Gender": "male", "Address": "Mullaghlea, Co. Cavan"}, {"Language": "English"}]}, "4922371/4875047/5087636": {"title": "An Glas Géimhneach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0618, Page 004", "Page 004"], "url": "https://www.duchas.ie/en/cbes/4922371/4875047/5087636", "text": "\nOver two hundred years ago in the Townland of Moher (about two statute miles to the west of Liscannor) we are told that the cows in that particular district died of a disease they called \"Galar Donn\", and consequently the inhabitants were very badly off for want of milk. One fine spring morning the people were surprised to hear what they thought was the bellowing of a cow; but no cow could they see anywhere. Suddenly they saw a huge animal at sea and swimming towards the shore. They all crowded  to the cliff tops and lo and behold what walked into the  land but a huge cow bellowing as loudly as it could. The inhabitants fled in terror but the cow would\n(continues on next page)\n", "school_info": "School: Scoil Bhríde, Liosceannúir", "metadata": [{"Location:": "Liscannor, Co. Clare", "Teacher:": "\nDónall Ó Seasnáin\n"}, {"Informant": "Seán Clárach", "Gender": "male", "Age": "84", "Occupation": "feirmeoir", "Address": "Beaghy, Co. Clare"}, {"Language": "English"}]}, "4798768/4796723/5149864": {"title": "An Glas Gaibhneach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0300, Page 057", "Page 057"], "url": "https://www.duchas.ie/en/cbes/4798768/4796723/5149864", "text": "", "school_info": "School: Doire Clathach (Derryclough), Drom Dhá Liag", "metadata": [{"Location:": "Derryclogh Lower, Co. Cork", "Teacher:": "\nÉamonn Mac Firbisigh\n"}, {"Collector": "Eamonn Mac Firbisig", "Gender": "male", "Address": "Drimoleague, Co. Cork"}, {"Informant": "Seán Ó Bhriain", "Gender": "male", "Address": "Drimoleague, Co. Cork"}, {"Language": "Irish"}]}, "4921828/4909882/5183006": {"title": "The Glas Gaibhneach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0375, Page 148", "Page 148"], "url": "https://www.duchas.ie/en/cbes/4921828/4909882/5183006", "text": "\nLong ago there was a woman who had no milk for her family and a fairy came to her and told her that she would send her a cow. The cow came into the woman's yard morning and evening, and whatever vessel the woman would put under her she would fill it with milk. Another woman who was jealous of her sais she would get a vessel that the \"Glas Gaibhneach\" would not fill. So she got a strainer and the cow disappeared and came back no more.\n\n\n\nThe most famous tradesman in olden times was the Gobán Saor. One time a lord sent a messenger to the Gobán to ask him to build a castle for him that any other castle on the earth would not equal. The work was commenced at once and when the castle would be completed the Gobán was to get a very big reward.\n(continues on next page)\n", "school_info": "School: Graigue, Cill Dairbhe", "metadata": [{"Location:": "Graigue, Co. Cork", "Teacher:": "\nMícheál Ó Lionacháin\n"}, {"Collector": "Anna Caplice", "Gender": "female", "Address": "Graigue, Co. Cork"}, {"Informant": "Mr William Kirke", "Gender": "male", "Age": "58", "Address": "Graigue, Co. Cork"}, {"Language": "mixed"}]}, "5162146/5158611/5196982": {"title": "An Glas Gamhnach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0633, Page 085", "Page 085"], "url": "https://www.duchas.ie/en/cbes/5162146/5158611/5196982", "text": "", "school_info": "School: Carraig an Chabhaltaigh (C.)", "metadata": [{"Location:": "Carrigaholt, Co. Clare", "Teacher:": "\nBríd, Bean Uí Chatháin\n"}, {"Collector": "Áine Dé Róiste", "Gender": "female"}, {"Informant": "(name not given)", "Relation": "relative (other than parent or grandparent)", "Gender": "male", "Age": "24"}, {"Language": "English"}]}, "5162147/5158743/5198136": {"title": "An Ceithearnach agus Mac Agairt na Feamugheata", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0633, Page 282", "Page 282"], "url": "https://www.duchas.ie/en/cbes/5162147/5158743/5198136", "text": "\n(continued from previous page)\nan truaill agus chonnaic sé ainm a athar scríobtha ar an lann le na fhuil feín. Scríobh  Ceithearnach a ainm air nuair bhí Mac Agairt  ag tabhairt na díghe dhó.Do mharbhuigh Mac an Ch, Mac  Agairt  lom láithreach.ó Sheán Ó Loingsigh, Cuibhreann, Có an Chláir\n\n\n\nBó bhainne a tháinig go dtí  an áit seo fadó (ní fios cérb as í)  Bhíodh sí ag ingior sna fearainn bhá mhéithe a bhí le fághail. Nuair bhíonn aoinne ag an moladh a fheirme fós deireann sé go mbíod an Glas Gamhnach ag féarac inntí.Bhí an buadh so aicí nár fhéad aoinne iomlán a bainne uaithí. Líonadh sí  gach soitheach bhí le fághail. Thainig bean na Sainnte ón Ros agus seift aicí cun an lámh uachtair d'fághail ar an mbuin. Cad a chuir sí fuíthí  acht críathar agus níor fhéad an bhó  é do líonadh. Nuair do chonnaic an Glas Gamhnac an feall a bhí dá imirt uirthí leim sí  le faill agus bádhadh í i Ros. Tá rian a achoise le feiscint fós ar na carraigreaca ann.Is i Mágh Fhearta Mágh Mhín agus Cill Baile Eoghain a bíodh sí ag inbhear acht tá an sgéal céadna le cloisint lámh le  Sráid na Cathrach maidir le h-áiteanna ar leith sa ndútháigh sin.Ní thagad  an Glas Gamhnach acht go daoine bochta.\n", "school_info": "School: Dún Átha, Carraig an Chabhaltaigh", "metadata": [{"Location:": "Doonaha, Co. Clare", "Teacher:": "\nEd J. Headtromóin\n"}, {"Language": "Irish"}]}, "5162144/5158450/5203256": {"title": "Glascloon", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0626, Page 290", "Page 290"], "url": "https://www.duchas.ie/en/cbes/5162144/5158450/5203256", "text": "\nGlascloune which means the green meadow, cloune which means meadow and glas which means green.  It is said that a cow used to come to a green field belonging to Mr. Murrihy as it was the greenest field in the place. Every day the cow would go to all the houses and stand outside until someone would come out and milk her. Then she would go to the next house and do the same . It did not matter what size of bucket  was brought out she would fill it. So one day a woman came out to milk her with a strainer but the cow would not stand for her.  She went into the fort. And every night the cow used to come out to the man's door. One night the man waited up until the cow came\n(continues on next page)\n", "school_info": "School: Dún Beag (C.)", "metadata": [{"Location:": "Doonbeg, Co. Clare", "Teacher:": "\nEibhlín Ní Shúilleabháin, Bean an Ághasaigh\n"}, {"Collector": "Theresa O' Sullivan", "Gender": "female"}, {"Language": "English"}, {"Location": "Glascloon"}]}, "5162144/5158451/5203258": {"title": "Glascloon", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0626, Page 291", "Page 291"], "url": "https://www.duchas.ie/en/cbes/5162144/5158451/5203258", "text": "\n(continued from previous page)\nand when the cow was outside he opened the door  and followed her. The cow ran into the fort and the man followed her in. When he was inside he heard an old lady say get out and dont break our ware. The man said he did not care about their ware if he got back his cow and when he was going  out he heard an old lady say that the cow was no good without a spancil.\n\n\n\nSome say that it descended from heaven on Scattery Island when St. Ciaran and St. Brenden were there but others say that it fell on the cross between Kildimo and Farrigha. It was shaped like a pyramid and quadrangular. It was exhibited at Lisdoovarna by the Royal society of antiquities.\n", "school_info": "School: Dún Beag (C.)", "metadata": [{"Location:": "Doonbeg, Co. Clare", "Teacher:": "\nEibhlín Ní Shúilleabháin, Bean an Ághasaigh\n"}, {"Collector": "Theresa O' Sullivan", "Gender": "female"}, {"Language": "English"}]}, "5286172/5285584/5286802": {"title": "A Story of a Liss", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0648, Page 345", "Page 345"], "url": "https://www.duchas.ie/en/cbes/5286172/5285584/5286802", "text": "\nA little distance from our house there is a liss of which numerous stories are told. The following is one of them.In this liss there was a great hole dug in the ground. One day a man was passing through it and seeing the hole, he went over to it and looked in. He saw a most beautiful staircase leading down to a room, as he thought. He did not go down but hurried home as quickly as possible and related the whole story to his people. It was afterwards said that when they went down there with candlelight the light would quench when they were down a certain distance so nobody ever succeeded in finding out what was at the end of the staircase.\n\n\n\nOnce upon a time there was an enchanted cow in this place. She used to fill a bucket for everyone who would milk her. But a certain man said she would not fill a sieve for him. As he went to milk her, her tail fell off and she disappeared and was never seen again. That is why the place is called Gleann an Earabail. Gleann an Earabail is situated between Bonmahon\n(continues on next page)\n", "school_info": "School: Bun Machan", "metadata": [{"Location:": "Bunmahon, Co. Waterford", "Teacher:": "\nÍde, Bean Uí Chobhthaigh\n"}, {"Collector": "John Keane", "Gender": "male", "Address": "Ballynahila, Co. Waterford"}, {"Informant": "Mrs Keane", "Relation": "parent", "Gender": "female", "Address": "Ballynahila, Co. Waterford"}, {"Language": "English"}, {"Location": "Ballynahila"}]}}