{"4428391/4403386/4511540": {"title": "Balair", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1068, Page 349", "Page 349"], "url": "https://www.duchas.ie/en/cbes/4428391/4403386/4511540", "text": "\nBalairBhí balair agus bhí caisláin déanta aige ar an dún agus rinn sé príosáin ins an bhinn agus chuir sé a nighean féin agus dá chloigeann déag eile cailín síos ann agus chuir sé plúir ar an Dún ar eagla go mbeadh páistí ag an nighean agus chonnaic sé lorgnacha cosa ins an phlúir. Thug gial dubh léim phort challa agus fuair sé páistí leis na cailíní go léir. Nuair a rugadh na páistí ba mhaith le balair na páistí uilig a chur chun báis acht a'n duine amháin. Bhí sé sgríobhtha ariamh ins an leabhar a bhí aige gurab é a ua féin a mharbhochadh é, agus ba mhaith leis a ua fhéin a mharbhadh igcuideachta na bpáistí eile. Bhaith sé na páistí uilig acht an duine amháin agus cé aca a choinnigh sé acht a ua. Bhuin sé na píní as a gcuid éadaigh agus chaith sé amach i bport oilig iad. Sin an fáth\n(continues on next page)\n", "school_info": "School: Oileán Toraighe", "metadata": [{"Location:": "Tory Island, Co. Donegal", "Teacher:": "\n-\n"}, {"Collector": "Gráinne Ní Chearbhaill", "Gender": "female"}, {"Informant": "Séamus Ó Cearbhaill", "Gender": "male", "Address": "East Town, Co. Donegal"}, {"Language": "Irish"}]}, "4428403/4404872/4514874": {"title": "The Poisoned Glen", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1072, Page 281", "Page 281"], "url": "https://www.duchas.ie/en/cbes/4428403/4404872/4514874", "text": "\nThe Derryveagh mountains are not very far away from Losset school. Slieve Snacht which is like the dome of some giant temple is the last important summit of them. Now the poisoned glen divides the shoulder of Slieve Snacht from the barren summit of Dooish. A story is told of how this glen got its name. Balor of the Evil Eye was one day passing along the glen when the coverings fell from his evil eye and the very fact of his looking on the place was sufficient to poison the glen. Even afterwards and to the present day it is known as the poisoned glen. This glen runs through Glenveagh estate. Now we are told that about fifty years ago the Golden Eagle had its eyrie in Glenveagh by the side of a waterfall which drops at best a thousand feet. Many of the old people in this locality remember when the Golden Eagle frequented the spot. Told by Maggie GallagherGartanTold by the teacher.\n", "school_info": "School: Losad", "metadata": [{"Location:": "Losset, Co. Donegal", "Teacher:": "\nÚna Bean Uí Laoghaire\n"}, {"Collector": "Maggie Gallagher", "Gender": "female", "Address": "Bellville or Gartan, Co. Donegal"}, {"Informant": "Úna Bean Uí Laoghaire", "Gender": "female", "Occupation": "teacher"}, {"Language": "English"}, {"Location": "Derryveagh Mountains"}]}, "4493639/4406561/4518999": {"title": "Balor an tSúil Nimhe", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1077, Page 309", "Page 309"], "url": "https://www.duchas.ie/en/cbes/4493639/4406561/4518999", "text": "\nIns an aimsear chian-aosta bhí fathach fíochmhar darbh ainm Balor ina chómhnaidhe ar oilean Thoraigh. De threibh na bhFhómharach é agus chuir sé bunadh an oileain uilig faoin a smacht 's bhí sé ag maoidheamh ceannais ar lucht an mhór thír fosta. Aon tsúil amháin a bhí ag Balor. Bhí an t-súil sin suidhte i gclár a éadain agus bhí léargas malluighthe ann idtreo go mairfidhe achan duine a nd'amharcadh sé air. Baisteadh balor an t- súil nimhe air da bhríghe sin.Ní rábh lucht an mhór thír sásta géilleadh do Balor. Go háirid Ceann Fhaolaidh, fear a lonnuigh neas don Fhalcarraigh.Bhí Ceann Fhaolaigh ionchurtha le Balor\n(continues on next page)\n", "school_info": "School: Dún Fhionnachaidh (2)", "metadata": [{"Location:": "Dunfanaghy, Co. Donegal", "Teacher:": "\nÉamonn Ó Canainn\n"}, {"Language": "Irish"}]}, "4493700/4412363/4526170": {"title": "Balor", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1094, Page 429", "Page 429"], "url": "https://www.duchas.ie/en/cbes/4493700/4412363/4526170", "text": "\nTá sgéal Bhalóir agus Lughaidh ar sgéal comh sean is atá ag Gaedhil. Ní in Éirinn a cumadh é. Bhí sé mar oigrideacht leis na Gaedhil ag teacht chun na tíre doibh. Taisbeánann sgéal Polyphemus agus sgéal Acrisius 7 Perseas a bhí ag na Gréagaigh go raibh an sgéal ann sul ar sgar an chuid sin den cineadh daonna ar díbh na Gaedhil 7 na Gréagaigh le chéile. Ba é Balór Beimeann Dia an Bháis i bhfeallsamhnacht na nGaedhal. Bhí súil amháin i gclár an éadain aige 7 bhí an bás san t-súil sin; óir nuair a thógadh sé an chúmhdach a bhí ag folach na súile, chuirfeadh an t-amharc a bheireadh sé ar an namhaid gach duine dúbh chun báis. Dálta Polyphemus bhí sé in a chomhnuidhe ar oileán mara. I dToraigh ar an taobh ó thuaidh de Thír Chonaill a bhí a dhún-árus. Tá Dún Bhaloir mar ainm ar an ait atá ar an taobh thoir de’n oileán go dtí an lá atá indiu ann. Chuir Balor ceist ar bhioróig an\n(continues on next page)\n", "school_info": "School: An Árd Leathan", "metadata": [{"Location:": "Altlahan, Co. Donegal", "Teacher:": "\nPádraig Mac Ailin\n"}, {"Collector": "Pádraig Mac Ailin", "Gender": "male", "Occupation": "múinteoir"}, {"Informant": "Micí Chaitlín ", "Gender": "male", "Address": "Inishbofin, Co. Donegal"}, {"Language": "Irish"}]}, "4493791/4420792/4537494": {"title": "The Irish Neptune", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1119, Page 365", "Page 365"], "url": "https://www.duchas.ie/en/cbes/4493791/4420792/4537494", "text": "\n(continued from previous page)\nsentation of the storm-god carrerring over land and sea with whirling motion.\n\n\n\nAnother disembodied hero of local celebrity is Niall-na-ard, or Neil of the Heights, who is said to rule as Fairy King over the Hills of Knockameny, Knockglass, Lagg, and Gorey, as also over the Gulf of Strabreagy, near Malin. The Queen of this potentate is thought to hold divided jurisdiction with him, and to influence his decisions.Manannan is said to have submerged both of these, with their former castle and estate, under Strabreagy Lough.\n\n\n\nBalor-of-the-mighty-blows, a hairy giant, remembered very vividly in local tradition. He was king of a tribe of Fomorian pirates, who, about 1200 B.C. in-\n(continues on next page)\n", "school_info": "School: St Columb's Moville", "metadata": [{"Location:": "Moville, Co. Donegal", "Teacher:": "\nHamilton Stewart\n"}, {"Collector": "Hamilton Stewart", "Gender": "male", "Address": "Moville, Co. Donegal"}, {"Language": "English"}]}}