{"4428299/4392563/4476279": {"title": "Scéal Stairiúil", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1038, Page 131", "Page 131"], "url": "https://www.duchas.ie/en/cbes/4428299/4392563/4476279", "text": "\nSeall maith bliadhanta ó shoin bhí fear ina chomhnuidhe I nDún-na-nGall darbh ainm Aodh Ó’Dómhnaill. Ba é an taoiseach a bhí againn annseo I dTír Chonnaill. Am amháin rinne sé amach go rabh sé comh maith aige caislean úr a dheánadh I nDún-na-nGall.Chruinnigh sé cuid mhór saoirthí leis an chaislean a dheánadh, agus thosuigh siad. An obair a rinne siad an chead lá bhí sé as amharc an an lá-thar-na-mharach arís. Thosuigh siad cupla uair eile ach ní rabh gar ann, ní rabh lorg a gcuid oibre le feiceal a chaidhche an darna lá agus mar sin ba leur do Aodh go rabh rud eighinteacht contrailte.Bhí sé fhéin amhuigh ag siubhal lá amháin ar bhruach Loch Iasg. Tchí sé fear a’ tairraing air aniar ar an clochain. Bheannuigh é do Ó’Dómhnaill agus seo ar rud a dubhairt sé leis, “Ó’Domhnaill,” ars sé, “tá tú I dtrioblaid inntine cionnas nar “féidir leat faghail ar aghaidh le do chaislean. Ach seo an chómhair le atá agam-se le tabhairt duit. Tar annseo amhárach I dtráthaibh an ama seo agus tchídhfidh tú a’ tarraing ort trúir fear. Na cuir thusa faillte ar bith roimhe duine aca thar an duine eile or ma gníd ní bhfuigh tú eolas ar bith uatha. Seo an fáillte a chuirfeas tú rompú, Coisceim fuar ar feur ghlas, Coisceim eadthrom ar sioc, Coisceim corrach ar clochan, sé bhur mbeatha I n-einfheacht.”Thug Aodh Ó’Domhnaill buidheachas do agus d’fhág sé slán aige. An tráthnóna ina dhiaidh sin bhí sé amhuigh ins an áit cheadhna agus níor bhfada bhí sé ann go\n(continues on next page)\n", "school_info": "School: Cruach", "metadata": [{"Location:": "Croagh, Co. Donegal", "Teacher:": "\nSéamus Mac Duibhir\n"}, {"Collector": "Mollaidh Ní Ghallchobhair", "Gender": "female"}, {"Informant": "Prionsus A Gallchobhair", "Gender": "male", "Address": "Doobin, Co. Donegal"}, {"Language": "Irish"}]}, "4428299/4392568/4476281": {"title": "Scéal Aoidh Ruaidh", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1038, Page 136", "Page 136"], "url": "https://www.duchas.ie/en/cbes/4428299/4392568/4476281", "text": "\nNuair a bhí Aoidh Ruadh Ó’Dómhnaill a’ fághail Dún-na-nGall bhí móran airgid aige le cuir I dthaiseidh. Chuaidh sé amach lá amháin go h-oilean Loch Beul Seod le é a chuir I dthaiseidh. Ins an am sin bhí geasaibh a’ gabhail agus bhí Aoidh é fhéin istoigh le lucht na geasa. Cuir siad an t-airgead I bhfolach agus lán pota óir a bhí ann. Tá easgan da choimhead go fóill agus deirtear go bhfuil anam duine le cailleadh sul a dthig é a dthógail.Níl le feiceal ins an áit a bhfuil sé curtha ach árdan beag crúinn caonaigh agus toir suileoig duibh a’ fás air. Deirtear gur Aodh Ruadh é fhéin a chuir an toir sin le na laimh fhéin.\n", "school_info": "School: Cruach", "metadata": [{"Location:": "Croagh, Co. Donegal", "Teacher:": "\nSéamus Mac Duibhir\n"}, {"Collector": "Mollaidh Ní Ghallchobhair", "Gender": "female"}, {"Informant": "Prionsus A Gallchobhair", "Gender": "male"}, {"Language": "Irish"}]}, "4428356/4398985/4487031": {"title": "Scéal", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1055, Page 256", "Page 256"], "url": "https://www.duchas.ie/en/cbes/4428356/4398985/4487031", "text": "\nScéalBhí Rí ann i bhfad ó shoin agus nuair a bhí sé ag cur suas a chaisleán i nDún na nGall an méid a chuireadh sé suas ins an lá bhéadh sé ar lár ar maidín. Bhí seisear saor cloiche aige. D’obair sé leis go dtí Aoine. Chuir sé ina chionn go gcuirfeadh sé trí shaor eile a gcuideachta an mhuinntir a bhí aige siocair an Domhnach a bheith ag teacht, nó chonnaiceas dó nach mbainfidhe leis ar an Domhnach. Agus bhí dúil aige go suidhfheadh sé fhéin ‘a choimheadh go mbéadh an mheadhon oidhche thart.Nuair a scap na saortha cloiche tráthnóna Dia Sathairn d’fhan an rí leis fhéin na ndiaidh ag coimheadh an chaisleáin. Bhí sé tamall ina shuidhe, a aghaidh ar an obair agus a chúl ar an taoibh eile, nuair a thionntaigh sé thart bhí bean ruad ina seasamh ar a chúl agus níor mhothuigh sé ag teacht í.“A rí Uí Dhomhnaill,” a deir sí “tá tú ag teacht ‘un tosaigh go maith le dó chaisleán,”\n(continues on next page)\n", "school_info": "School: Mín na Mánrach", "metadata": [{"Location:": "Meenamarragh, Co. Donegal", "Teacher:": "\nNiall ac Suibhne\n"}, {"Collector": "Sorcha Ní Fhirghil", "Gender": "female"}, {"Informant": "Seán Ó Dubhthaigh", "Gender": "male", "Age": "52", "Address": "Falcarragh, Co. Donegal"}, {"Language": "Irish"}]}, "4493698/4412092/4525346": {"title": "Fuadach Aoidh Ruaidh", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1094, Page 171", "Page 171"], "url": "https://www.duchas.ie/en/cbes/4493698/4412092/4525346", "text": "", "school_info": "School: An Árd Leathan", "metadata": [{"Location:": "Altlahan, Co. Donegal", "Teacher:": "\nPádraig Mac Ailin\n"}, {"Collector": "Pádraig Mac Ailin", "Gender": "male", "Occupation": "múinteoir"}, {"Language": "Irish"}]}, "4493700/4412401/4526574": {"title": "Seanscéal", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1094, Page 466", "Page 466"], "url": "https://www.duchas.ie/en/cbes/4493700/4412401/4526574", "text": "", "school_info": "School: An Árd Leathan", "metadata": [{"Location:": "Altlahan, Co. Donegal", "Teacher:": "\nPádraig Mac Ailin\n"}, {"Collector": "Róise Nic Néill", "Gender": "female"}, {"Language": "Irish"}]}}