{"4427877/4353314/4449274": {"title": "The Whiteboys in Kilmaine", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0105, Page 234", "Page 234"], "url": "https://www.duchas.ie/en/cbes/4427877/4353314/4449274", "text": "\nIn the time of the White-boys, I often heard my father say that no man of the name of Mullen, Moloney or Staunton was allowed to join or take the oath of the White-boys.  People of the name of Mullen, Moloney or Staunton were regarded as being of the breed of spies and informers.Ainm an duine a bhfuaireas on sgéal suas : Thomas Canny, Roundfort, Hollymount, Co. Mayo, aged 80 years.He was a native of Kilmaine Parish originally.  He was an ex-RIC pensioner.  He told me the above story in 1937. - Donnchadh Ó Riain, oide sgoile.N.B. (i) I regard this information as important because it explains the reference in the poem \"Donnchadh Bán\"  \"A Mhic Uí Mholáin, a sciursa a mhí-adh......\"(ii) Moloney was the surname of \"Seaghan na Sagart\"(iii) Staunton was the surname of those who murdered Eadmon de Burca in Lough Mask.(iv)Mullan (Ó Moláin) was surname of the traitor in \"Donnchadh Bán\"\n\n\n\nWhen I was a boy I went to school in Roundfort.  The school was held in the Catholic Church.  The teacher was Richard Nally.  All the children spoke nothing but Irish.  The reading books were English.  Each boy went up to the teacher in his turn and he heard their reading and spelling individually.\n(continues on next page)\n", "school_info": "School: Scoil N. Comáin, Hollymount", "metadata": [{"Location:": "Hollymount Demesne, Co. Mayo", "Teacher:": "\nDonncha Ó Riain\n"}, {"Collector": "Donnchadh Ó Riain", "Gender": "male", "Occupation": "múinteoir", "Address": "Rahard, Co. Mayo"}, {"Informant": "Thomas Canny", "Relation": "not a relative", "Gender": "male", "Age": "80", "Occupation": "police officer", "Address": "Roundfort, Co. Mayo"}, {"Language": "English"}]}, "4613710/4611186/4643193": {"title": "The Hanging at the Cross (where the two dtreets meet in Newtownsandes)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0405, Page 004", "Page 004"], "url": "https://www.duchas.ie/en/cbes/4613710/4611186/4643193", "text": "\nMy father remembered the Whiteboys. There was a landlord in Kilbaha named Wall. There was another in Moyvane named Sandes. Sandes knew the names of all the Whiteboys in the district. So did Wall. The Whiteboys trusted Sandes, but they were afraid Wall would tell all their names. So they decided to do away with Wall. Wall was afraid of them. He made up his mind to take in house in Glin, and went the Kerry line to Glin about the house, but he came back this (Newtownsandes) way. The Whiteboys watched him; they attacked his house that night, and the firing went on till morning. In the morning the set fire to the house and Wall was burned to death.Two hundred soldiers came from Limerick the following day. They were to kill everybody they met, but Sandes met them over on the Tarbert road near Johnny Nesk's and told them not to touch anybody, that he would have all the Whiteboys arrested, that he knew them all.The soldiers did no harm then. They went to Kilbaha, and the first them met were my father and my uncle Johnny threshing in the haggard. Sandes said, \"They're two honest boys, they're a widows sons, they never did harm to anybody\". So they did nothing to them. My father was about eighteen at that time.Sandes gave the names of all the Whiteboys and they were arrested and tried in Tralee. Three of them were sentenced to be hanged. One of them was ordered to be brought to Newtown to be hanged. His name was Neill (pron. Nayle). He was the ringleader. He was brought to Newtown by the soldiers. They drove two poles in the ground below at the Cross and put another pole across. The then put\n(continues on next page)\n", "school_info": "School: Murher (B.)", "metadata": [{"Location:": "Murher, Co. Kerry", "Teacher:": "\nTomás Ó Conaill\n"}, {"Collector": "Tomás Ó Conaill", "Gender": "male", "Occupation": "múinteoir"}, {"Informant": "Con Shine", "Gender": "male", "Age": "84", "Occupation": "carpenter", "Address": "Newtownsandes, Co. Kerry"}, {"Language": "English"}]}, "4613710/4611191/4643368": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0405, Page 009", "Page 009"], "url": "https://www.duchas.ie/en/cbes/4613710/4611191/4643368", "text": "\nJames Cunningham and Myles Cunningham lived in the same farm house in Kilbaha, now occupied by a man named Kearney. James and Myles were brothers. James Cunningham was my grand-father. He was a big able man and was married to a woman named Woulfe from Cratloe near Abbeypeale. The Whiteboys had a great set on my grandfather. They wanted him to join them and go with them. He had to hide from them several times. One night when they came for him they couldn't find him and for revenge began jumping their horses over his potato pits till they levelled them to the ground. They put Myles on his knees and made him swear he was not James. James had to leave his house altogether and did not return to it till the days of the Whiteboys were over.\n", "school_info": "School: Murher (B.)", "metadata": [{"Location:": "Murher, Co. Kerry", "Teacher:": "\nTomás Ó Conaill\n"}, {"Informant": "Edmund Stack", "Gender": "male", "Age": "77"}, {"Language": "English"}]}, "4613719/4612424/4644396": {"title": "Local Place Names", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0407, Page 080", "Page 080"], "url": "https://www.duchas.ie/en/cbes/4613719/4612424/4644396", "text": "\n(continued from previous page)\nbecause he was noted as a great tyrant.\n\n\n\nThere is a cross about a mile from Listowel at the eastern side. It is called Bolton's cross. It got its name from an old gentleman who lived there in former times. His name was Bolton. There is also a townland named Skehenerin. In former times it was divided into two portions, one portion was called Skehenerin Stokes and the other Skehenerin Egan. The whole townland was owned by these two men. There is a bridge in the townland of Bunagara called the bridge of the Spirit. It was formerly believed that a ghost used to be seen there at night. The story is told how this had occurred. A man named Blakney Kitchener lived in a place which is now known as Blakes Cross. He was raided by the White boys. They fought all night. One of the White boys was killed and day approaching they had to retreat leaving their dead comrade under this little bridge until they got an opportunity of taking him away.\n", "school_info": "School: Cluain Meacan", "metadata": [{"Location:": "Cloonmackon, Co. Kerry", "Teacher:": "\nLiam Ó Catháin\n"}, {"Informant": "Batt Scannell", "Gender": "male", "Age": "50", "Address": "Bunagarha, Co. Kerry"}, {"Language": "English"}]}, "4613719/4612426/4644413": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0407, Page 082", "Page 082"], "url": "https://www.duchas.ie/en/cbes/4613719/4612426/4644413", "text": "\nOn one occasion Blakeney Kitchener had no one living with him but a servant girl. One night moonlighters came to shoot him. He had light in every window but one at which he and the servant were. It was the servant girl that was loading the gun for him. He never got any wound but wounded some of them. He was firing at them. The cocks were crowing in the morning. He knew that they were wounded and he sent for the blood hounds but they were not able to trail the blood so he could not find out who the moonlighters were.\n", "school_info": "School: Cluain Meacan", "metadata": [{"Location:": "Cloonmackon, Co. Kerry", "Teacher:": "\nLiam Ó Catháin\n"}, {"Language": "English"}]}, "4613713/4611469/4651748": {"title": "A True Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0405, Page 287", "Page 287"], "url": "https://www.duchas.ie/en/cbes/4613713/4611469/4651748", "text": "\nThere lived in  Carrueragh at one time a man by the name of Costello with his two children.He lived in a farm out of which another family had been evicted by the Landlord Blacker Douglas.The White Boys had determined to murder everybody that had anything to do with the Landlord and so they came to the house of the poor man who was a widower. They took him a little distance from the house and killed him.The two children cried until they were hoarse and the hoarseness never left them.As the man was dying his blood spattered on a stone beside him, and the stone is still there bearing the name of \"The blood stained stone\".\n\n\n\nDown in Carrueragh in the middle of a wild mountain called Moanveinleac there is a big hole known as 'poll a' phiobaire'. It is believed that there was a piper drowned there long ago, and the noise of the waters beside the hole ever since resembles the music of the pipers band.The place beside the hole is a desolate spot in the mountain.\n(continues on next page)\n", "school_info": "School: Cnoc an Iubhair (C.)", "metadata": [{"Location:": "Kealid, Co. Kerry", "Teacher:": "\nMáire Ní Cheallacháin\n"}, {"Collector": "Máire Ní Cheallacháin", "Gender": "female"}, {"Informant": "Billy Drury", "Gender": "male", "Age": "70", "Address": "Carhooearagh, Co. Kerry"}, {"Language": "English"}]}, "4613721/4612801/4652949": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0407, Page 592", "Page 592"], "url": "https://www.duchas.ie/en/cbes/4613721/4612801/4652949", "text": "\n(continued from previous page)\nanswered and said it is farther over. It was a bright moonlight night. It was not long until they heard an awful heavy walk after them. They stood and the noise stopped and when they walked someone walked after them but they could see no one. They went on for nearly a quarter of a mile and someone walked after them until they left the road for their own house.\n\n\n\nThere was a very rich man there long ago who had a daughter by the name of Eileen. This night the Whiteboys came and carried her away to marry her. There was a man living near by whose name was \"Domhnall gan Sgáth\". He got a troop of men and horses and followed her. When they landed at the house to which the girl was carried Domhnall went in. She was sitting inside an old man in the corner. He told her to come out and to come home. He asked her had she all her clothes and everything she brought with her. She said she had except one white bib. She went into the house again and not one said a word to her. Domhnall brought her home up on the horse behind him. When she came home her father was delighted. He said that no one would marry her now but Domhnall married her and they were happy ever afterwards.\n", "school_info": "School: Dromlogach Mainistir na Féile", "metadata": [{"Location:": "Dromlegagh, Co. Kerry", "Teacher:": "\nEighneachán Ó Muircheartaigh\n"}, {"Collector": "Connchubhair O Caoimh", "Gender": "male"}, {"Informant": "Líam O Coileáin", "Gender": "male"}, {"Language": "English"}]}, "4666597/4665531/4668330": {"title": "Story of The Whiteboys", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0412, Page 203", "Page 203"], "url": "https://www.duchas.ie/en/cbes/4666597/4665531/4668330", "text": "\nStory of the WhiteboysIn the time of the \"white boys\" a man named Collis lived in the district.  He was an officer in the English Army and he had a find house situated in the Fortwilliam (part of this house is still standing and is now occupied by John Dowd). He had an orchard and plenty of good land still he was never done tormenting the poor Irish. He became so very cruel that the white-boys made up their minds to put a stop to his bad deeds. The captain of the Whiteboys sent word to his men of the different districts to meet at Kilflynn on a certain night. Ma bron' his men came from the Lixnaw, Listowel, over the hill from Bally-Mc-Elligott, Kilflynn, and they marched down along towards Shannow bridge. This was the dead of the night and all the people of the houses near the road were in bed and fast asleep. But it seemed the tramping of the marching men awakened one man just as they were passing his house. he opened the door and came out and on the road partly dressed to see what was happening. One of the marching men felt angry with him\n(continues on next page)\n", "school_info": "School: Ardrahan, Mainistir Ó dTórna", "metadata": [{"Location:": "Ardrahan, Co. Kerry", "Teacher:": "\nBean Uí Dhonnabháin\n"}, {"Collector": "Eileen O' Sullivan", "Gender": "female", "Address": "Kilgulbin West, Co. Kerry"}, {"Informant": "Mrs Slattery", "Relation": "not a relative", "Gender": "female", "Address": "Kilgulbin West, Co. Kerry"}, {"Language": "English"}]}, "4678390/4675759/4682711": {"title": "Na Buachaillí Bána", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0421, Page 166", "Page 166"], "url": "https://www.duchas.ie/en/cbes/4678390/4675759/4682711", "text": "\nBhí feirmeóir ann fadó agus bhí mach & ingean aige. Aon lá amháin chuaidh sé féin & a mhach & a bhuachaill aimsire ar an aonach go Corcaig le beithuighidh. An tráthnóna sar air imighuigeadar dúbhairt an feirmeóir le na ingean gan éinne a leigint isteach go dtí go dtiochfhaidh sé ón aonach. Dúbhairt an ingean ná leigheadh.Tráthnóna lar na mháireach do bhuail chúice isteach seana bhean bhocht & gach aon screach aice á rádh \"Ar shon Dé fágadhigh istig me go dtí maidhean. Ní fhághfam arsa ingean an feirmeóra mar dúbhair mathair liomsa ag éinne d'fághaint istig go dtí go dtíofadh sé. Tar éis tamaill dóibh ag cainnt d'fágh ingean an Rí istig i. Nuair a tháinig an oidhche chuaidh an t-seana-bhean a choladh sa chúine agus cuaidh ingean an fhir síos an t-seómra & d'fan sí ag feacaint aníos air an t-seana-bean.Siar san oidhche do tosnaig an t-seana-bean ag athrú. Do dhein fear di & las sí coingeal i láimh duine mairbh & bhí ag caitteamh ór ar an\n(continues on next page)\n", "school_info": "School: Smerwick (B.)", "metadata": [{"Location:": "Murreagh, Co. Kerry", "Teacher:": "\nDd. Ó Loingsigh\n"}, {"Collector": "Seamus Ruiséal", "Gender": "male", "Age": "15", "Address": "Ballynagall or Ballydavid, Co. Kerry"}, {"Informant": "Pádraig Óg Ó Maoileóin", "Gender": "male"}, {"Language": "Irish"}]}, "4678409/4678159/4688720": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0426, Page 488", "Page 488"], "url": "https://www.duchas.ie/en/cbes/4678409/4678159/4688720", "text": "\nLong ago there was an old Protestant church in Ballinacourty built by the English. There were people around called the White Boys. They had to swear that they wouldn't give out on one another. They knocked the Protestant  church on one night. They carried away the timber, and stones, and the slate, they were never found since. This night they were going to knock the pound in Ballinclare my grandfather told them not to go tonight, that there was one in the crowd that might give out on them. The soldiers were out that night and if the White Boys went out to knock the pound they would be all caught and hanged. They went a couple of nights after and knocked the pound that was in Ballinclare and they knocked another pound  that was in Garraidhe-na-dTor and more pounds also.Told by Thomas D Kennedy, Farmer, Anagap  age 52 years. Thomas never left his native place. Taken down March '38.\n", "school_info": "School: Breac-Cluain (B.)", "metadata": [{"Location:": "Brackloon, Co. Kerry", "Teacher:": "\nPádraig Ó Séaghdha\n"}, {"Informant": "Thomas J. Kennedy", "Gender": "male", "Age": "52", "Occupation": "farmer", "Address": "Annagap, Co. Kerry"}, {"Language": "English"}]}, "4706359/4706054/4725746": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0448, Page 146", "Page 146"], "url": "https://www.duchas.ie/en/cbes/4706359/4706054/4725746", "text": "", "school_info": "School: Cnuicín na hAbhann", "metadata": [{"Location:": "Knockeennahone, Co. Kerry", "Teacher:": "\nMáiréad, Bean Uí Chéirín\n"}, {"Collector": "Hanna Riordan", "Gender": "female", "Address": "Barna, Co. Kerry"}, {"Informant": "Dan Clifford", "Gender": "male", "Age": "82", "Address": "Barna, Co. Kerry"}, {"Language": "English"}]}, "4713233/4709742/4726219": {"title": "A Story of the Whiteboys", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0451, Page 015", "Page 015"], "url": "https://www.duchas.ie/en/cbes/4713233/4709742/4726219", "text": "\nAbout the year 1820 the mail used to be taken by coach. A man named Brereton used to drive the coach. The White Boys were very active in the Rathmore district about this time and Brereton received a warning from them not to take the mails on a certain date. He being a brave and reckless man ignored the warning. He said that having two pistols he would cut through them even if all the devils in Hell were with them.He travelled on this date and all went well until he came to Old Chapel, which is about a mile west of our school. One of the White Boys lay in ambush there and flung a scythe blade at Brereton's horse. The horse bled furiously and Brereton not noticing it drove on. The horse bled to death after a short time and the White Boys captured Brereton. He was murdered and left on the road and found the following morning in Upper ShinnaghThere was great activity by the soldiers in the district\n(continues on next page)\n", "school_info": "School: Ráth Mhór (B.)", "metadata": [{"Location:": "Rathmore, Co. Kerry", "Teacher:": "\nDiarmuid Ó Cróinín\n"}, {"Collector": "Diarmuid Ó Cróinín", "Gender": "male", "Address": "Shinnagh, Co. Kerry"}, {"Language": "English"}]}, "4706337/4703950/4743384": {"title": "Gallow Green (Páirc na Croiche)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0442, Page 246", "Page 246"], "url": "https://www.duchas.ie/en/cbes/4706337/4703950/4743384", "text": "", "school_info": "School: Listellick, Tráighlí", "metadata": [{"Location:": "Listellick North, Co. Kerry", "Teacher:": "\nDomhnall Ó Súilleabháin\n"}, {"Informant": "Thomas Healy", "Gender": "male", "Age": "85", "Address": "Listellick North, Co. Kerry"}, {"Language": "English"}]}, "4713253/4711727/4743615": {"title": "The White Boys", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0456, Page 223", "Page 223"], "url": "https://www.duchas.ie/en/cbes/4713253/4711727/4743615", "text": "\nIn the boundry between Cork and Kerry there is a cave on the side of the mountain. It cannot be reached except by a ladder. In this cave there lived three White Boys. This place where the cave was is called Leabaid Eoghain because one of their names was Eoghain. The White Boys were an army of men in themselves who lived in Ireland. Those three men used often make \"raids\" on the English \"Settlers\" who were in the Irish peoples land. They used take horses and cows and crops from them. They boasted that they never left an Englishman up the Glen. When the \"Red Coats\" as the English were called were passing along the road some spy told them where the White Boys were living. When the White Boys saw them coming they got their guns ready.They left the guns near the door so as to have them ready when the \"Red Coats\" would come up. It took the \"Red Coats\" a long time to come up because they had to get ladders. When the White Boys came for their guns they found they were useless because the house-keeper poured the hot water out of the potatoes into them. When the \"Red Coats\" came\n(continues on next page)\n", "school_info": "School: Clochar na Toirbhirte, Cill Áirne", "metadata": [{"Location:": "Killarney, Co. Kerry", "Teacher:": "\nAn tSr. M. Déaglán, An tSr. Marie Thérèse\n"}, {"Informant": "Tadhg Ó Cuanacháin", "Gender": "male", "Address": "Carrigeencullia, Co. Kerry"}, {"Language": "English"}]}, "4742075/4733070/4760696": {"title": "Cistí Óir i bhFolach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0461, Page 157", "Page 157"], "url": "https://www.duchas.ie/en/cbes/4742075/4733070/4760696", "text": "\nThere were men there long ago. They were called Whiteboys and they were supposed to have bags of gold. The soldiers were hunting them. They were very near one of them in the \"Hotel fields\". He hid the gold before he was shot and it is buried there.There is another lot of gold buried in Cummeen at the White Stones.There is another lot of gold buried in Crom Dan. The Whiteboys offered the gold to a woman there and she was afraid to take it for fear the soldiers would kill her. Then he burned it there.\n", "school_info": "School: Gort na Binne", "metadata": [{"Location:": "Gortnabinny, Co. Kerry", "Teacher:": "\nMáirín Ní Cheallacháin\n"}, {"Language": "English"}]}, "4742075/4733071/4760699": {"title": "Scéal Grinn", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0461, Page 158", "Page 158"], "url": "https://www.duchas.ie/en/cbes/4742075/4733071/4760699", "text": "\nFaries used be seen around the grave yard in Earneen. They used to kill some people they knew would be afraid of them. A certain man would not go out at all for fear of the faries. One day there was no one in the house but himself. A pig went in a pit of potatoes outside. The man had to go out to drive  him and the faries killed him near the pit.There is a place in Lousist called Inre Na mbuacailli and that place got its name when the Whiteboys were around. A big crowd \"Whiteboys came into the woman that was living on the farm. They asked food and she said that she had no food but a chest of seed oats she had left by. When they come to demand the food she ground the oats and she made oaten bread for them. Then she put the chaff back into the chest. It was afterwards sat and it grew.\n", "school_info": "School: Gort na Binne", "metadata": [{"Location:": "Gortnabinny, Co. Kerry", "Teacher:": "\nMáirín Ní Cheallacháin\n"}, {"Language": "English"}]}, "4713237/4710178/4778555": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0452, Page 020", "Page 020"], "url": "https://www.duchas.ie/en/cbes/4713237/4710178/4778555", "text": "\nThree brothers named Healy lived in Meenigishagh near this school. They were arrested. They were charged with the murder of the Driver of the Mail Car from Tralee to Cork. His name was something like Bréithre. He was killed on the old road to Cork near Shinnagh, and that part of the road is called Boithrín na Breítre. The three Healys were hanged and they were innocent.\n", "school_info": "School: Na Mínteóga", "metadata": [{"Location:": "Meentoges, Co. Kerry", "Teacher:": "\nEoghan Ó Caoimh\n"}, {"Collector": "Nellie Moynihan", "Gender": "female", "Address": "Stagmount, Co. Kerry"}, {"Informant": "Ellen Moynihan", "Relation": "grandparent", "Gender": "female", "Age": "87", "Address": "Stagmount, Co. Kerry"}, {"Language": "English"}]}, "4758495/4748704/4778820": {"title": "The Whiteboys", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0844, Page 124", "Page 124"], "url": "https://www.duchas.ie/en/cbes/4758495/4748704/4778820", "text": "\nThe Walsh Mountains were not without its Whiteboys, and there are recollections of men having been tied to cart-tails and flogged for miles along the public roads on suspicion of belonging to the Whiteboy conspiracy. This I suppose, was for the edification of the countryside. There were brave men on the mountains in those days as well as later in Carrickshock.A Whiteboy was sentenced to be flogged from Knocktopper Cross to the nearest Roman Catholic chapel. On reaching Knocktopher Friary, which is about ten perches from the Cross, the cavalcade was stopped by a crowd who insisted the Friary was a chapel, and the minions of the law had to forego their pastime.\n(continues on next page)\n", "school_info": "School: Owning Convent", "metadata": [{"Location:": "Owning, Co. Kilkenny", "Teacher:": "\nSr. M. Bernadette\n"}, {"Collector": "Maggie Nolan", "Gender": "female", "Address": "Garryduff, Co. Kilkenny"}, {"Informant": "Mr E.V. Drea", "Gender": "male", "Age": "70", "Address": "Ballyhale, Co. Kilkenny"}, {"Language": "English"}]}, "4742111/4736953/4817138": {"title": "Comharthaí Aimsire", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0471, Page 415", "Page 415"], "url": "https://www.duchas.ie/en/cbes/4742111/4736953/4817138", "text": "", "school_info": "School: Gleann Cotáin", "metadata": [{"Location:": "Glancuttaun Upper, Co. Kerry", "Teacher:": "\nLiam de Longphort\n"}, {"Informant": "Diarmuid Ó Braoin", "Gender": "male", "Age": "66", "Address": "Gortagreenane, Co. Kerry"}, {"Language": "Irish"}]}, "4758576/4756057/4923438": {"title": "Connection with Wexford", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0865, Page 349", "Page 349"], "url": "https://www.duchas.ie/en/cbes/4758576/4756057/4923438", "text": "\n(continued from previous page)\naway as usual, and his wife and mother-in-law were sleeping together. At the dead of night, the blind woman heard the door opening, and the sound of many voices. She recognised her husband’s voice, and the voices of others who were killed with him at Vinegar Hill. They talked for a time, and suddenly there was a commotion as if they had been alarmed, and they all took their departure through the back window. The younger woman also heard the noise, and was very frightened. When her husband arrived shortly afterwards, she was afraid to open the door for him, and the blind mother had to grope her way and let her son in. she said that there was no need to be alarmed, as they all came and went in good humour.\n\n\n\nDuring the time of the Whiteboys, three brothers named Somers from the Lotts, were arrested for alleged complicity in the burning of a house belonging to a man named Lockett, who was grandfather to Mrs. Cavanagh, Coone. The two houses were close to each other, and the night of the burning the brothers were a short time absent from their home. This they admitted when questioned, and suspicion immediately fell on them. They we arrested and brought to Kilkenny, when they were tried. A girl, who was at Somers’ house on the night in question, was inadvertently the cause of their deaths.\n(continues on next page)\n", "school_info": "School: Coone, Leighlinbridge", "metadata": [{"Location:": "Coan, Co. Kilkenny", "Teacher:": "\nÉamonn de Paor\n"}, {"Collector": "Eamonn de Paor", "Gender": "male", "Occupation": "teacher"}, {"Informant": "Paul Kinsella", "Gender": "male", "Address": "Coan, Co. Kilkenny"}, {"Language": "English"}]}, "4742094/4735306/4927683": {"title": "Na Buachaillí Bána", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0467, Page 065", "Page 065"], "url": "https://www.duchas.ie/en/cbes/4742094/4735306/4927683", "text": "\nNa Buachaillí BánaCuireadh fios chuig an tsagairt i gCathair Dhómhnaill go rabhadar chun ghlaodhach air , agus gach haon nídhe beith ullamh dóibh. Do scríghid an sagart litir i nGaedhluinn agus thug do’n teachtaire í le tabhairt chun captain na “buachaill bána”,Thug sé dhó é is do léig a Captaen a ‘ litir agus sé rud a bhí innti ná.“Ní líon díbh na cnuic Ná na sléibhte féin a mbunNá coille dubha an fhéir-ghlaisNá cár ghaibh ar tháinig rómhaibh riamh D’airm agus d’Fhianna ÉirinnTachaidh anoir andheas Go beannuighthe nár measgBainrioghain na dream naomhtha Tacaidh sé go humhal ar cealga a nglúin Ag achuingidhe ar a bPrionnsa Naomhtha Tachaidh anoir adtuaidh na peannadacha fuarSgata de gceannaibh éachtaSgiofaidh leo síos go hIfrinn iGach anam le’n a línn a daorfar”“Seadh a buachaillí “ ar seisean “Brisighidh bhúr ngunnaí ar an ngollán seo feuch a’ dtógfhaidh Dia anois féin sinn “\n", "school_info": "School: An Gleann Mór", "metadata": [{"Location:": "Glenmore, Co. Kerry", "Teacher:": "\nMáire T. Ní Chonaill\n"}, {"Informant": "Muiris Ó Riordáin", "Gender": "male", "Age": "70", "Address": "Baslickane, Co. Kerry"}, {"Language": "Irish"}]}, "4742089/4734743/4927983": {"title": "Na Buachaillí Bána", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0466, Page 006", "Page 006"], "url": "https://www.duchas.ie/en/cbes/4742089/4734743/4927983", "text": "", "school_info": "School: Doirín Darach", "metadata": [{"Location:": "Derreendarragh, Co. Kerry", "Teacher:": "\nMáire, Bean Uí Chathbhuaidh\n"}, {"Collector": "Siobhán Ní Cathasaigh", "Gender": "female", "Address": "Gortacloghane, Co. Kerry"}, {"Informant": "Seóirse Páiméar", "Gender": "male", "Address": "Tooreennafersha, Co. Kerry"}, {"Language": "Irish"}]}, "4921935/4911327/4932604": {"title": "A Kind Act in Glin", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0480, Page 344", "Page 344"], "url": "https://www.duchas.ie/en/cbes/4921935/4911327/4932604", "text": "\nIn the time of the \"White Boys\", a poor widow's son in Kinnaird, Glin, was arrested. The Knight of Glin was then very powerful. He had land from Glin to Killbraderan, and from Glin to Ballylongford.The Knight of Glin, happened to be in London when the case was tried in Tralee.The Knight returned just as the sentence of death was being passed on the boy.He went into Tralee courthouse, stuck his sword in the wooden pillar and demanded that the case should be called again.The judge did so and the boy was brought home triumphantly in the Knights own carriage and restored to his widowed mother.This act, as well as others, won the affection of the \"Glinsters\" for the Knights of Glin.\n", "school_info": "School: Glin (C.)", "metadata": [{"Location:": "Glin, Co. Limerick", "Teacher:": "\nBean Mhic Cárthaigh\n"}, {"Language": "English"}]}, "4742114/4737187/4936635": {"title": "Na Buachaillí Bána", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0472, Page 288", "Page 288"], "url": "https://www.duchas.ie/en/cbes/4742114/4737187/4936635", "text": "\nDo bhí dream d’fhearaibh ann fadó go dtugtar na Buachaillí Bána ortha. Bhídís amuigh gach oidhche ag siubhal dóibh féin mór timcheall na tíre. Do bhí an Tighearna Talmhan ana dhian san am san ar na daoine bochta ag bailiú cíosa agus á ndíbirt ó áit go háit. Do bhí na Buachaillí Bána ar a ndicheall a d’iarraidh an Tighearna Talmhan do chur fé chois agus é a dhíbirt as an dtír ar fad. Do dheinidís an stoc do thógaint as talamh an Tighearna Talmhan agus an stoc do mharú annsan agus an feól do roinnt imeasg daoine na háite. Do bhí dlighe na Sasanaig ana dhian san am san. Bhí sé ana dhian ar chlanna Ghaedheal. Do bhí dream píléirí agus saighdiuirí ag tabhairt aire do gach Tighearna Talmhan ar eagla go ndéanfaí é do mharbú agus ba dheacair dos na Buachaillí Bána dul chun cinn ró mhór mar bhí camtha an Sasanach ró láidir ‘na gcoinnibh ach do tháinig athrú sa tsaoghal mar níor stad fir crodha na hÉireann ó bheith ag troid riamh ó shoin igcoinnibh na Sasanach.\n", "school_info": "School: Curraichín (C.)", "metadata": [{"Location:": "Curraheen, Co. Kerry", "Teacher:": "\nEibhlín Ní Chonchobhair\n"}, {"Collector": "Máire Ní Shéagdha", "Gender": "female", "Address": "Reennanallagane, Co. Kerry"}, {"Informant": "Seán Ó Séaghdha", "Relation": "parent", "Gender": "male", "Age": "58", "Address": "Reennanallagane, Co. Kerry"}, {"Language": "Irish"}]}, "4922010/4918042/4942044": {"title": "The Man who Sentenced the Croppy Boys at Rathkeale", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0501, Page 042", "Page 042"], "url": "https://www.duchas.ie/en/cbes/4922010/4918042/4942044", "text": "\nMajor Going was in charge of the military at Rathkeale. He was the officer who sentenced the Croppy Boys to death. He stood on the bridge and witnessed the execution. The three victims were hanged near where the old power house now stands. Impatient to get away he ordered the bodies to be cut down quickly. One of the unfortunate lads was not dead and as his body was dropped into the grave the dying lad coughed. \"Salt him well\" ordered the Major and the soldiers emptied a bag of lime over the three bodies.A few nights later the Major's house in Abbeyview was attacked by Whiteboys. They had a barrel of lime hidden and meant to give him the same death as he gave the Croppy boys. The Major escaped by the back door but the Sunday following he was shot near the Five Cross Roads. A reward was offered for information. A spy Donovan informed on a young man who had no part in the shooting. At the trial this young man was found guilty and sentenced to death. Some days before the sentence could be carried out a man named Frawley, nicknamed \"Mickey cut the Soil\" was troubled in mind as he knew the Whiteboy that killed Going and as he could not see an innocent man hanged, he publicly informed\n(continues on next page)\n", "school_info": "School: Ráth gCaola (B.)", "metadata": [{"Location:": "Rathkeale, Co. Limerick", "Teacher:": "\nSeán Ó Coindealbháin\n"}, {"Collector": "Brian Connellan", "Gender": "male"}, {"Informant": "Martin Moylan", "Gender": "male"}, {"Language": "English"}]}, "4922010/4918044/4942050": {"title": "The Shooting of Major Hare at Mount Henry Rathkeale", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0501, Page 044", "Page 044"], "url": "https://www.duchas.ie/en/cbes/4922010/4918044/4942050", "text": "", "school_info": "School: Ráth gCaola (B.)", "metadata": [{"Location:": "Rathkeale, Co. Limerick", "Teacher:": "\nSeán Ó Coindealbháin\n"}, {"Collector": "Brian Connellan", "Gender": "male"}, {"Informant": "Martin Moylan", "Gender": "male"}, {"Language": "English"}]}, "4921983/4915370/4943439": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0494, Page 071", "Page 071"], "url": "https://www.duchas.ie/en/cbes/4921983/4915370/4943439", "text": "\n(continued from previous page)\nyou will bring me some token from her\" said the mother. Later on Joan brought a glove which the dead girl slipped from her hand and gave to Joan saying \"My mother will know those are the gloves myself and Mary Kearney bought going to my brother John's wedding\"\n\n\n\n\"One night during the time of the Whiteboys there was a raid made on my grand-father's uncle's house. When they heard the noise coming they knew they were the whiteboys. My grandfather's aunt was in the house and she told them to give her the money and she would hide it. So she put it into her poll of hair and folded it up. They forced in the door and searched the house, beds and all but never found the money. There was meat hanging from a stick over the fire and they took it away with them.\"\n", "school_info": "School: Cnoc Uí Choileáin, Mainistir na Féile", "metadata": [{"Location:": "Mountcollins, Co. Limerick", "Teacher:": "\nPádraig Ó Coileáin\n"}, {"Informant": "John P. Woulfe", "Gender": "male", "Age": "45", "Address": "Crataloe West, Co. Limerick"}, {"Language": "English"}]}, "4921988/4915700/4945370": {"title": "Folklore", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0495, Page 037", "Page 037"], "url": "https://www.duchas.ie/en/cbes/4921988/4915700/4945370", "text": "\nIn the land where my Grandmother lived before she got married was a school just at the corner of a field. The man who owned it was Mr. Margann. The shelfs were made of slates. They used to teach Sums and all Irish. The children had to bring six pence every day to the teacher to teach them. It is said that the girls used to hide there from the white boys. It is now called Margann's cabin.\n", "school_info": "School: Árd na Glaise (M.), Mainistir na Féile", "metadata": [{"Location:": "Ballaghbehy North, Co. Limerick", "Teacher:": "\nSeosamh Ó Ceallaigh\n"}, {"Collector": "Marie Galvin", "Gender": "female", "Address": "Ballaghbehy, Co. Limerick"}, {"Informant": "Mrs Mary Galvin", "Relation": "grandparent", "Gender": "female", "Age": "76"}, {"Language": "English"}]}, "4922003/4917317/4945560": {"title": "Story - The Whiteboys", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0499, Page 166", "Page 166"], "url": "https://www.duchas.ie/en/cbes/4922003/4917317/4945560", "text": "\nThe whiteboys lived about seventy years ago. The leader of the Whiteboys was called Richard Ruari (?).He was also called the Harper Culnane (?). He lived in the bog Cappenhane, Bruree. The Whiteboys were people who went around scourging those who were doing harm. There were twenty two White boys in this parish. One day when they were around they stuck eight calves belonging to a gentleman, because he was very cruel to the working people. After that they went over through Knockferna on the Lesifine hill and they were eating loaf bread and  drinking new milk when on came twenty two police and two sergeants. Their leader was sergeant Brown from Ballingarry. When they came near Richard Ruari (?) ordered his men to take their guns which were called blunderbuses. He asked the police was it on their track they were coming. Then the police were afraid, and said no. Then the police went to the back of  Comba's house and waited there until they would come. At evening about seven o'clock the Whiteboys came home, some of them went towards Knockferna and only seven of them went towards Comba's house. When they were coming\n(continues on next page)\n", "school_info": "School: Granagh (B.), Brúgh Ríogh", "metadata": [{"Location:": "Granagh, Co. Limerick", "Teacher:": "\nSs. Ó Spiaráin\n"}, {"Collector": "John O' Brien", "Gender": "male"}, {"Informant": "John Power", "Gender": "male", "Age": "67", "Address": "Ballingarry, Co. Limerick"}, {"Language": "English"}]}, "4921996/4916608/4948185": {"title": "Irish Chief", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0497, Page 322", "Page 322"], "url": "https://www.duchas.ie/en/cbes/4921996/4916608/4948185", "text": "\n(continued from previous page)\nwere given to one of Cromwell's officers Conyers and has been in their possession since\n\n\n\nThe Whiteboys used to go around the district disguised with white shirts and sometimes blackened faces. When travelling through strange districts they used to be very careful about calling for food. Calling at a house between here and Ballingarry they were told to call next evening. When one of them put his hand for the food the hand was held and the whiteboy shot through the window. He was brought to Castletown Barrack but could not or would not be identified.\n\n\n\nAfter the attack on Kilmallock Barrack one of the Fenians who took part in it took refuge in the chapel here at Ballygran.About the same time a party of soldiers were\n(continues on next page)\n", "school_info": "School: Béal Átha Grean", "metadata": [{"Location:": "Ballyagran, Co. Limerick", "Teacher:": "\nDónall Ó Cuill\n"}, {"Language": "English"}]}, "4922028/4919980/4948674": {"title": "Marriage Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0505, Page 164", "Page 164"], "url": "https://www.duchas.ie/en/cbes/4922028/4919980/4948674", "text": "\n(continued from previous page)\nunsuccessful.Wednesday is the luckiest day of the week and May the unluckiest month of the year.Pauline McCarthy, Demesne, Adare.From Kate Houlihan, Adare. (93 yrs).\n\n\n\nWhiteboys.About fifty years ago there dwelt in Adare a gang of men named \"Whiteboys\".  They carried around with them rifles and revolvers.  They were hated by all the people who tried their best to wipe them out but in\n(continues on next page)\n", "school_info": "School: Adare Convent", "metadata": [{"Location:": "Adare, Co. Limerick", "Teacher:": "\nAn tSr. Mechtildes\n"}, {"Collector": "Pauline Mc Carthy", "Gender": "female", "Address": "Adare, Co. Limerick"}, {"Informant": "Kate Houlihan", "Gender": "female", "Age": "93", "Address": "Adare, Co. Limerick"}, {"Language": "English"}]}, "4922106/4852608/4949069": {"title": "Dromloughan House", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0526, Page 038", "Page 038"], "url": "https://www.duchas.ie/en/cbes/4922106/4852608/4949069", "text": "\nDrumloughan House the residence of Patk McNamara figured in an ugly incident in the days when \"Whiteboys\" raided the country for guns and often beat severely people who disagreed with their policy. They visited Drumloughan House one night about 90 years ago and were beating the present owners grandfather when the servant-man shouted in gailic. Ná marbhuig athair na bpáiste, a SheáinEnraged at being recognised, the man addressed, thrust a bayonet into the poor man - who injudiciously spoke with a good intention. The faithful servant died from his wound. It is said that the ghost of the man was seen in the orchard sometime after.\n", "school_info": "School: Crecora, Tobar Pádraig", "metadata": [{"Location:": "Crecora, Co. Limerick", "Teacher:": "\nMáire, Bean Uí Ainnín\n"}, {"Language": "English"}]}, "4922105/4852499/4949359": {"title": "A Whiteboy Story - Drumloughan", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0525, Page 130", "Page 130"], "url": "https://www.duchas.ie/en/cbes/4922105/4852499/4949359", "text": "", "school_info": "School: Crecora, Tobar Pádraig", "metadata": [{"Location:": "Crecora, Co. Limerick", "Teacher:": "\nMáire, Bean Uí Ainnín\n"}, {"Informant": "Seán Ó Cuirc", "Gender": "male", "Age": "55", "Occupation": "feirmeoir", "Address": "Ballygriffin, Co. Limerick"}, {"Language": "English"}]}, "4922001/4917043/4950521": {"title": "The Whiteboy's Revenge", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0498, Page 301", "Page 301"], "url": "https://www.duchas.ie/en/cbes/4922001/4917043/4950521", "text": "\nLong ago during the time of the Whiteboys there was a woman up near Kildorrery who was very cruel to her servants. One night when she was in bed a knock came to the door, and her husband opened it. There were a crowd of Whiteboys outside and they ordered admittance at once. He asked them what brought them and they said, 'You know as well as us that your wife is very cruel to her servants'. The man got frightened and tried to coax them away on promise of better treatment in future. However they forced their way in, and into the woman's bedroom bringing a bag with them. They opened the bag, took out a wild cat and stuffed him under the bed-clothes. That is a warning to you said the Whiteboys so know in future that you'll have to treat your servants properly. They turned their backs and off they went. The woman got such a tearing that she was under doctors treatment for a month.\n", "school_info": "School: Brúgh Ríogh (B.)", "metadata": [{"Location:": "Bruree, Co. Limerick", "Teacher:": "\nDonncha Ó Haragáin\n"}, {"Informant": "Mrs O' Rourke", "Gender": "female", "Age": "76", "Address": "Clogher East, Co. Limerick"}, {"Language": "English"}]}, "4922112/4853246/4950937": {"title": "The White Boys and Carrig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0528, Page 108", "Page 108"], "url": "https://www.duchas.ie/en/cbes/4922112/4853246/4950937", "text": "", "school_info": "School: Mungraid (B.) Luimneach", "metadata": [{"Location:": "Mungret, Co. Limerick", "Teacher:": "\nMrs B. Mulroy\n"}, {"Informant": "Mr P. Hartigan", "Gender": "male", "Age": "59", "Address": "Clarina, Co. Limerick"}, {"Language": "English"}]}, "4921682/4889620/4952153": {"title": "The Famine Years", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0321, Page 159", "Page 159"], "url": "https://www.duchas.ie/en/cbes/4921682/4889620/4952153", "text": "\n(continued from previous page)\nSome of these poor persons did some extraordinary things to get a meal of food. One man professed to be a rat charmer. He would ask for a saucer of uncooked meal hold his mouth over it, spend some time whispering inaudible words, and finally addressing the invisible rats in a loud voice would say “ Be off with ye now west to Mrs Harris in Belgooly” The Mrs Harris alluded to was the wife of Horace Harris owner of the flour mill in at Belgooly.This woman was the most active souper all over the district.By a remarkable coincidence the field in which she had her boiler of soup set up was selected as the site for the new Church of Belgooly.\n\n\n\nDuring the Whiteboy troubles in the first quarter of the last century the military who were probably the local yeomanry often called to the houses at a late hour of night, gave a loud knock read out the list of occupants which was fastened on the outer part of the door and listen critically to each person responding to his or her name. Men going to market in Cork could not leave their homes until daylight and had to make sure they were back before nightfall. Occasionally there might be a delay and this threw the household into a\n(continues on next page)\n", "school_info": "School: Cnoc na Manach, An Mhainistir Bhán, Cionn tSáile", "metadata": [{"Location:": "Knocknamanagh, Co. Cork", "Teacher:": "\nDáithí de Barra\n"}, {"Collector": "Daniel Corrigan", "Gender": "male", "Address": "Laharran, Co. Cork"}, {"Language": "English"}]}, "4922033/4920657/4953971": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0507, Page 120", "Page 120"], "url": "https://www.duchas.ie/en/cbes/4922033/4920657/4953971", "text": "\n(continued from previous page)\ntold him not to touch it again for the day.  The lad did what he was told, and was well fit to reap with the best of them.  'Twas the edge that did it.(Mce. Devanney)\n\n\n\nThere were men reaping in a field of corn, and they had among them a young fellow who was not able to keep up his stroke.  A man passing by saw the boy's difficulty, and says he to the boy, \"Will you let me edge it for you?\".  The boy handed him the scythe and when he had edged it, he gave it back to him with the warning that he wasn't to touch it for the day again.  Neither did the boy, and he was able to keep up with the men from that out.Gearoid O hAodha\n\n\n\nEvery man that lived in Tory Hill had three-quarters (of land).   Where the single tree is, at the back of our house, in Bourke's field, Conor Murphy had a cabin and his three quarters.  Murphy was a Whiteboy, and they say that he accounted for three or four men in his time.  Be that as it may, the peelers who were only after coming (they came in 1832) were always watching him.  One night he was out, and he had his gun with him, and when he came up the bohreen, instead of bringing the gun into the\n(continues on next page)\n", "school_info": "School: Cromadh (B.)", "metadata": [{"Location:": "Croom, Co. Limerick", "Teacher:": "\nDáithí Ó Ceanntabhail\n"}, {"Collector": "Gearoid O hAodha", "Gender": "male"}, {"Language": "English"}]}, "4922033/4920671/4954115": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0507, Page 134", "Page 134"], "url": "https://www.duchas.ie/en/cbes/4922033/4920671/4954115", "text": "\n(continued from previous page)\nmanage was to tie a dog's tail to the plant and make him pull it up.  It would have no virtue if it wasn't pulled that way.  All that's a long time ago.  There was a young fellow in the house (a son) and I suppose the people used be going on to him about the piseoga and what did he do one day when he got their (the old people's) backs turned, but lay to and plough up the garden of herbs.  You may say there was ropach when they came home.  I could show you where the  garden was though 'twasn't going in my time.There was a whiteboy who was raiding for a gun, shot by one of them (the MacNamaras) on their own floor, and there was never a word about it. (Patsy Kennedy, Feeroo, Manister, 87 years)\n\n\n\nThere was a cooper where Mainster chapel is now.  A cooper in Yellowtown, 'twas Parkaree that time, three coopers at Coolavincin, and three coopers in Carnane, but I never heard of one in Moinear a-hille.This in reply to a question, seeking for information relative to the origin or significance of that name (The meadow of the coopers (?).Patsy Kennedy, above.\n\n\n\nFee, faw, fum, I smell the blood of an Irishman's son.  Liver and light for my supper tonight, and his blood for my morning dram\". = A rann that used occur frequently in a giant story I used hear as a child, but which unfortunately I have entirely forgotten.D.O.C.\n", "school_info": "School: Cromadh (B.)", "metadata": [{"Location:": "Croom, Co. Limerick", "Teacher:": "\nDáithí Ó Ceanntabhail\n"}, {"Informant": "Patsy Kennedy", "Gender": "female", "Age": "87", "Address": "Fearoe, Co. Limerick"}, {"Language": "English"}]}, "4922033/4920671/4954117": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0507, Page 134", "Page 134"], "url": "https://www.duchas.ie/en/cbes/4922033/4920671/4954117", "text": "\n(continued from previous page)\nmanage was to tie a dog's tail to the plant and make him pull it up.  It would have no virtue if it wasn't pulled that way.  All that's a long time ago.  There was a young fellow in the house (a son) and I suppose the people used be going on to him about the piseoga and what did he do one day when he got their (the old people's) backs turned, but lay to and plough up the garden of herbs.  You may say there was ropach when they came home.  I could show you where the  garden was though 'twasn't going in my time.There was a whiteboy who was raiding for a gun, shot by one of them (the MacNamaras) on their own floor, and there was never a word about it. (Patsy Kennedy, Feeroo, Manister, 87 years)\n\n\n\nThere was a cooper where Mainster chapel is now.  A cooper in Yellowtown, 'twas Parkaree that time, three coopers at Coolavincin, and three coopers in Carnane, but I never heard of one in Moinear a-hille.This in reply to a question, seeking for information relative to the origin or significance of that name (The meadow of the coopers (?).Patsy Kennedy, above.\n\n\n\nFee, faw, fum, I smell the blood of an Irishman's son.  Liver and light for my supper tonight, and his blood for my morning dram\". = A rann that used occur frequently in a giant story I used hear as a child, but which unfortunately I have entirely forgotten.D.O.C.\n", "school_info": "School: Cromadh (B.)", "metadata": [{"Location:": "Croom, Co. Limerick", "Teacher:": "\nDáithí Ó Ceanntabhail\n"}, {"Language": "English"}]}, "4758525/4751682/5009421": {"title": "Landlords", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0852, Page 199", "Page 199"], "url": "https://www.duchas.ie/en/cbes/4758525/4751682/5009421", "text": "\n(continued from previous page)\nnamed Hamilton Law in 1846. Law worked estate and quarries until about 1860 when Lord Ormond bought it to connect his Carrick and Kilkenny estates. It was next tenanted by Mercier a manager in the Slatequarries. Kilmacoliver House and farm was next bought from Ormond by Ed. Coonan in 1892.\n\n\n\n\"The White Boys\"They were very strong in this district during the 18th century (1700 to 1800). They collected money at times if necessary by force from all classes in the area for the help of the society and its dependents.This district became fairly thickly populated by the evicted people of the Castletown estate after the Cromwellian plantation. Their descendants were the back bone of the society in this area. A great number of them seemed to have eked out a poor existence on \"Bawnfree Hill\". At all times hoping to get back their old homes. Many stories are told of their deeds for example one night they raided Lord Waterford's place in the Co. Waterford. They were refused admittance by L. Waterford and decided to break in the door and collect whatever they were looking for, when one of the raiders succeeded in breaking in the door another of the\n(continues on next page)\n", "school_info": "School: Kilmacoliver, Piltown", "metadata": [{"Location:": "Kilmacoliver, Co. Kilkenny", "Teacher:": "\nRistéard Ó Faoláin\n"}, {"Language": "English"}]}, "4758525/4751706/5009442": {"title": "Old Mills (Local)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0852, Page 221", "Page 221"], "url": "https://www.duchas.ie/en/cbes/4758525/4751706/5009442", "text": "\nBarry's mill now corn mill was flour millCrowley's mill \" \" \" \" tuek millCarrigan's mill \" \" \" \" Rape millEthenon's (OSheas now) now [?] was corn mill\n\n\n\nFlax was believed to have been grown extensively around quarries & FangheenLin g aut [?] - probably gets its name from flax poolsBawn-a-lin g-aut townland or [?] om Co. Tipp. gets its name probably from where flax was dried.\n\n\n\nCrows & Black birds were killed against Scough hill owing to the force of the South West wind.\n\n\n\nFyigans lived in Baunfree for generations the went to the houses to make the Clothes. Last of them died about 40 yr ago.Night of the CipaisJohn Moore says on that night a secret warning was served on local people where young girls were living to warn them that the White boys were approaching i.e. raiding for an\n", "school_info": "School: Kilmacoliver, Piltown", "metadata": [{"Location:": "Kilmacoliver, Co. Kilkenny", "Teacher:": "\nRistéard Ó Faoláin\n"}, {"Language": "English"}]}, "4758525/4751706/5009443": {"title": "Old Mills (Local)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0852, Page 221", "Page 221"], "url": "https://www.duchas.ie/en/cbes/4758525/4751706/5009443", "text": "\nBarry's mill now corn mill was flour millCrowley's mill \" \" \" \" tuek millCarrigan's mill \" \" \" \" Rape millEthenon's (OSheas now) now [?] was corn mill\n\n\n\nFlax was believed to have been grown extensively around quarries & FangheenLin g aut [?] - probably gets its name from flax poolsBawn-a-lin g-aut townland or [?] om Co. Tipp. gets its name probably from where flax was dried.\n\n\n\nCrows & Black birds were killed against Scough hill owing to the force of the South West wind.\n\n\n\nFyigans lived in Baunfree for generations the went to the houses to make the Clothes. Last of them died about 40 yr ago.Night of the CipaisJohn Moore says on that night a secret warning was served on local people where young girls were living to warn them that the White boys were approaching i.e. raiding for an\n", "school_info": "School: Kilmacoliver, Piltown", "metadata": [{"Location:": "Kilmacoliver, Co. Kilkenny", "Teacher:": "\nRistéard Ó Faoláin\n"}, {"Language": "English"}]}, "4758525/4751706/5009444": {"title": "Old Mills (Local)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0852, Page 221", "Page 221"], "url": "https://www.duchas.ie/en/cbes/4758525/4751706/5009444", "text": "\nBarry's mill now corn mill was flour millCrowley's mill \" \" \" \" tuek millCarrigan's mill \" \" \" \" Rape millEthenon's (OSheas now) now [?] was corn mill\n\n\n\nFlax was believed to have been grown extensively around quarries & FangheenLin g aut [?] - probably gets its name from flax poolsBawn-a-lin g-aut townland or [?] om Co. Tipp. gets its name probably from where flax was dried.\n\n\n\nCrows & Black birds were killed against Scough hill owing to the force of the South West wind.\n\n\n\nFyigans lived in Baunfree for generations the went to the houses to make the Clothes. Last of them died about 40 yr ago.Night of the CipaisJohn Moore says on that night a secret warning was served on local people where young girls were living to warn them that the White boys were approaching i.e. raiding for an\n", "school_info": "School: Kilmacoliver, Piltown", "metadata": [{"Location:": "Kilmacoliver, Co. Kilkenny", "Teacher:": "\nRistéard Ó Faoláin\n"}, {"Language": "English"}]}, "4758525/4751706/5009445": {"title": "Old Mills (Local)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0852, Page 221", "Page 221"], "url": "https://www.duchas.ie/en/cbes/4758525/4751706/5009445", "text": "\nBarry's mill now corn mill was flour millCrowley's mill \" \" \" \" tuek millCarrigan's mill \" \" \" \" Rape millEthenon's (OSheas now) now [?] was corn mill\n\n\n\nFlax was believed to have been grown extensively around quarries & FangheenLin g aut [?] - probably gets its name from flax poolsBawn-a-lin g-aut townland or [?] om Co. Tipp. gets its name probably from where flax was dried.\n\n\n\nCrows & Black birds were killed against Scough hill owing to the force of the South West wind.\n\n\n\nFyigans lived in Baunfree for generations the went to the houses to make the Clothes. Last of them died about 40 yr ago.Night of the CipaisJohn Moore says on that night a secret warning was served on local people where young girls were living to warn them that the White boys were approaching i.e. raiding for an\n", "school_info": "School: Kilmacoliver, Piltown", "metadata": [{"Location:": "Kilmacoliver, Co. Kilkenny", "Teacher:": "\nRistéard Ó Faoláin\n"}, {"Language": "English"}]}, "4922108/4852830/5009986": {"title": "Another Story About Carrig O'Gunnell", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0527, Page 082", "Page 082"], "url": "https://www.duchas.ie/en/cbes/4922108/4852830/5009986", "text": "\n(continued from previous page)\nsaid if she had brought a bag of the leaves when she'd come home, they would have turned into gold.Recorded form Mrs. Ml. sheehan,Breska, Patrickswell.27/02/'38\n\n\n\nStory Of Treasure In CarrigO'Gunnel.Long ago there was a place near Carrig rock, and treasure was supposed to be buried there.  When we have a fall of snow.  The snow never rest on the spot where it's supposed to be buried.One day, a man was crossing Carrig, and he met an old woman, and she showed him the place where the treasure is buried.  she told him to come to the place in the middle of the night, and to bring with him, a cock, a hazel bough, and a bottle of Holy water.  She told him to dig up the treasure, but to have it gone before the cock would crow. He came at midnight with another man, and brought with him what he was told to bring.  They had the treasure nearly got, when the cock they had with them crew, and they had to run, and leave the treasure behind them.  Recorded form Mr.s Ml. Sheehan, Breska, Patrickswell.28/02/'38\n\n\n\nLong ago there was a young girl living down in Tervoe. She got sick and died and the people said the fairies took her.\n(continues on next page)\n", "school_info": "School: Lurga, Patrick's Well", "metadata": [{"Location:": "Kilcolman, Co. Limerick", "Teacher:": "\nMáire, Bean Uí Bhroin\n"}, {"Informant": "Mrs Michael Sheehan", "Gender": "female", "Address": "Briska Beg, Co. Limerick"}, {"Language": "English"}]}, "4922108/4852831/5009991": {"title": "Girl Taken by Fairies", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0527, Page 083", "Page 083"], "url": "https://www.duchas.ie/en/cbes/4922108/4852831/5009991", "text": "\n(continued from previous page)\nThe boy who loved her could'nt be consoled. He was walking through a field one day and he met an old woman. The old woman told him to go to a gap in a certain field called \"the Turrett\" at midnight on that night and he would see his girl riding on a white horse with the fairies. She told him to catch a hold of the girl and not to let go of her for \"love or money.\" He went to the gap at midnight and he saw the fairies coming and his girl in their midst riding on a white horse. When they were passing through the gap he caught the girl. The fairies did their best to make him let her go but he held on to her and brought her home with him.\n\n\n\nThe Whiteboys And Carrig.There are three or four ash trees near Carrig rock, and three Whiteboys were supposed to be hanged on them.  Their names were Lynch, Maddigan and Lewis.  Lynch and Maddigan were from Pallas, and Lewis was from Ballycommons.  While they were being hanged, one of their comrades came there, dressed as a girl.  The yeomanry were gathered together around the three Whiteboys.  One of the yeomen saw the comrade dressed as a girl, and he knew him.  He called him and told him to leave the place.The comrade left Carrig, and escaped across the Shannon to Clare.  The ash tree on which the Whiteboys were hanged never grew right. Even to the present day,  the branches are knotted and tangled\n", "school_info": "School: Lurga, Patrick's Well", "metadata": [{"Location:": "Kilcolman, Co. Limerick", "Teacher:": "\nMáire, Bean Uí Bhroin\n"}, {"Language": "English"}]}, "4922105/4852500/5010072": {"title": "Another Whiteboy Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0525, Page 131", "Page 131"], "url": "https://www.duchas.ie/en/cbes/4922105/4852500/5010072", "text": "", "school_info": "School: Crecora, Tobar Pádraig", "metadata": [{"Location:": "Crecora, Co. Limerick", "Teacher:": "\nMáire, Bean Uí Ainnín\n"}, {"Informant": "Seán Ó Cuirc", "Gender": "male", "Age": "55", "Occupation": "feirmeoir", "Address": "Ballygriffin, Co. Limerick"}, {"Language": "English"}]}, "4922109/4852928/5010814": {"title": "A Story of the Whiteboys", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0527, Page 180", "Page 180"], "url": "https://www.duchas.ie/en/cbes/4922109/4852928/5010814", "text": "\nA Story Of The Whiteboys.For their activities in this district, two brothers named Shearman were arrested and thrown into jail.  At that time, the wife could go into the jail and sleep all night with her husband.  Shearman's wife got into the jail in this manner, and managed to smuggle some instrument in to her husband.  He himself, his brother, and about twenty other prisoners escaped by cutting the locks in the doors of the jail.  Afterwards one brother was captured and hanged on a tree in the place where Mr. Costelloe's garden is now.  The other brother was in the lime kiln on Mr. Riordan's lands, when the hanging was taking place and he saw the whole incident.  There being no railway then to prevent him seeing.  He was so shocked by the whole affair that he gave himself up to the soldiers.  He was then hanged on the same tree as his brother had been hanged on earlier.\n", "school_info": "School: Tobar Pádraig", "metadata": [{"Location:": "Patrickswell, Co. Limerick", "Teacher:": "\nAnraoi Ó Broin\n"}, {"Language": "English"}]}, "4922150/4856535/5012177": {"title": "Wake Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0538, Page 063", "Page 063"], "url": "https://www.duchas.ie/en/cbes/4922150/4856535/5012177", "text": "\n(a). When the coffin would be brought home from the town those in charge would get a gad of herrings and put them in the coffin.Sometime during the night potatoes were boiled and those herrings were roasted and given for supper.(b) Clay pipes and tobacco were also distributed during the night.(c) During the Whiteboy Act all who were expected at the wake were put on a paper and nailed behind the door. Should the police come, this list was examined; a roll would be called and anyone over this number would be imprisoned or asked to explain.\n\n\n\n(a) 'Soldier'. Ten or twelve young men would stand in a row and numbered. One would escape(highman)After he was caught he was flogged, and put first. This procedure was continued till all got flogged. (b)  'Bersy'  A number of men or boys sat around in a  ring with knees raised. A twisted rope of straw called a 'sugan' was hidden by one of the boys. In the middle of the ring was another boy in a partly\n(continues on next page)\n", "school_info": "School: Burgess, Aonach Úrmhumhan", "metadata": [{"Location:": "Burgesbeg, Co. Tipperary", "Teacher:": "\nMícheál Ó Cearnaigh\n"}, {"Language": "English"}]}, "4922208/4860791/5015813": {"title": "The '98 Memorial", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0553, Page 140", "Page 140"], "url": "https://www.duchas.ie/en/cbes/4922208/4860791/5015813", "text": "\n(continued from previous page)\nis a fine piece of sculptural work, standing 18 feet high with a pikeman on top, and on its sides carved busts of Wolf Tone, Emmet, and Lord Edward Fitzgerald.\n\n\n\nPapers in ThurlesOne was started by Maurice Lyne who lived in the house occupied at present by Mr Johnson. Another called \"Tipperary\" flourished for two years. it was started by Mr T. P. Gill who lived in Liscahill in a house rented from Mr John Carrigan. In this house also lived a Mr Baker from whom Whiteboys took pistols while he slept. Baker afterwards commited suicide by shooting. Mr Gill had his paper printed in the house which later became Mr Charles Culhane's store and is at present Gleeson's shop. A Mr Dewson Dwyer a solicitor who defended the Mc Cormacks charged with, convicted + hanged for the shooting of the landlord Ellis - lived also in Liscahill house - now occupied by Mr John Meager.\n", "school_info": "School: Rahelty, Dúrlas Éile", "metadata": [{"Location:": "Rahelty, Co. Tipperary", "Teacher:": "\nTadhg Mac Domhnaill\n"}, {"Language": "English"}]}, "4922303/4868600/5054173": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0581, Page 202", "Page 202"], "url": "https://www.duchas.ie/en/cbes/4922303/4868600/5054173", "text": "\nA man named Nicholas Hill was killed for trying to grab a farm. He was killed on the road leading from Coach Road Cross to Tipperary town. The spot where he was killed is about three hundred yards North of Nat Bourke's house. Any body is not sure who killed him, but it is said that he was killed by the White boys.\n", "school_info": "School: Eatharlach (Aherlow)", "metadata": [{"Location:": "Aherlow, Co. Tipperary", "Teacher:": "\nÉnrí Mac Eochaidh\n"}, {"Collector": "Thomas Kiely", "Gender": "male", "Address": "Gortavoher West, Co. Tipperary"}, {"Informant": "John Kiely", "Relation": "parent", "Gender": "male", "Age": "60", "Address": "Gortavoher West, Co. Tipperary"}, {"Language": "English"}]}, "5079720/4878916/5080309": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0629, Page 151", "Page 151"], "url": "https://www.duchas.ie/en/cbes/5079720/4878916/5080309", "text": "\nOnce upon a time a man was living in Knockerra who made potheen and the peelers heard about it, and they came to Knockena searching for the still but they could not find it for a long time. A shower of rain came then and there was a cabin near and they went in to get shelter and when they opened the door of the cabin one if the peelers saw the still and six barrels of potheen inside. They brought some of the potheen to the barracks but they could not bring it all and all they could not bring they threw into the river which separates Coolminga from Knocknaheean. The man who owned the still got some of his friends who belonged to an organisation called \"The White Boys\" went to Kilrush on horseback and brought spade trees with them. They landed at Kilrush before the peelers and when the peelers were coming the \"White Boys\" pointed the spade trees and shouted to them to surrender and the peelers gave them the till but as they were near Knockerra Lake they saw the peelers coming with reinforcements and they threw the still into the lake where it remains always.\n", "school_info": "School: Knockerra (B.) Killimer", "metadata": [{"Location:": "Knockerra, Co. Clare", "Teacher:": "\nMícheál Ó Cuinneagáin\n"}, {"Collector": "Joseph Bonfield", "Gender": "male"}, {"Language": "English"}]}, "5080332/4879074/5084231": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0629, Page 335", "Page 335"], "url": "https://www.duchas.ie/en/cbes/5080332/4879074/5084231", "text": "\nAt the time of the famine the white boys used to come out and tell the people to give the potatoes to anyone who would come for them. So the people came for the potatoes and Marty Cooney's uncle whose name were Martin Cooney, said that the potatoes were nearly all gone and that he would not give them any more for he wanted them himself. So the white boys came in the night and took him up off his bed in his shirt and they put a furze bush between his legs and made him walk for some distance as a punishment.\n", "school_info": "School: Knockerra (C.), Killimer", "metadata": [{"Location:": "Knockerra, Co. Clare", "Teacher:": "\nEibhlín Ní Cholgain\n"}, {"Language": "English"}]}, "4921613/4885095/5148758": {"title": "Cúl Cath (Drom Mór) - Scéal Stairiúil", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0294, Page 007", "Page 007"], "url": "https://www.duchas.ie/en/cbes/4921613/4885095/5148758", "text": "\nAr thaobh an chnuic ceudna, timcheall ceathramhadh mhíle siar ó Mháthair Uí Cheallaigh tá áit in a tugtar Cúl Cath mar ainm air. Troid mór a bhí san áit roinnt blianta ó shoin. Do chuaidh muintir Uí Donnabháin go baile Caisleán Béara, lá. Ag goid bó a chuadar ann, agus d'éirigh leo na ba a ghoideadh. Thiománadar na ba rómpa, agus do lean Domhnal Cam agus a lucht leanamhna iad.Do thángadar suas le muintir Uí Donnabháin in aice na h-áite seo, agus do bhí cath mór, fuilteach, eatorra. Deirtear gur bhuaidh muintir Dhomhnaill Cam ortha, agus gur thógadar na ba uatha.Ó'n lá san go dtí indiu, tugtar Cúl Cath mar ainm ar an áit.\n", "school_info": "School: Drom Mór (B.), Beantraí", "metadata": [{"Location:": "Dromore, Co. Cork", "Teacher:": "\nÉamonn Ó Conchobhair\n"}, {"Language": "Irish"}]}, "4921671/4889000/5151798": {"title": "The Whiteboys or Barley Reapers", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0319, Page 254", "Page 254"], "url": "https://www.duchas.ie/en/cbes/4921671/4889000/5151798", "text": "\nBony was a hero in the eyes of our forefathers. Up to thirty years ago one could hear people singing the \"Bonny Bunch of Roses, O!\"   After 1815 growing destitution evictions and seizures of cattle caused the spread of secret societies and agrarian disturbances of various kinds. Here in Kinsale these societies were called Barley ReapersHere is a fragment of a ballad about them.In Ballinacubby we first broke outIn sweet Comoge we made a routAnd on Pipers' Hill* we were found outHurrah for the Barley Reapers*Pipers' Hill now called Winters Hill\n", "school_info": "School: Presentation Monaster, Ceann tSáile", "metadata": [{"Location:": "Kinsale, Co. Cork", "Teacher:": "\nJ. K. O' Connor\n"}, {"Language": "English"}]}, "4921671/4889002/5151810": {"title": "The Flogging of Curly Kaylee Patten and Others", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0319, Page 256", "Page 256"], "url": "https://www.duchas.ie/en/cbes/4921671/4889002/5151810", "text": "\n(continued from previous page)\nrunning pace and received a cut of the lash at regular intervals   During this ordeal Kaylee suppressed all manifestations of suffering until at the Jail Gate, on receiving the last cut he fell against the cart and gave vent to a prolonged moan that chilled the hearts of the spectatorsCurly Kaylee was stout and strong He bore the lashes all along\n\n\n\nThe friends of a prisoner sentenced to be flogged contrived to have an interview with the hangman and they offered him a bribe on condition that they would inflict the slightest possible pain.    The executioner rubbed a black powder to the chougs[?]; this powder left black marks on the naked skin, the doctor in attendance was deceived by the discolouration but the punishment was comparatively mild. As previously arranged\n(continues on next page)\n", "school_info": "School: Presentation Monaster, Ceann tSáile", "metadata": [{"Location:": "Kinsale, Co. Cork", "Teacher:": "\nJ. K. O' Connor\n"}, {"Language": "English"}]}, "4921671/4889004/5151814": {"title": "Constables and Yeomen", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0319, Page 258", "Page 258"], "url": "https://www.duchas.ie/en/cbes/4921671/4889004/5151814", "text": "\nAt night during the periods of martial law the constables appointed by the Corporation would parade the streets, and the yeomen would scout the country. Should Jack Fare or any other constable happen to hear a sound in a house or notice the glimmer of a tallow candle through the chinks of a window of a shutter they would bang the official staff on the door and shout \"Lights out!\".   The yeomen travelled even beyond the liberties of the Corporation. It is told that J. I. Heard Sovereign, and his party of raiders spent two days searching all the country from the Dock to Kilbrittain, and returned \"dog tired\" without the satisfaction of meeting a single Whiteboy   One night they went to a house in Garryfeasoge[?] in which according to reliable information a trouble some Whiteboy was hiding. Heard posted a cordon around the house, and, accompanied by Richard Armstrong, went to the door, knocked, the door was opened by a woman, and Heard in his brusque voice thus addressed her\n(continues on next page)\n", "school_info": "School: Presentation Monaster, Ceann tSáile", "metadata": [{"Location:": "Kinsale, Co. Cork", "Teacher:": "\nJ. K. O' Connor\n"}, {"Language": "mixed"}]}, "4921671/4889006/5151830": {"title": "Constables and Yeomen", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0319, Page 260", "Page 260"], "url": "https://www.duchas.ie/en/cbes/4921671/4889006/5151830", "text": "\n(continued from previous page)\n\"A ghost\" echoed the Sovereign \"It is Mescil[?] the Whiteboy. I am glad that he escaped from such a pack of cowards\"\n\n\n\nAnother night while searching around Hollyhill a glimmer of light attracted the attention of this yeoman officer and his men. The door of a miserable cabin was open. Dashing in Heard beheld a spectacle which though typical of the times was a revelation to the Sovereign.   A family sat on the floor around a cipeán of potatoes: the only light for their meal being a tallow dip.   Heard was heard to mutter as he hurried from this spectacle of abject poverty that he had enough of these night hunts\n\n\n\nDuring one of his terms as Sovereign John Isaac Heard committed a deed which earned for him the leas ainm of \"Hangman of Kinsale\"   Cattle belonging to a widow in Camphill\n(continues on next page)\n", "school_info": "School: Presentation Monaster, Ceann tSáile", "metadata": [{"Location:": "Kinsale, Co. Cork", "Teacher:": "\nJ. K. O' Connor\n"}, {"Language": "English"}]}, "4921671/4889006/5151839": {"title": "Constables and Yeomen", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0319, Page 260", "Page 260"], "url": "https://www.duchas.ie/en/cbes/4921671/4889006/5151839", "text": "\n(continued from previous page)\n\"A ghost\" echoed the Sovereign \"It is Mescil[?] the Whiteboy. I am glad that he escaped from such a pack of cowards\"\n\n\n\nAnother night while searching around Hollyhill a glimmer of light attracted the attention of this yeoman officer and his men. The door of a miserable cabin was open. Dashing in Heard beheld a spectacle which though typical of the times was a revelation to the Sovereign.   A family sat on the floor around a cipeán of potatoes: the only light for their meal being a tallow dip.   Heard was heard to mutter as he hurried from this spectacle of abject poverty that he had enough of these night hunts\n\n\n\nDuring one of his terms as Sovereign John Isaac Heard committed a deed which earned for him the leas ainm of \"Hangman of Kinsale\"   Cattle belonging to a widow in Camphill\n(continues on next page)\n", "school_info": "School: Presentation Monaster, Ceann tSáile", "metadata": [{"Location:": "Kinsale, Co. Cork", "Teacher:": "\nJ. K. O' Connor\n"}, {"Language": "mixed"}]}, "4921671/4889008/5151849": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0319, Page 262", "Page 262"], "url": "https://www.duchas.ie/en/cbes/4921671/4889008/5151849", "text": "\n(continued from previous page)\nKinsale, stabled his horse in his employers premises in Cork Street in the place now occupied by Mr J.W. Prendergast and climbing to the loft was soon fast asleep. From this slumber he was awakened by the Sergeant of the Mace, brought before the Sovereign on the charged of forming one of the conspirators responsible for the seizure of the previous night, but for lack of sufficient evidence was released.\n\n\n\nRichard Armstrong, Sergeant of the Mace, lived in the Front Glen in what is now a roofless house.    On the following Sunday afternoon while leisurely leaning his door, with coat off, he saw the Sovereign hurrying in his direction\"Armstrong\", commenced Heard in his gruff voice \"take that fellow Browne into custody again\"\"I am afraid my poor fellow\" said the Sergeant that it will go hard against you this time\"\n(continues on next page)\n", "school_info": "School: Presentation Monaster, Ceann tSáile", "metadata": [{"Location:": "Kinsale, Co. Cork", "Teacher:": "\nJ. K. O' Connor\n"}, {"Language": "English"}]}, "4921698/4891036/5162262": {"title": "Capaill", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0326, Page 171", "Page 171"], "url": "https://www.duchas.ie/en/cbes/4921698/4891036/5162262", "text": "\n(continued from previous page)\nsa bhearnain. D'innis an gaol do gur ghuid sé capall ó na chómharsain agus dá dtabharfai an capall eile do'n chómharsain go mbeadh an sgeal i gceart aige féin. D'imthigh an sprid nuair a bhí an méid sin ráidhte aice. Thug an fear capall do'n chómharsain gur goideadh an capall uaidh agus ní deirtear gur cuireadh aon chúramai eile air ná go bhfeaca sé an sprid a thuille.\n\n\n\nTímcheall na bliana 1800 bhí na Buachaillí Bána in Éirinn agus bhíodar go neamh-thrócaireach agus gan truagh do dhaoine. Lá amháin bhí sean-duine ag gabháil a bóthar ó Shráid a Mhuilinn go Máma. Bhí a phaidirín na láimh aige agus is dóichíghe gur ag rádh a phaidreacha a bhí sé agus é ag cur an bothair de ar a shuaimhneas. Tháinig na Buachaillí Bána suas leis agus do lámhadar é agus do chaith duine aca anáirde ar a chapall féin é agus deireadh sé leis anois agus airís \"Abair do phaidir anois\".\n", "school_info": "School: Gurrane (B.)", "metadata": [{"Location:": "Clondrohid, Co. Cork", "Teacher:": "\nSeán Ó Loingsigh\n"}, {"Language": "Irish"}]}, "4921630/4886310/5167111": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0310, Page 137", "Page 137"], "url": "https://www.duchas.ie/en/cbes/4921630/4886310/5167111", "text": "", "school_info": "School: Béal Átha Fhinghín (B.)", "metadata": [{"Location:": "Ballineen, Co. Cork", "Teacher:": "\nBeircheart Seártan\n"}]}, "4921784/4906831/5178326": {"title": "Local Happenings", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0364, Page 047", "Page 047"], "url": "https://www.duchas.ie/en/cbes/4921784/4906831/5178326", "text": "\nMany years ago there was a battle fought on Brittas Hill between a number of Irish soldiers known as the Whiteboys and a regiment of English soldiers.One night some of the English soldiers dressed as Whiteboys hoping to meet their enemies.  Shortly afterwards another batallion met them.  Thinking, no doubt, that they were the Whiteboys they opened fire on them and killed their officer named George Bon Lowe.\n", "school_info": "School: Leath-fhearann, Malla", "metadata": [{"Location:": "Laharan, Co. Cork", "Teacher:": "\nR. Barrow\n"}, {"Informant": "Mr R. Barrow", "Gender": "male", "Address": "Glantane, Co. Cork"}, {"Language": "English"}]}, "4921798/4908170/5179482": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0368, Page 069", "Page 069"], "url": "https://www.duchas.ie/en/cbes/4921798/4908170/5179482", "text": "\nThe \"White Boys\" were a secret society. They were the sons of Irish farmers whose farms had been taken by the British Government and given to settlers. They wore their shirts outside their coats to distinguish them from any other persons in the dark, and for that reason they were known as \"White-Boys\".     They went out in the night-time because they were not strong enough to beat the English. They used to fire shots through the windows of the settlers houses thinking that in this way they would frighten the settlers out of the country. Sometimes they used to shoot them too.\n", "school_info": "School: Brughtheine (B.), Malla", "metadata": [{"Location:": "Churchtown, Co. Cork", "Teacher:": "\nTomás Ó Tighearnaigh\n"}, {"Collector": "Matthew Coghlan", "Gender": "male", "Address": "Annagh South, Co. Cork"}, {"Informant": "Mr John Coghlan", "Gender": "male", "Age": "60", "Address": "Annagh South, Co. Cork"}, {"Language": "Irish"}]}, "4921798/4908171/5179485": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0368, Page 070", "Page 070"], "url": "https://www.duchas.ie/en/cbes/4921798/4908171/5179485", "text": "\nIn the year 1822 the \"White Boys\" attacked the Police Barracks in Churchtown. The Police defended it bravely until the attackers set it on fire. They did this by throwing lighting sods of turf up on the thatched roof which immediately caught fire. The Police rushed out and there were three killed and seven wounded. Their horses in the stables at the back of the Barracks were burned to death.\n", "school_info": "School: Brughtheine (B.), Malla", "metadata": [{"Location:": "Churchtown, Co. Cork", "Teacher:": "\nTomás Ó Tighearnaigh\n"}, {"Collector": "Matthew Coghlan", "Gender": "male", "Address": "Annagh South, Co. Cork"}, {"Informant": "Mr John Coghlan", "Gender": "male", "Age": "60", "Address": "Annagh South, Co. Cork"}, {"Language": "English"}]}, "4921798/4908172/5179487": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0368, Page 071", "Page 071"], "url": "https://www.duchas.ie/en/cbes/4921798/4908172/5179487", "text": "\nWhen the Barrack in Churchtown 1822 was burned by the White Boys one policeman named Dunlap happened to be out on patrol and he ran into the White Boys in the Cow Field just outside the village.They captured him and as he knew most of them they saw it was not safe to let him off so they tried him and shot him.Ever since in this district the people say of one who is surely dead that \"He is as dead as Dunlap\"\n", "school_info": "School: Brughtheine (B.), Malla", "metadata": [{"Location:": "Churchtown, Co. Cork", "Teacher:": "\nTomás Ó Tighearnaigh\n"}, {"Collector": "Patrick Irwin", "Gender": "male", "Address": "Annagh South, Co. Cork"}, {"Informant": "Mr T. Tierney", "Gender": "male", "Age": "62", "Address": "Churchtown, Co. Cork"}, {"Language": "English"}]}, "4921798/4908173/5179491": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0368, Page 072", "Page 072"], "url": "https://www.duchas.ie/en/cbes/4921798/4908173/5179491", "text": "\nAt the burning of Churchtown in 1822 there were three \"White Boys\" killed in the fight. They were buried in a rick of turf in Carrigeen Bot.There were two \"White Boys\" caught in England some time after. They were betrayed by one of their comrades who turned informer. They were brought back and hanged off Egmount Rock. One of the fields there is still know as the Gallows Field.\n", "school_info": "School: Brughtheine (B.), Malla", "metadata": [{"Location:": "Churchtown, Co. Cork", "Teacher:": "\nTomás Ó Tighearnaigh\n"}, {"Collector": "Thomas Sampson", "Gender": "male", "Address": "Ballynamuck, Co. Cork"}, {"Informant": "Mr T. Tierney", "Gender": "male", "Age": "62", "Address": "Churchtown, Co. Cork"}, {"Language": "English"}]}, "4921894/4899289/5182439": {"title": "A Story of the Whiteboy Days", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0390, Page 251", "Page 251"], "url": "https://www.duchas.ie/en/cbes/4921894/4899289/5182439", "text": "\nIn the Southern side of the Square of Macroom there is a house occupied at the present moment by Dr Jeremiah Kelleher. During the White boy days the house was occupied by another medical man named White. His son succeeded him in the practice and died in the same house. A son of the late Dr. White is a Protestant Clergyman in the Dioceses of Cork.   This Dr White was connected with the local Yeomanry Corps. In the course of his duties as doctor he went one day towards the village of Gurranes or as it is better known Clondrohid. He was well known as a dreaded hunter of the Whiteboys. It appears that he met this particular man, and whether the man was connected with the Whiteboy organisation or not, it is not definitely established: but White to quell all doubts in the matter shot the man dead. He then placed the man on the horse in front of him, and taking the rosary beads from the dead man's pocket stuck it in his mouth and rode into town through the crowds who throng the square and market.   I had this story from the late Miss H. Horgan Square, Macroom, who died in 1937 at the age of 101. She was a remarkable woman in so much\n(continues on next page)\n", "school_info": "School: Baile na Manach", "metadata": [{"Location:": "Monkstown, Co. Cork", "Teacher:": "\nLabhrás Mac Suibhne\n"}, {"Collector": "Laurence Mc Sweeney", "Gender": "male", "Occupation": "teacher", "Address": "Monkstown, Co. Cork"}, {"Language": "English"}]}, "4921723/4893828/5183242": {"title": "Na Buachaillí Bána", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0349, Page 146", "Page 146"], "url": "https://www.duchas.ie/en/cbes/4921723/4893828/5183242", "text": "\nOff of the Waterloo Road there is a patch of waste land which is covered with ashes and grass. It is said that long ago when the men were not allowed to drill they used to come up to (come) this patch and drill there. The patch of land was then almost covered with furze bushes and trees and there was a bare grassy place in the grove of trees where the men used to drill.These men known as \"Na Buachaillí Bána\". This happened about the year 1820 and for some time after.\n", "school_info": "School: An Bhlárna (C.)", "metadata": [{"Location:": "Blarney, Co. Cork", "Teacher:": "\nWinifred Scantlebury\n"}, {"Collector": "Betty Arnold", "Gender": "female"}, {"Informant": "Miss Mary Sullivan", "Gender": "female", "Address": "Blarney, Co. Cork"}, {"Language": "English"}]}, "4921856/4896658/5189832": {"title": "A Battle at Shanbally on the Banks of the Bride", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0382, Page 100", "Page 100"], "url": "https://www.duchas.ie/en/cbes/4921856/4896658/5189832", "text": "\n(continued from previous page)\noccupants to death including the owner Redmond Barry.    The story of this fight was told by Jermiah Donovan an old man who lived in Mountcatherine about 25 years ago. Regarding the date of this happening there is no account.\n\n\n\nAbout two or three hundred years ago, there was a chapel at the cross of Killeagh, and Father Mires was priest there at that time. When baptising children he usually came for the water to Tubbereen well. It was the time of the \"White Boys\" Priests were hunted from place to place when celebrating mass. One morning Father Mires was pursued when on horse back and followed as far as Tubbereen where he was shot down, and the print of the horses shoes are still to be seen on a stone at Ballinabortagh where he jumped off a fence. There is a stone a hundred yds from the well, and it is about six ft high and two tons weight. Father Barry Rathcormac visited Tubbereen about thirty five years ago, he belonged to the archaeological society of Cork. When he examined the stone he said to tell the owner of the land not to ever interfere with the stone, as a King of the ancient Ireland was buried there and his body was cremated. There is an ogham inscription on this stone.\n", "school_info": "School: Cnoc na Biolaraighe", "metadata": [{"Location:": "Watergrasshill, Co. Cork", "Teacher:": "\nDll. Mac Carrthaigh\n"}, {"Collector": "Bessie Driscoll", "Gender": "female", "Address": "Ballybrack, Co. Cork"}, {"Informant": "Jack Flynn", "Gender": "male", "Age": "circa 60", "Address": "Ballynaglogh East, Co. Cork"}, {"Language": "English"}]}, "4921888/4899015/5190420": {"title": "Bearna Crochaire", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0389, Page 419", "Page 419"], "url": "https://www.duchas.ie/en/cbes/4921888/4899015/5190420", "text": "\nAbout four miles from the City of Cork on the road to Waterfall there is a field known as bearna crochaire.  There was a gap into the field long ago and inside in the middle of the field there was a very large tree. It is said that the White boys were hanged on this tree long ago. The tree was blown down some years ago and was given to the people around the place for firewood.There was a man living in the same field up to about forty years ago. This man was known as Michael bán. It is said that he was one of the White boys.\n", "school_info": "School: Baile Nóra, Corcaigh", "metadata": [{"Location:": "Ballynora, Co. Cork", "Teacher:": "\nÚna Ní Laoghaire, Ss Ó Longaigh\n"}, {"Language": "English"}]}, "4811650/4808992/5190956": {"title": "Na Buachaillí Bána - Cath Léim an Fhia, 1822", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0338, Page 011", "Page 011"], "url": "https://www.duchas.ie/en/cbes/4811650/4808992/5190956", "text": "\nNa Buachaillí Bána : Cath Céim an Fhiadha. 1822.   Sé Captaen Rock a chuir an ghluaiseacht ar bun i lár Chonntae Chorcaighe. Bhí sé na chómhnaidhe ar Charaig Fharaire i bParóiste Chill Mhuire. Thug sé i dteannta chéile roinnt fear agus dhein sé iad a dhearbhughadh bheith dílis do féin agus dá dhlighthibh. Agus as san a thosnuig an obair Thug sé órdughadh dhóibh go gcaithfidís na gunnaí a thógaint ó lucht leanamhna na Sasanach timcheall na Banndan agus i n-Iarthar Theas Chorcaighe.   Chuaidh dream fear ón mball so timcheall Bhéal Atha-'n - Ghaorthaidh siar go Paróiste Beanntraighe agus thógadar roinnt gunnaí ós na tíoránaigh. Fuair Iarla Bheanntraighe sgéal mar gheall air agus bhailig roinnt gíománach\n(continues on next page)\n", "school_info": "School: Céim an Fhiaidh, Béal Átha'n Ghaorthaidh", "metadata": [{"Location:": "Keimaneigh, Co. Cork", "Teacher:": "\nDonncha Ó Súilleabháin\n"}, {"Informant": "Pádraig Ó Murchadha", "Gender": "male", "Age": "62", "Occupation": "feirmeoir", "Address": "Gortnaloughra, Co. Cork"}, {"Language": "Irish"}]}, "4921760/4904224/5215685": {"title": "The Execution of James Cotter", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0357, Page 087", "Page 087"], "url": "https://www.duchas.ie/en/cbes/4921760/4904224/5215685", "text": "\nJames Cotter was a native of Rockchapel in North Cork. He joined the Whiteboy or Rockite movement about 1820 or '21. An attempt was made to stop the mail coach at Rathmore which attempt proved successful. Therefore no Government dispatches could be carried. A Captain Brereton offered to carry dispatches and proceeded from Killarney in the direction of Millstreet, but was met at Rathmore, and the dispatches taken. In the struggle the Captain lost his life. Cotter went on the \"run\" but was betrayed at Rockchapel by some neighbour and arrested. He was tried in Killarney and sentenced to death. He was brought to Shinnagh Cross for execution. When standing on the scaffold he was offered pardon by Colonel Cronin if he gave information of the society to which he belonged. He scornfully refused and died a hero's death. His name and the manner of his death were long the talk of the district.\n", "school_info": "School: Carrigaline, Ráth Mhór", "metadata": [{"Location:": "Carrigaline, Co. Cork", "Teacher:": "\nEibhlín, Bean Mhic Conchoille\n"}, {"Collector": "Tadhg Ó Conchubhair", "Gender": "male", "Address": "Carrigaline, Co. Cork"}, {"Informant": "Seán Ó Laoghaire", "Gender": "male", "Age": "40", "Address": "Lyredaowen, Co. Cork"}, {"Language": "English"}]}}