{"4427927/4358237/4454702": {"title": "Gráinne Uaile", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0116, Page 197", "Page 197"], "url": "https://www.duchas.ie/en/cbes/4427927/4358237/4454702", "text": "\nClare Island was the home and headquarters of Grainne Uaile - Grace O'Mally - sea queen of the West, whose daring exploits on sea figures so largely in papers and are still recorded by Islanders.Her body lies in the Ancient Island Abbey. She was daughter of Owen O'Malley chief of Western Isles in the 16th century.On his death Grainne ignoring the rule of tanistry delegated herself the ruler of that district which surrounds Cew Bay, all its Islands.Her determined character and daring exploits especially on sea won her the name of \"Grainnie of the Heroes\"\n", "school_info": "School: Cloonlyon G.", "metadata": [{"Location:": "Cloonlyon, Co. Mayo", "Teacher:": "\nAnnie Burke\n"}, {"Language": "English"}]}, "4427927/4358238/4454703": {"title": "Gráinne", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0116, Page 198", "Page 198"], "url": "https://www.duchas.ie/en/cbes/4427927/4358238/4454703", "text": "\nGrainneHer first husband was O'Flaherty ruler of Connemara who died in a short time. She then married Sir Richard Bourke Mc William Oughter.Tradition hands down a singular item of the contract & that was.The alliance was to last for a year when it could be dissolved by either saying to the other 'I dismiss you'Grainne took advantage of the years alliance to garrison all Mac Williams castles with her own followers.At the end of the year as Mac William was entering one of his castlesGrainnes ended the alliance by saying \"I dismiss you\".\n", "school_info": "School: Cloonlyon G.", "metadata": [{"Location:": "Cloonlyon, Co. Mayo", "Teacher:": "\nAnnie Burke\n"}, {"Language": "English"}]}, "4427927/4358239/4454704": {"title": "Gráinne's Visit to London", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0116, Page 199", "Page 199"], "url": "https://www.duchas.ie/en/cbes/4427927/4358239/4454704", "text": "\nGrainnie was once invited to London to visit Queen Eliazabeth.  She had little regard for the Queen, but was outspoken in her conversation.A present of a lap-dog was declined by Grannie in her vigorous language.  She said that the poor women of Mayo had greater cares & greater industeries to their credit. In an attempt to appease the Amazonian sea Queen Eliz. offered to create her Countess but Gráine scornfully replied that she too was a Queen the equal of Elizabeth.  This ended the visit to Elizabeth and London.  She returned to her own people in the West of Mayo.\n", "school_info": "School: Cloonlyon G.", "metadata": [{"Location:": "Cloonlyon, Co. Mayo", "Teacher:": "\nAnnie Burke\n"}, {"Language": "English"}]}, "4427785/4344099/4456740": {"title": "Cuntas Eile faoi Sheanscoil i gCaisil", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0085, Page 156", "Page 156"], "url": "https://www.duchas.ie/en/cbes/4427785/4344099/4456740", "text": "\n(continued from previous page)\no shion. Nuair a tháinig Nangal bhí bród ar na daoine agus sé an t-ainm a bhí air an 'Niamh' mar thug sé neart le n-ithe is le n-ól dóibh Na daoine nach tionntuigh leis na Gaill fuair siad bás ar thaobh an bhóthair.\n\n\n\nBhí caiseal in uachtar Acla agus ceain eile i ndúnadh i nDuadhChumha. Tá ceithre stór ingac Caislean,agus ceithre fuinneóga. Tá staighre cloch suas go dtí a bharr agus tá doras beag amháin thíos ag a bun.Sí Gráinne Ní Mháille a thóg é. Deirtear nár thóg sí ach oidhche amháin ag déanamh an dhá caislean. Sé an fáth ar rinneadh iad le gardaí a fhágail ionnta leis an oilean agus an fhairrge a gárdáil. Thiocfadh leis na gardaí in Uachtar Achla caislean Dunadh a fheiceál.\n(continues on next page)\n", "school_info": "School: Sáile", "metadata": [{"Location:": "Salia, Co. Mayo", "Teacher:": "\nR. Ó Cuinn\n"}, {"Language": "Irish"}]}, "4428017/4368495/4471869": {"title": "Gráinne Ní Mháille", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138, Page 166", "Page 166"], "url": "https://www.duchas.ie/en/cbes/4428017/4368495/4471869", "text": "\nGráinne Ní Mháille: mair sí in aimsir Eilise Shasana (Gráinne na gCearbhach). Ba inghean de Eoghan o Máille dá ngoirrí Dubh-Darach air. Ba gadaide maraí d'réir gach tuairisc. Bhéadh a ingean Gráinne leis i gcead mán[?] dá eactaraí contabhairteacha. Caitheadh Eoghan & Gráinne in-aois a naoi mbliadhain déag. Bhí driothár aici ní b'óige ná í féin, ach tainigh Gráinne i gceannas a muinntire gan cead a thabhairt do duine ar bith ceist a sharughadh[?] uirthí. Deartar gorabh Cabhtae[?] láidir aici air a bhfairrge ó Oileán Chara go Cuan dún na nGall. Ba é Caisléan Carraig a Ghabhala an dún-phort ba láidre dá rabh aici.Ba iondainail san am sin go leor long a dhéanain ar Ghaillimh ón Spáinn, luchtuighthe leipíonta, togha síoda, tobac [?] b'iomdha uair rinne Gráinne a cabhthae slab ortha. Ba cuma le Grainne céard as a tainic long ar bith, dhéanfadh sí creach ar cheann ar bith. Chuir sí isteach chomh mór sin ar loingeas Shasana gur thairg siad £500 len a gabhadh, ach bhí sé fánach acu....\n(continues on next page)\n", "school_info": "School: Scoil na mBráthar, Cathair na Mart", "metadata": [{"Location:": "Westport, Co. Mayo", "Teacher:": "\nAn Br. C. J. Ó Haoláin\n"}, {"Collector": "C. J. Ó hAoláin", "Gender": "male"}, {"Language": "Irish"}]}, "4428018/4368543/4474090": {"title": "Gráinne Ní Mháille - Banlaoch Mhaigh Eo - 1530 - 1603", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138, Page 214", "Page 214"], "url": "https://www.duchas.ie/en/cbes/4428018/4368543/4474090", "text": "\nB’inghean í Gráinne Ní Mháille- nó Gráinne na gCeirr (?) mar tugtar uirthe sgaithtí le Dubhdara Ó Máille. Tighearna Umhaill Uí Mháille Uachtaicr, ‘sé sin Ceanntar Mhuirisg. Is deacair a rádh go cinnte cé’n uair ar rugadh í acht ó’s rud é go n-abrann Bingham, Uachtar (?) Chonnacht, i 1593 ag tagairt dhi ‘’the nurse of all rebellions in Connacht for the last 40 years’’ ní amugha a bhéadh muid da n-abruigheadh muid gur tuair(?) na bliadhna 1530 a rugadh í. Is cosamhail gur ar (?) a tógadh í, acht níl aon chinnteacht faoi, agus gur a chothuigh sí an fhairrge an chéad lá, an fhairrge a dhugl(?) sí an oiread sin taithneamh di ar ball, agus a mhúnách í go raibh sí ar an maraidhe a b’fhearr ar an bhfairrge thiar len a linn.  \tBhí dearbhráthair aice, agus de réir Dlighe agus (?) bhí tús aige-sean ar an talamh a bhí ag a athair. Níos ghéill Gráinne do’n Dlighe seo, agus chaith sí go leath (?) é gur ghlac oighreachta a h-atharda í féin. Ní raibh sí acht 19 mbl. an t-am seo. Sa bhliadhain 1550 do phós sí Domhall Ó Flaithbheartaigh a’ Chogaidh, as Baile na hInse i gConnamara. Ba é seo Taoiseach na bhFlaithbhea(?) in lar-Chonnacht ‘san am, agus bhí ghlaodhach aig freisin ar uachtarántacht Connamara uilig bhí Tadhg na buile Ó’ Flaithbheartaigh ag dul sa mb(?) air faoi’n uachtarántacht agus deirtear gur im(?)\n(continues on next page)\n", "school_info": "School: Bó Ros (Bouris)", "metadata": [{"Location:": "Glenbaun, Co. Mayo", "Teacher:": "\nBreandán Ó Lionáin\n"}, {"Language": "Irish"}]}, "4497767/4344518/4505446": {"title": "Old Ruins", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0086, Page 283", "Page 283"], "url": "https://www.duchas.ie/en/cbes/4497767/4344518/4505446", "text": "\nThere is one ruin back on the side of Slievemore Hill. It is an \"Altar\" that the priests erected during the \"Penal Days\". They had stones standing under it and it must have taken twelve men to put it up, they were trying to capture the priests. It is about a half mile from the road and it is very large, it is about two feet from the ground and on a wet day a person could get shelter there.There is a big \"Tower\" on one side of Croghan and it is built square, it must have been very good mortar for if you try to knock it, it is like cement and cement was not known in those days. It is supposed to be built by the sea queen Graine Ní Mháille when she was fighting against the English. There is a big stone on one side of Slievemore Hill and it is called the \"Star\" and it is there a long time, there is a small cross cut in it.\n", "school_info": "School: Tóin an tSeanbhaile", "metadata": [{"Location:": "Tonatanvally, Co. Mayo", "Teacher:": "\nPádhraic Mac Pháidín\n"}, {"Collector": "Mr Francis O' Malley", "Gender": "male"}, {"Language": "English"}]}, "4602680/4594972/4616591": {"title": "Gráinne Ní Mháille", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0004, Page 512", "Page 512"], "url": "https://www.duchas.ie/en/cbes/4602680/4594972/4616591", "text": "\nDo mhair Gráinne Ní Mháille le linn na bainríoghna Éilís. I gConamara do mhair sí. Bhí a sinnsear ina righthe in Iar Chonnacht agus togha mairnéalach do bead iad. Ba inghean d'Éoghan Uí Mháille ar a dtugtar \"Dubbara\" í. Bhíodh an taoiseach seo i gcomhnuidhe ar an bhfarraige ag déanamh tráchtála agus foghla agus bhíodh Gráinne i gcomhnaidhe in aonfheacht leis. Ní  h-ionghadh mar sin go raibh grádh an domhain aici don bhfarraige agus is ag dul i méid a bhí an grádh sin ó lá go lá. Nuair a bhí sí naoi mbliadhain déag d'aois fuair a h-athair bás. Chuaidh sí i gceannas cabhlaidh a h-athar agus toghadh í mar thaoiseach ar na Mailligh. Bhailigh siad le chéile chuici agus thugadar gach conghnamh agus cabhair dí. Seachas na Máilligh bhí muintir eile i gConnachta \"na Flaithearthaigh\" agus ní mhór a rádh go raibh cumhacht aca freisin. Do phós Gráinne duine aca \"Domhnaill an Chogaidh\" a thugtar air. Ins an gcaoi sin do rinneadh comh-cheangal idir an dá theaghlach sin. Bhí an fear sin ina thaoiseach i mBéal Átha na h-Inse agus bhí caisleán aige i mBun Abhann. Bhí mac aige ar a dtugadh \"Murach na Maor\" air. Nuair a cailleadh a fear phós Gráinne Mac Liam Uachtar de Búrca as Conndae Mhuigh Eo agus ins an chaoi sin thui an caisleán ba laidre dá raibh aice ina sheilbh \"Carraig na Súile\". Bhí triúr mac aice agus inghean. Bhíodh sí i gcomhnuidhe ag troid in aghaidh na Sasanaigh (Thar na bliadhna sin). Bhíodh sí go minic i bponc agus cheap sí ar son maitheasa na muintire go mba fhearr dí síothcháin a dhéanamh le Éilís.\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire, An Clochán", "metadata": [{"Location:": "Clifden, Co. Galway", "Teacher:": "\nAn tSr. M. Peadar\n"}, {"Language": "Irish"}]}, "4602685/4595151/4616650": {"title": "Ruins of Gráinne Ní Mháille's Castle", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0005, Page 152", "Page 152"], "url": "https://www.duchas.ie/en/cbes/4602685/4595151/4616650", "text": "\nThere are ruins of an old castle down at the sea in the village of Bunowen. A river runs beside it. Tradition has it that a number of giants lived there. It was said one of the giants was as big as a stack of hay. There was a hole under the floor of the castle into which prisoners was put.Another giant lived over in the mountains. One day he was \"throwing\" a leap and he went one hundred feet of a standing jump. As he rose in the sky he caught sight of the towers of the old castle, so he called his warriors to him, and they marched to Bunown. They attacked the castle, killed the inhabitants and put their bodies in the hole. Then they took possession of the castle.\n", "school_info": "School: Aill Bhreac", "metadata": [{"Location:": "Aillebrack, Co. Galway", "Teacher:": "\nEilís Bean Mhic Chonghaile\n"}, {"Collector": "Mícheál Ó Fláitheartaigh", "Gender": "male", "Age": "14", "Address": "Bunowen, Co. Galway"}, {"Language": "English"}]}, "4602751/4601035/4642413": {"title": "Granuaile", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0197, Page 481", "Page 481"], "url": "https://www.duchas.ie/en/cbes/4602751/4601035/4642413", "text": "\nAs the sunlight in its glory. Ever shines on fair Clew bay And Croagh Patrick old and hoary Rises o'er the ruins grey.As the streamlets in the meadows In their pride come dancing down Nestled close among the mountains Stands pleasant Newport town.Just a mile from where the turrets Of the ancient towns uprise And the frowning peak of nephin Soars in grandeur to the skies Lie a massive heap of ruins In their loneliness sublime Though scattered and dismantled now By tyranny and time.Twas a proud and stately castle In the years of long agoWhen the dauntless Grace O'Malley Ruled a queen in fair Mayo And from Bernham's lofty summit To the waves of Galway Bay And from Castlebar to Ballintra\n(continues on next page)\n", "school_info": "School: Cornamon", "metadata": [{"Location:": "Cornaman, Co. Leitrim", "Teacher:": "\nJohn Kenny\n"}, {"Collector": "John Kenny", "Gender": "male"}, {"Informant": "Bartly Roomey", "Gender": "male", "Address": "Killea, Co. Leitrim"}, {"Language": "English"}]}}