{"4493721/4414114/4527794": {"title": "Local Cures - The Whitlow", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1100, Page 167", "Page 167"], "url": "https://www.duchas.ie/en/cbes/4493721/4414114/4527794", "text": "\nThe Whitlow is a very common disease in our country.  It comes from a hurt, or a hurt you got years ago.  You can only take it in three places, at either in your thumb, foreigner, or your large toe.There is a cure for this disease. It is a very old one, but it still remains in Ireland.  I had the whitlow once in my thumb, and at first I did not know what it was. I kept putting poultices on it every day until it burst. Then I knew that it was the whitlow. There was a woman in our district who had the cure for this disease. I went to her, and she asked me how I got it, and many other things about it. She made up some stuff with many kinds of things in it such as soap, honey and sugar. It is yellow in color, and it is for\n(continues on next page)\n", "school_info": "School: Baile an Droichid (Ballindrait)", "metadata": [{"Location:": "Tamnawood, Co. Donegal", "Teacher:": "\nMáire Bean Mhic Cleantóige\n"}, {"Collector": "Ruby Mc Gonigle", "Gender": "male"}, {"Language": "English"}]}, "4701736/4697394/4714635": {"title": "Cure of a Whitlow", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0181, Page 164", "Page 164"], "url": "https://www.duchas.ie/en/cbes/4701736/4697394/4714635", "text": "\nThere is an herb called the cuckoo sorrel. It is a long thin leaf that grows around rushes. When the juice is bruised out of it and rubbed on the Whitlow it will cure it.\n\n\n\nTo cure a wound or cut an herb is got which is called St Patrick's leaf. It grows in the fields but it is more common in a place where the grass is scarce or on trampled ground.It is put on the wound for two days. If it is not healed it is taken off and a new one put on.\n", "school_info": "School: Geevagh", "metadata": [{"Location:": "Geevagh, Co. Sligo", "Teacher:": "\nSeán Ó Gallchobhair\n"}, {"Collector": "Paddy Joe Conlon", "Gender": "male"}, {"Informant": "Mr Patrick Mac Donagh", "Gender": "male", "Address": "Cabragh, Co. Sligo"}, {"Language": "English"}]}, "4701685/4692578/4728210": {"title": "Local Cures - Warts", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0161, Page 173", "Page 173"], "url": "https://www.duchas.ie/en/cbes/4701685/4692578/4728210", "text": "\n(continued from previous page)\n(f) Get a weed called wart-weed. Break the weed + rub the white milk on the wart + it will disappear. (g) Get a bit of \"bootrystick\" if you have four warts put five notches on the stick + hide it in the ground. When the stick rots the warts will fade away.(h) Dip the wart in the forge bucket.\n\n\n\nWhittle: Half a lemon.\n\n\n\nWhooping Cough: (a) Ask the first man you meet with a white horse. And he will give you the  cure.(b). Milk left after a ferret has eaten, is another cure. (c). Inhale the gas in a gas-yard for a couple of minutes.\n\n\n\nWorms: (a). Boil nettles + eat them as vegetables. They are especially good for young children. (b). A cupfull of boiled buttermilk\n", "school_info": "School: Scoil na mBráthar Sligeach (Sráid na Céibhe)", "metadata": [{"Location:": "Quay Street, Co. Sligo", "Teacher:": "\nAn Br. Ó Cearbhaill\n"}, {"Collector": "Th. Harte"}, {"Language": "English"}]}, "4742150/4740513/4782049": {"title": "Local Cures - The Blast", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0771, Page 145", "Page 145"], "url": "https://www.duchas.ie/en/cbes/4742150/4740513/4782049", "text": "\nIf you are unfortunate enough to get this terrible thing called the blast, you can get a bunch of blast herbs and cut it up real fine. Then get about a half pound of lard or dripping and it is put in the pan and melted well.When it is melted you put in the herbs and mix up the grease and herbs together. Then after four or five minutes you can take it up and let it cool. To cure it you rub on this ointment in the name of the Father and of the Son  and of the Holy Ghost. If done in time it will get better without delay if not it will be longer (it) in getting better.\n\n\n\nThe cure for this is prepared the same as above only different herb. The herb is called \"burst herb\".\n", "school_info": "School: Naomh Muire, Donadea", "metadata": [{"Location:": "Donadea, Co. Kildare", "Teacher:": "\nS. Ó Fearghail\n"}, {"Collector": "Kathleen Smyth", "Gender": "female", "Address": "Donadea, Co. Kildare"}, {"Informant": "Richard Smyth", "Gender": "male", "Address": "Donadea, Co. Kildare"}, {"Language": "English"}]}, "4769972/4763383/4785059": {"title": "Boils", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0780, Page 242", "Page 242"], "url": "https://www.duchas.ie/en/cbes/4769972/4763383/4785059", "text": "\nBoils  Mix some salt sugar and a cabbage leaf and apply mixture to boil.\n\n\n\nWounds  An old cure for wounds is a weed called Bog Cotton which grows in the Bog. People had to use it long ago in the war to cure wounds.\n\n\n\nBlood Poison  There is a weed called \"Soldiers\" Plaintain. Squeeze the leaves of this plant in your hand and put the joice in the cut and it will be cured.\n\n\n\nSting of Nettles  Dock-leaf - saying Dockety, Dockety, take the sting of a nettle away.\n\n\n\nWhitlow  Rub it with a roasted potato.\n\n\n\nrub a roasted fig on it\n\n\n\napply some roasted salt in a black stocking\n\n\n\nsmoke off blessed turf is good.\n", "school_info": "School: Kilcullen (Convent)", "metadata": [{"Location:": "Kilcullen, Co. Kildare", "Teacher:": "\nNa Siúracha\n"}, {"Collector": "Patsy Dix", "Gender": "female"}, {"Language": "English"}]}, "4922108/4852794/4954786": {"title": "Dandelion", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0527, Page 046", "Page 046"], "url": "https://www.duchas.ie/en/cbes/4922108/4852794/4954786", "text": "\nDandelion.Dandelion is a cure for tuberculosis or consumption, when the disease is at early stages.  It can be eaten raw.  It is also said that dandelion when boiled is a cure for liver and kidney trouble.  Dandelion is also used as a general tonic.\n\n\n\nNettles.Nettles were used for nourishing the blood, and for blood pressure in olden times.  In order to prepare nettles for nourishing the blood, a person would have to boil the nettles in water for about a half an hour.  The nettles would then be strained and eaten like cabbage.\n\n\n\nWhitlow.A whitlow is an inflammable sore, which a person gets on the top of his finger.  In order to cure a whitlow, you would get a potato and scrape a hole in it.  The bits of the potato you would scrape out would be applied to the whitlow.  This is supposed to ease the pain of the whitlow.\n\n\n\nWarts.Warts are small hard growths which come on peoples' fingers. Long ago when warts appeared, the people used to catch eels\n(continues on next page)\n", "school_info": "School: Lurga, Patrick's Well", "metadata": [{"Location:": "Kilcolman, Co. Limerick", "Teacher:": "\nMáire, Bean Uí Bhroin\n"}, {"Language": "English"}]}, "4770004/4766053/4956532": {"title": "Cures in Olden Times - To Purify Blood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0828, Page 119", "Page 119"], "url": "https://www.duchas.ie/en/cbes/4770004/4766053/4956532", "text": "\n1; There is a little plant called Bog-lane which is to be found in bogs, when it is boiled and the liquid drunk it purifies the blood.2; Another remedy for the same trouble is a shrub called Broom which is used in the same way.3; A form of tea made from herb called Agamomy is very good also.4; Unsalted butter is an old cure for drying up running sores.5; The best cure for any irritation of scalp is to make strong tea from figs.\n\n\n\nSpeed weed was largely used for Gout in olden days.\n\n\n\nA bundle of mint tied around the wrist preserved the wearer from infection.\n\n\n\nA Whitlow dipped in water potatoes were boiled in was counted good.\n", "school_info": "School: St John of God Convent, Rathdowney", "metadata": [{"Location:": "Rathdowney, Co. Laois", "Teacher:": "\nThe Sisters\n"}, {"Language": "English"}]}, "4922210/4860889/5016012": {"title": "Local Cures - Whitlow", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0553, Page 235", "Page 235"], "url": "https://www.duchas.ie/en/cbes/4922210/4860889/5016012", "text": "\nWhitlow(1) Boiled onion and linseed meal poultice(2) Dip the whitlow frequently in the water in which potatoes have been boiled.\n\n\n\nToothache.(1) A strong sniff of whiskey taken through the nose gives relief.(2) Insert a plug of tobacco into the hole in the tooth.\n\n\n\nHiccoughs.(1) Take nine sips of water without drawing breath.(2) Sip water from the side of the container furthest from you.\n\n\n\nStomach Pains(1) A linseed meal poultice.(2) Apply heated pot-lids rolled in flannel to the stomach.\n", "school_info": "School: Moycarkey, Thurles", "metadata": [{"Location:": "Moycarky, Co. Tipperary", "Teacher:": "\nMichael Myers\n"}, {"Language": "English"}]}, "5008892/4964398/5081821": {"title": "Cures - Jaundice", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0682, Page 054", "Page 054"], "url": "https://www.duchas.ie/en/cbes/5008892/4964398/5081821", "text": "\nCuresJaundiceThe bark of the broom boiled down and the water taken off it and made into a drink. Kathleen McGuinness\n\n\n\nWartsThe juice of the dandelion rubbed on warts will remove them.Washing soda moistened and rubbed on the warts is another cure.\n\n\n\nRheumatismTo bathe the painful joint with the liquid from boiled Marsh Mallow is said to bring great relief.\n\n\n\nWhitlowTo plunge the finger into a pot of boiling potatoes will cure a whitlow.\n", "school_info": "School: Donore", "metadata": [{"Location:": "Donore, Co. Meath", "Teacher:": "\nMaighréad Nic Eóin\n"}, {"Language": "English"}]}, "5044783/5037721/5083776": {"title": "The Whitlow", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0962, Page 326", "Page 326"], "url": "https://www.duchas.ie/en/cbes/5044783/5037721/5083776", "text": "\nThe Whitlow a very painful disease attacks the fingers and generally convenient to a joint. The medical skill of a doctor or surgeon is unavailing here, and the Whitlow can only be cured by some one endowed with the CureBernard McManus of Moher has the Cure of this fell disease. Like all other cures he makes it on Mondays and Thursdays and his cure has never been known to fail. This cure is sacred to McManus'es family for generations, and very many victims after being treated by doctors and surgeons for months and months, without effect, were happy to hear in the end about Bernard McManus's Cure and came to him for a certain cure after a week or two.\n", "school_info": "School: Árd Móinín", "metadata": [{"Location:": "Ardmoneen, Co. Cavan", "Teacher:": "\nA. Ó Cianaigh\n"}, {"Collector": "H. Keaney", "Gender": "male", "Occupation": "teacher"}, {"Language": "English"}]}, "5070791/5064180/5095963": {"title": "Local Cures - The Whittle", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1001, Page 087", "Page 087"], "url": "https://www.duchas.ie/en/cbes/5070791/5064180/5095963", "text": "\nTerenence Carroll, Burnew, Virginia, Co. Cavan has the cure of the whittle. The person that has the whittle goes to him and he puts a plaster on it. If it is not better in a week he goes to him again and he repeats the process and the afflicted person is cured. He got this cure from his father and he would tell no one how he does it.\n\n\n\nThe cure for a toothace is to get a white stone of a grave and keep it to the afflicted persons cheek and say three Hail Mary's and the toothace will go.\n\n\n\nThe cure for the thrush is to get a posthumous child to blow her or his breath nine mornings into your mouth whey you are fasting.\n", "school_info": "School: Virginia (B)", "metadata": [{"Location:": "Virginia, Co. Cavan", "Teacher:": "\nE. Ó Raghallaigh\n"}, {"Collector": "Patrick Mc Cabe", "Gender": "male", "Address": "Lisnabantry, Co. Cavan"}, {"Informant": "Eamon Mc Cabe", "Gender": "male", "Address": "Lisnabantry, Co. Cavan"}, {"Language": "English"}]}, "5070835/5068827/5098837": {"title": "Cure for Whitlow", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1019, Page 059", "Page 059"], "url": "https://www.duchas.ie/en/cbes/5070835/5068827/5098837", "text": "\nA whitlow is a serious complaint and most people who take it lose the first joint of their fingure it starts like a prod from a thorn and gets swoolen up. The local cure is made from a herb called mouse-ear white of an egg and salt. Put the mouse-ear and the white of an egg on a plate and beat them together until they get quite  thick like a salve. Then out the salt into this and squeeze the liquid out of it.Then apply this to whitlow and after some time it is cured.\n\n\n\nA cure for a sty on the eyeGet 10 gooseberry thorns and throw the tenth one away over your shoulder. Then point the other nine thorns to the sty once each day for three days. At the end of the three days throw them all away and the sty\n(continues on next page)\n", "school_info": "School: Doocarrick", "metadata": [{"Location:": "Doocarrick, Co. Cavan", "Teacher:": "\nMiss Oldfield\n"}, {"Informant": "Mrs R. Mc Cullagh", "Gender": "female", "Address": "Dernaskeagh, Co. Cavan"}, {"Language": "English"}]}, "5008908/4965849/5106466": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0686, Page 111", "Page 111"], "url": "https://www.duchas.ie/en/cbes/5008908/4965849/5106466", "text": "\nMrs. Gaffney who lived at Proudstown say about 20 yds at this side of Brourne's House was getting water at the well at the off side of the road. While she was getting the water she was swept off to the Baushla river. She cried and roared and people who were going to Mrs. Whites wake ( Skryne Road) heart her. Ned Kelly, Nickey Derby and Dick Finegan were the three who heard the cries. They went to where she was and took her out of the Baushla River and went home with her. The place in which they foud her was just at the back of here Jack Derby's Garden is now. This happened about 50 years ago.    (14 January 1938)\n\n\n\nCure of the whittle. Dip your finger in boiling potato water three times saying - in the name of the father, son and Holy Ghost.\n", "school_info": "School: Walterstown", "metadata": [{"Location:": "Walterstown, Co. Meath", "Teacher:": "\nProinseas, Bean Uí Cheallaigh\n"}, {"Collector": "Mary B. Kelly", "Gender": "female", "Address": "Monktown, Co. Meath"}, {"Informant": "John Byrd", "Gender": "male", "Occupation": "farm-worker", "Address": "Monktown, Co. Meath"}, {"Language": "English"}]}, "5008960/4971079/5109530": {"title": "Thorn In The Hand", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0700, Page 122", "Page 122"], "url": "https://www.duchas.ie/en/cbes/5008960/4971079/5109530", "text": "\n(continued from previous page)\nwill be out in the morning.\n\n\n\nBoil and strain celery seed and drink off.\n\n\n\nObtained from Mrs Brady Donaghmore, who has the cure handed down from her grandmother. It is written in a little piece of paper and no one knows who wrote it. The cure was got from Mrs Dillon ne Gilsenan of Girley great grandmother of the Bradys. People as a rule do not tell the ingredients of their cures but these people gave the paper containing the cure and were quite willing to give it.The Cure:-1. Red Nettle2. Daisy roots3. Yarrow4. Sorrell5. Crow foot6. Salt7. Suit [Suet]8. White of Egg9. Butter[?] Boil down and put to Bust\n", "school_info": "School: St Columba's Abbey, Navan", "metadata": [{"Location:": "Navan, Co. Meath", "Teacher:": "\nBr. Abban O' Donoghue\n"}, {"Informant": "Mrs Brady", "Gender": "female", "Address": "Donaghmore, Co. Meath"}, {"Language": "English"}]}, "5008978/4972960/5111422": {"title": "Local Cures - Rickets", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0705, Page 164", "Page 164"], "url": "https://www.duchas.ie/en/cbes/5008978/4972960/5111422", "text": "\nA man named Edward Farrelly in the downland of Neagh has the cure of the rickets.  The child has to go three mornings to him fasting and he carries the child round the anvil three time saying In the name of the Father and of the Son and of the Holy Ghost each time.\n\n\n\nThe whitlow is a very common disease among the people.  It appears on the finger.  Mrs Peter Rogers Hermitage, Moynalty, Kells, Co. Meath has the cure of it.  She cures it with the herbs of the earth.Father and of son and of the holy ghost amen.  This is done with nine of the stones, the tenth is thrown away.  This is performed for them and then the person is cured.\n", "school_info": "School: Ughtyneill", "metadata": [{"Location:": "Ughtyneill, Co. Meath", "Teacher:": "\nMaighréad, Bean Uí Chinnéide\n"}, {"Collector": "Micael Ó Brian", "Gender": "male", "Address": "Carrickspringan, Co. Meath"}, {"Language": "English"}]}, "5008978/4972963/5111460": {"title": "Local Cures - Rheumatism", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0705, Page 167", "Page 167"], "url": "https://www.duchas.ie/en/cbes/5008978/4972963/5111460", "text": "\n(continued from previous page)\natism found a raw potato on the road and preserved it, it would cure the complaint.\n\n\n\nWhitlowThe Whitlow is a very common disease among the people. It appears mostly on the fingers of the hands. Mrs Peter Rogers, Hermitage, Moynalty, Co. Meath has the cure of the whitlow. She makes an ointment from the herbs of the earth. The herbs she uses are, roots of Nettles, roots of daisies, the Yarrow, the tops of Furze bushes and grass that was never trodden upon. She also adds an egg, unsalted butter and Holy Water. The person who has the whitlow applies this ointment twice daily. After about nine days the whitlow is completely cured.\n", "school_info": "School: Ughtyneill", "metadata": [{"Location:": "Ughtyneill, Co. Meath", "Teacher:": "\nMaighréad, Bean Uí Chinnéide\n"}, {"Collector": "Cristiná Nic an t Saoi", "Gender": "female", "Address": "Ballymakane, Co. Meath"}, {"Language": "English"}]}, "5008974/4972553/5111997": {"title": "Burst", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0704, Page 303", "Page 303"], "url": "https://www.duchas.ie/en/cbes/5008974/4972553/5111997", "text": "\nThe cure of the burst is made of ointment and herbs.  Dan Clarke has the cure of it.  You have to make a poltice of the ointments and herbs, and put it on the sore.  There is a cure of the running worm.  Ned Matthews has the cure of it.  My father got the cure from him and it cured him.  He was the seventh sone of the family.\n", "school_info": "School: Kilskeer (B.)", "metadata": [{"Location:": "Kilskeer, Co. Meath", "Teacher:": "\nMáirtín Ó Loingsigh, R. Ó Fithcheallaigh\n"}, {"Language": "English"}]}, "5008975/4972641/5112228": {"title": "Toothache", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0704, Page 417", "Page 417"], "url": "https://www.duchas.ie/en/cbes/5008975/4972641/5112228", "text": "\n15There is a well in Kieran about three miles from Kells named St Kieran's well which cures the toothache.  Every year lots of people visit this well.  The cure is to rub the water to the tooth and when they are going away they leave something on the stone which lies near the well such as pins, money and matches.  Another cure is to meet God's horse on the road without looking for him.  It is said you would never have the toothache ever after that.  God's horse is a brown hairy worm.\n\n\n\n16Paddy Martin lives near us and he has the cure of the burst. He says some prayers over it and gives you some medicine to put on it.\n\n\n\n17Paddy Tormey lives near us and he has\n(continues on next page)\n", "school_info": "School: Kilskeer (C.)", "metadata": [{"Location:": "Kilskeer, Co. Meath", "Teacher:": "\nMáire, Bean Uí Fhithcheallaigh\n"}, {"Collector": "Bridie Smyth", "Gender": "female", "Address": "Johnsbrook, Co. Meath"}, {"Informant": "James Smyth", "Gender": "male", "Address": "Johnsbrook, Co. Meath"}, {"Language": "English"}]}, "5009001/4975538/5113310": {"title": "Cures - Cure of Whitlow", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0712, Page 143", "Page 143"], "url": "https://www.duchas.ie/en/cbes/5009001/4975538/5113310", "text": "\nMr Robert Shakleton (about 82 years) Ardagh, Kingscourt is well known in this part of the country for curing sufferers from Whitlow. The poultice consists of three herbs known to him by appearance though not by name, one of the herbs grows in his own garden, another is found at the bottom of a ditch (known in this part of the country as grifse) and the third is found in a stubble field. The herbs are boiled until soft and then linseed meal is poured in and boiled again.The poultice is now applied and never fails to cure.Mr Shakelton's mother used to make a healing ointment for application when the Whitlow ceased running. The ointment was made with the above herbs and unsalted butter and proved a marvelous healer.\n", "school_info": "School: Meath Hill", "metadata": [{"Location:": "Meath Hill, Co. Meath", "Teacher:": "\nPatrick J. Connolly\n"}, {"Collector": "P.J. Connolly"}, {"Language": "English"}]}, "5009007/4976413/5115362": {"title": "Local Cures - A Cure for Whitlow Locally Called Bust", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0714, Page 218", "Page 218"], "url": "https://www.duchas.ie/en/cbes/5009007/4976413/5115362", "text": "\n(This is a disease which attacks the joints of the fingers, and often people lose portion of the finger as a result.)Take a handful of each of the following herbs:-YarrowKey of the Gentry (local name of herb)Common NettleCommon SorrelWild Water Grass* Rib Grass } The Rib grass here mentioned is that found growing up through furze or gorse on \"Whin Hills\".Put 1 lb of unsalted butter - goats' butter if possible and melt in saucepan over the fire. Then put in the herbs in equal quantities and allow all to boil for a short time. Then add the white of two eggs and stir well. When cool apply to the whitlow(P.S. This woman makes up this ointment without fee for any person needing it. I have recently seen two whitlows cured by this ointment. The person cured was once a pupil of mine - Patrick Meade, Foolstown, Ardee)\n", "school_info": "School: Rathkenny", "metadata": [{"Location:": "Rathkenny, Co. Meath", "Teacher:": "\nTomás Mac Cárthaigh\n"}, {"Collector": "Thomas Carty", "Gender": "male", "Address": "Rathkenny, Co. Meath"}, {"Informant": "Mrs Kate Doherty", "Gender": "female", "Address": "Mullagha, Co. Meath"}, {"Language": "English"}]}, "5008933/4967782/5119851": {"title": "Cure of the Burst", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0692, Page 199", "Page 199"], "url": "https://www.duchas.ie/en/cbes/5008933/4967782/5119851", "text": "\nMrs. McEnroe, Kilbeg, Rathmolyon, has this cure. She makes ointment from un-salted butter and some herbs, one of which can only be gathered at twilight and it is not seen by any other person at any other times.\n\n\n\nA man named Lawless, who lives at Culmullen has this cure. Anyone that is injured with a fork or a pointed iron has to bring it to him and he gives an herb called Comfrey Root to heal the wound. This was never known to have failed.\n", "school_info": "School: Dangan (C.)", "metadata": [{"Location:": "Dangan, Co. Meath", "Teacher:": "\nMaighréad Ní Fhógartaigh\n"}, {"Collector": "Annie Dwyer", "Gender": "female"}, {"Informant": "Maureen Fagan", "Gender": "female", "Address": "Clondoogan, Co. Meath"}, {"Language": "English"}]}, "5008933/4967786/5119903": {"title": "A Cure for Wildfire", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0692, Page 203", "Page 203"], "url": "https://www.duchas.ie/en/cbes/5008933/4967786/5119903", "text": "\nThere is a girl who lives outside Kilmesson. She gives medicine to take and ointment to rub on the sore. Then she will get you to say prayers and go to her three times. It will bleed the third time and then it will disappear.\n\n\n\nThere is a man who lives in Readstown and he has the cure of the Burst. Then is a herd and it is chopped up finely with sugar. This will cure it. But a better way still is to get goose grease and rub it on the sore. It will heat it more  rapidly than the above.\n", "school_info": "School: Dangan (C.)", "metadata": [{"Location:": "Dangan, Co. Meath", "Teacher:": "\nMaighréad Ní Fhógartaigh\n"}, {"Collector": "Elizabeth Grehan", "Gender": "female"}, {"Informant": "Hubert Grehan", "Gender": "male", "Address": "Ginnetts Great, Co. Meath"}, {"Language": "English"}]}, "5044582/5023899/5140721": {"title": "Local Cures - Yellow Jaundice", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0803, Page 218", "Page 218"], "url": "https://www.duchas.ie/en/cbes/5044582/5023899/5140721", "text": "\n(4) a cure for the yellow jaundice is to get worms and cut them and eat them.\n\n\n\na way to cure a gumbile is to scald the mouth with boiling water.\n\n\n\nTo cure an earache warmed olive oil put into the ear and wadding put into keep in the olive oil is good.\n\n\n\n2) Seven Christmas day's and seven Easter Sunday's holy water mixed together and then three drops poured into the ear \"in the name of the Father and of the Son and of the Holy Ghost\"\n\n\n\n3) To get the juice of an ash stick and rub it on the ear, will cure it\n\n\n\n(4) Castor oil is used to cure a pain in the ear\n\n\n\nHaemorrhage: Put a key down our back or from the nose.. chew paper\n\n\n\na burst: a cure for a burst is to get hot water and a spoonful of breadsoda\n(continues on next page)\n", "school_info": "School: Kilmurry", "metadata": [{"Location:": "Kilmurry, Co. Offaly", "Teacher:": "\nA. de Búrca\n"}, {"Collector": "Celia Dalton", "Gender": "female", "Age": "11", "Address": "Bracklin Little, Co. Offaly"}, {"Informant": "Thomas Dalton", "Relation": "parent", "Gender": "male", "Age": "51", "Address": "Bracklin Little, Co. Offaly"}, {"Language": "English"}]}, "5044652/5029062/5145305": {"title": "Local Cures - Bad Heart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0821, Page 013", "Page 013"], "url": "https://www.duchas.ie/en/cbes/5044652/5029062/5145305", "text": "\n(continued from previous page)\nfrom juice of dandelion.M. Connolly from Denis Connolly, Chapel St, Birr.\n\n\n\nWhitlowDip the whitlow in water in which the potatoes have been boiled.B. Dowd from Mr. Dowd, Emmet Square, Birr.\n\n\n\nSore FeetIf feet get sore from heat in Summer time or from new boots, remove the boots and socks, and walk in the dust along the road.\n\n\n\nRheumatismTake a raw potato in your pocket.T.G. Roche, Moorpark St, Birr.\n", "school_info": "School: Birr (St. Brendan's)", "metadata": [{"Location:": "Birr or Parsonstown, Co. Offaly", "Teacher:": "\nS. Ó Conchobhair, R. Ó Huigín\n"}, {"Collector": "D. Dowd", "Gender": "unknown"}, {"Informant": "Mr Dowd", "Gender": "male", "Address": "Birr or Parsonstown, Co. Offaly"}, {"Language": "English"}]}, "5177649/5176660/5202119": {"title": "Leigheasanna - Sore Eyes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0598, Page 103", "Page 103"], "url": "https://www.duchas.ie/en/cbes/5177649/5176660/5202119", "text": "\n(continued from previous page)\nin under eyelid. Then dry with a dry portion of same cloth. Burn cloth.for 2nd eye if necessary a new cloth is needed.\n\n\n\ndip in boiling potato water.\n\n\n\nput a piece of lard, as it comes from pig, up to corn. Leave it there for some days. Corn will soften & go away.Pare corn and put a small piece of head of red-headed match on exposed top. Apply a lighted match to this. Corn goes.To walk barefoot in the dew.\n", "school_info": "School: Meelick (B.)", "metadata": [{"Location:": "Meelick, Co. Clare", "Teacher:": "\nEoghan Ó Néill\n"}, {"Language": "English"}]}}