{"4428157/4382559/4449004": {"title": "It Happened at Cards", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0653, Page 12", "Page 12"], "url": "https://www.duchas.ie/en/cbes/4428157/4382559/4449004", "text": "\nOne night about eighty years ago six people were playing cards in a house in the Parish of Ballygunner. One of the men was a stranger. Suddenly he lighted a candle, called for the Ace of Hearts, and sent the candle across to the \"cut\". The Ace of Hearts came across the table to where the stranger was sitting.\n", "school_info": "School: Ballygunner (B.), Portláirge", "metadata": [{"Location:": "Ballygunnermore, Co. Waterford", "Teacher:": "\nConchobhar Mac Giolla Phádraig\n"}, {"Language": "English"}]}, "4428144/4381647/4458448": {"title": "Religious Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0649, Page 63", "Page 63"], "url": "https://www.duchas.ie/en/cbes/4428144/4381647/4458448", "text": "\nThere are many religous stories told about Stradbally in older times. Many years ago there was a Mission held in Stradbally Church and every body young and old attended each night and all went to confession and Holy communion save one man who commonly went by the name of Seanin A Mounts. This man used work Devilment such as changing a penny into a hall-crown at\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire, An tSráidbhaile", "metadata": [{"Location:": "Stradbally, Co. Waterford", "Teacher:": "\nAn tSr. Ióseph\n"}, {"Collector": "Maureen Corbett", "Gender": "female", "Address": "Stradbally, Co. Waterford"}, {"Informant": "Patrick Corbett", "Relation": "parent", "Gender": "male"}, {"Language": "English"}]}, "4666609/4666433/4688967": {"title": "Ghost Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0415, Page 164", "Page 164"], "url": "https://www.duchas.ie/en/cbes/4666609/4666433/4688967", "text": "\n(continued from previous page)\ncandle was put into a bax, and put under the foundation of a church about twelve miles from Ballyduff village.\n\n\n\nLong ago there was a man living in Kilmore and whatever way he used to knot himself up he used to go into a man's shoe. He was one night inside at home, and he said to his father \"I bet you I will put you sitting on the chair outside in the yard and the doors bolted.\" They all said it was impossible, so whatever he did, the old man was found outside in the yard sitting on the chair. He used also stand on the top of his head up in the top of a canoe from Poll Buidhe to the Castle how ever rough it would be or whatever way the day would be.\n", "school_info": "School: Ballyduff B. N. School", "metadata": [{"Location:": "Ballyduff, Co. Kerry", "Teacher:": "\nTadhg Ó Leathlobhair\n"}, {"Informant": "James Houlihan", "Gender": "male", "Address": "Benmore, Co. Kerry"}, {"Language": "English"}]}, "4713256/4711945/4744270": {"title": "Béaloideas", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0456, Page 429", "Page 429"], "url": "https://www.duchas.ie/en/cbes/4713256/4711945/4744270", "text": "\nLong ago there lived a man in Kilgarvan. Every night he played cards and he was able to read through the ace of hearts and if anybody lost anything they would go to him to find out where it was. Once a man lost a horse and he went to him, he told him he was between two mountains at the foot of a rising hill and the man got the horse there. Another man lost sheep and he went to him and he told him that he would be within a days reach of them every day and that he would never find and he never found them.One day he was mowing hay and that night when he was coming home he met a ghost he drew the scythe as he was drawing the scythe the scytheboard fell off and the ghost stepped on it and poisoned it. He never took it up after that and the priest stopped him of playing  cards after that.\n", "school_info": "School: Ráithín (B.)", "metadata": [{"Location:": "Raheen, Co. Kerry", "Teacher:": "\nDiarmuid Ua Cróinín\n"}, {"Informant": "Tadhg Ua Scannaill", "Gender": "male", "Address": "Knockysheehan, Co. Kerry"}, {"Language": "English"}]}, "4723831/4717122/4784597": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0938, Page 117", "Page 117"], "url": "https://www.duchas.ie/en/cbes/4723831/4717122/4784597", "text": "\n(continued from previous page)\ncart were swept down the river. The next morning the donkey and cart were found safe and sound on the bank of the river. But old Mac Adam was found dead.\n\n\n\nThere was a girl hired in Pat Hughes's grandfather's. She could go to the room and return in the form of a baby, and when she went back to the room. she became her Natural shape again.When the above man Pat Hughes was making brick in the brick yard fairies appeared to him and began to sing and dance. \"Paddy from Clare\" went round the country blinking everything he saw.Dan Hughes and his servant were ploughing when suddenly Paddy approached \"Oh says Dan\" my horses are done here comes Paddy\". The servant paid no heed to him but finding a big stone tied some string around it & hung it from the beam of the plough. When Paddy came near he wondered to see the stone - looked at it and suddenly it broke into pieces & flew through the air. and so the horses were saved.\n", "school_info": "School: Lappen", "metadata": [{"Location:": "Lappan, Co. Monaghan", "Teacher:": "\nSeán Ó Ruanadha\n"}, {"Language": "English"}]}, "4758606/4758323/4785892": {"title": "Black Art", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0952, Page 199", "Page 199"], "url": "https://www.duchas.ie/en/cbes/4758606/4758323/4785892", "text": "", "school_info": "School: Nart", "metadata": [{"Location:": "Nart, Co. Monaghan", "Teacher:": "\nMrs Mc Adoo\n"}, {"Informant": "Miss A. Abbott", "Gender": "female", "Address": "Lisnaveane, Co. Monaghan"}, {"Language": "English"}]}, "4758606/4758325/4785894": {"title": "Black Art", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0952, Page 201", "Page 201"], "url": "https://www.duchas.ie/en/cbes/4758606/4758325/4785894", "text": "\n(continued from previous page)\nothers began to kill them striking them with their spades. After a while he changed them back to spuds again, but they were ruined, all but and slashed with the spades.\n\n\n\nBooks on Black Art were got in Scotland by those who went to work there during the Harvest.It was against the law to sell or buy these but it was done. A £1 was left on a certain placeed and while one watched a hand appeared took the money and shortly afterwards put the required book in its place.\n(continues on next page)\n", "school_info": "School: Nart", "metadata": [{"Location:": "Nart, Co. Monaghan", "Teacher:": "\nMrs Mc Adoo\n"}, {"Informant": "Mrs M. A. Mc Adoo", "Gender": "female", "Address": "Lisnaveane, Co. Monaghan"}, {"Language": "English"}]}, "4770022/4767450/4786070": {"title": "Folklore", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0831, Page 253", "Page 253"], "url": "https://www.duchas.ie/en/cbes/4770022/4767450/4786070", "text": "\nI. Not far from where I live there stands the ruins of an old house in which in later days there lived an old pair, Mr. Robert and Mrs. Robert and their son Micky.II. Micky had an art from the devil called the Black Art, and by his actions the people would sometimes run from him in terror, for the things he used to preform were beyond man's power.III. He used to ramble to the neighbouring houses by night and I have no need in saying that they dreaded the sight of him coming.IIII. For instance some of his antics were as follows:V. One night there was a gamble for a saw at Mr. Rowans, and a great number took part in it. When they were far advanced in the game and some of the men two game's up, Micky Robert's came in and asked to be let take part in it; but the told him that the game was too far advanced and that he would have no use playing, but Micky insisted that he would have to be let play. The therefore let him play, and it was not long until\n(continues on next page)\n", "school_info": "School: Timahoe", "metadata": [{"Location:": "Timahoe, Co. Laois", "Teacher:": "\nR. O' Byrne\n"}, {"Collector": "Kieran Brennan", "Gender": "male", "Address": "Knocklead, Co. Laois"}, {"Informant": "Andrew Daly", "Gender": "male", "Age": "60", "Address": "Fossy Upper, Co. Laois"}, {"Language": "English"}]}, "4770022/4767453/4786080": {"title": "Stories of Michael Roberts - The Local Necromancer", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0831, Page 256", "Page 256"], "url": "https://www.duchas.ie/en/cbes/4770022/4767453/4786080", "text": "\nOne morning Michael Roberts was journeying to the fair of Athy. He had been told that pigs were a great price. He saw two big stones in the ditch and walking over he hit the stones and told them to go on. The stones walked on in the shape of two big white pigs.When he reached the fair a jobber walked up to him. Michael disposed of the pigs. The man ordered him to put them in the wagon, Michael did so but if he took his eyes off them they would change back to their old shaped again.When Michael turned to go home the pigs changed back again. The man took out to run after Roberts. Roberts ran in to a house and rolled in under the bed. The man caught him by the legs, Roberts let off his leg in the man's hands, the poor jobber fainted on the floor. Roberts got back the legs again and had easily arrived home when the unfortunate man came to.\n", "school_info": "School: Timahoe", "metadata": [{"Location:": "Timahoe, Co. Laois", "Teacher:": "\nR. O' Byrne\n"}, {"Collector": "William Shortall", "Gender": "male", "Address": "Luggacurren, Co. Laois"}, {"Language": "English"}]}, "4713225/4709283/4815693": {"title": "A Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0449, Page 316", "Page 316"], "url": "https://www.duchas.ie/en/cbes/4713225/4709283/4815693", "text": "\nOnce a man lived in a field called the \"cuilín: in Carrigeen. It was said that he had power from the devil. Many people made up their minds to watch him but they could not see him doing anything.Once he went to a fair in Abbeyfeale but he had no pigs to sell. As he came near the town he picked three pieces of elder and laid them on the ground. Instantly they were changed into three pigs and he took them to the fair and sold them for the best price. The man who bought them put them into his car and went to buy some more. When he returned he found no pig in the car but three pieces of elder rods. Then he knew the man had played a trick on him so he decided to buy three more, but he was careful not to be caught again.Another story told of a man who was fishing. When the bailiff was coming near the place where the man was the man decided to play a trick on him. He jumped out of the sallies and ran across the river with a salmon in his hands. When the bailiff say him he ran after him and was coming up with him towards the foot of a cliff. Going up the cliff he caught him by the leg and fell backwards because\n(continues on next page)\n", "school_info": "School: Brosna (B.)", "metadata": [{"Location:": "Brosna, Co. Kerry", "Teacher:": "\nAonghus Ó Laochdha\n"}, {"Collector": "Dermot Connor", "Gender": "male", "Address": "Carrigeen, Co. Kerry"}, {"Informant": "William Lane", "Gender": "male", "Age": "84", "Address": "Carrigeen, Co. Kerry"}, {"Language": "English"}]}, "4742070/4732631/4820122": {"title": "Folklore", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0460, Page 287", "Page 287"], "url": "https://www.duchas.ie/en/cbes/4742070/4732631/4820122", "text": "\nOnce long ago a man on horse-back was on his way on a journey.He became thirsty and he went in for a drink of butter-milk but the woman refused.So as the horse man was going out of the house, he wrote a piece of a note and put it up in the \"thatch\" and went his way. He was not gone far, when the woman came out, and when she went in again, she started to whirl round the house (day) dancing, next the maiden came in, and so she started whirling round the house also.\"The men were out in the field saving hay and were wondering what was the delay of the dinner and the boss sent the boy to know what had happened, he also went in and was whirled round the house with them.\"The boss himself went to the house, but he did not go in, he went for the priest and the priest followed the traveller, and the traveller told him to take down the note and the[y] would be all right again.\n", "school_info": "School: Knockaderry (C.)", "metadata": [{"Location:": "Knockaderry, Co. Kerry", "Teacher:": "\nHanna Mannix\n"}, {"Collector": "Shelia Quirke", "Gender": "female", "Age": "12", "Address": "Fieries, Co. Kerry"}, {"Language": "English"}]}, "4742070/4732633/4820130": {"title": "Folklore", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0460, Page 289", "Page 289"], "url": "https://www.duchas.ie/en/cbes/4742070/4732633/4820130", "text": "\nOne harvest, long ago, people were not able to grow corn at all and they did not know why.\"One family went to a wise man & he told them to put a part of their seeds under an oven at the bottom of the house & not to look at it for a certain team & it would be grown.\"They did as he told them and when they looked at it, it was a fine crop. Next time they tried it, somebody wanted to know how it was done. \"When they looked, there was nothing then but rats.It seems that it changed when they looked before the time.\n", "school_info": "School: Knockaderry (C.)", "metadata": [{"Location:": "Knockaderry, Co. Kerry", "Teacher:": "\nHanna Mannix\n"}, {"Collector": "Shelia Quirke", "Gender": "female", "Age": "12", "Address": "Fieries, Co. Kerry"}, {"Language": "English"}]}, "4922033/4920605/4953762": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0507, Page 068", "Page 068"], "url": "https://www.duchas.ie/en/cbes/4922033/4920605/4953762", "text": "\n(continued from previous page)\ncrocks of gold buried near the garden gate, and that he was to get one of them, and the man of the house was to get the other two.  They disappeared then and the house was never more haunted. (M. O'Hartigan).\n\n\n\nThere was a man in Fedamore, one time and he could turn ivy leaves into money.  He'd go into the public house and give the (bad) money for drink, and get (good) change, always when he'd be gone, the money would turn back into ivy leaves in the till or else 'twould be scattered among the people who'd get it (as change) and be turned into ivy leaves in their pocket.  There was this poor woman and he'd get no credit.  The man made money for her, and she bought what she wanted , and the money (Which she gave to the shopkeepers) was scattered, and it stayed with some and 'twas changed back (into ivy leaves) with others.  That man used go hunting with Fr. Blake and if they could not get a hare, he would go behind the ditch and make a hare of his handkerchief.(M.O'H.)\n\n\n\nAny one that gets money, handy that way, (that is in a \"crock\", or by the \"poor scholar method \") some one in their family suffers\". They (that is one person) lose their mind or get deformed or something happens them, so that if they have it one way, they lose it another way\".(M - D-)\n", "school_info": "School: Cromadh (B.)", "metadata": [{"Location:": "Croom, Co. Limerick", "Teacher:": "\nDáithí Ó Ceanntabhail\n"}, {"Language": "English"}]}, "4922033/4920605/4953763": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0507, Page 068", "Page 068"], "url": "https://www.duchas.ie/en/cbes/4922033/4920605/4953763", "text": "\n(continued from previous page)\ncrocks of gold buried near the garden gate, and that he was to get one of them, and the man of the house was to get the other two.  They disappeared then and the house was never more haunted. (M. O'Hartigan).\n\n\n\nThere was a man in Fedamore, one time and he could turn ivy leaves into money.  He'd go into the public house and give the (bad) money for drink, and get (good) change, always when he'd be gone, the money would turn back into ivy leaves in the till or else 'twould be scattered among the people who'd get it (as change) and be turned into ivy leaves in their pocket.  There was this poor woman and he'd get no credit.  The man made money for her, and she bought what she wanted , and the money (Which she gave to the shopkeepers) was scattered, and it stayed with some and 'twas changed back (into ivy leaves) with others.  That man used go hunting with Fr. Blake and if they could not get a hare, he would go behind the ditch and make a hare of his handkerchief.(M.O'H.)\n\n\n\nAny one that gets money, handy that way, (that is in a \"crock\", or by the \"poor scholar method \") some one in their family suffers\". They (that is one person) lose their mind or get deformed or something happens them, so that if they have it one way, they lose it another way\".(M - D-)\n", "school_info": "School: Cromadh (B.)", "metadata": [{"Location:": "Croom, Co. Limerick", "Teacher:": "\nDáithí Ó Ceanntabhail\n"}, {"Language": "English"}]}, "4922033/4920687/4954299": {"title": "Fragment of a Song Composed by Kelly the Poet", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0507, Page 148", "Page 148"], "url": "https://www.duchas.ie/en/cbes/4922033/4920687/4954299", "text": "\n(continued from previous page)\nAnd poor Fr. James, he has banished the soupers.And purchased out Gubbin's old property.If Guiry was hunted, he would rest the the \"Echo\".*If he would reform, we would pray for his soul.The Angels in Heaven would all join in chorus.And welcome poor Bill to his heavenly home.*A place somewhere about Knockfierna.(The above from Ml. O'Grady, 74, Gurteen, Ballingarry.I have included it in the reply to the question re Bible schools and readers, which see for explanation.(D.O.C.)According to Ed. O'Connell (Cuid 1, Cuid 11).  Fr. James Enright P.P. of ballingarry was himself a convert, and he, Ed. O'Connell, heard his mother say that the Priest said off the altar in Ballingarry, that he could not pray for the souls of his father and mother.\n\n\n\nI heard it more than once, that those who want to make themselves invisible, to do any bad work, can do it in this way.  They would get a black cat and kill it, and boil it, wholesale until it would be in jelly.  They would take out the bones, then one by one without breaking any of them, and as they took them out, they would hold them before a looking glass, and the one that would not show in the glass, would give them the power to be invisible when they'd be doing the dirty work\" (Practising pishogues)  M.--O'D.--)\n(continues on next page)\n", "school_info": "School: Cromadh (B.)", "metadata": [{"Location:": "Croom, Co. Limerick", "Teacher:": "\nDáithí Ó Ceanntabhail\n"}, {"Language": "English"}]}, "4922034/4920751/4954834": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0507, Page 244", "Page 244"], "url": "https://www.duchas.ie/en/cbes/4922034/4920751/4954834", "text": "\nDon't have any doubt about it but you can cure the beast with charms.  I know what I'm talking about.  I saw it done when I was twelve years of age or so.  There was a cow that had the murrain bad.  There was no hope for her, and you can take it from me she was badly wanted (by the man who owned her).  Well she was cured with a charm and so sure as she was, it (that is, an alternative trouble) fell on one of the members of the family.  The charms can be worked, they are worked, but you can take it from me, it doesn't pay.  (a.b.)\n\n\n\nOf what follows, part I know to be true and the whole I know to be more generally believed than one could think possible in this sceptic age: In the village of X____ there is a widow named Mrs. Y____.  she has a shop and either one or two little girls. She is an industrious woman and to supplement the shop receipts, she keeps a good deal of fowl.  There was a married man living in the neighbourhood, and his wife was not extra strong.  They had no family, though both were young.  One day the man went into Mrs. Y__'s shop and asked if she had chickens to sell.  She said she had.  The man asked if she\n(continues on next page)\n", "school_info": "School: Cromadh (B.)", "metadata": [{"Location:": "Croom, Co. Limerick", "Teacher:": "\nDáithí Ó Ceanntabhail\n"}, {"Language": "English"}]}, "4922337/4871385/5058128": {"title": "Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0607, Page 002", "Page 002"], "url": "https://www.duchas.ie/en/cbes/4922337/4871385/5058128", "text": "\nA free mason was staying in Limerick one time he had his head out the window and saw another man crossing the street at a distance. He wanted to play a trick on him so he put a lake in front of him. The man in the street looked around and saw this man with his head out the window of the hotel and there and then he put a pair of horns on him. So the fellow on the top could not pull in his head and had to clear the way for the man on the street. It seems that the man on the street was a free mason too.\n", "school_info": "School: Baile Aodha (B.), Inis", "metadata": [{"Location:": "Ballyea, Co. Clare", "Teacher:": "\nTomás Ó Mathúna\n"}, {"Collector": "Christy O' Shea", "Gender": "male"}, {"Informant": "Mrs M. O' Shea", "Relation": "grandparent", "Gender": "female", "Age": "78", "Address": "Darragh, Co. Clare"}, {"Language": "English"}]}, "4922337/4871398/5058138": {"title": "A Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0607, Page 015", "Page 015"], "url": "https://www.duchas.ie/en/cbes/4922337/4871398/5058138", "text": "\nOnce a man had two hounds of which he was very fond. He had no way to exercise them, as there were no hares in the country at that time. He had one son of whom he was very fond. He changed his son in to a hare to exercise his grey hounds. He ment to change him back again. The first day he let the hounds after the hare he escaped them. The second time he let them after him, they killed him. The man was very sorry then because he could not get back his son. He was so sorry that he killed his two grey-hounds. He had not a hound or a son after his trouble.\n", "school_info": "School: Baile Aodha (B.), Inis", "metadata": [{"Location:": "Ballyea, Co. Clare", "Teacher:": "\nTomás Ó Mathúna\n"}, {"Collector": "Vincent Walle", "Gender": "male", "Address": "Barnanageeha, Co. Clare"}, {"Informant": "Lot Malone", "Age": "86", "Address": "Barnanageeha, Co. Clare"}, {"Language": "English"}]}, "4922397/4877908/5076673": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0625, Page 154", "Page 154"], "url": "https://www.duchas.ie/en/cbes/4922397/4877908/5076673", "text": "\nOnce upon a time a man lived in Inagh who had a charm for making people dance. He was in no friends with Father Grace because the latter had tried to make him give up the charm.  One day Father Grace came to his house and the man set the charm as soon as he saw him.  Father Grace was dancing all the whole day and in the end he was ready to fall he was so tired.  Then he asked the man to undo the charm.  In the honour of God the man man then in stopped him from dancing with black ass blood and a ravens feather\n", "school_info": "School: Dubhloch, Cill Mháille", "metadata": [{"Location:": "Doolough, Co. Clare", "Teacher:": "\nTadhg Ó Maoldhomhnaigh\n"}, {"Language": "English"}]}, "4922329/4870652/5079223": {"title": "Cistí Óir i bhFolach - Leacain na Sionnach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0604, Page 209", "Page 209"], "url": "https://www.duchas.ie/en/cbes/4922329/4870652/5079223", "text": "", "school_info": "School: Cill an Dísirt (C.)", "metadata": [{"Location:": "Killadysert, Co. Clare", "Teacher:": "\nMáire Mac Eochaidh\n"}, {"Informant": "Pádraig ", "Gender": "male", "Age": "75", "Occupation": "oibrí", "Address": "Killadysert, Co. Clare"}, {"Language": "Irish"}]}, "5079720/4878796/5079910": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0629, Page 031", "Page 031"], "url": "https://www.duchas.ie/en/cbes/5079720/4878796/5079910", "text": "\nOne time when the Hickmans were landlords of Kilmore estate, the whole lot of the surrounding townlands were plagued with rats. When they became too plentiful Mr Hickman sent to England for a magician. When the magician came he wrote some magic words on a piece of paper. Then he put a razor on the trunk of a tree and he took a magic whistle from his pocket and blew upon it. Immediately all the rats from the Hickman estate appeared before the magician. Then the magician spoke to the rats and called out the oldest of them and put the piece of paper into his mouth. The old rat rubbed his neck to the edge of the razor. by doing so he cut his throat. When the other rats saw this they set up a loud cry which was heard for many miles around. There was so many rats there that it took several days to cart them away and bury them. From that day out the rats never got as plentiful again in the Hickman estate. I should have said above that when the old rat cut his neck on the razor all the other rats did likewise.\n", "school_info": "School: Knockerra (B.) Killimer", "metadata": [{"Location:": "Knockerra, Co. Clare", "Teacher:": "\nMícheál Ó Cuinneagáin\n"}, {"Collector": "Samuel Keane", "Gender": "male"}, {"Language": "English"}]}, "4922383/4876266/5083016": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0621, Page 375", "Page 375"], "url": "https://www.duchas.ie/en/cbes/4922383/4876266/5083016", "text": "\nThere was a man living in the village of Lahinch one time whose name was Tom Clancy. He was one of the great scholars of the time. When he was young he had a great love for learning. His father wanted to keep him at home, because he was an only son, but Tom would not stay, so he went away to Denmark, and he learned a subject called the Black Art. Tom Clancy was a Free MasonWhen he came home from Denmark his father and all the neighbours said he knew nothing, so he wanted to show them that he did. One night there was a dance at a house in Lahinch, and Tom wrote some magical words on a slip of paper, and he stuck it under the thatch of the house where the dance was to be held. After a while the boys got up to dance and when they tried to stop they couldn't. After a while one man would get up to make the peace, but after a while he would be dancing too. At last someone went in for Tom Clancy's father. He came out thinking to make the peace without delay, but no sooner had he entered the house when he too was dancing.\n", "school_info": "School: Lahinch", "metadata": [{"Location:": "Lehinch, Co. Clare", "Teacher:": "\nDónall Ó Ríordáin\n"}, {"Informant": "Michael Finucane", "Gender": "male", "Age": "60", "Address": "Moymore South, Co. Clare"}, {"Language": "English"}]}, "5044819/5041493/5084408": {"title": "A Story of the Black Art", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0973, Page 126", "Page 126"], "url": "https://www.duchas.ie/en/cbes/5044819/5041493/5084408", "text": "\nAbout four generations ago, there lived in County Cavan a man who was supposed to be able to work the \"black art.\"One day, he thought he would go to the market to make a few pounds. So gathering a load of baughlons (buachalon = Ragweed), he brought them out in a covered cart. He wasn't long in the (in) market, until a man came up to him and asked what he had in the cart, to which he replied, \"A cart of pigs, Sir,\" revealing a fine load of pigs, which he sold for a large sum of money. The purchaser of the pigs, very proud of his bargain went home, but on removing the cover, all he found was a load of baughlons.On another occasion, this man who worked the \"black art\" was riding a horse through Cavan town, his face towards the horse's tail. A girl happened to be looking through a window, and saw the\n(continues on next page)\n", "school_info": "School: Ballyhaise (2)", "metadata": [{"Location:": "Ballyhaise, Co. Cavan", "Teacher:": "\nBean Uí Mhaolagáin\n"}, {"Collector": "Sylvia Mullen", "Gender": "female", "Address": "Ragaskin, Co. Cavan"}, {"Informant": "Mrs O' Neill", "Gender": "female", "Age": "40", "Address": "Lisnashanna, Co. Cavan"}, {"Language": "English"}]}, "4922388/4876767/5085463": {"title": "Gabha Rua", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0622, Page 474", "Page 474"], "url": "https://www.duchas.ie/en/cbes/4922388/4876767/5085463", "text": "\nThere was a Blacksmith long ago who was enchanted and from the sparks that came from the shoe he turned them into oats. His name was Gabha Ruadh. This smith lived down near where my grandfather lived in Coore - My grandfather heard this when he was a little boy.\n", "school_info": "School: Sráid na Cathrach (C.)", "metadata": [{"Location:": "Milltown Malbay, Co. Clare", "Teacher:": "\nÚna, Bean Uí Bhriain\n"}, {"Collector": "Mary Lynch", "Gender": "female", "Address": "Milltown Malbay, Co. Clare"}, {"Informant": "Johny Lynch", "Gender": "male", "Age": "circa 78", "Address": "Milltown Malbay, Co. Clare"}, {"Language": "mixed"}]}, "5044836/5042835/5086695": {"title": "An Old Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0977, Page 221", "Page 221"], "url": "https://www.duchas.ie/en/cbes/5044836/5042835/5086695", "text": "\nOnce upon a time there lived a woman at the Billis who had magic power. She had two servant boys. One night one of them happened to waken he heard her steps coming up the stairs he shut his eyes and pretended he was asleep. She came to the bedside and said magic words and turned the other boy into a horse. She got up on him and rode him down the stairs about an hour later she returned to the room with the horse and said the words backways and turned him into a man. The next night the boy got up and same words and turned her into a horse and rode away, he returned to the house about an half an hour later and said the words backways he forgot the last word he turned her into a woman but she had horses hooves.\n", "school_info": "School: Lacken", "metadata": [{"Location:": "Lackanduff, Co. Cavan", "Teacher:": "\nP. Colreavy\n"}, {"Collector": "Mary Brady", "Gender": "female", "Age": "12", "Address": "Corracarrow, Co. Cavan"}, {"Language": "English"}]}, "5044839/5043105/5093832": {"title": "Funny Stories", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0978, Page 179", "Page 179"], "url": "https://www.duchas.ie/en/cbes/5044839/5043105/5093832", "text": "\nOnce upon a time a Catholic girl was working in a Protestant house in the parish of Crosserlough in the time of my Grandfather. The woman of the house was supposed to take butter. When the girl went up to her room at night the woman used to go out to the barn. One night when the girl went to her room she pretended to be in bed, but instead when she got the woman gone out she stole out after her. She saw her get on a riddle, say some words and then go off.Next night the girl went out and got on the riddle said the words. All at once the riddle rose to the roof of the barn and her head was hopped against the roof. The screams of her brought out the servant boy who took her off the riddle. She did not try to take any more butter.\n", "school_info": "School: Árd-chill", "metadata": [{"Location:": "Ardkill More, Co. Cavan", "Teacher:": "\nBean Uí Chonalláin\n"}, {"Collector": "Tommy Mc Dermott", "Gender": "male", "Address": "Drumnalaragh, Co. Cavan"}, {"Language": "English"}]}, "5009278/5004054/5132233": {"title": "A Curious Happening", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0886, Page 136", "Page 136"], "url": "https://www.duchas.ie/en/cbes/5009278/5004054/5132233", "text": "\nThe following was told to John Belorin by his mother. When she was a young girl she was left to 'mind house' one day while her parents were in town. Some playmates from the neighbouring houses came to keep her company for the day. They locked the door and played outside and when the time came to go in and prepare for the return of the parents the key was not to be found. They searched high and low but all to no purpose.At length one of them, Ellen ONeill by name said she'd found it. She drew a circle on the ground and put a nail standing upright in the centre. She then made them all go out of sight until she gave the signal. When they came back there was the key on the nail with a black snail lying on it.\n", "school_info": "School: Naomh Bríghid, Blackwater", "metadata": [{"Location:": "Blackwater, Co. Wexford", "Teacher:": "\nDiarmuid Ó Súilleabháin\n"}, {"Informant": "John Belvin", "Gender": "male"}, {"Language": "English"}]}, "5044666/5030321/5142318": {"title": "A True Story of a Conjurer", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0904, Page 283", "Page 283"], "url": "https://www.duchas.ie/en/cbes/5044666/5030321/5142318", "text": "\nIn the year of 1887 there lived in Spahill, Borris, Co Carlow, a man named Hugh O'Neill. One night two neighbouring men name John Kealy Scorthreen, and Sonny Kealy viaducts Borris, went in to ramble. When Hugh got them in he shut the door and locked it.He had a number of dogs on the floor and after some time the dogs began to play music, and many red coat men came out of the corner and began to dance till the floor was full of them.The same Hugh had a book and if you gave him a leaf or a piece of straw he could turn it into a coin of any kind except a two shilling piece, because it had a cross on it.\n", "school_info": "School: Borris (B.)", "metadata": [{"Location:": "Borris, Co. Carlow", "Teacher:": "\nSs. Ó Loinneáin\n"}, {"Collector": "Jeremiah Byrne", "Gender": "male", "Age": "14", "Address": "Ballynasilloge, Co. Carlow"}, {"Informant": "Edward Byrne", "Relation": "parent", "Gender": "male", "Age": "60", "Address": "Ballynasilloge, Co. Carlow"}, {"Language": "English"}]}, "5044684/5031821/5145374": {"title": "A Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0908, Page 244", "Page 244"], "url": "https://www.duchas.ie/en/cbes/5044684/5031821/5145374", "text": "\nLong ago there lived a man named Watchorn and every day himself and a man named Goslin went into Yine[?] with one shilling to buy drink. They always had the shilling coming back.One day a police-man caught them getting drink without paying for it. They were summoned for the next court. The day before the court Goslin and Watchorn met in Watchorn's yard\n(continues on next page)\n", "school_info": "School: Cluain (1), Baile an Droichid", "metadata": [{"Location:": "Clonmore, Co. Carlow", "Teacher:": "\nSs. Ó Laochdha\n"}, {"Informant": "Thomas Mc Donaloe", "Gender": "male", "Address": "Knockatomcoyle, Co. Wicklow"}, {"Language": "English"}]}, "5009265/5002889/5147772": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0882, Page 480", "Page 480"], "url": "https://www.duchas.ie/en/cbes/5009265/5002889/5147772", "text": "\nI suppose you often heard tell o' Ned Hayden of Old Ross, an' all the quare things he used to do. Of course he, had some power from the divil. I saw him here, meself, times an' he'd put a cup o' wather on the middle o' the flure an say some words over it an make the wather swell like the Pacific Ocean. We'd all have to leave the kitchen 'till he'd make it dry up again.There was a barn dance round here some night long a go an Ned was in it. There was a great swell of a girl at the dance, an' she thrated Ned with great contempt an' jeered at him. Begor Ned got vexed an' he used his\n(continues on next page)\n", "school_info": "School: Carrigbyrne", "metadata": [{"Location:": "Carrickbyrne, Co. Wexford", "Teacher:": "\nMáire Cuirtéis\n"}, {"Collector": "Kitty French", "Gender": "male", "Address": "Raheevarren, Co. Wexford"}, {"Informant": "Mrs Curtis", "Gender": "female", "Address": "Carrickbyrne, Co. Wexford"}, {"Language": "English"}]}, "5009265/5002891/5147783": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0882, Page 482", "Page 482"], "url": "https://www.duchas.ie/en/cbes/5009265/5002891/5147783", "text": "\nThere was wan night and Ned Hayden was going to the public house.  Moll o' the Wads that is where mc. Cabes are now.  He went in to Nowlans o' Ballagh an' he said to wan of the girls, \"Give me a shilling and I'll bring you in a hen and xhickens\".  She was delighted, and she said she would to be sure.She gave Ned the shilling, an' he went out an' brought her in a hen an' twelve lovely little chickensShe put them into a box, an' when Ned was gone she went to go feed them, an' what was in the box only twelve skilawns of spuds an' wan big oneNed was up in Ballinaboola wan night at Brennans Pub.  It was after closin' time but Ned thought hed get a sup.  The seargent was on the cross, an' Ned expected he saw him goin to go in.  So he took off his boots an' told the\n(continues on next page)\n", "school_info": "School: Carrigbyrne", "metadata": [{"Location:": "Carrickbyrne, Co. Wexford", "Teacher:": "\nMáire Cuirtéis\n"}, {"Collector": "Josie Kehoe", "Gender": "female", "Address": "Carrickbyrne, Co. Wexford"}, {"Informant": "Mr Jack Shea", "Gender": "male", "Age": "74", "Address": "Carrickbyrne, Co. Wexford"}, {"Language": "English"}]}, "5177635/5174830/5189140": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0593, Page 423", "Page 423"], "url": "https://www.duchas.ie/en/cbes/5177635/5174830/5189140", "text": "\nA certain man called in one day to a forge to a smith to put a set of new shoes on his horse, which he did. The man asked him would he like to see a hunt, and the smith said he would, but that he had no horse. Come on with me, and I will get a horse for you, he brought him into the back of the forge where there was a lot of old ploughs and he turned the plough into a fine grey horse, bridle and saddle and said, Come on now, to the hunt. He collected the dogs and told him not to cross a certain river he had forgotten what the man told him and he crossed it, and he found he was sitting on an old plough fourteen miles from his home.\n", "school_info": "School: Clooney, Cuinche", "metadata": [{"Location:": "Clooney, Co. Clare", "Teacher:": "\nMícheál Mac Clúmháin\n"}, {"Collector": "Anna O' Flannagan", "Gender": "female"}, {"Informant": "Patrick O' Halloran", "Gender": "male", "Age": "50"}, {"Language": "English"}]}, "5162131/5156791/5192653": {"title": "Folklore - A Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0603, Page 124", "Page 124"], "url": "https://www.duchas.ie/en/cbes/5162131/5156791/5192653", "text": "\nThe Gabhrúadh was a black smith that lived to the west of Kilmihill. He used to spend all day working in the forge and all night with the fairies. He was also able to tell the people when any person around the neighborhood was going to die or when the fairies were going to bring any of their cows. His name was Hickey and they called him Gabhrúadh because he had a red head.\n\n\n\nThere are no tailors in this parish now. Some tailors have cloth selling in their houses while others only make the suits and whoever wants the suit supplies him with the cloth bought at some establishment. All the cloth is bought in the shops now. A tailor when working required\n(continues on next page)\n", "school_info": "School: Crannach, Inis", "metadata": [{"Location:": "Cranny, Co. Clare", "Teacher:": "\nMícheál Ó Maolchaoin\n"}, {"Collector": "Margaret Browne", "Gender": "female"}, {"Informant": "Mrs B. Browne", "Gender": "female", "Address": "Carrowreagh East, Co. Clare"}, {"Language": "mixed"}]}, "5162149/5158926/5197955": {"title": "Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0655, Page 077", "Page 077"], "url": "https://www.duchas.ie/en/cbes/5162149/5158926/5197955", "text": "\nLong ago some of the old people had power to do some wonderful thing and these powers were called charms. Micilín Burke had a charm for dogs when he used to let his hand on a dog the dog would follow him everywhere. Micilín Burke was  tramp travelling around the Country and he always had a twinty  or thirty dogs following him around from house to house looking for alms for me brothers as he used to call them. Mrs. Nugent, Seskin Carrick-on-Suir had a charm to stop blood. Before a person would have a charm another person should send some words written on piece of paper and the person should not know who send the piece of paper. If a dog bit a person the old people used to catch the dog and they used to pull a rib  of hair from the dog and put it on the cut and it is said that the cut wouldn’t ever fester. When a man would go to town and when he would take some drink he would say the day after that he would like to get a rib from the dog that bit him yesterday.\n", "school_info": "School: An Charraig Bheag, Carraig na Siúire", "metadata": [{"Location:": "Carrickbeg, Co. Waterford", "Teacher:": "\nSeán Ó Comhraidhe\n"}, {"Informant": "Mary Fitzpatrick", "Gender": "female", "Address": "Sheskin, Co. Waterford"}, {"Language": "English"}]}, "5162151/5159046/5198223": {"title": "Cearrbhachs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0655, Page 195", "Page 195"], "url": "https://www.duchas.ie/en/cbes/5162151/5159046/5198223", "text": "\nThere were a lot of cearrbhacs in this parish long ago the most famous of them being a man named Thomas Whelan of Rathgormack. Many stories are told about him but we are not certain whether they are true or not. This man was supposed to be able to colour the cards and was often noticed by his companions never to be beaten in a game. He was one day in a public house and he took up a penny out of his pocket and shewed it to his companion and when he left it on the counter it was a two shilling piece.This man was another day going up Bridge Lane Carrick-on-Suir and he had a large load of potatoes. A man put his head out in a window and frightened the horse. Thomas did not know at first what the cause of the fright was  but when he saw the head out in the window he put horns on it and he was unable to pull it in.\n", "school_info": "School: Ráth Ó gCormaic (B.), Carraig na Siúire", "metadata": [{"Location:": "Rathgormuck, Co. Waterford", "Teacher:": "\nMícheál Mac Créigh\n"}, {"Collector": "Seán Ó Dálaigh", "Gender": "male"}, {"Informant": "Pádraig Ó Dálaigh", "Gender": "male", "Age": "50"}, {"Language": "English"}]}}