{"4428270/4390295/4429232": {"title": "The Sly Fox", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1032, Page 005", "Page 005"], "url": "https://www.duchas.ie/en/cbes/4428270/4390295/4429232", "text": "\nLong ago there lived in Carrickbreeny near Bridgetown County Donegal a man called William Hammond who had a boy hired called Ned Weir. They kept a lot of hens and a fine rooster. But as the foxes were plentiful in the district they stole all the hens but the rooster, and in order to save him Ned Weir took him home to his own house and made a roost for him under the kitchen table.One night shortly after this as he was coming home he saw a fox lying as he thought dead on the roadside. He picked it up and took it into the kitchen intending to save the skin for a fur. While he turned round to take off his coat the cunning fox who had only been shamming jumped up snapped the rooster and ran out with him to the consternation of poor Ned.The story shows us of the wonderful cleverness and slyness of the fox in order to get his ends accomplished.\n", "school_info": "School: Shannagh", "metadata": [{"Location:": "Shannagh, Co. Donegal", "Teacher:": "\nJ. Hutchman\n"}, {"Collector": "James Mc Groary", "Gender": "male", "Age": "13", "Address": "Ballydermot, Co. Donegal"}, {"Language": "English"}]}, "4428091/4377416/4435425": {"title": "An Madra Rua agus an Láir", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0636, Page 161", "Page 161"], "url": "https://www.duchas.ie/en/cbes/4428091/4377416/4435425", "text": "\nBhí ferimeoir ann uair amháin agus bhí sean-capall aige, sé an nós a bhíodh ag na daoine fadó ná, nuair a bhíodh na capaill ró-aosta cun obair a dhéanamh chaithidís amacj sa coill iad chun go bhfuigheadh siad bás. Do chuir an feirmeoir an sean-capall amach sa coill lá áirithe agus sé dubhairt sé leis an capall agus é ag imtheacht, dá dtabharfadh sé béir beo abhaile leis go coimeadaidh sé sa stábla an fhaid a marbhadh sé. Do chuireadh amach sa coill é agus bhí sé ag siubhal timcheall an coille ar feadh trí seachtaine nó mar sin agus ar deireadh do chas sé ar an madra ruadh. \"Tá aithne agam ortsa go maith mar is minic do rith mé romhat ar an mbóthar\" arsa an madra ruadh.\"TáTá mise curtha amach sa coill anois mar níl aon mhaith ionnamh mar tá mé ró-aosta chun an obair a dhéanamh agus féadainn dul abhaile arís dá dtabharfadh mé béir beó abhaile liom\"\"Tá fhios agam áit ina bhfuil sean-ceann agus bí ceann óga agus tá a lán cleasanna agam\" arsa an madra ruadh. \"Rachaidh mé go dtí an áit agus abrócaidh mé leis an ceann óg go bhfuil láir marbh sa coill, mar bíonn bainnt mór ag an béir ar feoil an capaill marbh\n(continues on next page)\n", "school_info": "School: Gleann Garbh, Lios Mór", "metadata": [{"Location:": "Glengarra, Co. Waterford", "Teacher:": "\nEibhlín Bean Uí Chaomháin\n"}, {"Collector": "Éamonn Uí Uinnsudúin", "Gender": "male", "Address": "Glengarra, Co. Waterford"}, {"Language": "Irish"}]}, "4427841/4349511/4440633": {"title": "Wild Animals - The Fox", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0096, Page 793", "Page 793"], "url": "https://www.duchas.ie/en/cbes/4427841/4349511/4440633", "text": "\nWILD ANIMALS. THE FOX.The fox is a very cute animal. He lives in a den near a bog or in a furge hedge. He stays in his den all the day, but when the night comes he goes out to seek prey.When he comes to a farm yard he gives a few barks. If he gets an answer from a dog he wont go to the farm yard.The fox is a big brown animal like a dog with a bushy long tail. When there is no dog to give him an answer he will go to the farm. There are foxes in Cloon More. There are dens there also. They go in the hen house and take out the hens. He throws them over his back, and goes to his den. Sometimes when he has alot of hens and ducks he will bury some of them.He will come again when he is hungry and eat them. He goes out on frosty nights. The fox is very destructive in spring for he\n(continues on next page)\n", "school_info": "School: Baile an Daingin (B)", "metadata": [{"Location:": "Ballindine, Co. Mayo", "Teacher:": "\nSéamus P. Ó Gríobhtha\n"}, {"Collector": "Seán Mc Hugh", "Gender": "male", "Address": "Branraduff, Co. Mayo"}, {"Informant": "John Mc Hugh", "Gender": "male", "Age": "49", "Address": "Branraduff, Co. Mayo"}, {"Language": "English"}]}, "4428221/4386889/4456665": {"title": "The Fox and the Fish", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0795, Page 065", "Page 065"], "url": "https://www.duchas.ie/en/cbes/4428221/4386889/4456665", "text": "\nLong ago a fish train used to go from Cahirciveen to some inland town with fish. Once when the ground was frozen and covered with snow birds and wild animals were starving for want of food. This particular district was infested with foxes. They patrolled the country in packs in search of food.\n(continues on next page)\n", "school_info": "School: Palmerstown", "metadata": [{"Location:": "Palmerston, Co. Dublin", "Teacher:": "\nMrs Tuohy\n"}, {"Informant": "Mr T. MacMahon", "Gender": "male", "Occupation": "feirmeoir"}, {"Language": "English"}]}, "4428136/4381041/4459586": {"title": "Wild Animals", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0647, Page 223", "Page 223"], "url": "https://www.duchas.ie/en/cbes/4428136/4381041/4459586", "text": "\n(continued from previous page)\nmany burrows in some fences and the result is that the fences often fall. The weasel hare never do a great deal of damage at all. Neither does the squirrel. The rat does plenty of damage, around the house especially. He often kills young chickens.The Fox's Cleverness 19:1:1938Long ago a man owned a very big farm. There were many out-houses in this farm. He had a very big hen-house in which he kept many hens. He used to lock the hen-house every night but this night however he forgot to lock the house. The door was open for a part of the night. About eight o' clock a fox came to the hen-house. In he went. Just when the man was about to go to bed he thought about the hen-house. He went out and locked the house. The fox was inside in the house unknown to the man. The fox killed many hens during the night. Next morning when the farmer came out he opened the door of the hen-house\n\n\n\nLong ago a man owned a very big farm.There were many outhouses in this farm. He ha a very big hen-house in which he kept many hens. He used to lock the hen-house every night but this night, however, he forgot to lock the house. The door was open for a part of the night. About eight o'clock a fox came to the hen-house. In he went.Just when the man was about to go to bed he thought of the hen-house. He went out and locked the house. The fox was inside in the house unknown to the man. The fox killed many hens during the night. Next morning when the farmer came out he opened the door of the hen-house\n(continues on next page)\n", "school_info": "School: Tuar an Fhíona, Cluain Meala", "metadata": [{"Location:": "Tooraneena, Co. Waterford", "Teacher:": "\nGearóid Ó Coindealbháin\n"}, {"Collector": "Pádraig Teidhirs", "Gender": "male", "Address": "Cahernaleague, Co. Waterford"}, {"Language": "English"}]}, "4461441/4394999/4461444": {"title": "Scéalta fán Mhadadh Rua - An Madadh Rua agus an Chorr", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1046, Page 101", "Page 101"], "url": "https://www.duchas.ie/en/cbes/4461441/4394999/4461444", "text": "\n1. Ainm: Máire Ni Choileáin2. Seoladh: Gleannchoilmcille i dTír Chonaill3. Aois: 31 bliana4. Gairm Beatha: Múinteóir Scoile5. Car tógadh í: Teidhleann, An Charraig i dTír Chonaill6. Ainm an duine ó'r chualaidh iad: Peigí Ní h-Eigheartaigh (nach maireann)7. Cá mhéad bliadhain ó shoin: 20 bliadhain ó shoin8. Aois an duine eile: 60 bliadhain9. An Áit Chomhnuidhe: Teidhleann i dTírchonaill10. An Dáta ar sgríobhadh an sgéil: Eanáir 1936Bhí madadh ruadh agus an chorr na gcomhnuidhe le chéile ag taobh an chladaigh agus teach beag ceann toigheadh aca. Bhí an chorr 'na bean toighe maith agus bhí croc mór ime deánta aicí réidh le h-aghaidh an mhargaidh, ach ní luaithe an croc lán nó tháinig sgeula go rabh cogadh le theacht agus cuireadh an croc i bhfolach i mbeul na trágha.Lá amháin bhí'n madadh ruadh thuas ag cur tuighe agus sgairt sé amach Hoi! hoi! hoi! Caidé sin ort? arsa'n chorr. \"Tá\" ar seisean \"fear thall annsin 'mo iarraidh le páiste a chongbhailt le baisteadh.\" Ar h-iarraidh mise?\" arsa'n creatúr.\" Níor h-iarradh arsa'n madadh ruadh,\" ach gabh isteach annsin\n(continues on next page)\n", "school_info": "School: Mín na Croise", "metadata": [{"Location:": "Meenacross, Co. Donegal", "Teacher:": "\nMáire C. Ní Choileáin\n"}, {"Informant": "Máire Ní Choileáin", "Gender": "female", "Age": "31", "Occupation": "múinteoir", "Address": "Glencolumbkille, Co. Donegal"}, {"Language": "Irish"}]}, "4428112/4379267/4463045": {"title": "Bean agus Madra Rua", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0641, Page 256", "Page 256"], "url": "https://www.duchas.ie/en/cbes/4428112/4379267/4463045", "text": "\nFadó bhí bean ina cónaí amuigh fén dtuaith. Bhí gé aice agus bhí tigh beag aici agus is ann do bhíodh an gé gach aon oíche.Gairid do'n áit bhí coill beag agus bhí madra ruadh ina cónaí ann. Oidhche anháin cuaidh an bean a chodladh agus níor cuimhnigh sí ar an doras beag a dhúnadh.Tháinigh an madra ruadh amach as an gcoill ag lorg bídh agus nuair a tháinigh sé go dtí an tigh seo chonnaic sé go raibh an doras oscailte agus bhí áthas air. Chuaidh sé isteach agus bhí an gé istigh agus mairbh sé í. Nuair a bhí an\n(continues on next page)\n", "school_info": "School: Baile Mhic Airt, An Rinn", "metadata": [{"Location:": "Ballymacart, Co. Waterford", "Teacher:": "\nTomás Ó Faoláin\n"}, {"Collector": "Máire Ní Thallachán", "Gender": "female", "Address": "Curraghnamaddree, Co. Waterford"}, {"Informant": "Seamus Ó Tallachán", "Relation": "parent", "Gender": "male", "Address": "Curraghnamaddree, Co. Waterford"}, {"Language": "Irish"}]}, "4428112/4379274/4463048": {"title": "An Sionnach agus an Coileach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0641, Page 262", "Page 262"], "url": "https://www.duchas.ie/en/cbes/4428112/4379274/4463048", "text": "\nScéal - An Sionnac agus an (Trát) CoileacTrátnóna amháin bhí sionnac ag lorg bíd. Táinig sé gairid do maca feirmeora.Connaic sé cúig nó a sé de cearca agus coileach in áirde i gcrann.Tar anuas cúgam tá scéal maith agam dib. Thá siothchain deanta idir na h-ainmidhte go léir agus tá an áthas orm. Tá áthas orm-sa leis” ars an coileach ac ní raghaidh mé síos as so go maidin. Act cogair, cím madra ag teacht.O ars an madra ruadh thá sé in am dom bheith ag imtheacht mar tá siad ag fuireach liom sa mbaile agus\n(continues on next page)\n", "school_info": "School: Baile Mhic Airt, An Rinn", "metadata": [{"Location:": "Ballymacart, Co. Waterford", "Teacher:": "\nTomás Ó Faoláin\n"}, {"Collector": "Pádraig Ó Mathghamna", "Gender": "male", "Address": "Coolroe, Co. Waterford"}, {"Informant": "Tomás Ó Mathghamna", "Relation": "parent", "Gender": "male", "Address": "Coolroe, Co. Waterford"}, {"Language": "Irish"}]}, "4428064/4374354/4464675": {"title": "The Fox", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0149, Page 415", "Page 415"], "url": "https://www.duchas.ie/en/cbes/4428064/4374354/4464675", "text": "\nThe fox is a middle sized quadruped. His color is red. He lives on hens and geese. He makes his din in the wood and he brings the meat into the din. Every one is on the foxes track. They set traps for him. When they catch him they make furs out of his skin. They keep his tongue because there is a cure in it. When the fox is barking it is the sign of frost. The fox is the wisest animal of all because if a person is cute they say he is as cute as a fox.\n", "school_info": "School: Sruthán an Aifrinn", "metadata": [{"Location:": "Massbrook Lower, Co. Mayo", "Teacher:": "\nBríd Ní Mhóráin\n"}, {"Collector": "Thomas Grehan", "Gender": "male", "Address": "Massbrook Lower, Co. Mayo"}, {"Language": "English"}]}, "4428335/4396749/4466148": {"title": "A Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1049, Page 49", "Page 49"], "url": "https://www.duchas.ie/en/cbes/4428335/4396749/4466148", "text": "\nOne night a man from Narin went out to Rosbeg for a load of herrings. When the boats came in to the strand the man bought a load of herrings and he put them on his cart and then he started for home. When he was coming in at a very lonely place a hungry fox saw him coming and he knew the man had fish with him. Then the fox went out to the road and he lay down and he closed his eyes. When the man saw him  he threw him up on top of the fish. Then the fox started to throw off some of the herrings and when he had a box full thrown off he jumped off and he ate all the fish he threw off. When the man came to a house at the bottom of a hill he asked the man the house did he want any fish and the man said he wanted a dozen. When the man went to look for the fox the fox was gone and a box full of the fish were gone.\n\n\n\nOne time a man from Narin named James McCole went out to Dunmore to hunt foxes. He was going up to a little hill and he saw a fox with a broken leg coming he followed him with his dog\n(continues on next page)\n", "school_info": "School: Clochar", "metadata": [{"Location:": "Inishkeel, Co. Donegal", "Teacher:": "\nSeán Mac Giolla Bhríghde\n"}, {"Language": "English"}]}, "4428114/4379493/4467327": {"title": "Sprid", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0642, Page 269", "Page 269"], "url": "https://www.duchas.ie/en/cbes/4428114/4379493/4467327", "text": "\n(continued from previous page)\n[-]\n\n\n\nBhí fear ann uair amháin agus bhí a lán cearca aige. Tháinigh madra rua aon oíche. Chuaidh sé isteach i dtig na gcearc. Tigh ceann tuighe ab ea é.Chuaidh sé in áirde ar an tigh agus dhein sé poll. Chuaidh sé síos agus d'ith sé cuid des na cearca. Léim sé in áirde agus thit sé anuas mar bhí bhí sé r-árd. Cuimhnigh sé ar chleas. Shín sé é féin ar an dtalamh.Tháinigh fear an tigh amach ar maidin chun an doras d'oscailt. Chonaic sé an madra rua, Fuair sé an spráinn agus chaith sé amach é.Dúirt sé le bean an tigh \"Déanfaimíd poll tar éis an bhreacfast\". Nuair a bhí an bhreacfast ithe aige chuaidh sé amach. Bhí an madra rua imithe.\n\n\n\nBhí fear istigh i dtigh Eibhlín Ní Foghlua. Ní raibh aon duine istigh ach é féin. Bhí piano istigh ann leis.Bhí sé i lár na h-oíche agus d'airigh sé an coiste gan ceann. Do chroth sé an tigh. Do dhein sé fothrom comh mór san go raibh an piano á imirt. Do stop\n(continues on next page)\n", "school_info": "School: Maol an Chóirne, An Rinn", "metadata": [{"Location:": "Mweelahorna, Co. Waterford", "Teacher:": "\nPilib Ó Foghlú\n"}, {"Collector": "Máire Ní Dhonnabháin", "Gender": "female", "Age": "13", "Address": "Knockanpower Lower, Co. Waterford"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "female", "Address": "Knockanpower Lower, Co. Waterford"}, {"Language": "Irish"}]}, "4428114/4379554/4467869": {"title": "Naomh Bríd", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0642, Page 323", "Page 323"], "url": "https://www.duchas.ie/en/cbes/4428114/4379554/4467869", "text": "\nFadó nuair a bhí Naomh Brighid ag lorg píosa talmhan chun clochair a thógaint air. Chuaidh sí go dtí taoiseach chun píosa talmhan a d'fhágailt uaidh. Taoiseach an-ghortach ba eadh é. D'fhiafraigh sé di dé mhéid a bhí uaithe agus sé an rud a dúirt sé ná \"Níl uaim ach an méid is a chlúdóchadh mo bhrat\". Ansan bhain sí an brat di agus leathnaigh sé amach go dtí go raibh píosa mór talmhan aici.Thug an taoiseach am méid sin, talmhan di agus thóg sí an clochair air.\n\n\n\nBhí bean ann fadó agus bhí an-chuid cearc aici. Bhí tig mór aici dhóibh agus oscailt mór ar bárr an tighe chun go raghadh an t-aer isreach sa tigh.An oíche seo níor chuimhnigh sí ar an oscailt a dhúnadh agus chuaidh an madra rua isteach agus marbhuigh sé an-chuid cearc. Ar maidean tháinigh\n(continues on next page)\n", "school_info": "School: Maol an Chóirne, An Rinn", "metadata": [{"Location:": "Mweelahorna, Co. Waterford", "Teacher:": "\nPilib Ó Foghlú\n"}, {"Collector": "Siobhán Ní Lonáin", "Gender": "female", "Age": "13", "Address": "Mweelahorna, Co. Waterford"}, {"Informant": "Liam Ó hArta", "Gender": "male", "Age": "43", "Address": "Ringville, Co. Waterford"}, {"Language": "Irish"}]}, "4427995/4365726/4468851": {"title": "Gleacaíocht an tSionnaigh", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0132, Page 187", "Page 187"], "url": "https://www.duchas.ie/en/cbes/4427995/4365726/4468851", "text": "", "school_info": "School: Gleann Cuileann", "metadata": [{"Location:": "Glencullin Lower, Co. Mayo", "Teacher:": "\nMáire Ní Loinn\n"}, {"Collector": "Áine Ní Mhaolalaidhe", "Gender": "female"}, {"Language": "Irish"}]}, "4428040/4371293/4473958": {"title": "Foxes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0144, Page 040", "Page 040"], "url": "https://www.duchas.ie/en/cbes/4428040/4371293/4473958", "text": "\nThere are many foxes through the Country at the present time, especially in the woods.Several attempts were made to kill them but failed as foxes are very cute. When there is a hunt the hunters very often catch them.There are foxes' dens in several places throughout the Country. There is one in Mr. J. O'Hara's land Palmerstown, Killala, one in Castle Rea, Killala, one in an island outside Cartoon, and one in Ross, Killala. There is a cure for Whooping Cough on a foxes' tongue.\n", "school_info": "School: Teampall Mhuire", "metadata": [{"Location:": "Carbad Beg, Co. Mayo", "Teacher:": "\nEithne, Bean Uí Mhaonghaille\n"}, {"Collector": "Margaret Lynn", "Gender": "female", "Address": "Cartoon, Co. Mayo"}, {"Informant": "Patrick Jordan", "Relation": "not a relative", "Gender": "male", "Address": "Cartoon, Co. Mayo"}, {"Language": "English"}]}, "4428025/4369247/4474055": {"title": "An Easóg", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0139, Page 632", "Page 632"], "url": "https://www.duchas.ie/en/cbes/4428025/4369247/4474055", "text": "\n(continued from previous page)\nná cath a geobhas in-a gaobhar. Tá cineál eile ann ionnsuigheóchaidh sí duine madadh ná cath. Tá sí an borbh agus crosta agus níl fathcíos faoi rud ar bith  uirrtí agus má fheiceann sí éan in-a  luighe ar an dtalmh béirfidh sí  greim rubhall uirri féin agus béidh sí ag dul thart in-a fáinne agus béidh an t-éan ag faire ar an obhair seo bhéirfidh an easóg léim agus marbhuigheóchaidh sí í.Nodlaigh Mac ConamaraCill Fhir Dubh,Baile an Chaisil,Co. Mhuigheo.27//1/1938Seolad=Mártan  Ó Docharthaigh (65bl)Cill Fhir Dubh,Baile an Chaisil,Co. Mhuigheo.31/1/1938\n", "school_info": "School: Baile an Chaisil B.", "metadata": [{"Location:": "Ballycastle, Co. Mayo", "Teacher:": "\nMícheál de Búrca\n"}, {"Collector": "Séamús Ó Mocháin", "Gender": "male", "Address": "1419748"}, {"Informant": "Seán Mach Giollarnáth", "Gender": "male", "Age": "40", "Address": "1419748"}, {"Language": "Irish"}]}, "4428040/4371371/4474070": {"title": "Spinning Wheels", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0144, Page 118", "Page 118"], "url": "https://www.duchas.ie/en/cbes/4428040/4371371/4474070", "text": "\n(continued from previous page)\ngoing out of fashion.\n\n\n\nFoxes are very common in our district. There are a few foxe's dens in Castle-Reagh wood. There is another one in James Kearne's land also.They often pay a\n(continues on next page)\n", "school_info": "School: Teampall Mhuire", "metadata": [{"Location:": "Carbad Beg, Co. Mayo", "Teacher:": "\nEithne, Bean Uí Mhaonghaille\n"}, {"Collector": "May Killeen", "Gender": "female", "Address": "Cartoon, Co. Mayo"}, {"Informant": "Mrs Killeen", "Relation": "unknown", "Gender": "female", "Address": "Cartoon, Co. Mayo"}, {"Language": "English"}]}, "4428041/4371616/4474627": {"title": "A Ghost Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0144, Page 433", "Page 433"], "url": "https://www.duchas.ie/en/cbes/4428041/4371616/4474627", "text": "\n(continued from previous page)\nwhere they were going for the train to Killala.\n\n\n\nThere is four foxes in our district. They often do great destruction. They kill geese, ducks, hens, and carry them away with them, when they get the chance. They go away ever so far from their dens in search of fowl. They are very hard caught, they are so wise. They come around the houses where the fowl be, and they bring them away, but it is said where there is a dog, and if he barks, that they go away afraid of him, and dos'nt do any damage.\n(continues on next page)\n", "school_info": "School: Teampall Mhuire", "metadata": [{"Location:": "Carbad Beg, Co. Mayo", "Teacher:": "\nEithne, Bean Uí Mhaonghaille\n"}, {"Collector": "Kathleen Mc Hale", "Gender": "female", "Address": "Tooreen, Co. Mayo"}, {"Informant": "Michael Forde", "Relation": "not a relative", "Gender": "male", "Address": "Tooreen, Co. Mayo"}, {"Language": "English"}]}, "4428041/4371652/4474733": {"title": "Foxes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0144, Page 469", "Page 469"], "url": "https://www.duchas.ie/en/cbes/4428041/4371652/4474733", "text": "", "school_info": "School: Teampall Mhuire", "metadata": [{"Location:": "Carbad Beg, Co. Mayo", "Teacher:": "\nEithne, Bean Uí Mhaonghaille\n"}, {"Collector": "Bridie Lynn", "Gender": "female", "Address": "Cartoon, Co. Mayo"}, {"Language": "English"}]}, "4428039/4371122/4474764": {"title": "A Fox", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0143, Page 411", "Page 411"], "url": "https://www.duchas.ie/en/cbes/4428039/4371122/4474764", "text": "\nA fox is supposed to be a very cunning animal and a source of worry to the people who feel uneasy for the safety of their fowl. If a fox enters into a fowl house he will make short work of the hens, ducks, or geese or what ever may be in it. He will make sure to have some for his supper. At night they do the most damage. As a rule the people say the foxes never kill much fowl near where they have their den. They are sure to have some fowl to the den for\n(continues on next page)\n", "school_info": "School: Teampall Mhuire", "metadata": [{"Location:": "Carbad Beg, Co. Mayo", "Teacher:": "\nEithne, Bean Uí Mhaonghaille\n"}, {"Informant": "Michael Rogers", "Gender": "male", "Address": "Rathbaun, Co. Mayo"}, {"Language": "English"}]}, "4427992/4365296/4475633": {"title": "Scéal faoi Shionnach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0131, Page 468", "Page 468"], "url": "https://www.duchas.ie/en/cbes/4427992/4365296/4475633", "text": "", "school_info": "School: Ceathrú Thaidhg", "metadata": [{"Location:": "Carrowteige, Co. Mayo", "Teacher:": "\nPádraig Mag Shamhráin\n"}, {"Collector": "Tomás Ó Sírín", "Gender": "male", "Address": "Carrowteige, Co. Mayo"}, {"Informant": "Micheál Ó Dochartaigh", "Gender": "male", "Address": "Carrowteige, Co. Mayo"}, {"Language": "Irish"}]}, "4427992/4365300/4475651": {"title": "Scéal faoi Iascaireacht", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0131, Page 471", "Page 471"], "url": "https://www.duchas.ie/en/cbes/4427992/4365300/4475651", "text": "", "school_info": "School: Ceathrú Thaidhg", "metadata": [{"Location:": "Carrowteige, Co. Mayo", "Teacher:": "\nPádraig Mag Shamhráin\n"}, {"Collector": "Micheál Ó Conghaile", "Gender": "male", "Address": "Carrownaglogh, Co. Mayo"}, {"Informant": "Seán Ó Conghaile", "Relation": "parent", "Gender": "male", "Address": "Carrownaglogh, Co. Mayo"}, {"Language": "Irish"}]}, "4428034/4370827/4475771": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0142, Page 58", "Page 58"], "url": "https://www.duchas.ie/en/cbes/4428034/4370827/4475771", "text": "\n(continued from previous page)\nning before Fr Sweeney was hanged some people from Newport were crossing a river and noticed a dead fish floating down with the current.\n\n\n\nOne time a fox and a hedgehog met and they agreed to have a strive. In drills of potatoes they were running & there was two hedgehogs in it. When the fox would start running one of the hedgehogs would be at each end of the drill & he was always defeated, because when he would run up the hedgehog at the end above would be before him & when he would run down the one at the end below would be before him.\n\n\n\nOne time a fox was on the road and he seen a man\n(continues on next page)\n", "school_info": "School: Eanach Mór", "metadata": [{"Location:": "Annagh More, Co. Mayo", "Teacher:": "\nMártain Ó Braonáin\n"}, {"Collector": "Mártain Ó Braonáin", "Gender": "male"}, {"Language": "English"}]}, "4428034/4370827/4475775": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0142, Page 58", "Page 58"], "url": "https://www.duchas.ie/en/cbes/4428034/4370827/4475775", "text": "\n(continued from previous page)\nning before Fr Sweeney was hanged some people from Newport were crossing a river and noticed a dead fish floating down with the current.\n\n\n\nOne time a fox and a hedgehog met and they agreed to have a strive. In drills of potatoes they were running & there was two hedgehogs in it. When the fox would start running one of the hedgehogs would be at each end of the drill & he was always defeated, because when he would run up the hedgehog at the end above would be before him & when he would run down the one at the end below would be before him.\n\n\n\nOne time a fox was on the road and he seen a man\n(continues on next page)\n", "school_info": "School: Eanach Mór", "metadata": [{"Location:": "Annagh More, Co. Mayo", "Teacher:": "\nMártain Ó Braonáin\n"}, {"Collector": "Mártain Ó Braonáin", "Gender": "male"}, {"Language": "English"}]}, "4428034/4370827/4475778": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0142, Page 58", "Page 58"], "url": "https://www.duchas.ie/en/cbes/4428034/4370827/4475778", "text": "\n(continued from previous page)\nning before Fr Sweeney was hanged some people from Newport were crossing a river and noticed a dead fish floating down with the current.\n\n\n\nOne time a fox and a hedgehog met and they agreed to have a strive. In drills of potatoes they were running & there was two hedgehogs in it. When the fox would start running one of the hedgehogs would be at each end of the drill & he was always defeated, because when he would run up the hedgehog at the end above would be before him & when he would run down the one at the end below would be before him.\n\n\n\nOne time a fox was on the road and he seen a man\n(continues on next page)\n", "school_info": "School: Eanach Mór", "metadata": [{"Location:": "Annagh More, Co. Mayo", "Teacher:": "\nMártain Ó Braonáin\n"}, {"Collector": "Mártain Ó Braonáin", "Gender": "male"}, {"Language": "English"}]}, "4428034/4370828/4475780": {"title": "The Fox and the Fish", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0142, Page 59", "Page 59"], "url": "https://www.duchas.ie/en/cbes/4428034/4370828/4475780", "text": "\n(continued from previous page)\ncoming with a horse and creels and the fox guessed that it was fish he had, and so it was. The fox lied down on the road and when the man came along he threw the fox across on the horse. According as the horse was going the fox was throwing out the fish, and when he had enough thrown out he jumped down off the horse and off (he went) gathering the fish. When the man seen that he said to himself \"Nach raibh mé i mo amadán go léir.\"\n\n\n\nOne time a fox had her den under a cliff at the sea. She could up the cliff alright but could not get down as good. The only way she had was a briar that was growing at the top of the cliff and she used to catch it in her mouth and sling down on it. The huntsmen were out after her a few times and she escaped. At last they found out her plan and they cut the briar. She was coming and the hounds after her and she could not get the briar and she ws dashed to pieces on the rocks in front of her den.\n\n\n\nOne time a fox met a cat and he asked the cat \"How many tricks have you?\" \"Well I have only one good trick\"said the cat. The fox said he had ten and ten times as many as he could think of. No sooner than they had that said didn't they see the hound coming and the cant ran up a tree. The fox ran this way and\n(continues on next page)\n", "school_info": "School: Eanach Mór", "metadata": [{"Location:": "Annagh More, Co. Mayo", "Teacher:": "\nMártain Ó Braonáin\n"}, {"Collector": "Mártain Ó Braonáin", "Gender": "male"}, {"Language": "English"}]}, "4428034/4370828/4475788": {"title": "The Fox and the Fish", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0142, Page 59", "Page 59"], "url": "https://www.duchas.ie/en/cbes/4428034/4370828/4475788", "text": "\n(continued from previous page)\ncoming with a horse and creels and the fox guessed that it was fish he had, and so it was. The fox lied down on the road and when the man came along he threw the fox across on the horse. According as the horse was going the fox was throwing out the fish, and when he had enough thrown out he jumped down off the horse and off (he went) gathering the fish. When the man seen that he said to himself \"Nach raibh mé i mo amadán go léir.\"\n\n\n\nOne time a fox had her den under a cliff at the sea. She could up the cliff alright but could not get down as good. The only way she had was a briar that was growing at the top of the cliff and she used to catch it in her mouth and sling down on it. The huntsmen were out after her a few times and she escaped. At last they found out her plan and they cut the briar. She was coming and the hounds after her and she could not get the briar and she ws dashed to pieces on the rocks in front of her den.\n\n\n\nOne time a fox met a cat and he asked the cat \"How many tricks have you?\" \"Well I have only one good trick\"said the cat. The fox said he had ten and ten times as many as he could think of. No sooner than they had that said didn't they see the hound coming and the cant ran up a tree. The fox ran this way and\n(continues on next page)\n", "school_info": "School: Eanach Mór", "metadata": [{"Location:": "Annagh More, Co. Mayo", "Teacher:": "\nMártain Ó Braonáin\n"}, {"Collector": "Mártain Ó Braonáin", "Gender": "male"}, {"Language": "English"}]}, "4428034/4370830/4475796": {"title": "The Fox and the Cat (1)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0142, Page 60", "Page 60"], "url": "https://www.duchas.ie/en/cbes/4428034/4370830/4475796", "text": "\n(continued from previous page)\nthat way and he was caught and torn to pieces. \"I see\" said the cat, \"one good trick is better than ten bad ones\"\n\n\n\nOne day a fox met a cat and they had a conversation about the ways they used to escape from their enemies. The fox said he would run after the cat and if he would catch her he would eat her. Then the cat said \"I have only one chance and if I fail I am a lost cat\". So the fox gave a sharp look and jumped after the cat. But before the fox could look the cat was above on a big tree looking down. The cat played a trick on the fox that time.\n\n\n\nOnce there was a fox and  he went into a house where there was geese and he killed all of the geese. When he had them all killed he could not get out because it was in the roof he came and there was a window but it was too far up. So the fox thought of a plan. The plan was to gather all the geese and make a lump of them, then he might reach the window. But he heard some noise and he knew it was the farmer, so what did he do but stretch himself on the floor. The farmer came in and saw the fox but thought he was dead. He went in to see the geese and when the fox got him gone the he scampered off.\n\n\n\nOne day a fox was out walking in a wood and he\n(continues on next page)\n", "school_info": "School: Eanach Mór", "metadata": [{"Location:": "Annagh More, Co. Mayo", "Teacher:": "\nMártain Ó Braonáin\n"}, {"Collector": "Mártain Ó Braonáin", "Gender": "male"}, {"Language": "English"}]}, "4428034/4370830/4475800": {"title": "The Fox and the Cat (1)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0142, Page 60", "Page 60"], "url": "https://www.duchas.ie/en/cbes/4428034/4370830/4475800", "text": "\n(continued from previous page)\nthat way and he was caught and torn to pieces. \"I see\" said the cat, \"one good trick is better than ten bad ones\"\n\n\n\nOne day a fox met a cat and they had a conversation about the ways they used to escape from their enemies. The fox said he would run after the cat and if he would catch her he would eat her. Then the cat said \"I have only one chance and if I fail I am a lost cat\". So the fox gave a sharp look and jumped after the cat. But before the fox could look the cat was above on a big tree looking down. The cat played a trick on the fox that time.\n\n\n\nOnce there was a fox and  he went into a house where there was geese and he killed all of the geese. When he had them all killed he could not get out because it was in the roof he came and there was a window but it was too far up. So the fox thought of a plan. The plan was to gather all the geese and make a lump of them, then he might reach the window. But he heard some noise and he knew it was the farmer, so what did he do but stretch himself on the floor. The farmer came in and saw the fox but thought he was dead. He went in to see the geese and when the fox got him gone the he scampered off.\n\n\n\nOne day a fox was out walking in a wood and he\n(continues on next page)\n", "school_info": "School: Eanach Mór", "metadata": [{"Location:": "Annagh More, Co. Mayo", "Teacher:": "\nMártain Ó Braonáin\n"}, {"Collector": "Mártain Ó Braonáin", "Gender": "male"}, {"Language": "English"}]}, "4428034/4370830/4475802": {"title": "The Fox and the Cat (1)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0142, Page 60", "Page 60"], "url": "https://www.duchas.ie/en/cbes/4428034/4370830/4475802", "text": "\n(continued from previous page)\nthat way and he was caught and torn to pieces. \"I see\" said the cat, \"one good trick is better than ten bad ones\"\n\n\n\nOne day a fox met a cat and they had a conversation about the ways they used to escape from their enemies. The fox said he would run after the cat and if he would catch her he would eat her. Then the cat said \"I have only one chance and if I fail I am a lost cat\". So the fox gave a sharp look and jumped after the cat. But before the fox could look the cat was above on a big tree looking down. The cat played a trick on the fox that time.\n\n\n\nOnce there was a fox and  he went into a house where there was geese and he killed all of the geese. When he had them all killed he could not get out because it was in the roof he came and there was a window but it was too far up. So the fox thought of a plan. The plan was to gather all the geese and make a lump of them, then he might reach the window. But he heard some noise and he knew it was the farmer, so what did he do but stretch himself on the floor. The farmer came in and saw the fox but thought he was dead. He went in to see the geese and when the fox got him gone the he scampered off.\n\n\n\nOne day a fox was out walking in a wood and he\n(continues on next page)\n", "school_info": "School: Eanach Mór", "metadata": [{"Location:": "Annagh More, Co. Mayo", "Teacher:": "\nMártain Ó Braonáin\n"}, {"Collector": "Mártain Ó Braonáin", "Gender": "male"}, {"Language": "English"}]}, "4428034/4370831/4475803": {"title": "The Fox and the Crab Race", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0142, Page 61", "Page 61"], "url": "https://www.duchas.ie/en/cbes/4428034/4370831/4475803", "text": "\n(continued from previous page)\nmet a crab. They had a conversation and at last the fox said \"you are a very lazy-looking fellow.\" Then the crab said \"you are as selfish as you look, but if we went for a race I bet you would fail\" \"Well let us try\"(said the fox) and they went and got marks and put them up. Then after a while they started and what did the crab do but jump on the fox's tail. Then the fox ran as fast as he could and when he reached the mark he shouted to the crab that he had failed. Then the crab got off the fox's tail and said he had not failed.\n\n\n\nOne day a fox was going through a wood and he met a hedge-hog. He told her he was very thirsty and he wanted a drink and he could not get any water. Then the hedge-hog brought him to a pit and the fox told the hedge-hog to go down and bring up some water. So the hedge-hog went down and the fox pulled her up again with the water-he drank enough. Then the hedge-hog got thirsty and she went down for water. When she was coming up she wanted the fox to pull her up. The fox would not but ran away laughing about the hedge-hog.\n", "school_info": "School: Eanach Mór", "metadata": [{"Location:": "Annagh More, Co. Mayo", "Teacher:": "\nMártain Ó Braonáin\n"}, {"Collector": "Mártain Ó Braonáin", "Gender": "male"}, {"Language": "English"}]}, "4428039/4371240/4475969": {"title": "Crickets", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0143, Page 529", "Page 529"], "url": "https://www.duchas.ie/en/cbes/4428039/4371240/4475969", "text": "\n(continued from previous page)\nif they can get them.\n\n\n\nFoxes are very cunning little animals, They stay in the dens during the day and they come out in search of food during the night. A Fox never steals fowl except they are a long bit away from where he has his den.\n(continues on next page)\n", "school_info": "School: Teampall Mhuire", "metadata": [{"Location:": "Carbad Beg, Co. Mayo", "Teacher:": "\nEithne, Bean Uí Mhaonghaille\n"}, {"Collector": "Bearnadetta O' Hara", "Gender": "female", "Address": "Breastagh, Co. Mayo"}, {"Informant": "Mrs O' Hara", "Gender": "female", "Address": "Breastagh, Co. Mayo"}, {"Language": "English"}]}, "4428280/4391673/4478282": {"title": "Aibítir na Soupers", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1035, Page 4", "Page 4"], "url": "https://www.duchas.ie/en/cbes/4428280/4391673/4478282", "text": "\nA = cupla tigeB = branndhaiC = CandaD =bow an' arrowE = eaglaisF = FatherG = SpeacloirH = baraI = cois reacaJ = CamanK = eocairL = ladyM = im a cur ar do preataiN = An rud is giorra dóÓ = faínninP = pipinQ = ruball a madaidhR = draidh a mdaidS = eascorT = CroisínU = chrompánU = da chrompánX = A croich ceasthaY = An easZ = Aine.Rimeadh dearmad é so a chur isteach - bhí sé sa leabhar nó taéTá an píosa so le fághail7 mbealoideas Nodlaig 1936\n\n\n\nAn RáideogachSin an tSaileóg bheag a bíos ag fás ag taoibh na locha. Fásann sé go han-mhín agus beag agus sí an chiall atá le é a bheith chomh beag íseal as tá sé gurb as an [adhmuid?] sin a rinneadh croich-chéasta ar slánuigtheora agus go bhfuil sé faoi crann smóla ó [shoin?] (Nansaí Ní Ceallaican 78)\n\n\n\nAn Madadh Ruadh agus an GearrfhiadhBhí an gearrfhiadh ag rathaidh suash Taobh na malacha (i fánaidh) nuair a bhí an madadh ruadh ag teacht amach as a bhrocach (=pluais).“Fan orm a ghearrfiadh go rabh tamall cómhráidh agaim ná leóga is fada ó chonnaic mé tú”“Ní dhe mhaithe liomsa tá tú ag caint ach gheall ar do bholg”, agus sgiorr an gearrfhiadh isteach sa raitneach.\n", "school_info": "School: Cineal Conaill", "metadata": [{"Location:": "Garvagh, Co. Donegal", "Teacher:": "\nAntoin Ó Dochartaigh\n"}, {"Collector": "(name not given)", "Gender": "male"}, {"Informant": "Donnchadh Ó Sléibhín, Dinny Neddy ", "Gender": "male", "Age": "57", "Address": "Edergole, Co. Donegal"}, {"Language": "Irish"}]}, "4428347/4397748/4483393": {"title": "An Madadh Rua", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1052, Page 130", "Page 130"], "url": "https://www.duchas.ie/en/cbes/4428347/4397748/4483393", "text": "\nBhí saor beo in Éirinn ‘san t-sean am agus pósadh é. Nuair a bhí sé trí mhí posta, dimthigh sé ag cuarthú oibre. Casadh fear air an lá céadna agus thug obair dó. Char fhiarr an saor tuarasdal agus char thairg an fear é. Bhí sé ag obair do’n fhear ar feadh (ce) fiche bliadhan. Ag dheireadh an ama sin, thoisigh sé ag smaoituí ar an bhaile agus ar an mnaoi a d’fág sé ‘na dhiaidh. D’innis sé do’n mhaighistir nach bhfuair seisean scolb nó scéal (uadh-san) o na mhnaoi le fiche bliadhan agus nach bhfuair sise scolb nó sceal uadh-san agus go gcaithfeadh sé dhul ag amarc ci’aca raibh sí beo nó marbh. Thug an maighistir madadh ruadh dó, teannta istigh\n(continues on next page)\n", "school_info": "School: An Sealgán", "metadata": [{"Location:": "Shallogan Beg, Co. Donegal", "Teacher:": "\nRóis Ní Bhraonáin\n"}, {"Informant": "Seán Ó Ghloinn", "Gender": "male", "Address": "Lougherrig, Co. Donegal"}, {"Language": "Irish"}]}, "4428334/4396328/4486159": {"title": "A Clever Fox", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1048, Page 353", "Page 353"], "url": "https://www.duchas.ie/en/cbes/4428334/4396328/4486159", "text": "\nAbout 50 yrs ago the people of the Point suffered much from the  depredations of a fox. Hens disappeared nightly and ultimately men with guns kept watch for him. He was so clever however that they could not get within range of him. He became so bold that he actually took away the hens in daytime when the women were feeding them. On one of these occasions a number of young men gave chase and followed the fox over to the cliff bound shore. The fox disappeared over a cliff which had a sheer drop of 70 or 80 ft to the rocks below. When the young men reached the place and looked down the concluded that the foxe's days were ended. However the hens continued to disappear and the people recognised the old fox again. He was hunted again and disappeared at exactly the same spot. A curious young man, on examining the spot noticed that a briar bush overhung the precipice. Lying in hiding close by, he saw the fox on the occasion of the third hunt swing himself over the cliff by the aid of the briar and land on a ledge a few feet down. The briar was partially severed for the fourth hunt and the fox dropped to the bottom of the cliff & was killed.\n", "school_info": "School: Cronaghbois", "metadata": [{"Location:": "Crannogeboy, Co. Donegal", "Teacher:": "\nCriostóir Ó Beirn\n"}, {"Language": "English"}]}, "4428363/4400107/4486359": {"title": "An Fear agus an Madadh Rua", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1058, Page 1d", "Page 1d"], "url": "https://www.duchas.ie/en/cbes/4428363/4400107/4486359", "text": "\nBhí fear uair amháin i na chomhnuidhe istoigh i nGabhla. San am sin ní rabh acht beirt no triur i na gcomhnuidhe ar na h-oileain. Oidhche amháin chiún socair chualaidh an fear seo tormán amuigh fa'n bhoitheach. Thug an tormán seo iongantas do agus chuaidh sé amach go bhfeiceadh sé caidé bhí ann. Nuair a d'fhosgail sé doras an bhoithigh caidé fuair sé acht an madadh ruadh ag piocadh an chearc is fearr a bhí ann. Ní dhearn an fear a dhath acht dhul isteach 'un toighe arais agus thug leis an pice féire a bhí i gcúl an dorais aige agus chuaidh amach 'un bhoithigh arais. Nuair a d'fosgail sé an doras bhí an madadh ruadh ag gabhail amach ar an fhuinneog agus leis an rása bhí leis ag\n(continues on next page)\n", "school_info": "School: Céideadh", "metadata": [{"Location:": "Keadew, Co. Donegal", "Teacher:": "\nE. Mac Suibhne\n"}, {"Collector": "Searlas Ua Baoghaill", "Gender": "male", "Address": "Keadew, Co. Donegal"}, {"Informant": "Eoghan Mac Cumhaill", "Gender": "male", "Occupation": "táilliúir", "Address": "Keadew, Co. Donegal"}, {"Language": "Irish"}]}, "4428369/4400289/4487841": {"title": "Ainmhithe Fiáine - Madadh Rua", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1059, Page 133", "Page 133"], "url": "https://www.duchas.ie/en/cbes/4428369/4400289/4487841", "text": "", "school_info": "School: Tráigh Éanna", "metadata": [{"Location:": "Trawenagh Bay, Co. Donegal", "Teacher:": "\nP. Mac Giolla Bhríghde\n"}, {"Language": "Irish"}]}, "4428376/4401102/4491997": {"title": "Mar Beireadh ar an Mhadadh Rua", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1062, Page 104", "Page 104"], "url": "https://www.duchas.ie/en/cbes/4428376/4401102/4491997", "text": "", "school_info": "School: An Clochán Liath (Dungloe)", "metadata": [{"Location:": "Dunglow, Co. Donegal", "Teacher:": "\nDoiminic Ó Ceallaigh\n"}, {"Informant": "Séamus Ó Domhnaill", "Gender": "male", "Age": "82", "Occupation": "múinteoir", "Address": "Meenagolan, Co. Donegal"}, {"Language": "Irish"}]}, "4428376/4401103/4491998": {"title": "Ramarán fán Mhadadh Rua", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1062, Page 105", "Page 105"], "url": "https://www.duchas.ie/en/cbes/4428376/4401103/4491998", "text": "", "school_info": "School: An Clochán Liath (Dungloe)", "metadata": [{"Location:": "Dunglow, Co. Donegal", "Teacher:": "\nDoiminic Ó Ceallaigh\n"}, {"Collector": "Pádraig Ó Gallchobhair", "Gender": "male"}, {"Informant": "Padaí Uí Dhubhtaigh", "Gender": "male", "Age": "76", "Occupation": "feirmeoir", "Address": "Dunglow, Co. Donegal"}, {"Language": "Irish"}]}, "4428376/4401122/4492004": {"title": "An Madadh Rua a Chuaigh go hÁrainn", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1062, Page 122", "Page 122"], "url": "https://www.duchas.ie/en/cbes/4428376/4401122/4492004", "text": "", "school_info": "School: An Clochán Liath (Dungloe)", "metadata": [{"Location:": "Dunglow, Co. Donegal", "Teacher:": "\nDoiminic Ó Ceallaigh\n"}, {"Collector": "Pádraig Ó Gallchobhair", "Gender": "male"}, {"Informant": "Domhnall Breathnach", "Gender": "male", "Age": "62", "Occupation": "tiománaí", "Address": "Dunglow, Co. Donegal"}, {"Language": "Irish"}]}, "4497967/4345147/4497971": {"title": "The Fox and the Geese", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0088, Page 033", "Page 033"], "url": "https://www.duchas.ie/en/cbes/4497967/4345147/4497971", "text": "\nWhen I was eighteen years of age, I was sent as a boy to my uncle, who lived at the foot of Nephin. The place was infested with foxes. This night, though we had the hen-house barred, the fox tore a hole in the thatch roof of the hen-house. My uncle had a powerfull little dog and he made great noise when he heard the hen's fluttering. My uncle and myself went out and to our great surprise we got the fox within among the hen's. I caught the fox and we put her under a box. Next day I went to see her and she had three cubs. There was to be a fox hunt in Kildare and a gentleman from Ballina would give ten pounds to the one who would catch a live fox for him. The gentleman came to the house and we gave him the fox, but I kept the three cubs. I was feeding them on milk and bones. In a week after the fox came home with a goose slung on his back. At the same time the dog ran out and the goose dropped an egg. My aunt set the egg under a clucking hen and from that day to this my uncle has the finest breed of geese\n(continues on next page)\n", "school_info": "School: Baile Uí Fhiacháin", "metadata": [{"Location:": "Newport, Co. Mayo", "Teacher:": "\nT. Ó Ceallaigh\n"}, {"Collector": "John J. O' Malley", "Gender": "male", "Occupation": "pupil"}, {"Informant": "Thomas Mulchrone", "Relation": "unknown", "Gender": "male", "Address": "Carrow More, Co. Mayo"}, {"Language": "English"}]}, "4498009/4345499/4498038": {"title": "A Story - A Clever Fox", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0088, Page 438", "Page 438"], "url": "https://www.duchas.ie/en/cbes/4498009/4345499/4498038", "text": "\nWhen Lord Sligo married he had a lot of money and his wife had as much more. He sent to France for engineers to engineer the town. They began making the Mall. They built the three bridges. They set the trees. They made the streets and marks at place. They built houses. They made the block and finished the castle.\n(continues on next page)\n\n\n\nOne day as a man was going to town with an ass an cleeves. He had the full of the two Cleeves of fish to sell. He met a dead fox on the road and he threw his across the straddle. Every time the man would not be looking the fox would throw a fish across the wall out of the cleeve. This went on for a good while. But the fox made a mistake. He took them all out of the one cleeve and after a while the ckeeves toppled over because one cleeve was much heavier than the other. Off jumped\n", "school_info": "School: Ceathrú an Chalaidh", "metadata": [{"Location:": "Carraholly, Co. Mayo", "Teacher:": "\nBrian Mac Aodhgáin\n"}, {"Collector": "Florrie Gibbons", "Gender": "female"}, {"Informant": "Austin Gibbons", "Relation": "grandparent", "Gender": "male", "Age": "76"}, {"Language": "English"}]}, "4428337/4396592/4499694": {"title": "Scéal - Móirí agus an Mada Rua", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1049, Page 258", "Page 258"], "url": "https://www.duchas.ie/en/cbes/4428337/4396592/4499694", "text": "\nSgéal : Móirí agus an Madadh RuadhPadraig Mac Giobúin        mar ar leath 10Bhí bean 'na comhnuidhe ar an Chlochar thíos annsin agus bhí bó amháin aici.Ins an tSamhradh chruinnigheadh sí an méid bainne a bhí ag an bhuin i gcóir an Gheimhridh. Bhíodh madadh ruadh fa'n teach aici 'na chomhnuidhe. Chruinnigh sí tubán ime. Diarr sí ar an mhadadh ruadh dul leithí 'na cnuic lá amháin go gcuirfeadh siad tubán an ime. D'imtgigh siad leo agus chur siad tubán an ime.Maidin lá thar na mhárach d'éirigh an madadh ruadh go luath agus d'iarr sé ar Mhóirí toirtín aráin a dheánamh dó , go raibh aige le dul ar thuras an-fhada. Rinne Móirí an toirtín do'n mhadadh ruadh. D'imthigh sé leis go dtí tubán an ime\n(continues on next page)\n", "school_info": "School: Na Cruacha", "metadata": [{"Location:": "Croaghgorm or Blue Stack Mountains, Co. Donegal", "Teacher:": "\nMáire C. Ní Chinnéide\n"}, {"Collector": "Máire C. Ní Chinnéide", "Gender": "female", "Address": "Kilrean, Co. Donegal"}, {"Informant": "Pádraig Mac Giobúin", "Gender": "male", "Age": "73", "Address": "Dergroagh, Co. Donegal"}, {"Language": "Irish"}]}, "4497975/4345195/4500467": {"title": "The Bold Undaunted Fox", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0088, Page 133", "Page 133"], "url": "https://www.duchas.ie/en/cbes/4497975/4345195/4500467", "text": "\nI am a bold undaunted foxThat never was before on tramp.My rent, poor rates and taxesI was willing to payI made my denIn prime good landBetween Tipperary and Athlone,Where my forefathers livedOne thousand years ago.But now of lateI have got my tradeFrom one who was a fool or knaveHe told me I should quit the placeAnd show my face no moreAs soon as he ejected me,I thought it was full time to flee,I murdered all his ducks and geese,His ganders and his drakes.I knew I could no longer stand,Because he had the hounds at handI tightened up my garters,\n(continues on next page)\n", "school_info": "School: Maol Raithnighe", "metadata": [{"Location:": "Mallaranny, Co. Mayo", "Teacher:": "\nAn tSiúr Philomena\n"}, {"Collector": "Colm Ó Caitigín", "Gender": "male"}, {"Language": "English"}]}, "4498009/4345500/4501111": {"title": "A Story - A Clever Fox", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0088, Page 439", "Page 439"], "url": "https://www.duchas.ie/en/cbes/4498009/4345500/4501111", "text": "\n(continued from previous page)\nas the old fox and he had enough fish for the year.\n\n\n\nLong ago there was a fox in Clare island. He was eating all the hens and ducks and geese that were on the island. The often tried to kill him but they never succeeded. One day as they were following him they found his den. It was in the side of a bank but the bank was to steep to get down to the den. The watched the fox another time and they found out his way for getting in to his den. He used to jump from the top and catch a long briar in his mouth on the way down and it would let him swing into the den. One day they let down a man with a rope and cut the briar. The followed him again and he ran for his den as usual. When he jumped over the bank he found that there was no briar and he fell down on the cliffs and was killed.\n", "school_info": "School: Ceathrú an Chalaidh", "metadata": [{"Location:": "Carraholly, Co. Mayo", "Teacher:": "\nBrian Mac Aodhgáin\n"}, {"Collector": "Florrie Gibbons", "Gender": "female"}, {"Informant": "Austin Gibbons", "Relation": "grandparent", "Gender": "male", "Age": "76"}, {"Language": "English"}]}, "4498043/4345660/4504748": {"title": "The Fox and the Deer", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0089, Page 111", "Page 111"], "url": "https://www.duchas.ie/en/cbes/4498043/4345660/4504748", "text": "\nOnce upon a time a fox was looking for food. As he was going along by the river he got a dead fish. He was just eating it when a deer came along and asked the fox where he had got the fish. The fox told him that he went down to the river and made a hole in the ice and let down his tail and a lot of trout came to bite at it and so they got fastened on to it.Down went the poor deer to the river and did as the cute fox had told him. He waited there a long time on the ice. He felt the trout biting on his tail. He thought he would have a lot of them then at last he tried to pull his tail but he found that it was stuck to the ice. He kept pulling and pulling and at last he pulled the tail of himself. Thats the why a deer has no tail.\n", "school_info": "School: Eaglais", "metadata": [{"Location:": "Burren, Co. Mayo", "Teacher:": "\nS. Ó Mongaigh\n"}, {"Collector": "Michael Neary", "Gender": "male"}, {"Informant": "Michael Neary", "Gender": "male", "Age": "65", "Address": "Burren, Co. Mayo"}, {"Language": "English"}]}, "4428392/4403420/4511586": {"title": "Scéal - An Madadh Rua agus an Gabhar", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1068, Page 414", "Page 414"], "url": "https://www.duchas.ie/en/cbes/4428392/4403420/4511586", "text": "\nBhí madadh ruadh agus gabhar ag siubhal thart lá amháin agus bhí sé iongantach te. Bhí tart ortha agus dubhairt an madadh ruadh leis an ghabhar go siubhalfadh siad leo go bhfeicfeadh siad an bhfuigheadh siad uisge ar bith. Shiubhal siad leo go dtáinig siad go dtí thobar uisge a bhí thios faoi an talamh. Chuaidh siad síos agus d'ól siad a sáit.Nuair a bhí a sáit ólta aca d'amharc siad suas agus bhí sé iongantach árd agus ní rabh fhios aca caidé a dhéanfadh siad. Smaointigh an madadh ruadh go rachadh seisean suas ar dhruim an ghabhair agus d'iarr sé ar ghabhar a dhá chois achur suas ar an bhalla agus go rachadh seisean suas ar a dhruim. Rinne an gabhar mar h-iarradh air.Chuir sé a dhá chos suas ar a dhruim. Dubhairt an madadh ruadh leis an ghabhar go bhfuighadh sé greim dhá adharc air agus go dtabharfadh sé aníos é. Nuair a chuaidh an madadh ruadh amach shuas ar bharr, shiubhal sé leis thart agus nuair a b'fhada leis an ghabhar nach rabh sé ag dul a thabhairt suas, chuir sé ceist air nach rabh sé ag  dul a sheasamh do na ghealltanas. A amadáin bocht arsa an madadh ruadh dá mbéadh oiread céille agat agus tá de fhéasóg ort ní bhéadh tú thíos annsin anois.\n", "school_info": "School: Luinneach", "metadata": [{"Location:": "Lunniagh, Co. Donegal", "Teacher:": "\nEoghan Mac Giolla Chomhghaill\n"}, {"Collector": "Sadhbha Ní Bhaoighill", "Gender": "female", "Address": "Stranabrooey, Co. Donegal"}, {"Informant": "Nuala Ní Bhaoighill", "Gender": "female", "Age": "76", "Address": "Stranabrooey, Co. Donegal"}, {"Language": "Irish"}]}, "4428393/4403603/4511846": {"title": "An Giota Óir", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1069, Page 029", "Page 029"], "url": "https://www.duchas.ie/en/cbes/4428393/4403603/4511846", "text": "\n(continued from previous page)\nléithe an t-ór agus chuir sí isteach i mbocsa a bhfolach é. Bhí an fear bocht go cliste agus go bhfachaidh sé an bocsa ina rabh an t-ór ann, agus nuair a bhí siad uilig ina gcodhladh thug sé leis an t-ór agus bhí sé go saidhbhir ó sin amach\n\n\n\nBhí madadh ruadh istigh ar an oileán lá amháin agus bhí sé ag ithe na gcearc ar na daoine agus bhí siad ag iarraidh é a mharbhadh.Lá amháin nuair a tháinig an madadh ruadh amach as an poll, tchídh sé an fear ina dhiaidh. Luigh sé síos ar\n(continues on next page)\n", "school_info": "School: Luinneach", "metadata": [{"Location:": "Lunniagh, Co. Donegal", "Teacher:": "\nEoghan Mac Giolla Chomhghaill\n"}, {"Collector": "Anna Nic Aodhachain", "Gender": "female", "Age": "15"}, {"Informant": "Caitlín Nic Aodhacháin", "Gender": "female", "Age": "45"}, {"Language": "Irish"}]}, "4428392/4403537/4511982": {"title": "Scéal - An Madadh Rua agus an Coileach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1068, Page 531", "Page 531"], "url": "https://www.duchas.ie/en/cbes/4428392/4403537/4511982", "text": "\nScéal an Mádadh Ruadh agus an Coileach.Cuaidh mádadh ruadh isteach na gcearc lá amháin agus bhí na cearca uilig ar an urlár ag iche  gcodach. Leim siad uilig suas ar an áradh ach amháin an coileach.Chuir an mádhad ruadh a dhá chois suas i mullach an choilligh agus annsin thóg sé anuas ag tabhairt buidheachas  do óna go raibh trád breáigh aige.Nuair a fuair an coileach a dhá chois toghea suas léim sé suas ar an n-áradh i gcuideachra na gcearc.Bhí an mádadh ruadh ag dul iart agus dubhairt sé leis an choileach. \"Ó\" gab anuas na tá sioshán déanta ladar beachaigh allsa an domháin. Níl fhios agam arsain coileach cé an fear aggus an cú bán é suíd aniar. Máis sin mar tá arsain mádhad ruadh is fearr do duine bheirthnar shuimbhal. Ó nach corraidh arsa coileach nar síl mé go rabh síoshán deánta ladarbeachaigh allsa an domhain.Sioshán na troid é arsin mádadh ruadh  is fearr do duine a beirt ar shuimbhal agus d'imigh sé.Domhnall Mac Giolla Easbuig Sraid na bruige Doirí-beaga aois13blÁodh Mac Giolla Easbuig  aois 42bl\n", "school_info": "School: Luinneach", "metadata": [{"Location:": "Lunniagh, Co. Donegal", "Teacher:": "\nEoghan Mac Giolla Chomhghaill\n"}, {"Collector": "Domhnaill Mac Giolla Easbuig", "Gender": "male", "Age": "13", "Address": "Stranabrooey, Co. Donegal"}, {"Informant": "Áodh Mac Giolla Easbuig", "Gender": "male", "Age": "42", "Address": "Stranabrooey, Co. Donegal"}, {"Language": "Irish"}]}, "4428392/4403558/4512078": {"title": "Scéal Pisreogach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1068, Page 552", "Page 552"], "url": "https://www.duchas.ie/en/cbes/4428392/4403558/4512078", "text": "", "school_info": "School: Luinneach", "metadata": [{"Location:": "Lunniagh, Co. Donegal", "Teacher:": "\nEoghan Mac Giolla Chomhghaill\n"}, {"Collector": "Anna Nic Aodhachain", "Gender": "female", "Age": "14", "Address": "Corveen, Co. Donegal"}, {"Informant": "Caitlín Nic Aodhachain", "Gender": "female", "Age": "45", "Address": "Corveen, Co. Donegal"}, {"Language": "Irish"}]}, "4428363/4400117/4514883": {"title": "Maidrín Rua", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1058, Page 1n", "Page 1n"], "url": "https://www.duchas.ie/en/cbes/4428363/4400117/4514883", "text": "\nLá amháin bhí cú na luige taobh amuigh do theach. Chonnaic sé maidrín ruadg ag rith thart. Rith sé na  dhiaidh í brath greim á fhaghail ar as é á mharbhughadh. Ach rith an maidrín ruadh annsuid agus annseo go dtí sa deireadh tháinig sé fhad le choill. Bhí fear ag grarradh adhmaid sa choill seo. Diarr an maidrín ruadh ar é á leigint í bhfolach í gcúl na gcrann. \"Tá go maith arsa an fear.\" Tamall na dhisiadh sin tháinig an chú fhad leis an fhear agus arsa seisean \"Bhfaca tú maidrín riadh ag rith thart áit ar birh annseo\". Níor labhair an fear ach chroith sé á  mhéar siar í gcul na gcrann ag taisbean an áit á rabh an maidrín ruadh í bhfolach ann d'on cú ach ní raibh fhios ag an chú caié bhí sé ag deanamh agus eith sé ar shiubhal. Nuair a dimthigh an chú tháinig an maidrín ruadh amach agus ar siubhal leis.Scairt an fear oibre na dhiaidh\n(continues on next page)\n", "school_info": "School: Céideadh", "metadata": [{"Location:": "Keadew, Co. Donegal", "Teacher:": "\nE. Mac Suibhne\n"}, {"Collector": "Sorcha Ní Chnáimhsighe", "Gender": "female", "Address": "Keadew, Co. Donegal"}, {"Informant": "Brighid Bean Uí Chnáimhsighe", "Relation": "parent", "Gender": "female", "Address": "Keadew, Co. Donegal"}, {"Language": "Irish"}]}, "4493643/4406757/4517600": {"title": "An Sionnach agus an Cat", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1078, Page 184", "Page 184"], "url": "https://www.duchas.ie/en/cbes/4493643/4406757/4517600", "text": "", "school_info": "School: Doire Chasáin", "metadata": [{"Location:": "Derrycassan, Co. Donegal", "Teacher:": "\nTomás Mac Fhionghaile, Brighid Ní Cheallaigh\n"}, {"Collector": "Éamonn Mac Laithbheartaigh", "Gender": "male", "Address": "Downies, Co. Donegal"}, {"Informant": "Donnchadh Mac Laithbheartaigh", "Gender": "male", "Age": "76", "Address": "Downies, Co. Donegal"}, {"Language": "Irish"}]}, "4493655/4407993/4520447": {"title": "Scéal an Mhadaidh Ruaidh", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1081, Page 332", "Page 332"], "url": "https://www.duchas.ie/en/cbes/4493655/4407993/4520447", "text": "\nBhí fear uasall ann aon uair amhain agus bhí fear aige ag coimhead coillidh is ag baint bhrosna do na crainn.Bhí teach aige i gcionn na coilleadh agus dá mhadadh ag congbhailt cuideachta leis. Bhí clar ins an doras a rachadh ar aghaidh agus ar gcúl do reir mar bhéadh na madaidh ag gabhail amach no ag teacht isteach. Thainic an fear na bhaile trathnóna agus ultach brosnaigh leis. Chuir sé síos teine agus d'fhag sé a phíopa líonta ar an stól i gcois na teineadh. Chuaidh sé a luighe annsin, é féin, níos mó le sgíste a dheanamh no dúl a chodladh.Bhí sé ag amharc amach go pleisiúrach ar an teinidh a bhí lósta mar bhéadh teine fhéile Eoghan ann. Nuair goidé chuir an clar ar aghaidh ach madadh ruadh.Shuidh sé síos i gcois na teineadh as thóg sé píopa an fhir de'n chathaoir. Chuir sé a cheann isteach sa teinidh agus thúsaigh sé chaitheadh an phiopa, Go nadurtha le an fhear a bhfaca tú ariamh. \"Do chorp 'un Diabhail a rógaire\" arsan fear, agus fearg mór air, agus leim sé amach as a leabaidh. \"An ag caitheamhmp phíopa ata tú? Dar siud as dar seo da mbéadh mo ghunna comhgarach damhsa, teine is toit de chineal eile bheireann duitse agus rud na dearn tú margadh ar a shoin . \"Leóga\", arsan madadh ruadh, \"Shílidh tu do fhéin do fhear threan. Ach is\n(continues on next page)\n", "school_info": "School: Tearmonn", "metadata": [{"Location:": "Termon, Co. Donegal", "Teacher:": "\nAodh Ó Duibhne\n"}, {"Collector": "Seán Mac Gairbheach", "Gender": "male", "Address": "Tirkillin, Co. Donegal"}, {"Informant": "Eiblin Ní Múireadhaigh", "Gender": "female", "Address": "Curreen, Co. Donegal"}, {"Language": "Irish"}]}, "4493655/4408043/4520556": {"title": "Éan Bocht Scoite", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1081, Page 377", "Page 377"], "url": "https://www.duchas.ie/en/cbes/4493655/4408043/4520556", "text": "", "school_info": "School: Tearmonn", "metadata": [{"Location:": "Termon, Co. Donegal", "Teacher:": "\nAodh Ó Duibhne\n"}, {"Collector": "Aodh Ó Duibhne", "Gender": "male", "Occupation": "múinteoir"}, {"Informant": "Eibhlín Ní Mhuireadhaigh", "Gender": "female", "Address": "Curreen, Co. Donegal"}, {"Language": "Irish"}]}, "4493689/4411098/4527949": {"title": "Ainmhithe Allta", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1091, Page 474", "Page 474"], "url": "https://www.duchas.ie/en/cbes/4493689/4411098/4527949", "text": "\nAn madadh ruadhAn brocLuchóg bheagLuchóg FhranncachAn giarrfaidhAn fearadAn frogAn coinínCat fiadhainAn éasógAn rónMadadh uisgeÁirc sléibhteGrianóg fhéirAn sionnach\n\n\n\nBhí fear ina chomhnuidhe sa chnoc agus ní rabh aon duine aige ach é fhéin. Bhí madadh ruadh sa chnoc. Bhí poll ar bhun an dorais agus thiocadh an madadh ruadh isteach achan oidhche agus luigheadh sé ar leic na teineadh. Ní thiocfadh leis an fhear fhágháil eadar é fhéin agus an doras am ar bith. Ach oidhche amháin tháinig an madadh ruadh isteach agus fuair an fear\n(continues on next page)\n", "school_info": "School: Caiseal (2)", "metadata": [{"Location:": "Cashel Glebe, Co. Donegal", "Teacher:": "\nSeán Ó Domhnaill\n"}, {"Collector": "Suibhán Ní Fhríghil", "Gender": "female", "Address": "Tullyconnell, Co. Donegal"}, {"Informant": "Micheál Ó Fríghil", "Gender": "male", "Occupation": "feirmeoir", "Address": "Tullyconnell, Co. Donegal"}, {"Language": "Irish"}]}, "4493689/4411102/4527955": {"title": "Ainmhithe Allta", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1091, Page 478", "Page 478"], "url": "https://www.duchas.ie/en/cbes/4493689/4411102/4527955", "text": "\nAn sionnachAn brocAn madadh ruadhAn ghreanóg féirEasógAn franncachAn madadh uisceAn rónAn giarrfiadhAn coinínAn cat fiadhainAirc sléibheAn frogAn mhuc mára\n\n\n\nBhí cearc mhór bhán ann aon uair amháin agus bhí a shúil ag an mhadah ruadh I gcomhnuidhe uirthí. Ach lá amháin nuair a fuair sé an chearc amuigh ag cruinneadh brosnach, isteach leis agus siar faoin tábla leis. Nuair a tháinig an chearc isteach leis an bhrosnach, chuir sí síos teine mhór agus annsin thionntuigh sí thart chun an pandaí a fhaghailt chun bolgam a dhéanamh díthe féin, ach le sin féin\n(continues on next page)\n", "school_info": "School: Caiseal (2)", "metadata": [{"Location:": "Cashel Glebe, Co. Donegal", "Teacher:": "\nSeán Ó Domhnaill\n"}, {"Collector": "Maighréad Nig Reannacháin", "Gender": "female", "Address": "Gortnatraw North, Co. Donegal"}, {"Informant": "Máire Bean Nig Reannacháin", "Gender": "female", "Age": "45", "Occupation": "oibrí tí", "Address": "Gortnatraw North, Co. Donegal"}, {"Language": "Irish"}]}, "4493760/4417628/4531090": {"title": "A Story - Fox", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1112, Page 083", "Page 083"], "url": "https://www.duchas.ie/en/cbes/4493760/4417628/4531090", "text": "\nA StoryFoxLong ago when the Gaels were evicted out of their lands, they had to go back to the hills and try to find a living because the Planters got their lands and they were left with none. They had little to live on. What they lived on most was sheep. To keep sheep they had to herd their sheep by day and they had to put them into a house at night. If they did not do so they would soon have no sheep for the foxes would kill and cat them. The people got tired sitting out in the cold but what were they to do for they needed the wool of the sheep to make clothes\n(continues on next page)\n", "school_info": "School: Naomh Aicnidh", "metadata": [{"Location:": "Buncrana, Co. Donegal", "Teacher:": "\nRistéard Ó hAoláin\n"}, {"Collector": "Edward Jackson", "Gender": "male", "Address": "Gortleck, Co. Donegal"}, {"Informant": "Neil Jackson", "Gender": "male", "Address": "Gortleck, Co. Donegal"}, {"Language": "English"}]}, "4562126/4561672/4562218": {"title": "Sionnach Glic", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0022, Page 0090", "Page 0090"], "url": "https://www.duchas.ie/en/cbes/4562126/4561672/4562218", "text": "", "school_info": "School: Cill Chuana", "metadata": [{"Location:": "Kilcoona, Co. Galway", "Teacher:": "\nLiam Ó Conáin\n"}, {"Informant": "Seán Ó Cuinneagáin", "Gender": "male", "Age": "60", "Occupation": "feirmeoir", "Address": "Bunatober, Co. Galway"}, {"Language": "Irish"}]}, "4566056/4562805/4569639": {"title": "Scéal - Leigheas na Caillí", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0024, Page 0240", "Page 0240"], "url": "https://www.duchas.ie/en/cbes/4566056/4562805/4569639", "text": "", "school_info": "School: Corr an Droma", "metadata": [{"Location:": "Corrandrum, Co. Galway", "Teacher:": "\nBreandán Ó Míodhcháin\n"}, {"Informant": "Bean Uí Sgiréud", "Gender": "female", "Age": "73", "Occupation": "oibrí tí", "Address": "Kilgill, Co. Galway"}, {"Language": "Irish"}]}, "4566056/4562806/4569640": {"title": "An Sionnach Uaibhreach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0024, Page 0241", "Page 0241"], "url": "https://www.duchas.ie/en/cbes/4566056/4562806/4569640", "text": "", "school_info": "School: Corr an Droma", "metadata": [{"Location:": "Corrandrum, Co. Galway", "Teacher:": "\nBreandán Ó Míodhcháin\n"}, {"Informant": "Bean Uí Sgiréud", "Gender": "female", "Age": "73", "Occupation": "oibrí tí", "Address": "Kilgill, Co. Galway"}, {"Language": "Irish"}]}, "4566064/4563741/4571676": {"title": "The Fox and the Goat", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0026, Page 0131", "Page 0131"], "url": "https://www.duchas.ie/en/cbes/4566064/4563741/4571676", "text": "\nOne upon atime there were a man; and he kept two pets ÷ a fox and a goat. The two pets would follow him where ever he'd go. This day he went for a swim; he brought some sandwitches with him, for it was a long journey. The two pets followed him. He went for a long swim, the two pets got very hungry. The fox knew where the sandwitches were kept. He poked them out of the man's pocket; and he ate every one of them; when he had it eaten he rubbed some crumbs of the goat's whiskers. When the man came out after the swim; he was very hungry  and he found all the sandwitches gone. He noticed the crumbs on the goat's whiskers ∵ and he took him to be the thief. The man got very angry with the goat. He killed the goat, and the fox was his greatest pet after that again.\n", "school_info": "School: Beárna Dhearg (B)", "metadata": [{"Location:": "Barnaderg, Co. Galway", "Teacher:": "\nFlaithrí Ó Súilleabháin\n"}, {"Informant": "Kate Healy", "Gender": "female", "Age": "75", "Address": "Barnaderg, Co. Galway"}, {"Language": "English"}]}, "4566064/4563742/4571677": {"title": "Another Story of the Fox's Cleverness", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0026, Page 0132", "Page 0132"], "url": "https://www.duchas.ie/en/cbes/4566064/4563742/4571677", "text": "\nAnother stone of the foxes clevernessLong ago the people used to keep the hens in their dwelling houses.  They had not hen houses of any kind.  This night the fox went in over the window.  This man used to keep the hens at the back-door.  The fox killed every one of them.  When the man got up he found the fox and he having all the hens killed.  The man closed the window and he went out for the fork to kill the fox.  He made sure not to let the fox out the door.  When the man was coming in the door the fox caught his jacket which was on the chair and threw it into the fire.  When the man saw his jacket in the fire he made a haste to save it.  He did not think about closing the door, so the old fox went out the door and was safe as could be.ENDKate Healy,Barnaderg,Co. Galway Age 75\n", "school_info": "School: Beárna Dhearg (B)", "metadata": [{"Location:": "Barnaderg, Co. Galway", "Teacher:": "\nFlaithrí Ó Súilleabháin\n"}, {"Informant": "Kate Healy", "Gender": "female", "Age": "75", "Address": "Barnaderg, Co. Galway"}, {"Language": "English"}]}, "4566082/4565497/4572520": {"title": "Fiach an tSionnaigh", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0032, Page 0042", "Page 0042"], "url": "https://www.duchas.ie/en/cbes/4566082/4565497/4572520", "text": "\nchuaidh club fear amach ag fiadhac an tsionnaigh lá. D'fhan fear aca amuigh dhá fhiach, indhiadh na bhfear eile ar fad. D'fhan sé amuigh nó gur bhain an oidhce an lá dhó. Ní raibh a fhior aige cé  dtiocfhadh sé. Chonnaic sé solas fadh a radairc uaidh, agus dubhairt sé leis féin go dtaraingeóchadh sé air. Bhí sé féin agus a chapall ag imtheacht thar sgeachaibh, clocha agus gach rud dá raibh ar an mbealach go dtí an solas, bhí an capall indon léimhreach thairis. Nuair a bhí siad go dtí teach an tsoluis, bhuail an fear ar an doras. D'fiashruig fear an tighe cé bhí annsin, agus céard a bhí uaidh. Dubhairt an marcach go raibh lóistín ag teastáil uaidh go maidin. ''bhel'', adeir fear an tighe, ''ní fhéadfhaidh mé aon lóistín a thabhairt duit.'' ''Nach bféadfá mé a fhághail faoi dhíon an tighe go maidin'' ars an marcach. ''Thairs sin féin'' adeir fear an tighe, ''níl aon stábla agam le n-aghaidh do chapaill. ''Níl mise ag iárraidh aon stábla le na h-aghaidh, fanfadh sí ceangailte annsin ag an doras go maidin,'' arsa an marcach. ''Thairis sin féin,'' adeir fear an tighe, tá trioblóid ar bhean an tighe. Dubhairt an ''nurse'' go raibh an\n(continues on next page)\n", "school_info": "School: Baile Chláir na Gaillimhe (C)", "metadata": [{"Location:": "Claregalway, Co. Galway", "Teacher:": "\nEibhlín Bean Mhic Suibhne\n"}, {"Informant": "Bhailentín Ó Dubhagáin", "Gender": "female", "Age": "circa 66", "Address": "Montiagh North, Co. Galway"}, {"Language": "Irish"}]}, "4569065/4568312/4575260": {"title": "An Sionnach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0039, Page 0061", "Page 0061"], "url": "https://www.duchas.ie/en/cbes/4569065/4568312/4575260", "text": "\nSan am úd in Éireann nuair a bhíodh na daoine bochta úd feasta chomh maith le na buic mhára. Thárla go raibh fear bocht ann a d'aithneóchadh aon sórt feála a legtaí roimhe.Fuair sé cuireadh le dul chuig suipéar mór a bhí le bheith sa mbaile an oidhch aithrid seo. Annsin dubhairt an buitiléara, \"cuirfidh mé geall nach mbeidh fhios aige cé'n mhías a leagfeas mise roimhe anocht. Thainig an oidhche 's leagadh an mhías bhreágh ghleásta roimh an bhfear bhocht. Nárbh é beo cé'n sort feola a bhí ann. Thug sé súas fé dheireadh 's dubhairt sé, \"Dá fhad da dteigheann an sionnach beirtear fé dheire air.\" Vhuail faitchíos é nuair a chúala, m'anam gur fíos dhuit gur píosa dhe sionnach atá ann. Fuair ssé lúath saothar maith 's scaipeadh a cháil.\n", "school_info": "School: Cros-Bhóthar", "metadata": [{"Location:": "Pollacorragune, Co. Galway", "Teacher:": "\nSeán Ó Maoláin\n"}, {"Language": "Irish"}]}, "4569068/4568649/4575264": {"title": "Scéal faoi Shionnach, Mada, Cat agus Easóg", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0042, Page 0063", "Page 0063"], "url": "https://www.duchas.ie/en/cbes/4569068/4568649/4575264", "text": "\nIs iomdha scéal atá ar bhéal na sean-daoine faoi distheacht an mhadaidh. Tá saghas dadradh ann a thimbhreadh na ba isteach - ceann i ndiadh ceann agus is minic a chonnaic me iad dá dhéanamh. Chonnaic mé madadh a d'fhosglóchadh an doras nuair a bheadh an laiste nó an glas air. Is iomda uair freisin a sábháil madadh fear ó bheith marbh le tarbh nó bó nó aon rud eile. Seo scéal faoi madadh.Bhí fear agus bhean uair amháin agus chuaidh siad ar chuairt go dtí teach carad agus d'fhag siad na páistíbh agus cúpla duine eile i na ndiaidh i na gcodladh go sámh. Ní raibh siad i bhfad ag teacht na carad go dtáicin an madadh agus é ag caoineadh agus ag tafann. Do chuir sé a dhá chois thart ar mhuinéal an fhir agus do dhírigh chun an dorais é.Thuig an fear agus an bhean annsin go raibh rud eicínt as bealach agus chuaigh said abhaile go scifreach. Nuair a tháinig siad go dtí sin céard a d'fheicfeadh siad ach an teach ag lasadh agus gan aoinne de'm mhuinntir a bhí istigh i na dhúiseacht. Ní raibh an tine i bhfad tosuighthe agus dá bháirgh sin bhí chuile rud sábhailte mar gheall ar chomh chríonna is a bhí an madadh sin.Seo scéal faoi easóg. Bhí bean ann uair amháíg agus bhí sí ag ag iompódh fataí amuigh ins na páirceanna. fuair ní nead easóige istigh ann agus\n(continues on next page)\n", "school_info": "School: Baile an Mhuillinn (B)", "metadata": [{"Location:": "Milltown, Co. Galway", "Teacher:": "\nPádraic Ó Discín\n"}, {"Collector": "Pádhraic Ó Coisdealbha", "Gender": "male"}, {"Informant": "Máire Ní Coisdealbha", "Gender": "female"}, {"Language": "Irish"}]}, "4569068/4568701/4583548": {"title": "Scéal faoi Shionnach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0042, Page 0115", "Page 0115"], "url": "https://www.duchas.ie/en/cbes/4569068/4568701/4583548", "text": "", "school_info": "School: Baile an Mhuillinn (B)", "metadata": [{"Location:": "Milltown, Co. Galway", "Teacher:": "\nPádraic Ó Discín\n"}, {"Collector": "Seán de Bláca", "Gender": "male"}, {"Informant": "Máire de Bláca", "Relation": "grandparent", "Gender": "female"}, {"Language": "Irish"}]}, "4569069/4568779/4583810": {"title": "Scéal faoi Shionnach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0042, Page 0193", "Page 0193"], "url": "https://www.duchas.ie/en/cbes/4569069/4568779/4583810", "text": "\nSgéal faoi Sionnach. 27-5-38Bhí teach ann úair amháin agus bean agus a mac a bhí beagán simplidhe a bhí ina gcómhnuidhe ann.Bhí go leór cearcaí aca agus oidhrheh amháin d’fhág síad sonas teach na gcearc ar learh-osgaitl ar searmad oicínr. Tháinig an sionnach an oidhrheh sin agus súas leis chuig an loca ins an áir a raibh na cearcaí. Rinne sé ár agus éinleach ar na cearcaí go nach raibh fágcha achc an coileach. Bhí an oiread eihre aige agus bhí sé cómh crom sin, nár féidir leis corruighe ná eirghe achr sá mbeadh sé i ndon eirghe féin ní raibh aon mhaich dó ann mar do dún an coileach an doras.Bhí go Maich agus ní raibh go holc d’imigh an oidhrhe achr níor fhéad an sionnach imrheachr.Nuair a chúala an sionnach an mac ag teachr luighe\n(continues on next page)\n", "school_info": "School: Baile an Mhuillinn (B)", "metadata": [{"Location:": "Milltown, Co. Galway", "Teacher:": "\nPádhraic Ó Discín\n"}, {"Informant": "Tomás Ó Grádaigh", "Relation": "parent", "Gender": "male"}, {"Language": "Irish"}]}, "4583356/4582618/4585709": {"title": "Mac an Rí is a Dheirfiúr", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0061, Page 0125", "Page 0125"], "url": "https://www.duchas.ie/en/cbes/4583356/4582618/4585709", "text": "", "school_info": "School: Doireadh", "metadata": [{"Location:": "Derroogh South, Co. Galway", "Teacher:": "\nPádraig Ó Heidhin\n"}, {"Informant": "Máirtín Breathnach", "Gender": "male", "Age": "54", "Occupation": "feirmeoir", "Address": "Ballard, Co. Galway"}, {"Language": "Irish"}]}, "4583290/4576889/4588138": {"title": "Schools", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0046, Page 0144", "Page 0144"], "url": "https://www.duchas.ie/en/cbes/4583290/4576889/4588138", "text": "\nThere was no school here before Cappagh. They used to go around teaching in barns. There was a man going round called O'Dowd teaching in barns. There was another man going round called Malinn. The scholars brougth him a penny each week.\n\n\n\nThere was in Ireland long ago a great Famine. The people died of hunger. The had to eat Indian meal.Around that time the priests were not allowed to say Mass. There was Mass said in a few houses in Lissavruggy. There was a mass said in Dan Mac Cormac's house in Lissavruggy.\n\n\n\nThere was a fox one time. One night he saw a barn door open. He went in and could not get out\n(continues on next page)\n", "school_info": "School: An Cheapach", "metadata": [{"Location:": "Cappagh, Co. Galway", "Teacher:": "\nSeosamh G. Ó Cléirigh\n"}, {"Collector": "Mary Lohan", "Gender": "female", "Age": "13"}, {"Language": "English"}]}, "4602699/4596299/4606700": {"title": "An Sionnach agus na Fir", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0009, Page 206", "Page 206"], "url": "https://www.duchas.ie/en/cbes/4602699/4596299/4606700", "text": "\nBhí dhá fhear ánn san ám fadó agus bhíodhar le dhul go h-Áirinn. Bhí an bádh locthuighthe san gcaladh achabh mar bhiodhar le n-imtheacht ar thúille na maidhna.Tháinigh sionnach an beallach, agus dhubhairth sé leis fhéin, go raibh beallach maith aige le dul go h-Áirinn. Chaith sé é féin ar an talamh agus leig sé air féin go raibh sé marbh.Nuair a tháinigh na fir ar maidin go dtí an chaladh, chonnachadhar an sionnach ar an gcaladh. Dubaradhar le céile go dtiúrfaidhís go h-Áirinn é, mar nár raibh aon sionnach i n-Áirinn chor ar bith. Rugadar air, chaitheadhar isteac san mbádh é, d'fán sé annsin nó gur shroich an bád Áirinn.Annsin do chaitheadhar amhach ar an\n(continues on next page)\n", "school_info": "School: Cill Chiaráin", "metadata": [{"Location:": "Kilkieran, Co. Galway", "Teacher:": "\nNioclás Mac Aoidh\n"}, {"Collector": "Éithne Ní Dhomhnaill", "Gender": "female", "Age": "13", "Address": "Kylesalia, Co. Galway"}, {"Informant": "Micheál Ó Domhnaill", "Gender": "male", "Age": "62", "Address": "Kylesalia, Co. Galway"}, {"Language": "Irish"}]}, "4591089/4589655/4606813": {"title": "Fox Rids himself of the Fleas", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0012, Page 441", "Page 441"], "url": "https://www.duchas.ie/en/cbes/4591089/4589655/4606813", "text": "\nThere lived on a mountain a wise and cunning fox. He lived in a hole under a rock. After a while he and his nest got full of fleas, and the fox had no ease. One day as he sat at his den he saw in the distance a big lake. Then he tought of a plan he jumped up and plucked a bunch of moss with his mouth and he went too the lake. He held the moss tight in his mouth. Then he backed in slowly into the lake as the water was covering the fox the fleas ran off his legs out his back and into the moss, when the fleas were in the moss he through the moss into the water and drowned the fleas. Then he went to the heather\n(continues on next page)\n", "school_info": "School: Fleasgach", "metadata": [{"Location:": "Flaskagh More, Co. Galway", "Teacher:": "\nSs. Ó Maonaigh\n"}, {"Collector": "William Kelly", "Gender": "male", "Address": "Beagh, Co. Galway"}, {"Informant": "John Grogan", "Gender": "male", "Address": "Roy, Co. Galway"}, {"Language": "English"}]}, "4613671/4607060/4623997": {"title": "Lavally Lake", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0016, Page 166", "Page 166"], "url": "https://www.duchas.ie/en/cbes/4613671/4607060/4623997", "text": "\n(continued from previous page)\nfairy tale but a fact. (end of Mr Connell's ace)\n\n\n\nMrs P. Brennan, Knockmaskill said when she would finish her meals my grandmothers would say:-\"Seact lán déag munboughCríosta bráth bhrigid agus roillig Phádráig go bheanuigh. Dílis de i naomh agus asbhol i anam a Seáin a Stór isteach go bhflaitheas De.Tom B the fatherinlaw (90 yrs of age) heard her  and said \"that's nearly like what I used to say my-self after my meals\":-Díar áw sios le Dia, an fear a tug an bheatha sin duinn. go dtugadh sé bheatha hearie ins na flathais duinn.Go mba seacht míle fearr, bheas muid bliadhain ó indiú in ár gcuid agus in ár grádh Dia agus in ár gcomharsaine míol saoghal agus Sláinte Amen\n\n\n\nHow would you bring a fox and a goose and a sheeve of oats across to the other side of a river, not letting the fox eat the goose, or the goose to eat the oats:-Bring the goose first across leaving the fox and the oats on the other side as the fox won't toatch the oats until you come back again. Then come back again for the sheeve of oats and bring back the gooses with you to the foxes(P.T.O. to page 147 x)\n(continues on next page)\n", "school_info": "School: Gort na Díogha", "metadata": [{"Location:": "Gortnadeeve West, Co. Galway", "Teacher:": "\nSéamus Ó Dochartaigh, Bean Uí Dhochartaigh\n"}, {"Informant": "Thomas Brennan", "Gender": "male", "Age": "91", "Address": "Knockmascahill, Co. Galway"}, {"Language": "English"}]}, "4613694/4609442/4625368": {"title": "Scéalta a Thaispeánas Chomh Glic is atá an Mada Rua", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0065, Page 050", "Page 050"], "url": "https://www.duchas.ie/en/cbes/4613694/4609442/4625368", "text": "\n(1) Deirtear go raibh mada ruadh 'na chómhnuidhe san gcoill annseo fadó. Bhí an aimsir fuair agus ní raibh mórán le n-ithe ag an mada ruadh. An lá seo bhí lic-oighre ar an loch agus shiubhal an mada ruadh amach air go dtí Oilean na Laoí ag féachaint an raibh aon bhiadh ar an oilean i Loch Coirib.Fhaid is bhí sé amuigh ar an oilean do leagh an leach-oighre agus ní raibh aon snámh ag an mada ruadh agus níorbh fhéidir leis teacht i dtír. Thosuigh sé ag machtnamh. Annsin chuimhnigh sé ar phleann. Bhí fhios aige go mbíodh báidh ag teacht isteach ag Oilean na Laoí ag áit áirithe. Chuaidh sé go dtí an áit san agus d'fhan sé ann go bhfaca sé bád ag teacht.Luigh sé síos annsin gan gíog\n(continues on next page)\n", "school_info": "School: Caladh na Muc", "metadata": [{"Location:": "Callownamuck, Co. Galway", "Teacher:": "\n-\n"}, {"Collector": "Ailís Breathnach", "Gender": "female", "Address": "Cloonmore, Co. Galway"}, {"Language": "Irish"}]}, "4613694/4609443/4625369": {"title": "Scéalta a Thaispeánas Chomh Glic is atá an Mada Rua", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0065, Page 051", "Page 051"], "url": "https://www.duchas.ie/en/cbes/4613694/4609443/4625369", "text": "\n(continued from previous page)\ngan míog as. Cheap na bádóirí go raibh sé marbh agus chuireadar isteach sa mbád é len a thabhairt abhaile go ndéanfaidís cocall breagh as a craiceann. D'fhan mo dhuine chómh ciúin is a bhfacha tú ariamh go dtáinig na bádóirí go dtí an caladh ag an dTeach Dóighte. Annsin léim sé amach as an mbád agus thug sé do na bonnaibh é. Ailís Bhreathnach, Cluain Mór, Ros Cathail.II Sgéal eile:-Chuaidh bean go dtí an baile mór lá agus d'fhág sí sicíní i mbosca san gcistinigh roimh dul amach dí. Rinne sí dearmad ar an doras a dhúnadh agus tháinig an sionnach glic isteach. Rinne sé caol díreach ar na sicíníbh.Bhí fear an tighe 'na leaba san seomra agus chuala sé an torann san gcistinigh. Léim sé amach as an leaba agus isteach leis san gcistinigh chómh sgiobtha agus bhí  'na\n\n\n\nII Sgéal eile:-Chuaidh bean go dtí an baile mór lá agus d'fhá sí sicíní i mbosca san gcistinigh roimh dul amach dí. Rinne sí dearmad ar an doras a dhúnadh agus tháinig an sionnach glic isteach. Rinne sé caol díreach ar na sicíníbh.Bhí fear an tighe 'na leaba san seomra agus chuala sé an torann san gcistinigh. Léim sé amach as an leaba agus isteach leis san gcistinigh chómh sgiobtha agus bhí 'na\n(continues on next page)\n", "school_info": "School: Caladh na Muc", "metadata": [{"Location:": "Callownamuck, Co. Galway", "Teacher:": "\n-\n"}, {"Collector": "Maighréad Breathnach", "Gender": "female", "Address": "Burnthouse or Bleanoran, Co. Galway"}, {"Language": "Irish"}]}, "4613694/4609444/4625370": {"title": "Scéal Eile faoin Mada Rua", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0065, Page 052", "Page 052"], "url": "https://www.duchas.ie/en/cbes/4613694/4609444/4625370", "text": "\n(continued from previous page)\nchosaibh.Rinne sé iarracht breith ar an mada ruadh acht rug an mada ruadh ar bhróig leis agus chaith isteach san teine í. D'fhéach an fear leis an bhróg a shábháil agus nuair a d'iompuigh sé thart tásg ná tuairisc ní raibh le fághail ar an sionnach glic. Maighréad Breathnach, Teach Dóighte, Ros Cathail.III Sgéal eile fá'n mada ruadh:-Chuir fear inneall i dtreo uair chun breith ar an sionnach mar bhí sé ag goid a chuid cearch.Ar maidin tháinig an sionnach chun adhbhar dinnéir d'fhághail agus chonnaic sé an trap. \"ha, ha\" ar seisean leis féin ní rachad isteach annsin acht ní imtheochad gan sicín acht oiread.Rug sé ar chloich len a bhéal agus chaith isteach san inneal é. Dhún an chloch an trap. Bhí an bealach réidh annsin agus isteach leis i gcóir adhbhair dinnéir a bhí tuillte go maith aige, dar leis. Máire Ní Fhíle, Cluain Mór, Ros Cathail.\n\n\n\nIII Sgéal eile fá'n mada ruadh:-Chuir fear inneall i dtreo uair chun breith ar an sionnach mar bhí sé ag goid a chuid cearch.Ar maidin tháinig an sionnach chun adhbhar dinnéir d'fhághail agus chonnaic sé an trap. \"ha, ha\" ar seisean leis féin ní rachad isteach annsin acht ní imtheochad gan sicín acht oiread.Rug sé ar chloich len a bhéal agus chaith isteach san inneal é. Dhún an chloch an trap. Bhí an bealach réidh annsin agus isteach leis i gcóír adhbhair dinnéir a bhí tuillte go maith aige, dar leis. Máire Ní Fhíle, Cluain Mór, Ros Cathail.\n", "school_info": "School: Caladh na Muc", "metadata": [{"Location:": "Callownamuck, Co. Galway", "Teacher:": "\n-\n"}, {"Collector": "Máire Ní Fhíle", "Gender": "female", "Address": "Cloonmore, Co. Galway"}, {"Language": "Irish"}]}, "4622963/4617433/4627666": {"title": "Madra Rua na Coille Glaise", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0069, Page 412", "Page 412"], "url": "https://www.duchas.ie/en/cbes/4622963/4617433/4627666", "text": "", "school_info": "School: Ros Muc", "metadata": [{"Location:": "Rosmuck, Co. Galway", "Teacher:": "\nStiofán Ó hOisín\n"}, {"Collector": "Seán Ó Conaire", "Gender": "male", "Address": "Rosmuck, Co. Galway"}, {"Informant": "Pádraig Ó Conaire", "Gender": "male", "Age": "56", "Address": "Rosmuck, Co. Galway"}, {"Language": "Irish"}]}, "4461441/4395003/4631072": {"title": "Scéalta fán Mhadadh Rua - An Madadh Rua agus an Chorr", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1046, Page 105", "Page 105"], "url": "https://www.duchas.ie/en/cbes/4461441/4395003/4631072", "text": "\n(continued from previous page)\nAnois cé d’ith an t-im ar seiseann ‘ Ní mise ar scór ar bith arsan creatúr go crith - eaglach, agus ar an bomaite sin léim an mhadadh ruadh suas uirthí agus d’ith í idear chorp agus chleiteach.\n\n\n\nBhí an madadh ruadh ‘na chomhnuidhe le na mhnaoi i gcró beag ar thaobh na choilleadh agus tráthnóna amhain dar léithe go ndeánadh sí bunnóg bhréag fachoinne’n Dómhnuigh. Chuir sí gach eile sheóirt spíosaraí ann:- uibheacha, im, siúcra as risíní agus nuair a bhí sí réidh bruitthe aicí, chuir sí amach ar an fhuinneóig í le fuaradh. Chonnaic an bhunnóg an madadh ruadh ag teacht agus smaoitigh sí gur bhocht an íde a bheárfadh sé uirthí agus gur bfeárr duithe teitheadh. Léim sí anuas de chlár na fuinneóige agus anuas léithe taobh an chnuic mar béadh rotha ann.Bhí sgaifte páistí ag imirt agus tcídh siad an bhunnóg ag teacht, leig siad uaill mhillteanach astú fhéin agus léim ‘na diaidh ach ní bhfuair siad ach plac thall agus abhfos agus ar siad:-“Ca bhfuil tú gabhail a bhunnoig”?Siar annseo de d’aindeoinLán péin a’ “rathaidh” lán péin a rathaidhSiúd siar an bunnóg.Rith sí léithe go dtáinig sí chuig an dara toigh. Bhí fear\n(continues on next page)\n", "school_info": "School: Mín na Croise", "metadata": [{"Location:": "Meenacross, Co. Donegal", "Teacher:": "\nMáire C. Ní Choileáin\n"}, {"Informant": "Máire Ní Choileáin", "Gender": "female", "Age": "31", "Occupation": "múinteoir", "Address": "Glencolumbkille, Co. Donegal"}, {"Language": "English"}]}, "4461441/4395005/4631074": {"title": "Scéalta fán Mhadadh Rua - An Madadh Rua agus an Bhonnóg", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1046, Page 107", "Page 107"], "url": "https://www.duchas.ie/en/cbes/4461441/4395005/4631074", "text": "\n(continued from previous page)\nNuair a bhí siad giota amach thug an madadh ruadh tomadh duíthche san uisge. An bhfuil tú fliuch anois? “Tom! Tom! Tá! Bhal!” gabh suas ar mo mhuinneach arsan madadh ruadh léithe. Nuair a bhí siad i lár an dean, thug sé tomadh eile dí. “An bhfuil tú fliuch anois”? “Tom! Tom! Tá”! bhal! gabh amach ar mo cheann arsan madadh ruadh leíthe agus rinne sí sin. Dheamhan abhfad go dtug sé tomadh eile dí. An bhfuil tú fluich anois? Tom! Tom! Tá arsa sise. “Gabh anuas ar mo bheul” arsa seiseann agus ní luaithe a rinne sé sin nó d’fosgail sé a bheul agus shlug sé siar í.\n\n\n\nBhí sin ann agus is fad o bhí. Bhí gabhairín curcach a trí micidín beag meannan agus a gasúr beag boic na gcomhnaidhe ar chrimhas na coilleadh. Lá amhain rith an mhóm amach orrthú agus dubhairt an mhathair go rachadh si amach ‘na coilleadh ag cruinniughadh brosna agus d’iárr sí orthú an doras a chongbhail teannta go maith agus gan duine ar bith a leiginn isteach go gcuireadh siad isteach a gcos ar bhun an dorais. “Annsin” arsa sise béidh fhios agaibh mo chos sa agus na leigigidh isteach an madadh ruadh no’n mhac - tire. “Maith go leór” arsa na páistí agus d’imthigh sí.\n(continues on next page)\n", "school_info": "School: Mín na Croise", "metadata": [{"Location:": "Meenacross, Co. Donegal", "Teacher:": "\nMáire C. Ní Choileáin\n"}, {"Informant": "Máire Ní Choileáin", "Gender": "female", "Age": "31", "Occupation": "múinteoir", "Address": "Glencolumbkille, Co. Donegal"}, {"Language": "Irish"}]}, "4602763/4602244/4643722": {"title": "The Farmer and a Fox", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0200, Page 201", "Page 201"], "url": "https://www.duchas.ie/en/cbes/4602763/4602244/4643722", "text": "\n(continued from previous page)\nfoxes killed and knowing how cunning was the fox, the farmer stood in the door with a fine stout stick in his hand ready to kill the fox. The fox as everyone knows is very cute. In the corner beside a big blazing fire were the farmers best Sunday shoes. He made a spring at the shoes and threw them into the fire. The man seeing his fine Sunday shows in the fire ran to rescue them, and the fox quickly seized the opportunity to escape out the open door.\n\n\n\nThe Fox and the Wolf.When wolves were plentiful in Ireland many years a fox and a wolf visited a farmyard in search of food. Seeing the barn door open they went in. Here there were young calves and hens, so that each could have a great meal. The wolf being very hungry and greedy killed and ate to his hearts content so that he was swollen to about twice his usual size. The fox killed fowl and also had a fine meal, but unlike the wolf\n(continues on next page)\n", "school_info": "School: Drumlease", "metadata": [{"Location:": "Drumlease, Co. Leitrim", "Teacher:": "\nThomas Dillon\n"}, {"Collector": "Erwin Armstrong", "Gender": "male", "Address": "Cleen, Co. Leitrim"}, {"Informant": "John Armstrong", "Gender": "male", "Address": "Cleen, Co. Leitrim"}, {"Language": "English"}]}, "4649674/4645532/4650864": {"title": "Scéal an Mhada Rua", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0030, Page 166", "Page 166"], "url": "https://www.duchas.ie/en/cbes/4649674/4645532/4650864", "text": "\nBhí trí mhadadh ar bhruach an locha lá. Bhí siad deallruighthe leis an ocras. Siad na trí mhada a bhí ann, ná an mada allaidh, an mada uisge, agus an mada ruadh. Bhí siad in a suidhe annsin go ceann tamaill ag faire go mbéadh iasg ar fághail aca. Níor fhéad siad aon iasg d’fhághail. Annsin bhuail plan ar an mada ruadh agus dubhairt sé na trí drioball a chur san uisge. Annsin chuir siad na trí driobal san uisge. I gceann tamaill thóg an mada ruadh a driobal as an uisge agus chraith sé a driobal. Annsin chuir sé síos aríst é agus dubhairt sé le na madaidh eile gan a dhriobal a chorrú go mbhainfeadh an t-iasg greim astab. Annsin thóg sé aníos aríst a dhriobal agus dubairt sé an rud chéadhna aríst leobh. Annsin chuir sé síos aríst ann é. I gceann tamaill thóg sé aníos aríst as agus shuidh sé ar bhruach an locha. D’fhan an dá mhada san uisge gur tháinig\n(continues on next page)\n", "school_info": "School: Ceathramha 'n Bhrúnaigh", "metadata": [{"Location:": "Carrowbrowne, Co. Galway", "Teacher:": "\nMíchéal Ó Reachtabhra\n"}, {"Informant": "Máirtín Ó Ruaidhín", "Gender": "male", "Age": "63", "Occupation": "feirmeoir", "Address": "Kilroghter, Co. Galway"}, {"Language": "Irish"}]}, "4605947/4604920/4652504": {"title": "A Story of the Fox", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0206, Page 518", "Page 518"], "url": "https://www.duchas.ie/en/cbes/4605947/4604920/4652504", "text": "", "school_info": "School: Urbal", "metadata": [{"Location:": "Urbal, Co. Leitrim", "Teacher:": "\nGerald Kelliher\n"}, {"Informant": "Francis Earley", "Gender": "male", "Age": "75", "Occupation": "farmer", "Address": "Eden, Co. Leitrim"}, {"Language": "English"}]}, "4605947/4604920/4652506": {"title": "A Story of the Fox", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0206, Page 518", "Page 518"], "url": "https://www.duchas.ie/en/cbes/4605947/4604920/4652506", "text": "", "school_info": "School: Urbal", "metadata": [{"Location:": "Urbal, Co. Leitrim", "Teacher:": "\nGerald Kelliher\n"}, {"Informant": "Francis Earley", "Gender": "male", "Age": "75", "Occupation": "farmer", "Address": "Eden, Co. Leitrim"}, {"Language": "English"}]}, "4605947/4604921/4652508": {"title": "A Story of the Fox", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0206, Page 519", "Page 519"], "url": "https://www.duchas.ie/en/cbes/4605947/4604921/4652508", "text": "", "school_info": "School: Urbal", "metadata": [{"Location:": "Urbal, Co. Leitrim", "Teacher:": "\nGerald Kelliher\n"}, {"Informant": "Francis Earley", "Gender": "male", "Age": "75", "Occupation": "farmer", "Address": "Eden, Co. Leitrim"}, {"Language": "English"}]}, "4666600/4665704/4667044": {"title": "How the Fox Outwitted the Spirit", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0413, Page 079", "Page 079"], "url": "https://www.duchas.ie/en/cbes/4666600/4665704/4667044", "text": "\nLong ago there was a man going on a journey and he went on until he came to a tree. There he saw a spirit tied to the tree. The man looked up and the spirit saw him and said, “If you release me from this tree I will do the whole world for you.” So the man took him down from the tree and they went on until they came to a wood. “Well,” said the spirit, “now it is time for me to kill you.” “Is that my payment?” said the man to the spirit. “That is your payment, there is no good but while the good is doing,” said the spirit. Then the\n(continues on next page)\n", "school_info": "School: Mainistir Ó dTórna", "metadata": [{"Location:": "Abbeydorney, Co. Kerry", "Teacher:": "\nMícheál Ó Ríoghbhardáin\n"}, {"Collector": "P. Hanafin"}, {"Language": "English"}]}, "4658424/4653931/4667254": {"title": "Folktale", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0219, Page 166", "Page 166"], "url": "https://www.duchas.ie/en/cbes/4658424/4653931/4667254", "text": "\n(continued from previous page)\nlet him in. St. Peter said \"no\" because he did not wish for heaven when he had the chance. Will went to purgatory but the devil was there and told Will to go to hell. He went down to hell but the devil was there and would not let him in so he gave him a sheaf of straw lighted and sent him through the bogs. They are the lights that are seen in the bogs at night.\n\n\n\nLong ago there lived a man whose name was Blue Beard and he\n(continues on next page)\n\n\n\nHe gathers a mouthful of moss and swims out in the water. He puts his tail down in the water first, then he keeps going down under the water bit by bit until there is nothing left over the water but his head. When the fleas feel the water they all go to the moss in his mouth. Then the fox spits out the moss and leaves all the fleas behind him.\n", "school_info": "School: Cluain Eich", "metadata": [{"Location:": "Clooneagh, Co. Leitrim", "Teacher:": "\nSr. Ó Donnabhair\n"}, {"Collector": "John Hackett", "Gender": "male", "Address": "Liscloonadea, Co. Leitrim"}, {"Language": "English"}]}, "4672091/4669282/4678909": {"title": "The Sly Fox", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0164, Page 238", "Page 238"], "url": "https://www.duchas.ie/en/cbes/4672091/4669282/4678909", "text": "\nA fox saw a man travelling on the road with a horse. On the horse's back there were two creels well filled with fresh herring.The fox smelled the fish and thought of a plan to get some. This was not easy, as the man had a heavy stick in his hand. What the fox did was to jump in across the fence and run very fast to get well ahead.He then jumped out on to the road again, and lay down pretending to be dead.When the man came up he saw the dead fox and he said :\"You are done for, my boy. I'll take the skin off you and sell it.\"He threw the fox across the horse's back behind the creels, and started off again on his journey, leading the horse. The fox saw that the man could not see him from where he was, so he started taking\n(continues on next page)\n", "school_info": "School: Kilglass", "metadata": [{"Location:": "Kilglass, Co. Sligo", "Teacher:": "\nBean Uí Chléirigh\n"}, {"Informant": "Pat Sheridan", "Gender": "male", "Address": "Kilglass, Co. Sligo"}, {"Language": "English"}]}, "4678387/4675063/4683357": {"title": "Máire Ní Chiostaile", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0420, Page 159", "Page 159"], "url": "https://www.duchas.ie/en/cbes/4678387/4675063/4683357", "text": "\n(continued from previous page)\n'san drurfair-se arís a shíbín.\"Bhí sí chomh tugtha amach san taréis na hoidhche gur ar éigin a bhí sinte siubal abhaile an bhean bhocht.\n\n\n\nTá mada ruadh scubhtha chun báirnigh. bhí sé sa bhfaill an lá so agus chonnaic sé na báirnig amuigh ar charraigh buile beag amach ó bhun na faile. bhí an taoide ag líonadh ach dúbhairn sé go mbeadh blaise beag deas aige ar na báirnig sul a mbeadh an charraig fá loch.   B'seo leis amach agus d'aimsig sé ceann breágh mór des na báirnig. bí sé ag dul do aon bhogadh a bainr aisirigo drí go dtáinig an sáile uirthe. Bogann an saíle an báirneach. Nuair a bhrath sé ag bogadh i shleamhnuig sé a theanga fé biorahc a' bháirnig is ,a briathar má dhein gur fhásg an sliogán ar an dteanga is gur choinnibh\n(continues on next page)\n", "school_info": "School: Scoil N. Íde", "metadata": [{"Location:": "Marhin, Co. Kerry", "Teacher:": "\nÉamonn Ó Catháin\n"}, {"Informant": "Donnchadh Ó Máinín", "Gender": "male", "Age": "73", "Address": "Ballyferriter, Co. Kerry"}, {"Language": "Irish"}]}, "4678387/4675064/4683358": {"title": "Conas a Bháigh an Bairneach an Mada Rua", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0420, Page 160", "Page 160"], "url": "https://www.duchas.ie/en/cbes/4678387/4675064/4683358", "text": "", "school_info": "School: Scoil N. Íde", "metadata": [{"Location:": "Marhin, Co. Kerry", "Teacher:": "\nÉamonn Ó Catháin\n"}, {"Informant": "Donnchadh Ó Máinín", "Gender": "male", "Age": "73", "Address": "Ballyferriter, Co. Kerry"}, {"Language": "Irish"}]}, "4687695/4684690/4688907": {"title": "An Mada Rua agus an Bairneach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0429, Page 153", "Page 153"], "url": "https://www.duchas.ie/en/cbes/4687695/4684690/4688907", "text": "", "school_info": "School: Baile Uí Dhuibhne, Caisleán Ghriaire", "metadata": [{"Location:": "Ballyquin, Co. Kerry", "Teacher:": "\nSeán Ó Loingsigh\n"}, {"Informant": "Mici Breathnach", "Gender": "male", "Age": "67"}, {"Language": "Irish"}]}, "4678394/4676167/4689861": {"title": "Scéal i dtaobh Gliceas an Mhadra Rua", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0422, Page 109", "Page 109"], "url": "https://www.duchas.ie/en/cbes/4678394/4676167/4689861", "text": "\nFadó do bhí fear a bFáthan agus aimsir Aifrinn Dé Domnaigh do bhuail an madra ruadh isteach chuige. Do rith sé go dtí an doras. Nuair a chonnaic an madra ruadh é sin do rith sé go dtí an dorasach bhí  an fear ann roimhe.Do rith an madra ruad go dtí an cliabhán a bhí sa ch uimhne agus do tharraig sé sop tiughe amach as agus chaith sé isteach sa teine é. Rug sé ar an sop arís agus chaith sé anuas ar an leanbh a bhí sa cliabhán é.Nuair a chonnaic an fear e sin do rith sé go dtí an leanbh agus níor cuimhnig sé ar an doras a dhúnadh na dhiaid. Nuair a chonnaic an\n(continues on next page)\n", "school_info": "School: Ceann Trá (Ventry)", "metadata": [{"Location:": "Ventry, Co. Kerry", "Teacher:": "\nD. Ó Cúrnáin\n"}, {"Informant": "Muiris Ó Cíobháin", "Gender": "male", "Address": "Ballinleague, Co. Kerry"}, {"Language": "Irish"}]}, "4701658/4690712/4708442": {"title": "Foxes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0155, Page 456", "Page 456"], "url": "https://www.duchas.ie/en/cbes/4701658/4690712/4708442", "text": "\nwounded badgers probably went in a cave and died.The people do not hunt the badger.\n(continues on next page)\n", "school_info": "School: Doire Leathan, Grange", "metadata": [{"Location:": "Derrylehan, Co. Sligo", "Teacher:": "\n-\n"}, {"Collector": "Seán Ó Cíarain", "Gender": "male", "Address": "Lyle, Co. Sligo"}, {"Language": "English"}]}, "4701738/4697536/4715288": {"title": "The Three Foxes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0181, Page 303", "Page 303"], "url": "https://www.duchas.ie/en/cbes/4701738/4697536/4715288", "text": "\nAt the top of Glen there is a townland in which all the inhabitants were named Fox. This townland got its name as Foxes Town. The three brothers were married and lived there. Their three wives met in Drumkeeran one day and they argued among themselves about their husbands. Each one said her own man was the silliest. They agreed to see which of them would to the silliest act.Next morning one woman said to her husband \"the priest is in Geevagh as long as he is and we never gave him a present. You should drive out that pig that is out in the barn to him\". Off he went with the pig and never stopped untill he arrived with Father Coyle. The parish priest had great welcome for him and\n(continues on next page)\n", "school_info": "School: Airgneach Uachtarach", "metadata": [{"Location:": "Glen, Co. Sligo", "Teacher:": "\nMáire Ní Ruairc\n"}, {"Collector": "Tommy Cullen", "Gender": "male", "Address": "Glen, Co. Sligo"}, {"Informant": "Mrs Cullen", "Gender": "female", "Address": "Glen, Co. Sligo"}, {"Language": "English"}]}, "4742135/4739239/4760477": {"title": "Scéal i dtaobh Sagairt", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0477, Page 155", "Page 155"], "url": "https://www.duchas.ie/en/cbes/4742135/4739239/4760477", "text": "", "school_info": "School: Achadh Tiobraid", "metadata": [{"Location:": "Aghatubrid, Co. Kerry", "Teacher:": "\nTomás Ó Muircheartaigh\n"}, {"Language": "Irish"}]}, "4742135/4739241/4760482": {"title": "Scéalta - Scéal i dtaobh Mada Rua", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0477, Page 157", "Page 157"], "url": "https://www.duchas.ie/en/cbes/4742135/4739241/4760482", "text": "", "school_info": "School: Achadh Tiobraid", "metadata": [{"Location:": "Aghatubrid, Co. Kerry", "Teacher:": "\nTomás Ó Muircheartaigh\n"}, {"Language": "Irish"}]}, "4742129/4738443/4778508": {"title": "An Sionnach agus an Coileach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0475, Page 194", "Page 194"], "url": "https://www.duchas.ie/en/cbes/4742129/4738443/4778508", "text": "\nAn Sionnach agus an CoileachBhí an sionnach t’réis coileach a scuaba leis as fuilín na gcearc uair.  Pamach mór de coilleach reamhar beathuighthe do b’eadh é go raibh lán corcán nuair a tháinig sé chómh fada le an pluais leis.  Do leig sé chuige ar a mbán é chun é marbhú is d’ithe do féin.  Bhí greim aige ar bhaic a’ muiníl air agus a dhá lapa tosaig anuas ar a dromaighe i slí is go raibh a’ fear bocht i gcruadh-chás.  Bhí sé díreach cun an ceann a sciota de nuair a labhair an coilleach.  “Anois a sionnaig” ar seisean “Badh ceart duit bheith ana-bhuidheach do Dhia i dtaobh mise a bheith agat le n’ithe is b’é ba lúgha is badh gann duit a dhéanamh ná altú ód croídhe amac sara n’íosfá mé.  “Bádh mhaith an smaoineamh é gan aon dabht” a dubhairt an sionnach “an té féadfadh altú a deanamh ac sin rud nár tháithigheas riamh is ní h-eól dom connus é déanamh ach chómh beag.  “Ná bíodh san mar leath-scéal agat feasta” ar san coilleac.   Muinfeadh-sa dhuit cionnús altú roimh biadh mas maith leat é.  “Bheinn ana-bhuidheach díot dá ndéanfá” ar san sionnach.  “Tá go maith mar sin.  Chuir do\n(continues on next page)\n", "school_info": "School: Na Cnoicíní", "metadata": [{"Location:": "Garranearagh, Co. Kerry", "Teacher:": "\nSeán S. Ó Cuimín\n"}, {"Informant": "Seán T. Ó Súilleabháin", "Gender": "male", "Age": "54", "Address": "Garranearagh, Co. Kerry"}, {"Language": "Irish"}]}, "4758596/4757660/4784517": {"title": "The Fox and The Woodman", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0950, Page 417", "Page 417"], "url": "https://www.duchas.ie/en/cbes/4758596/4757660/4784517", "text": "\nThe fox and the woodman.A fox chased for a long distance by a pack of hounds, came to a  man who was cutting wood and asked to be shown a place in which to hide himself out of the hounds' reach.  The man told the fox to hide behind a bundle of rushes that were lying near at hand.In a few minutes the hunters came and asked the man if he had seen the fox.  \"I have not\", said the man at the same time pointing his thumb to the place where the animal lay hidden.  The hunters did not know what he meant by the sign and soon went on quickly.When they were out of sight\n(continues on next page)\n", "school_info": "School: Ráth Dairbhe", "metadata": [{"Location:": "Radeerpark, Co. Monaghan", "Teacher:": "\nHenry Mc Kenna\n"}, {"Collector": "Agnes Brady", "Gender": "female"}, {"Informant": "Andrew Brady", "Gender": "male", "Age": "53", "Occupation": "labourer", "Address": "Scarvy, Co. Monaghan"}, {"Language": "English"}]}, "4742083/4734185/4786361": {"title": "Another Fox Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0463, Page 384", "Page 384"], "url": "https://www.duchas.ie/en/cbes/4742083/4734185/4786361", "text": "\nMy Father's Uncle Dan Downning Lohart who is still alive and in our house was a great sportsman in his day. Once upon at time he noticed a fox taking stones on his paw  & settling them there well  & then throwing up the stones at the fowl which perched on branches of an ash tree which was about 10 feet or so from the ground.He did his best in this way to force down the fowl & if he failed it was not his fault. On another occasion a fox pretended to be dead.\n", "school_info": "School: Landsdowne (Cuar na gCoileach)", "metadata": [{"Location:": "Coornagillagh, Co. Kerry", "Teacher:": "\nEibhlín, Bean Uí Súilleabháin\n"}, {"Collector": "Pady Kelly", "Gender": "male", "Address": "Lohart, Co. Kerry"}, {"Informant": "Dan Downing", "Gender": "male", "Address": "Lohart, Co. Kerry"}, {"Language": "English"}]}, "4713225/4709285/4815842": {"title": "The Fox and the Scald-Crow", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0449, Page 318", "Page 318"], "url": "https://www.duchas.ie/en/cbes/4713225/4709285/4815842", "text": "\nLong ago a fox and a scal-crow met and they decided to carry the fish from a little man by the name of Darbie O Drive from \"Barna Bheag\".On Thursday evening as the little man was coming home, the fox laid across the road and pretended to be dead. The little man had just been asked for a fox skin so he was delighted to get the fox. He threw him in the car near the basket of fish and then drove on.Then the fox had his chance, he put his head into the basket and threw the fish out one by one. Then the \"scal-crow\" picked them up quickly and put them on the \"gabhlog\" of an ash tree. This continued until all the fish were out. On one occasion the little man looked back and saw the fox throwing out a fish. The fox knew he was seen and jumped quickly out of the car. The he ran quickly to where the scal-crow had the fish. On landing the scal-crow told him that he wouldn't get any fish so he thought of a plan.He asked the scal-crow for the herring at the bottom so she consented. When she pulled the foundation from the rest of the fish they all fell down and then the fox started laughing. The scal-crow was so mad that she dashed at at the fox but he quickly devoured her saying Id rather a fowl than a fish.\n", "school_info": "School: Brosna (B.)", "metadata": [{"Location:": "Brosna, Co. Kerry", "Teacher:": "\nAonghus Ó Laochdha\n"}, {"Collector": "Dermot Connor", "Gender": "male", "Address": "Carrigeen, Co. Kerry"}, {"Informant": "William Lane", "Gender": "male", "Age": "84", "Address": "Carrigeen, Co. Kerry"}, {"Language": "English"}]}, "4742143/4740280/4816668": {"title": "An Sionnach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0479, Page 154", "Page 154"], "url": "https://www.duchas.ie/en/cbes/4742143/4740280/4816668", "text": "\nLe linn ár sinnsear is mó iad na hainmhidhthe fiadhna a bhí san dtír. Ceann díobh san dob eadh an sionnach. Bhíodar san go hana flúirseach ar fad, agus níl ach foth cheann le feiscint indiú.Nuair a bhéarfaí ortha san, coimeádfaí na fionnaí. Bhí leigheas i dteannga an sionnaigh leis. Bainfidís an teanga de’n mhada ruadh mharbh chun é do chun é do chur le tineas éigint agus do bhíodh ceann díobh i ngach ceanntar.Bhí tíghearna talmhan ins an nGleann uair amháin agus bhí sgata madraí aige istigh in áit le fallaí árda tímpeall air. Bhí staighre ag dul suas go dtí a bharr ó’n dtaobh amuigh. Oidhche amháin chonnaic an tíghearna sionnach ar a bhárr agus é ag léimrigh agus ag feuchaint ar na madraí. Ní rabhadar ábalta ar é do mharbhú.An oidhche a bhí chúghainn chuaidh an Tighearna féin ag faire air, nuair a tháinig sé do chaith sé isteach imeasc na madraí é, agus do stracadar as a chéile é. Do choimeád an tíghearna an teanga. Do leigheas an teanga sin fear le tineas uabhásach in a láimh, agus deirtear go raibh sé tímpeall na h-áite go dtí le fíor déanaighe.\n", "school_info": "School: Baile an Tighearna (Ballyhearnay)", "metadata": [{"Location:": "Ballyhearny West, Co. Kerry", "Teacher:": "\nPartolan Ó Gríbhthín\n"}, {"Collector": "Bríghid Ní Chúipéar", "Gender": "female", "Address": "Tinnies Lower East, Co. Kerry"}, {"Informant": "Máire Ní Chonaill", "Gender": "female", "Age": "73", "Occupation": "pinsinéir", "Address": "Coarha Beg, Co. Kerry"}, {"Language": "Irish"}]}, "4742143/4740281/4816670": {"title": "Sionnach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0479, Page 155", "Page 155"], "url": "https://www.duchas.ie/en/cbes/4742143/4740281/4816670", "text": "\nUair amháin geall le céad is a fiche blian ó thoin do bhí fear bocht na chómhnaidhe i dtigín beag inaice cheann Bhrí.Do bhí cúpla cearca aige agus oidhche amháin do sgiob rud éigint ceann díobh agus do bhí ana fhearg  ar an bhfear mar ní raibh aige ach iad san.Do dhún sé an doras go daingean an oidhche na dhiaidh sin agus lá ar na mháireach d’eirigh sé go moch agus chuaidh sé go dtí chró na gcearc agus ní raibh aon chearc ann agus bhí sé ag féachaint tímcheall agus cad a chonnaic sé ach sionnach mór i gcúinne an chró.Níor dhein an fear aon rud acht dul amach agus bata mór d’fághail chuaidh sé isteach aríst agus do bheir sé ar earball an tsionnaigh agus do bhuail sé é.Do leig an sionnach sgread as agus do shin sé é féin amach agus cheap an fear go raibh sé marbh.Do thóg sé suas é agus do chuaidh sé go dtí a thig féin leis agus chuaidh sé amach chun rann d’fághail chun é chur.Nuair a tháinig sé isteach ní raibh tásg ná tuairisc den sionnaigh le fághail in aon áit d’féach an fear amach agus cad a chonnaic sé acht an sionnach ag dul suas an cnuic dó féin.\n", "school_info": "School: Baile an Tighearna (Ballyhearnay)", "metadata": [{"Location:": "Ballyhearny West, Co. Kerry", "Teacher:": "\nPartolan Ó Gríbhthín\n"}, {"Collector": "Máire Ní Néill", "Gender": "female", "Address": "Tinnies Lower East, Co. Kerry"}, {"Informant": "Pádraig Ó Loingsigh", "Gender": "male", "Age": "42", "Occupation": "feirmeoir", "Address": "Tinnies Lower East, Co. Kerry"}, {"Language": "Irish"}]}, "4811603/4800893/4937103": {"title": "The Fox that was Clifted near Carraig Fhiachna", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0274, Page 112", "Page 112"], "url": "https://www.duchas.ie/en/cbes/4811603/4800893/4937103", "text": "\nAnother fox came into the Island over forty years ago.  He was making a scrios and he had the sign of it - he wasn't a good runner.  They were after him for over a year before they killed him. One day in the month of May there was a crowd of them to the hill gathering sheep for shearing.  When they were coming hither near the tower they started him and off he goes down to the sea - towards the cliffs.  Some of them kept after him and more of them kept higher up.  They cut down across and they shut him off east of Carraig Fhiachna, so he was shut off from the east and the south and there was nothing below him but the cliff.  They were all throwing stones at him and he turned west again along the edge of the cliff.  Inside the point of Carraig Fhiachna there is a narrow cuas running in to the land - tis about 80 feet deep and only about six feet wide.  When he came so far he was closed in from all sides, so he had nothing to do but to jump across the cuas.  He made the\n(continues on next page)\n", "school_info": "School: Oileán Baoi (Dursey)", "metadata": [{"Location:": "Dursey Island, Co. Cork", "Teacher:": "\nEoghan Ó Súilleabháin\n"}, {"Collector": "Seán Ó hUrdaill", "Gender": "male", "Address": "Kilmichael, Co. Cork"}, {"Language": "English"}]}, "4922033/4920681/4954182": {"title": "How the Fox Got Shut (Rid) of the Fleas", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0507, Page 143a", "Page 143a"], "url": "https://www.duchas.ie/en/cbes/4922033/4920681/4954182", "text": "\nHow the fox got shut (rid) of the fleas. The fox was et alive with fleas, so he med up his mind to get shut of them.  He wint to a sheep field and got a few bits of wool from the briars in the ditches and carried them all in his mouth in a little roll, till he came to the bank of the river.  Then he set back very slow into the water and as he went back in, the fleas began to run up from the water. He went on till there was nothing above the water, but his puss, and the little ball of wool he held in the top of his mouth.  All the fleas climbed from the rising water into that and then he let that float down the river.  So that's the way the fox got shut of the fleas.(From several sources in Manister and Croom, but remarkable to relate the Manister version invariably had \"moss\" instead of \"wool\".  Otherwise every version was identical. D.O.C.)\n\n\n\n(Crosta ar dhaoinibh galánta é seo do léigheamh)Once upon a time there was a man very sick.  In fact he was dying, and the doctor who used come to him every day, said he had a lump in his stomach. This day a travelling man called in to the house, and the woman of the house told the man all about her trouble, and how her husband was dying with a lump in his stomach\n(continues on next page)\n", "school_info": "School: Cromadh (B.)", "metadata": [{"Location:": "Croom, Co. Limerick", "Teacher:": "\nDáithí Ó Ceanntabhail\n"}, {"Language": "English"}]}, "4922127/4854624/4957109": {"title": "A Local Funny Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0532, Page 104", "Page 104"], "url": "https://www.duchas.ie/en/cbes/4922127/4854624/4957109", "text": "\nOne morning a fox came to the farm-yard of Michael Butler Cloughkeating to steal a goose. When he had the goose killed he was not able to lift it over the farmyard wall. Twice he tried and failed. He stopped and thought for a minute. He put the goose's head in a hole half way up the wall. He then mounted the wall and took the goose over the wall by the neck.\n", "school_info": "School: Buirgheas Uí Chatháin (B.)", "metadata": [{"Location:": "Borrisokane, Co. Tipperary", "Teacher:": "\nSéamus Gáirnéar\n"}, {"Collector": "Michael Hayes", "Gender": "male", "Age": "14", "Address": "Ballynavin, Co. Tipperary"}, {"Informant": "Mr William Hayes", "Relation": "parent", "Gender": "male"}, {"Language": "English"}]}, "4922215/4861289/5017953": {"title": "Story - The Fox and The Hen", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0554, Page 242", "Page 242"], "url": "https://www.duchas.ie/en/cbes/4922215/4861289/5017953", "text": "\nOnce upon a time there lived in a house all alone a little red hen. She used to go out every day gathering sticks. One day she was going out she saw a fox so she locked the door. When the fox saw her locking the door he crept up along the chimney and he said that he would catch her. When he went up on top of the chimney he could not get in. He said to the little red hen \"Take me down and I won't touch you\". So the little hen took him down. As soon as she did that the fox opened his bag and said now I have you so he put her into the bag. The little hen used always wear an apron and in the pocket she used to keep a scissors a needle and thread. So the fox went home to his house and there were two other young foxes at home to boil the water for the big fox if he had any fowl.\n(continues on next page)\n", "school_info": "School: Cnocán an Teampaill, Ros Gréine", "metadata": [{"Location:": "Knockantemple, Co. Tipperary", "Teacher:": "\nMáire, Bean Nic Aodhagáin\n"}, {"Informant": "Nellie Landy", "Address": "Lagganstown Lower, Co. Tipperary"}, {"Language": "English"}]}, "4811622/4803061/5018532": {"title": "An Chéad Sionnach in Oileán Béarra", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0280, Page 015", "Page 015"], "url": "https://www.duchas.ie/en/cbes/4811622/4803061/5018532", "text": "\nTráth éigin de'n bliadhain bhí dream daoine ag dul amach go dthí Oileán Béara. Díreach nuair a bhíodar ag dul isteach ins' na mbháid chonnacadar sionnach marbh ar an dtráigh agus é sínte amach mara dheadh. Rugadar air agus chaitheadar isteach ins an mbhád é chun é thabhairt amach go dtí Óileán Béara.Chuadar amach do dthí an t-Oileán. Ceangaladar an bád agus chaitheadr an sionnach marbh amach ar an dtráigh.   Chómh luath agus mhothuig an sionnach é féin ar an dtalamh tuirm d'eirig sé agus rith sé chómh mear is do b'fhéidir leis fé dhéin coill mór a bhí i nghioract de'n fhairrge. Is mar sin an slíghe a chuaidh an céad sionnach isteach san Oileán agus táid siad ann o shin.\n", "school_info": "School: Doire an Chairn", "metadata": [{"Location:": "Derreenacarrin, Co. Cork", "Teacher:": "\nNóra, Bean Uí Shéaghdha\n"}, {"Collector": "Síghle Ní Chruadhlaoich", "Gender": "female", "Address": "Leahill, Co. Cork"}, {"Informant": "Míceál Ua Cruadhlaoích", "Relation": "parent", "Gender": "male", "Age": "46", "Address": "Leahill, Co. Cork"}, {"Language": "Irish"}]}, "4922308/4868964/5022727": {"title": "A Clever Fox", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0582, Page 183", "Page 183"], "url": "https://www.duchas.ie/en/cbes/4922308/4868964/5022727", "text": "\nLong ago when the old mill was working there was a man going to his work. When he came to Taylor's' he saw a fox after coming out of Taylor's with a goose. The wall at Taylor's was about twice as high as it is now, and the fox tried to jump it but he couldn't. He climbed up as far as he could and stuck the goose's head in a hole in the wall. When he got up to the top of it, he pulled the goose up after him.\n", "school_info": "School: Dúndroma", "metadata": [{"Location:": "Dundrum, Co. Tipperary", "Teacher:": "\nMrs Ester Jackson\n"}, {"Collector": "Bella Carter", "Gender": "female", "Address": "Dundrum, Co. Tipperary"}, {"Informant": "James Carter", "Gender": "male", "Age": "55", "Occupation": "gardener", "Address": "Tipperary, Co. Tipperary"}, {"Language": "English"}]}, "4922276/4866590/5054334": {"title": "The Fox Chase", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0575, Page 286", "Page 286"], "url": "https://www.duchas.ie/en/cbes/4922276/4866590/5054334", "text": "\n(I)In Bansha woods long time I livedAnd all my generation,Till that grand peer from CurraghmoreDisturbed my habitation,The cry of hound and horn-soundFrom slumber  roused me early,In Father Kane's enclosed demense,I cleared the rural paling.(II)Through hills and dales and verdant vales,I soon reached Bansha Glebe lands,The mill pond I nimbly swam,Close by the \"peelers\" station.Those chaps they thought to make me halt,With loaded guns and bayonets,But Brave Mc Cloud gave them no power,On me to make a seizure.\n(continues on next page)\n", "school_info": "School: Bealach, Bansha", "metadata": [{"Location:": "Ballagh, Co. Tipperary", "Teacher:": "\nS. Meiscill\n"}, {"Language": "English"}]}, "4922268/4866004/5070920": {"title": "Foxes' Cunning", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0573, Page 128", "Page 128"], "url": "https://www.duchas.ie/en/cbes/4922268/4866004/5070920", "text": "\nOne day early old Mrs Burke heard the hen cackling. She dressed as quickly as she could and ran out. The fox was carrying of a hen but when he saw he could not escape he pretended to be dead. She took the hen and caught teh fox by the tail and dragged him back to the house. She often heard how a fox pretended to be dead and escaped afterwards so she put him in the barn and beat him with a stick. The fox rolled himself in a ball so to guard himself. She left and closed the door and came back later. She brought a bill hook with her. She had a job to find him. She killed him.\n\n\n\nA fox stole three ducks from a man. The hounds and horsemen chased the foxed one day and he was coming to the man's farmyard. He couldn't climb the gate but went for the stile. The man was sitting on the stile and he would not allow the\n(continues on next page)\n", "school_info": "School: Sceichín an Rince, Cloichín an Mhargaidh", "metadata": [{"Location:": "Skeheenaranky, Co. Tipperary", "Teacher:": "\nDómhnall Ua Cathasaigh\n"}, {"Informant": "John Rouse", "Gender": "male", "Age": "80", "Address": "Skeheenaranky, Co. Tipperary"}, {"Language": "English"}]}, "4922268/4866004/5070921": {"title": "Foxes' Cunning", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0573, Page 128", "Page 128"], "url": "https://www.duchas.ie/en/cbes/4922268/4866004/5070921", "text": "\nOne day early old Mrs Burke heard the hen cackling. She dressed as quickly as she could and ran out. The fox was carrying of a hen but when he saw he could not escape he pretended to be dead. She took the hen and caught teh fox by the tail and dragged him back to the house. She often heard how a fox pretended to be dead and escaped afterwards so she put him in the barn and beat him with a stick. The fox rolled himself in a ball so to guard himself. She left and closed the door and came back later. She brought a bill hook with her. She had a job to find him. She killed him.\n\n\n\nA fox stole three ducks from a man. The hounds and horsemen chased the foxed one day and he was coming to the man's farmyard. He couldn't climb the gate but went for the stile. The man was sitting on the stile and he would not allow the\n(continues on next page)\n", "school_info": "School: Sceichín an Rince, Cloichín an Mhargaidh", "metadata": [{"Location:": "Skeheenaranky, Co. Tipperary", "Teacher:": "\nDómhnall Ua Cathasaigh\n"}, {"Informant": "Pat Fitzgerald", "Gender": "male", "Address": "Skeheenaranky, Co. Tipperary"}, {"Language": "English"}]}, "4922268/4866005/5070925": {"title": "Foxes' Cunning", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0573, Page 129", "Page 129"], "url": "https://www.duchas.ie/en/cbes/4922268/4866005/5070925", "text": "\n(continued from previous page)\nfor to pass. The fox dropped to the ground. When the hounds were within a hundred yards of him he looked very pitiful at the man, the man said \"I'll leave you go this time.\" The fox escaped and early next morning the man was surprised to see the fox driving three ducks and tipping them with his tail. The man advertised it but as no body claimed them he knew they were his. The fox had shown his gratitude in a strange way.\n\n\n\nA fox used to steal a head from Tom Dunley every day. This morning Tom Dunley and Bill Walsh watched him. Th Fox saw them and stole a hen from Bill Walsh.\n\n\n\nA fox used to go to John Gorman's house for a hen and steal one. After a couple of days John Gorman told John Hennessy to come and watch the fox with his gun.\n(continues on next page)\n", "school_info": "School: Sceichín an Rince, Cloichín an Mhargaidh", "metadata": [{"Location:": "Skeheenaranky, Co. Tipperary", "Teacher:": "\nDómhnall Ua Cathasaigh\n"}, {"Informant": "Jim Scully", "Gender": "male", "Age": "50", "Address": "Skeheenaranky, Co. Tipperary"}, {"Language": "English"}]}, "4922268/4866005/5070928": {"title": "Foxes' Cunning", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0573, Page 129", "Page 129"], "url": "https://www.duchas.ie/en/cbes/4922268/4866005/5070928", "text": "\n(continued from previous page)\nfor to pass. The fox dropped to the ground. When the hounds were within a hundred yards of him he looked very pitiful at the man, the man said \"I'll leave you go this time.\" The fox escaped and early next morning the man was surprised to see the fox driving three ducks and tipping them with his tail. The man advertised it but as no body claimed them he knew they were his. The fox had shown his gratitude in a strange way.\n\n\n\nA fox used to steal a head from Tom Dunley every day. This morning Tom Dunley and Bill Walsh watched him. Th Fox saw them and stole a hen from Bill Walsh.\n\n\n\nA fox used to go to John Gorman's house for a hen and steal one. After a couple of days John Gorman told John Hennessy to come and watch the fox with his gun.\n(continues on next page)\n", "school_info": "School: Sceichín an Rince, Cloichín an Mhargaidh", "metadata": [{"Location:": "Skeheenaranky, Co. Tipperary", "Teacher:": "\nDómhnall Ua Cathasaigh\n"}, {"Informant": "John Moloney", "Gender": "male", "Age": "67", "Address": "Skeheenaranky, Co. Tipperary"}, {"Language": "English"}]}, "4922268/4866006/5070931": {"title": "Foxes' Cunning", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0573, Page 130", "Page 130"], "url": "https://www.duchas.ie/en/cbes/4922268/4866006/5070931", "text": "\n(continued from previous page)\nJohn Hennessy came and watched the fox. This morning the fox went and stole a hen from John Hennessy.\n\n\n\nA man caught a fox in a trap. The man wanted to punish the fox. He got a round stick and started to beat the fox when he thought he was dead he went away. When he was gone the fox got up and ran away.\n\n\n\nOne morning when Thady Kilmartin's faher got u he found all the geese dead in the house and a fox dead there as well. he got the pike and threw the fox out on a heap of dung. When the fox saw he was safe he got up and ran into the wood.\n\n\n\nOnce a fox went into a fowlhouse and killed some hens. He could not get out so he made up his mind to pretend to be dead.\n(continues on next page)\n", "school_info": "School: Sceichín an Rince, Cloichín an Mhargaidh", "metadata": [{"Location:": "Skeheenaranky, Co. Tipperary", "Teacher:": "\nDómhnall Ua Cathasaigh\n"}, {"Informant": "Will Neill", "Gender": "male", "Age": "64", "Address": "Skeheenaranky, Co. Tipperary"}, {"Language": "English"}]}, "4922268/4866006/5070934": {"title": "Foxes' Cunning", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0573, Page 130", "Page 130"], "url": "https://www.duchas.ie/en/cbes/4922268/4866006/5070934", "text": "\n(continued from previous page)\nJohn Hennessy came and watched the fox. This morning the fox went and stole a hen from John Hennessy.\n\n\n\nA man caught a fox in a trap. The man wanted to punish the fox. He got a round stick and started to beat the fox when he thought he was dead he went away. When he was gone the fox got up and ran away.\n\n\n\nOne morning when Thady Kilmartin's faher got u he found all the geese dead in the house and a fox dead there as well. he got the pike and threw the fox out on a heap of dung. When the fox saw he was safe he got up and ran into the wood.\n\n\n\nOnce a fox went into a fowlhouse and killed some hens. He could not get out so he made up his mind to pretend to be dead.\n(continues on next page)\n", "school_info": "School: Sceichín an Rince, Cloichín an Mhargaidh", "metadata": [{"Location:": "Skeheenaranky, Co. Tipperary", "Teacher:": "\nDómhnall Ua Cathasaigh\n"}, {"Informant": "Bridget Fitzgerald", "Gender": "female", "Age": "45", "Address": "Skeheenaranky, Co. Tipperary"}, {"Language": "English"}]}, "4922268/4866006/5070936": {"title": "Foxes' Cunning", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0573, Page 130", "Page 130"], "url": "https://www.duchas.ie/en/cbes/4922268/4866006/5070936", "text": "\n(continued from previous page)\nJohn Hennessy came and watched the fox. This morning the fox went and stole a hen from John Hennessy.\n\n\n\nA man caught a fox in a trap. The man wanted to punish the fox. He got a round stick and started to beat the fox when he thought he was dead he went away. When he was gone the fox got up and ran away.\n\n\n\nOne morning when Thady Kilmartin's faher got u he found all the geese dead in the house and a fox dead there as well. he got the pike and threw the fox out on a heap of dung. When the fox saw he was safe he got up and ran into the wood.\n\n\n\nOnce a fox went into a fowlhouse and killed some hens. He could not get out so he made up his mind to pretend to be dead.\n(continues on next page)\n", "school_info": "School: Sceichín an Rince, Cloichín an Mhargaidh", "metadata": [{"Location:": "Skeheenaranky, Co. Tipperary", "Teacher:": "\nDómhnall Ua Cathasaigh\n"}, {"Informant": "William Walshe", "Gender": "male", "Age": "42", "Address": "Coolagarranroe, Co. Tipperary"}, {"Language": "English"}]}, "4922268/4866007/5070938": {"title": "Foxes' Cunning", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0573, Page 131", "Page 131"], "url": "https://www.duchas.ie/en/cbes/4922268/4866007/5070938", "text": "\n(continued from previous page)\nWhen the man went out in the morning he saw the fox. He went out for a pike to throw him out and while he was gone the fox got up and ran off.\n\n\n\nVIIIOne morning a boy was sent to a wood for firewood. When he was taking the branches he saw as he thought was a red dog. There was a trap on his leg and the boy had pity for him and when he tried to take the trap off his leg he ran across two fields and the boy followed him.  The fox threw himself beside a ditch. The boy took him in his arms and rubbed him. Then he took the trap off his leg and let him on the ground and called him all the names he could think off but the fox did not seem to hear him but lay still on the ground as if he were dead. The boy ran home and told his father. His father came to the place but there was not trace of the fox. One morning a man went across the yard and looked into the geese house. He saw all the geese dead and the fox lying on the floor as if he\n(continues on next page)\n", "school_info": "School: Sceichín an Rince, Cloichín an Mhargaidh", "metadata": [{"Location:": "Skeheenaranky, Co. Tipperary", "Teacher:": "\nDómhnall Ua Cathasaigh\n"}, {"Informant": "Bridget O' Brien", "Gender": "female", "Age": "63", "Address": "Coolagarranroe, Co. Tipperary"}, {"Language": "English"}]}, "4922268/4866008/5070940": {"title": "Foxes' Cunning", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0573, Page 132", "Page 132"], "url": "https://www.duchas.ie/en/cbes/4922268/4866008/5070940", "text": "\n(continued from previous page)\nif he was dead. The man went for a pike to throw him out. He was only half way to where the pike was when the fox ran across the yard.\n\n\n\nIXOne morning a man named John Brien came out to feed the cows and he saw a fox bringing three geese. He had one in his mouth and one across his back and he was driving one before him. He followed him and took them off of him.\n", "school_info": "School: Sceichín an Rince, Cloichín an Mhargaidh", "metadata": [{"Location:": "Skeheenaranky, Co. Tipperary", "Teacher:": "\nDómhnall Ua Cathasaigh\n"}, {"Informant": "Mary Walsh", "Gender": "female", "Age": "87", "Address": "Coolagarranroe, Co. Tipperary"}, {"Language": "English"}]}, "4922272/4866264/5073680": {"title": "Story - A Fox", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0573, Page 384", "Page 384"], "url": "https://www.duchas.ie/en/cbes/4922272/4866264/5073680", "text": "\nStory - A FoxA fox stole into a farmer's yard and when he saw that there was no one inside in the house he went and opened the hasp on the door of one of the houses in the yard. When he saw that there were geese in the house he went and eat some of them. As the farmer was coming into the yard he heard all the noise in the house, he ran into the kitchen for his gun as he knew there were a fox in the house outside in the yard. He stole over to the door with his gun to shoot the fox, but when he looked in he saw the fox lying on the floor \"dead\". He went and caught the fox by the legs and threw him over the wall into a field. When the fox got into the field he ran like the wind and off with him across the country.\n", "school_info": "School: Cloichín an Mhargaidh", "metadata": [{"Location:": "Clogheen Market, Co. Tipperary", "Teacher:": "\nSéamus Ó Teacháin\n"}, {"Informant": "Mr J. Mulcahy", "Gender": "male", "Age": "46", "Address": "Clogheen, Co. Tipperary"}, {"Language": "English"}]}, "5008886/4963830/5077909": {"title": "A Legend of the Foxes at Gormanston's Castle", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0680, Page 049", "Page 049"], "url": "https://www.duchas.ie/en/cbes/5008886/4963830/5077909", "text": "\nDuring the fourteenth century witches were common in Ireland. One of these witches lived in a wood close to Lord Gormanstons Castle. One day as Lord Gormanston was out hunting his huntsmen saw the witch. They started to put the wolf hounds on her but Lord Gormanston had a heart of Gold and as soon as he saw them hunting her he called them back. The witch was so grateful that every time there was a death is Lord Gormanston the witch ordered foxes to lie at the death bed and also attend the funeral. After the funeral they would all go quietly back to the wood.\n", "school_info": "School: Naomh Pádhraic (C.), Droichead Átha", "metadata": [{"Location:": "Drogheda, Co. Louth", "Teacher:": "\nM. Bhreathnach, M. Ní Dhubhainn\n"}, {"Informant": "Mrs Fagan", "Gender": "female", "Age": "45", "Occupation": "oibrí tí", "Address": "Sandyford Terrace, Co. Louth"}, {"Language": "English"}]}, "4428338/4396755/5079696": {"title": "Scéal", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1049, Page 495", "Page 495"], "url": "https://www.duchas.ie/en/cbes/4428338/4396755/5079696", "text": "\nOidhce amhain bhí fear agus bean na shuidhe ag an teinidh ag chomhrad. Ní rabh siad i bhfad na shuide nuair a thainig sgairt go dtí an fhuinneog ag rabh tár amach ta mo bo tinn ar ghamhain. Dimthigh an fear amach agus shil sé gur fear an chomarsun a bhí ag sgartaí agus dimthigh se leis go thig a chomharsun. Nuair a thainig se fhad leis an teach ní rabh duine ar bith istoigh. Chuaidh sé isteach sa bhoiteac bhí solas sa bhoitheach agus bhí beirt fhear ag tarraingt gamhain. Thoisigh an fear eile ag chuiduighad leis. Bhí siad ag tarraingt agus ag tarraingt leobhta agus ní thiocfadh leobhta an ghamhain a tharraingt. Tharraing siad leobhta go dtí gur glan an lá ar maidin. Nuair a glan an la sé an ait ar bhfuair na fir iad fhein ag tarraingt buachalan buidhe amach as an talamh agus ní thiocfad leobhta é a fhaghail amach as an rúta agus bhí fhios aca annsin gur be na daoine beaga a rinne é. Sheachtmain indiaidh sin thainig sgairt go dtí an fhuinneog arais ag rad tár amach. Tá mo bhó tinn ar gamhain. Bhí fear an chomharsun ag sgartaí agus shil an fhear gur bé na daoine-beaga a bhí ag sgartaí agus ní dheachaidh sé amach ar cor ar bhith. Ar maidin la na bhmarac thainig fear an chomharsun fad le teach an fhear eile agus dfiafruigh se do\n(continues on next page)\n", "school_info": "School: An Ghrafaidh (Graffy)", "metadata": [{"Location:": "Graffy, Co. Donegal", "Teacher:": "\nProinnsias Ua Braonáin\n"}, {"Collector": "Siobhan Ní Ghallchobhair", "Gender": "female", "Address": "Greenans, Co. Donegal"}, {"Informant": "Brighid Ní Ghallchobhair", "Relation": "parent", "Gender": "female", "Address": "Greenans, Co. Donegal"}, {"Language": "Irish"}]}, "4428338/4396757/5079701": {"title": "Scéal", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1049, Page 497", "Page 497"], "url": "https://www.duchas.ie/en/cbes/4428338/4396757/5079701", "text": "\nLá amháin bhí Colmcille ag siubhal thart agus thuit chnaipe de a chóta. Chuaidh sé isteach i dteach agus cé bhí istigh ann acht gréasaidhe agus táiliúir. Chuaidh Colmcille fhad leis an táiliúir agus d’iarr sé air an cnaipe a fhudhuigheal do acht ní dheanfadh an táiliúir é. Annsin d’iarr Colmcille ar an gréasaidhe an cnaipe a fhudhuigheal da agus rinne sé é a fhudhuigheal le na chórda róisín, bhí buidheachas mór ag Colmcille ar an gréasaidhe agus bhí an fhearg ar leis an táiliúir agus ag imtheacht do dubhairt sé.“Nimh an polladar ar an t-snathaidh, agus fuacht an tonnudar ar an táiliúir”.O’n lá sin go dtí an lá indiu tá an táiliúir ag fhleachadh é féin i gcomhnuidhe agus ma shaitheann sé an snathad i n-a mhéar ta sé cinnte líonadh de shileadh agus bíonn sé iongantach frithir, agus is cuma caidé an poll a dhéanas an greasaidhe air fhein leis an meannaidh ní shíleann sé fac de.\n", "school_info": "School: An Ghrafaidh (Graffy)", "metadata": [{"Location:": "Graffy, Co. Donegal", "Teacher:": "\nProinnsias Ua Braonáin\n"}, {"Collector": "Dómhnall Ua Ludhóg", "Gender": "male", "Age": "12", "Address": "Graffy, Co. Donegal"}, {"Informant": "Séamus Ua Ludhóg", "Relation": "parent", "Gender": "male", "Address": "Graffy, Co. Donegal"}, {"Language": "Irish"}]}, "4428338/4396758/5079709": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1049, Page 498", "Page 498"], "url": "https://www.duchas.ie/en/cbes/4428338/4396758/5079709", "text": "\nAm amháin bhí sean fhear i na chomhnuidhe i Gcondae Dhun Na Gall agus bhí a bhean marbh. Bhí sé an bhoct, bhí mac amháin aige dar b’ainm’ Shéaghain. Ní rabh aon cheird ag an mac go fóill. Chuaidh an sean fhear fhad leis an mhaighistear agu d’fhiafruigh sé do caidé an ceird a bhfearr a thiocfadh leis a tabairt dó a mhac. Ní rabh meas ag an mhaighistear seo ar na daoine bochta agus dubhairt sé. “Céad agat do mhac a chuir ag thriall ar gadaidhe éiginteacht go bfoghliumneocadh sé gadaidheacht uaidh. Chuaidh an sean fhear ‘na bhaile agus d’innis do a mac caidé mar ‘ bh.Ar maidin lá-thar-na-bharach gluais siad go dtí an baile-mór. Fuair siad gadaidhe annsin gan mhoill. D’fág an t-athair slán ag a mhac agus d’imthigh sé leis ‘ na bhaile go trom craoidhthe. An oidhche sin rug an gadaidhe ar laimh Shéaghain agus d’imthigh siad leobhtha. Nuair a bhí siubhal fada deanta aca stad an gadaidhe go tobainn ag teach beag agus arsa seisean le Shéaghain, “Caithfidh mid an teach seo a róbail. Seo an doigh an dhéanfaidh mid é. Leigfidh mise thusa síosan simlear leis an rópa seo agus achan rud maith a\n(continues on next page)\n", "school_info": "School: An Ghrafaidh (Graffy)", "metadata": [{"Location:": "Graffy, Co. Donegal", "Teacher:": "\nProinnsias Ua Braonáin\n"}, {"Collector": "Máighread Ní Bhraonáin", "Gender": "female", "Address": "Straboy, Co. Donegal"}, {"Informant": "Prionnsias Ó Braonáin", "Relation": "parent", "Gender": "male", "Address": "Straboy, Co. Donegal"}, {"Language": "Irish"}]}, "5070787/5063479/5101454": {"title": "The Cute Old Fox", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0999, Page 307", "Page 307"], "url": "https://www.duchas.ie/en/cbes/5070787/5063479/5101454", "text": "\nThere was a man in this neighbour hood one time and he was always setting snares to catch rabbits and foxes.One morning when he went out to look at the snares there was a great big fox in one of the snares.  The fox saw the man coming and he lay down and the man thought the fox was dead.  The man carried the fox home, and when he got home he left down the fox and went into the house to tell his wife.  When he came out the fox was gone.\n\n\n\nNot so long ago a woman from Curraghmore went to the sea-side.  When she was at the sea-side she met with a woman who had a delicate son.  They decided to board in the same hotel.  They went to bed that night and they\n(continues on next page)\n", "school_info": "School: Corr Riabhach", "metadata": [{"Location:": "Correagh Glebe, Co. Cavan", "Teacher:": "\nR. Mac Éamuis\n"}, {"Language": "English"}]}, "5008958/4970711/5109799": {"title": "Story - The Foxes and the Gormanstown Family", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0699, Page 121", "Page 121"], "url": "https://www.duchas.ie/en/cbes/5008958/4970711/5109799", "text": "\nTradition says that the foxes follow the Gormanstown family. They are supposed to be seen around the house when the head of the house is dying.The late Lord Gormanstown came out of the room in which his father was dying and on the doorstep of the hall were two foxes. It is said that the Gormanstown family must have befriended the foxes in olden times.\n", "school_info": "School: Clochar Loreto, An Uaimh", "metadata": [{"Location:": "Navan, Co. Meath", "Teacher:": "\nAn tSr. M. Colm\n"}, {"Collector": "Patrick Matthews", "Gender": "male", "Address": "Rathaldron, Co. Meath"}, {"Informant": "Kitty Matthews", "Gender": "female", "Address": "Rathaldron, Co. Meath"}, {"Language": "English"}]}, "5008984/4973798/5110054": {"title": "A Story about a Fox", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0707, Page 088", "Page 088"], "url": "https://www.duchas.ie/en/cbes/5008984/4973798/5110054", "text": "\nOnce upon a time, a fox came to a house at night to steal hens. The hens were up on a loft, and the fox got in on the loft and he killed all the hens that were on it. When he was going away, he went down through the loft and there was a horse in the houses, and the fox could not get out of the house. Then he lay down behind the horse so that the man would think in the morning, that the horse gave him a kick and killed him. When the man of the house came out in the morning, he thought the fox was dead, and he lifted the fox and left him out-side the door and went for a spade to bury him, but when he came back the\n(continues on next page)\n", "school_info": "School: Maio", "metadata": [{"Location:": "Trohanny, Co. Meath", "Teacher:": "\nMáire Ní Chreaig\n"}, {"Collector": "Patrick Mc Cormac", "Gender": "male", "Address": "Druminiskin, Co. Meath"}, {"Informant": "Peter Mc Cormac", "Relation": "parent", "Gender": "male", "Address": "Druminiskin, Co. Meath"}, {"Language": "English"}]}, "5008984/4973800/5110055": {"title": "A Story about a Fox", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0707, Page 090", "Page 090"], "url": "https://www.duchas.ie/en/cbes/5008984/4973800/5110055", "text": "\nThere was a man and he went out hunting and he caught a fox. He gave a blow of a fork to him, and he pretended to be dead. So the man threw the fox into a bag and he threw the bag into the barn. There were eight clocking hens in the barn. In the night-time the fox crept out of the bag and ate the clocking hens and the eggs. Next day, the man brought another man to show him the fox. When he opened the door the fox ran out between his legs and got away.When the fox is approaching a house he cries to see will the dogs cry. If he cries he will not go\n(continues on next page)\n", "school_info": "School: Maio", "metadata": [{"Location:": "Trohanny, Co. Meath", "Teacher:": "\nMáire Ní Chreaig\n"}, {"Collector": "Bridie Geraghty", "Gender": "female", "Address": "Druminiskin, Co. Meath"}, {"Language": "English"}]}, "5009042/4980183/5116093": {"title": "Fairy Rath", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0725, Page 019", "Page 019"], "url": "https://www.duchas.ie/en/cbes/5009042/4980183/5116093", "text": "\nChristy Hand lived in the Parish of Kilskyre. His home was on the side of a hill and he could not find a place to sink a well. There was a Rath about 150 yards away from the house and a well in it. Christy put pipes from the well to his yard, to let the water into a tub in the yard. From that till he died he was sick every second day\n\n\n\nOnce upon a time a fox was full of fleas, and he could not rid himself of them. At last he found a plan by which he did away with them. As he was walking through the fields he found a piece of wool and put it in his mouth. Then he went to a deep river and put his tail in first. The deeper he went the further the fleas went up his back. He went down into the water till there was noting but his nose up. All the fleas left his body and went into the wool. Then he swam out and there was not a flea left on his body.\n\n\n\nAn old man who lived in Ballinlough used to tell this story:-One night he was returning home at a late hour from a neighbouring house where he had been  \"Ceilidhidhing\". As he was passing one of the fields near his home, he saw a great fair being held in the field. There was a great number of men buying and selling cattle and horses. There were clapping of hands and clinching of bargains. As the old man approached the field-gate, two men called him over and told him to stand at the gate and receive the money. As each purchase passed the gate the owner paid the toll. Before long his pockets were bulging with money. When the fair was over the man\n(continues on next page)\n", "school_info": "School: Clonmellon (B.)", "metadata": [{"Location:": "Clonmellon, Co. Westmeath", "Teacher:": "\nP. Ó Droighneáin\n"}, {"Collector": "M. Ó Gadhra", "Gender": "male"}, {"Language": "English"}]}, "5009123/4988598/5121394": {"title": "Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0746, Page 229", "Page 229"], "url": "https://www.duchas.ie/en/cbes/5009123/4988598/5121394", "text": "\n(continued from previous page)\n\"Leave that back, that is my poor sister's\". Again he threw it back and taking up the 5th skull, the voice again called \"That is my poor brother's, leave it back\". \"Ah\" said the young fellow losing his patience, \"bad luck to you and your brother and sister, ye can't own them all, I'm bringing this one, I don't give a dam who owns it\". And he brought it and won his bet.\n\n\n\nOnce upon a time a very clever fox was stealing a farmers fowl and he (the farmer) could not manage to catch the fox, so he lit upon the plan of making a hole in the roof for him so that when he came in he could not get out. Things worked out according to plan and when the farmer arrived he found the fox trapped. The farmer opened the door cautiously and stole\n(continues on next page)\n", "school_info": "School: Lower Warren", "metadata": [{"Location:": "Warren Lower, Co. Westmeath", "Teacher:": "\nLiam Mac Coiligh\n"}, {"Collector": "Liam F. Cox", "Gender": "male"}, {"Language": "English"}]}, "5009123/4988668/5121867": {"title": "Folk Stories - Animal Tales - Race between Fox and Hedgehog", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0746, Page 400", "Page 400"], "url": "https://www.duchas.ie/en/cbes/5009123/4988668/5121867", "text": "\nOnce upon a time a fox was talking to a Hedgehog and the Fox said to his animal that he was not good for anything.  So the Hedgehog challenged the fox for a race in a potato furrow. There were two Hedgehogs in.  When they were ready the hedgehog said to the Fox \"do it and at it now\" and the two jumped into the furrow.  When the Hedgehog that was in the end of the Furrow heard the two above starting, he jumped up out of the furrow and was there when the fox went down. The fox was there before him. So the two of them started again and the Hedgehog above jumped up on the headland and when the Fox went he was codded again. And at last he found out and he went away from them\n", "school_info": "School: Lower Warren", "metadata": [{"Location:": "Warren Lower, Co. Westmeath", "Teacher:": "\nLiam Mac Coiligh\n"}, {"Collector": "Sean Fitzpatrick", "Gender": "male", "Address": "Annagh, Co. Westmeath"}, {"Language": "English"}]}, "5044664/5030208/5141449": {"title": "Tales about Animals", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0904, Page 108", "Page 108"], "url": "https://www.duchas.ie/en/cbes/5044664/5030208/5141449", "text": "\nOnce upon a time some men went out to cut corn with a scythe. There were a nest of weasels in it. The men brought a pail of milk to the field to drink. They left it on the headland and went to cut the corn. They killed all the young weasels and the old one escaped. The old one knew that the men were going to drink the milk and she went over and spat in it. The men knew that the weasles spit was poison.\n\n\n\nOne day a fox met a crow in a wood. The crow was after finding a piece of cheese. She flew up to the top of a high tree when she saw the fox coming. The fox looked up in the tree and he saw the crow. He began to praise the crow. He said she had lovely feathers and he said she should be a grand singer and he would like to hear her sing. The poor foolish crow began to sing and the cheese fell to the ground. The fox picked it up and ran away with it. The crows singing was of no use when the fox got the cheese.\n", "school_info": "School: Baile Uí Mhurchadha, Borris", "metadata": [{"Location:": "Ballymurphy, Co. Carlow", "Teacher:": "\nMichael Ó Seachnasaigh\n"}, {"Collector": "Katie Kennedy", "Gender": "female", "Address": "Ballymurphy, Co. Carlow"}, {"Informant": "Patrick Murphy", "Gender": "male", "Age": "over 40", "Address": "Ballymurphy, Co. Carlow"}, {"Language": "English"}]}, "5044663/5030061/5144746": {"title": "How the Fox Rids Himself of Fleas", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0903, Page 677", "Page 677"], "url": "https://www.duchas.ie/en/cbes/5044663/5030061/5144746", "text": "\nThe fox ties a piece of wool around his nose and he goes in and sits in a river.  All the fleas goes into the wool then he throws the wool into the river and jumps out.  All the fleas are them left in the river and the get drowned.\n\n\n\nThere was a man and his wife and child living in a small house They lived very happily for many years until the woman died.In the same townland there was a woman and her daughter living near them.  One day the man and woman were married and the four of them lived together for a long time.  The woman was very kind to her own daughter but she was very cruel to her stepdaughter.  Every morning her own daughter got wine to drink and milk to bathe in. And her stepdaughter got only water to drink and water to bathe in.\n", "school_info": "School: Inch, Borris", "metadata": [{"Location:": "Clanagh, Co. Carlow", "Teacher:": "\nMichael J. O'Donoghue\n"}, {"Language": "English"}]}, "5044663/5030064/5144759": {"title": "Dwarves and Hunchbacks", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0903, Page 680", "Page 680"], "url": "https://www.duchas.ie/en/cbes/5044663/5030064/5144759", "text": "\n(continued from previous page)\nThe fairies came out and instead of taking off his hump they put on the one they took from Hud.  Dud had to go around all his life with two humps on his back.\n\n\n\nA peasant had an old horse who had served him faithful.  He was very old and was not able to work anymore.The peasant turned him out and told him if he was able to bring a lion home with him he would keep him as long as he lived.The horse went into the wood and remained there till he met his old friend the fox.  The fox asked the horse why he was so sorrowful.  The horse told him the whole story of what the happened. Then the fox told him to lie down and pretend to be dead and he would bring a lion.\n(continues on next page)\n", "school_info": "School: Inch, Borris", "metadata": [{"Location:": "Clanagh, Co. Carlow", "Teacher:": "\nMichael J. O'Donoghue\n"}, {"Language": "English"}]}, "5044663/5030067/5144770": {"title": "We Three: For Money", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0903, Page 683", "Page 683"], "url": "https://www.duchas.ie/en/cbes/5044663/5030067/5144770", "text": "\n(continued from previous page)\nthe road till the guards came.Guards: - Who killed the man.First fool We three.Guards: - Why did ye kill this manSecond fool: - For money.Guards: - Ye will all be hangedThird fool: -AlrightThe three fools were hanged because the guards though they killed the man.  That was the end of the three fools.\n\n\n\nOne day a fox went for a walk.  He had not gone far when he met a goat.  The two of them went for a long walk.  It was a very warm day and they were very thirsty.  The two of them got down in a deep pond to get a drink.They were not able to get out.  The fox told the goat to put her feet up against the side\n(continues on next page)\n", "school_info": "School: Inch, Borris", "metadata": [{"Location:": "Clanagh, Co. Carlow", "Teacher:": "\nMichael J. O'Donoghue\n"}, {"Collector": "Josie Fanning", "Gender": "female", "Address": "Ballyroughan Little, Co. Carlow"}, {"Language": "English"}]}, "4798766/4796451/5152027": {"title": "A Fox Chase", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0299, Page 120", "Page 120"], "url": "https://www.duchas.ie/en/cbes/4798766/4796451/5152027", "text": "\nFor Cahirmore hilltops the red fox is facing,Every hound running true, every horse running game,O'er Burgatia's green hillside the hunters are racingEvery man in the saddle is riding for fame.2 Past Hart's forge at the crossroads the hounds are now streamingWith Beamish and Townshend well up in the van,Whilst the air with the note of the fox-hound is teeming,As Owen the pride of the Galweys- leads on.3A check in the laurels! but Burns has found it,As \"For'rd Away\" rings the veterans voice, Thro' the lawn, thro' the yard, thro the house and around it,Ride hard and ride fast all are open for choice.4Man who could forget the wild ringing chorus,Re-echoed from Ardagh thro' Milleen's lone glen,Now who could forget the cheer so uproariousAs \"Harry the Master\" rides past the Froe men.5Thro' the boulders of Benduff the veteran is leadingwith gallant old Peacock going free in his stride\n(continues on next page)\n", "school_info": "School: Meall an tSrutháin", "metadata": [{"Location:": "Maulatrahane, Co. Cork", "Teacher:": "\nDll. Ó Luasaigh\n"}, {"Language": "English"}]}, "4921923/4900538/5166618": {"title": "The Clever Fox", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0396, Page 237", "Page 237"], "url": "https://www.duchas.ie/en/cbes/4921923/4900538/5166618", "text": "\nThere is an old saying – \"As cute as a fox\" – and from the different stories you hear of his cleverness, you will admit there is a lot of truth in the proverb. There was once a very poor widow who lived in a cottage close to a fox cover, which was inhabited by an old fox and six cubs.Although the widow was poor she had the finest flock of geese, turkeys and hens in the countryside. The fowl were under the fox's nose crowing and cackling from morning 'till night. He appeared to know she was a widow for he never touched one of them.One winter came very cold. All the country was snowed up and the fox being very hungry came to the widow's fowl house and although it was against his conscience, he took one of her finest hens. Next morning when the widow discovered her loss, she lost her temper and cursed the fox in three different languages. After a few days the weather got better and one fine morning when the widow counted her hens, she found she had two too many. She wondered who owned them but in looking up she saw Mr. Fox walking proudly away without waiting to be thanked. The queer part of it was that the hens he brought back were of the same colour and breed as the ones he took away.\n", "school_info": "School: Cill Liath", "metadata": [{"Location:": "Killeagh, Co. Cork", "Teacher:": "\nMícheál Ó Murchadha\n"}, {"Collector": "Mary Cotter", "Gender": "female", "Address": "Curraghishal, Co. Cork"}, {"Informant": "John Cotter", "Gender": "male"}, {"Language": "English"}]}, "4811623/4803233/5179438": {"title": "Conas a Ghlanann Sionnach é féin ó Dhearnairtí", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0280, Page 187", "Page 187"], "url": "https://www.duchas.ie/en/cbes/4811623/4803233/5179438", "text": "\nO Diarmuid O SúiliobhánDoirínEadargóilFuair bás 4 bliana o thoin aos 65Gheibheann sé beulóg dé fionán bán, Téigheann sé go dtí an abhainn.Síneann sé a earball isteach san uisge agus a dhrom leis an abhainn. Diaid ar ndiaidh bíonn sé ag druidim isteach san uisge go mbíonn sé go léir cludaighthe ach an ceann.Faidh a bhí sé ag gluaiseacht isteach bhí na Deanaití ag gluaiseacht ó'n uisge go rabhadar go léir thuas sa cheann. Go breagh mall chuaidh an ceann fe uisge go dtí na raibh le feicsint ach an bheulóg  fionain 'na raibh na buachaillí dúbha go léir  bailighthe.D'oscail sé a bheul, seo chun siubhail an fionán agus a ualach síos abhainn, agus amach as an abhainn Sionnach Glan.\n", "school_info": "School: Tráigh Phraisce (B.)", "metadata": [{"Location:": "Trafrask, Co. Cork", "Teacher:": "\nMícheál Ó Súilleabháin\n"}, {"Informant": "Diarmuid Ó Suiliobháin", "Gender": "male", "Age": "65", "Address": "Derreen Upper, Co. Cork"}, {"Language": "Irish"}]}, "4811636/4806002/5180982": {"title": "An Mada Rua Maol", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0332, Page 100", "Page 100"], "url": "https://www.duchas.ie/en/cbes/4811636/4806002/5180982", "text": "", "school_info": "School: Baile Mhúirne (C.)", "metadata": [{"Location:": "Ballyvourney, Co. Cork", "Teacher:": "\nEibhlín, Bean Uí Bhuachalla\n"}, {"Collector": "Máire Ní Chríodáin", "Gender": "female", "Age": "13", "Address": "Coolierher, Co. Cork"}, {"Informant": "Máire Bn. Uí Chriodáin", "Relation": "parent", "Gender": "female", "Age": "52"}, {"Language": "Irish"}]}, "4921726/4893928/5183692": {"title": "Earball an Mhadra Ruaidh", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0349, Page 245", "Page 245"], "url": "https://www.duchas.ie/en/cbes/4921726/4893928/5183692", "text": "\nBhí sean bean ann uair agus bhí a lán bhá agus caorac aici. Bá mhaith leí aodaire d'fhaghail. Dimthigh sí amach lá ag lorg buachalla. Do chuardaigh sí na cnuic agus na pairceanna, ach ní raibh aon buachaill ann.    Nuair a bhí sí ag teacht abhaile do bhuail madra ruadh leí. Tá mé ag lorg buachaill cun aodhaireachta arsa an bean. Bfhéidir go ndeanfhainn an obair sin duit arsa an rógaire. Má féidir leat glaodach go bhinn agus go cneasta, ar sise. Do dhein sé é go deas agus do thog sí an madra ruadh mar aodhaire. Bha ghearr go bhfeaca sí go raibh na ba ag eirighe iseal. Dubhairth si leis an madra ruadh, cá bhfuil mo ainmidhe ag dul. O' a bean uasal do táinig an mactíre agus do ghuid sé cuid díobh. Do bhí brón ar an mnaoi ach d'éirigh sí [?] ar an madra ruadh. Lá amháin do chuaidh sí amac le deoch uachtair do agus cad a cifeadh ach an madra ruadh ag marbhú caorach. \"A claidhre [?], ar sise, is túsa a dhein guideachth go léir ar mo cuidh ainmhidhthe agus do chaith sí an tuachtar ar bhárr a earbhall. As san amach tá bún earball and madra ruadh comh bán le bainne.\n", "school_info": "School: Na Cloichíní, Carraig Ruacháin", "metadata": [{"Location:": "Clogheen, Co. Cork", "Teacher:": "\nSeán Ó Coisdealbha\n"}, {"Language": "Irish"}]}, "4921841/4895997/5184816": {"title": "Animal Tales - A Fox's Cleverness", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0378, Page 134", "Page 134"], "url": "https://www.duchas.ie/en/cbes/4921841/4895997/5184816", "text": "\nNo. 14                      Page 134                              Animal Tales                         A Fox's cleverness                                          18-11-'38The fox is the most sly and most cunning of all animals.  he has been often known to pretend to be dead in order to escape being caught.  Once a man living in Kilworth a granduncle of mine named Patrick Murphy who was working on a farm told this story to my Aunt who related it to me.  In this farm a great number of fowl were kept, the fowl were often missing and were supposed to be taken by a fox.  One morning this man was letting out the fowl into a pond in the farm-yard near which there was a wall on this wall he saw the fox perched looking with hungry eyes on the fowl. Well said the man if you are hungry come down and take one of them. He had no sooner said the words than\n(continues on next page)\n", "school_info": "School: Clochar na Toirbhirte, Mainistir Fhearmuighe", "metadata": [{"Location:": "Fermoy, Co. Cork", "Teacher:": "\nNa Mná Rialta\n"}, {"Collector": "Mary O' Brien", "Gender": "female", "Address": "Fermoy, Co. Cork"}, {"Language": "English"}]}, "4811649/4808925/5187290": {"title": "An Fear agus an Madra Rua", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0336, Page 448", "Page 448"], "url": "https://www.duchas.ie/en/cbes/4811649/4808925/5187290", "text": "", "school_info": "School: Baile Mhúirne (C.)", "metadata": [{"Location:": "Ballyvourney, Co. Cork", "Teacher:": "\nEibhlín, Bean Uí Bhuachalla\n"}, {"Language": "Irish"}]}, "5162150/5158956/5198022": {"title": "Story of a Fox", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0655, Page 106", "Page 106"], "url": "https://www.duchas.ie/en/cbes/5162150/5158956/5198022", "text": "\nStory of a FoxHere in Ireland many stories are told about the cunningness of a fox. This is a story which I heard my father tell.One night a farmer heard a great noise in the fowl house. The hens were flying around and causing great commotion. The farmer got up rushed to the fowl house and burst open the door. The first thing he saw was a great big fox lying dead to all appearances. The farmer lifted up the fox and threw him outside the door and returned again to the fowl house to find out if any of the hens had been killed Having satisfied himself that no damage was done he locked up the fowl house again and went to the spot where he had thrown the fox, but there was no sign of the latter there. it was then the farmer found out the fox had feigned death and had played a trick on him.\n", "school_info": "School: Bearna na Gaoithe, Carraig na Siúire", "metadata": [{"Location:": "Windgap or Ardmore, Co. Waterford", "Teacher:": "\nCáit Pléimeann\n"}, {"Language": "English"}]}, "5177649/5176652/5203309": {"title": "Damage or Otherwise of Animals", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0598, Page 095", "Page 095"], "url": "https://www.duchas.ie/en/cbes/5177649/5176652/5203309", "text": "\n(continued from previous page)\n95eat the pheasant off the nest.Squirrel -harmless.Marten-cat -harmless.otter -plays on fish.Hedgehog -harmless..\n\n\n\nTricks of Fox.      Tom Mc Inerney(Scotch)of Cratloe went one morning to find all his hens dead and the fox as well lying in cabin in roof of which there was a hole.He caught the fox by tail and flung him upon the bush.He then called some of his neighbours to show the fox but he had no fox to show.(about 50yrs ago).   About 25 yrs ago Wm White of Meelick had 2 great dogs. He heard a great noise during the night and went out to find\n(continues on next page)\n", "school_info": "School: Meelick (B.)", "metadata": [{"Location:": "Meelick, Co. Clare", "Teacher:": "\nEoghan Ó Néill\n"}, {"Language": "English"}]}, "5235167/5223791/5240863": {"title": "An Sionnach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0070C, Page 02_025", "Page 02_025"], "url": "https://www.duchas.ie/en/cbes/5235167/5223791/5240863", "text": "\nCuaid sionnach síos ag an gcladac tá go n-tseach sé beile bairneach. Bhí bairneach ann a bhí ar bogadh agus cuir an sionnach a teanga faoi agus d'fáirg an báirneach air agus níor féad sé imeacht agus baitheadh é.Bí sionnach ag an gcladach lá agus caradh portan air agus dubhairt an portán go ritead sé rása leir. Cá bfuigead anad féin beith comh tréan liomsa arsan sionnach. Táim adeir an portán agus leigfead d'fad féín romam tú ag tosaig. Cuaidh an portán ibfastód na driobal. Rith an sionnach annsin agus an portán ingreim ann. Nuair a sroich an sionnach ceann cursa léim an\n(continues on next page)\n", "school_info": "School: Scoil Mhuire, Na Forbacha", "metadata": [{"Location:": "Furbogh, Co. Galway", "Teacher:": "\nname not given\n"}, {"Collector": "Liam Ó Droighneáin", "Gender": "male"}, {"Informant": "Cáit Bhreathnach", "Gender": "female", "Age": "28", "Address": "Furbogh, Co. Galway"}, {"Language": "Irish"}]}, "5235172/5224763/5243675": {"title": "Cluichí", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0085C, Page 08_037", "Page 08_037"], "url": "https://www.duchas.ie/en/cbes/5235172/5224763/5243675", "text": "", "school_info": "School: Béal Feirsde / Belfarsad", "metadata": [{"Location:": "Belfarsad, Co. Mayo", "Teacher:": "\nPrionnsias S. Ó Gallachobhair\n"}, {"Collector": "Áine Ní Ghallacobhair", "Gender": "female"}, {"Language": "Irish"}]}, "5235179/5225822/5243975": {"title": "Ainmhithe Fiáine: An Coinín", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0086B, Page 07_034", "Page 07_034"], "url": "https://www.duchas.ie/en/cbes/5235179/5225822/5243975", "text": "", "school_info": "School: An Corrán/Currane", "metadata": [{"Location:": "Currane, Co. Mayo", "Teacher:": "\nMícheál P. Ó Gallachobhair\n"}, {"Collector": "Padraig Ó Máille", "Gender": "male", "Address": "Gubnahardia, Co. Mayo"}, {"Language": "Irish"}]}, "5235179/5226021/5260888": {"title": "Cluiche - An Sionnach agus an Gandal", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0086B, Page 11_037", "Page 11_037"], "url": "https://www.duchas.ie/en/cbes/5235179/5226021/5260888", "text": "", "school_info": "School: An Corrán/Currane", "metadata": [{"Location:": "Currane, Co. Mayo", "Teacher:": "\nMícheál P. Ó Gallachobhair\n"}, {"Collector": "Martán Ó Móráin", "Gender": "male", "Address": "Bolinglanna, Co. Mayo"}, {"Language": "Irish"}]}, "5235179/5226047/5261004": {"title": "An Sionnach agus an Gandal", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0086B, Page 12_coverA", "Page 12_coverA"], "url": "https://www.duchas.ie/en/cbes/5235179/5226047/5261004", "text": "\n[-]\n(continues on next page)\n", "school_info": "School: An Corrán/Currane", "metadata": [{"Location:": "Currane, Co. Mayo", "Teacher:": "\nMícheál P. Ó Gallachobhair\n"}, {"Collector": "Seán Ó Gallachobhair", "Gender": "male", "Address": "Knocknamona, Co. Mayo"}, {"Language": "Irish"}]}, "5235179/5226159/5261645": {"title": "An Coinín", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0086B, Page 16_028", "Page 16_028"], "url": "https://www.duchas.ie/en/cbes/5235179/5226159/5261645", "text": "", "school_info": "School: An Corrán/Currane", "metadata": [{"Location:": "Currane, Co. Mayo", "Teacher:": "\nMícheál P. Ó Gallachobhair\n"}, {"Collector": "Mártan Ó Máille", "Gender": "male", "Address": "Gubnahardia, Co. Mayo"}, {"Language": "Irish"}]}, "5260434/5252847/5262749": {"title": "A Fox's Trick", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0590C, Page 13_019", "Page 13_019"], "url": "https://www.duchas.ie/en/cbes/5260434/5252847/5262749", "text": "\nOnce upon a time a fox came to the geeses house. He went into the house where the geese was, and he killed all the geese.When the women of the house got up in the morning she went out to let out the geese and when she opened the door all the geese were killed and the fox lying over dead in the house. She ran in and said that all her\n(continues on next page)\n", "school_info": "School: Knockjames", "metadata": [{"Location:": "Knockjames, Co. Clare", "Teacher:": "\nname not given\n"}, {"Collector": "Bridie Harrison", "Gender": "female"}, {"Language": "English"}]}, "5260434/5252877/5262782": {"title": "A Fox's Trick", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0590C, Page 14_019", "Page 14_019"], "url": "https://www.duchas.ie/en/cbes/5260434/5252877/5262782", "text": "\n19             A fox's trick                     24th January,1938The story is told of a man in this district who was in bed one night .About midnight he (he)heard a noise in the fowl house .He ran out and and on opening the door he saw a fox lying on the floor seemingly dead with a crowd of dead hens lying about him.The man turned around to get a pitch-fork to stick the fox and make sure he was dead when up\n(continues on next page)\n", "school_info": "School: Knockjames", "metadata": [{"Location:": "Knockjames, Co. Clare", "Teacher:": "\nname not given\n"}, {"Collector": "Michael Torpey", "Gender": "male"}, {"Language": "English"}]}, "5235179/5226335/5268706": {"title": "Dallóg", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0086B, Page 21_023", "Page 21_023"], "url": "https://www.duchas.ie/en/cbes/5235179/5226335/5268706", "text": "", "school_info": "School: An Corrán/Currane", "metadata": [{"Location:": "Currane, Co. Mayo", "Teacher:": "\nMícheál P. Ó Gallachobhair\n"}, {"Collector": "Brighid Seoighthe", "Gender": "female", "Address": "Mweewillin, Co. Mayo"}, {"Informant": "Brighid Seoighthe", "Gender": "female", "Address": "Glassillaun, Co. Mayo"}, {"Language": "Irish"}]}, "5235179/5227397/5284371": {"title": "File an Bhaile", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0086B, Page 49_032", "Page 49_032"], "url": "https://www.duchas.ie/en/cbes/5235179/5227397/5284371", "text": "\n(continued from previous page)\nmo cuail le baile ag sihimh ceol as pocai falu\n\n\n\nRinn Sean Ruaidhe Mád Martan Mhór agus tá an dan sin ag na daoine go feoil.\n\n\n\nCaiteann na paiste 5 cloc suas san eir agus ma leigeann paiste ar bit an cloc  a chuitimh, eaigfidh an duine sin imteact as an cluice. Imrigeann na paiste an cluice sin go feoil.\n\n\n\nAn sionnac agus an gandal\n(continues on next page)\n", "school_info": "School: An Corrán/Currane", "metadata": [{"Location:": "Currane, Co. Mayo", "Teacher:": "\nMícheál P. Ó Gallachobhair\n"}, {"Collector": "Seosamh Ó Móráin", "Gender": "male", "Address": "Knocknacassagh, Co. Mayo"}, {"Informant": "Síle Ní Mhóráin", "Gender": "female"}, {"Language": "Irish"}]}}