{"4428101/4378229/4443875": {"title": "Saint Brigid's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0638, Page 22", "Page 22"], "url": "https://www.duchas.ie/en/cbes/4428101/4378229/4443875", "text": "\n(continued from previous page)\nIrish name for these. They hang these over their doors and it brings a blessing on the house. This is left up till the succeeding day; then it is taken down and burned.\n\n\n\nSt. Patrick's Day occurs on the 17th of March. The previous day the children go out and gather shamrock. It is an old custom to make a cross with a half-burned stick on one's shoulder in honour of saint Patrick. This is called \"Patrick's Cross\"People used to wear crosses decorated with flowers, beads, and green ribbons on the collar of their coats. Men wear shamrock on their hats. A four-leaf shamrock is a sign of good luck.\n", "school_info": "School: Glencairn", "metadata": [{"Location:": "Glencairn, Co. Waterford", "Teacher:": "\nEibhlín Ní Dhuibhir\n"}, {"Informant": "Mrs O' Neill", "Gender": "female", "Age": "58", "Address": "Glencairn, Co. Waterford"}, {"Language": "English"}]}, "4427850/4350546/4451156": {"title": "Festival Customs - St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0098, Page 359", "Page 359"], "url": "https://www.duchas.ie/en/cbes/4427850/4350546/4451156", "text": "\nAll the people used to go to Ballyhaunis for Mass on St. Patrick's day. They used to go to St Augustines Chruch  (now occupied by the Friars) You were nowhere if you did not got to Ballyhaunis that day. After Mass was over the people used to a \"Pattern\". A Pattern was like a fair. The people used to have little stalls made on asscarts. They used to sell holy things and souvenirs. They also sold vegetables and poatatoes and things like that. All the shop used to be open that day in Ballyhaunis. The custom began to die out gradually and about forty years ago it had died out altogether.On St Patrick's day also the people used to meet at the cross-roads, and they used to have dances there. The dances used to begin early in the evening and when it began to get dark all the people would go home. This custom has also died out.People wear shamrocks on St Patrick's day. Some girls wear green ribbobn on their hair or sometimes they  they wear a little harp made of green cardboard paper with little gold threads running through it. Often people wear a little medal of St. Patrick on a little green\n(continues on next page)\n", "school_info": "School: Cnocán Mhichíl Naofa (Clochar)", "metadata": [{"Location:": "Claremorris, Co. Mayo", "Teacher:": "\nSiúracha na Trócaire\n"}, {"Collector": "Biddy Killeen", "Gender": "female", "Age": "13", "Address": "Claremorris, Co. Mayo"}, {"Informant": "Mrs B Killeen", "Relation": "grandparent", "Gender": "female"}, {"Language": "English"}]}, "4428071/4375050/4457376": {"title": "Festival Customs - St John's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0151, Page 381", "Page 381"], "url": "https://www.duchas.ie/en/cbes/4428071/4375050/4457376", "text": "\n(continued from previous page)\nfire and puts it into his tillage field, so that the crops would grow well.\n\n\n\nSt Patrick's day some on the 17th March. On that day every person wears the shamrock. The people at home send the shamrock to their relatives in other countries. Long ago all the men used to go to town and drink whiskey or to \"drown the shamrock\" as it was called, but this custom is discontinued.\n", "school_info": "School: Droichead na Daoile", "metadata": [{"Location:": "Lackalustraun, Co. Mayo", "Teacher:": "\nMáire, Bean Uí Ghallchobhair\n"}, {"Collector": "Bridgie Eileen Rowland", "Gender": "female", "Address": "Tubbrid Beg, Co. Mayo"}, {"Language": "English"}]}, "4428107/4378906/4460314": {"title": "Local Belief and Customs - New Year", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0640, Page 40", "Page 40"], "url": "https://www.duchas.ie/en/cbes/4428107/4378906/4460314", "text": "\nDoors of the house are struck with a loaf of bread on New Years eve.People always wait up on New Years eve to see the New Year. The direction of the wind is noted. If blowing from the North the year is going to be in the Protestants' favour; if from the south the Catholics are to be favoured. If you stay up till twelve oclock you would see the man you are going to marry in a mirror.\n\n\n\nThis is a special feast. No true Irishman would forget to put out \"Brat Brighid on Brigids eve. This consists of a black strip of cloth which is put out through the window and left hanging outside till morning. Then it is carefully preserved and used in many sicknesses, principal of which is the common head ache. If you wind the cloth around your head the headache will go. It is also put around a lamb that would not take with its mother.\n\n\n\nOne custom which is fast dying out is the making of a cross on the left sleeve with a stick that is partly burned. The\n(continues on next page)\n", "school_info": "School: West Waterford Branch I.N.T.O", "metadata": [{"Location:": "Coshmore and Coshbride, Co. Waterford", "Teacher:": "\nJames Cashman\n"}, {"Collector": "James Cashman", "Gender": "male"}, {"Language": "English"}]}, "4428112/4379115/4462897": {"title": "Lá Fhéile Pádraig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0641, Page 119", "Page 119"], "url": "https://www.duchas.ie/en/cbes/4428112/4379115/4462897", "text": "\nLá Fhéile Padraig Bíonn Lá Féile Pádraig ar an seachtmhad lá deag de Mí na Márta againn.Caitheann na daoine go léir seamróg ar an lá san in ónoir do Naomh Pádhraig. Lá mór do Muinntir na h-Éireann is ead Lá Fheile Pádraig. Bíonn árd-spórt agus greann an domhain acá.Bhíonn cluichí ar siubhal i ngach pharóiste nach mhór bíodh rásanna ar siubhal sa pharóiste seo fadó agus bíodh árd spórt aca.Ba bhéas le muinntir an pharóiste seo beith ag troid le na céile an lá\n(continues on next page)\n", "school_info": "School: Baile Mhic Airt, An Rinn", "metadata": [{"Location:": "Ballymacart, Co. Waterford", "Teacher:": "\nTomás Ó Faoláin\n"}, {"Collector": "Máighread Ní Cadhla", "Gender": "female", "Address": "Ballytrisnane, Co. Waterford"}, {"Informant": "Peadar Ó Cadhla", "Relation": "parent", "Gender": "male", "Address": "Ballytrisnane, Co. Waterford"}, {"Language": "Irish"}]}, "4428056/4373275/4467019": {"title": "St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0147, Page 508", "Page 508"], "url": "https://www.duchas.ie/en/cbes/4428056/4373275/4467019", "text": "\nSaint Patrick’s day falls on the 17th of March every year. On that day all the people wear a piece of shamrock on their coats. This is to honour Saint Patrick. When he came to Ireland it was by means of the shamrock that he converted the Irish to the true faith. Saint Patrick is the patron St. of Ireland. In olden times the people of two villages gathered together and then they went to the public house and got drunk. Then they often beat\n(continues on next page)\n", "school_info": "School: An Cheathrú Gharbh", "metadata": [{"Location:": "Carrowgarve, Co. Mayo", "Teacher:": "\nTomás Ó Fiachra\n"}, {"Collector": "V Hunter", "Gender": "male"}, {"Language": "English"}]}, "4428056/4373344/4467104": {"title": "Saint Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0147, Page 577", "Page 577"], "url": "https://www.duchas.ie/en/cbes/4428056/4373344/4467104", "text": "\nSaint Patrick’s day comes every year on the 17th March. On that day long ago the people used to get drunk and they called that drownding the shamrock. The sang and danced and sometimes they nearly killed each other.\tNow all public houses are closed down and on Saint Patrick’s day, and no one is seen drunk. The church has given a little liberty to the people.\tThey can go to foot ball matches or any other famous games which people play. Every St. Patrick’s day since the people wear a small piece\n(continues on next page)\n", "school_info": "School: An Cheathrú Gharbh", "metadata": [{"Location:": "Carrowgarve, Co. Mayo", "Teacher:": "\nTomás Ó Fiachra\n"}, {"Collector": "Bea Mullany", "Gender": "female"}, {"Informant": "Mrs Brogan", "Gender": "female", "Address": "Carrowvaneen, Co. Mayo"}, {"Language": "English"}]}, "4428056/4373346/4467260": {"title": "Saint Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0147, Page 579", "Page 579"], "url": "https://www.duchas.ie/en/cbes/4428056/4373346/4467260", "text": "\nSaint Patricks day is celebrated every year on th [sic] 17th March. On that day the People wear the Shamrock on their coats.\tLong ago the People used to get drunk. They thought they were honouring St. Patrick. The law of the land now will not allow public houses be open on this day. So that the people cannot get drunk. The people have a better way of honouring St. Patrick now. They play some national games such as hurling, playing foot Ball,\n(continues on next page)\n", "school_info": "School: An Cheathrú Gharbh", "metadata": [{"Location:": "Carrowgarve, Co. Mayo", "Teacher:": "\nTomás Ó Fiachra\n"}, {"Collector": "Teresa Coyne", "Gender": "female"}, {"Language": "English"}]}, "4428056/4373354/4467271": {"title": "St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0147, Page 587", "Page 587"], "url": "https://www.duchas.ie/en/cbes/4428056/4373354/4467271", "text": "\nSheila Mullaney2nd June '38St. Patrick is the patron Saint of Ireland. Long ago in the days of old St. Patrick was very badly honoured by the Irish people. They used to drink and drink until they did not know whether it was the ground or the air that was carrying them. \tSometimes they used to smash each other and fight and kill each other. They thought they were honouring him as best they could. All that class of unholy work was and is called, “drowning the shamrock”. \tNowadays he is better honoured. Every year the people of Ireland send shamrock to\n(continues on next page)\n", "school_info": "School: An Cheathrú Gharbh", "metadata": [{"Location:": "Carrowgarve, Co. Mayo", "Teacher:": "\nTomás Ó Fiachra\n"}, {"Collector": "Sheila Mullaney", "Gender": "female", "Address": "Ballyhanruck, Co. Mayo"}, {"Language": "English"}]}, "4428016/4368435/4471701": {"title": "Festival Customs - St Brigid's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138, Page 107", "Page 107"], "url": "https://www.duchas.ie/en/cbes/4428016/4368435/4471701", "text": "\nFestival CustomsFestival days are arranged in order of time beginning with St. Brigid’s day.  This information was supplied by pupils of Srds VI + VIISt. Brigid’s DayOn St. Brigid’s day the little girls of the district dress up a doll which they call a Brideóg.   Then they go from house to house and repeat the following rhyme “Here comes poor Brigid both deaf and both blind Put your hand in your pocket and give her a coin If you haven’t a penny a halfpenny will do If you haven’t a halfpenny God bless you.” The people usually give a few pence.  If they ask the child’s name its not customary to tell it.\n", "school_info": "School: Clochar na Trócaire, Leac an Anfa, Cathair na Mart", "metadata": [{"Location:": "Leckanvy, Co. Mayo", "Teacher:": "\nAn tSr. Treasa\n"}, {"Language": "English"}]}, "4428026/4369424/4475221": {"title": "Festivals - St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0140, Page 132", "Page 132"], "url": "https://www.duchas.ie/en/cbes/4428026/4369424/4475221", "text": "\nThe 17th March is the day of a National Festival for the Patron Saint of Ireland St Patrick. It comes next to Xmas as a day of great joy and hope. Long ago it was kept in a grand simple fashion. The young people in rural districts worked hard at the spring work so as to have it well advanced by St Patricks Day. The boys then got one shilling for pocket money to \"drown the Shamrock\" and th girls got bright green ribbons to tie their dresses. Of course all attended church in the evening. There were games played by the men with the women and maidens looking on. It was an old custom to give a small gift on this occasion which was called a \"Patrick's Pot.\" Eggs were always cooked (boiled) for breakfast and that egg was called a \"Patricks Pot.\"Before the Day of freedom young and\n(continues on next page)\n", "school_info": "School: Ballycastle Boys'", "metadata": [{"Location:": "Ballycastle, Co. Mayo", "Teacher:": "\nMícheál de Búrca\n"}, {"Collector": "John Lenihan", "Gender": "male", "Address": "Ballycastle, Co. Mayo"}, {"Informant": "Mrs Polke", "Gender": "female", "Age": "63", "Address": "Ballinglen, Co. Mayo"}, {"Language": "English"}]}, "4428027/4369692/4475745": {"title": "Gach Galar a Thagas ar an mBoin agus an Leigheas dó", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0140, Page 400", "Page 400"], "url": "https://www.duchas.ie/en/cbes/4428027/4369692/4475745", "text": "\nBíonn greann mór ag na sean daoine i mBaile an Chaisil Lá 'le Pádhraig. Cuireann siad fá-dhein buidéail uisge beatha agus cuireann siad cuireadh ar na chomharsanaibh uilig agus bíonn siad ag ól uisge beatha agus ag cantain ceóil agus ag innseacht sgéalta ar feadh na h-oidhche. Bíonn oidhche bhreágh ghreannmhar aca ag damhsadh agus ag déanamh spóirt go maidin lá ar na bhárach. Caitheann gach Éirinneach fir agus mná in nÉirinn an t-seamróg Lá 'le Pádhraig. Lá 'le\n(continues on next page)\n", "school_info": "School: Baile an Chaisil C., Clochar na Trócaire", "metadata": [{"Location:": "Ballycastle, Co. Mayo", "Teacher:": "\nAn tSr. Aingeal\n"}, {"Collector": "Áine Ní Chonmara", "Gender": "female", "Address": "Killerduff, Co. Mayo"}, {"Informant": "Máirtín Ó Dochartaigh", "Gender": "male", "Address": "Killerduff, Co. Mayo"}, {"Language": "Irish"}]}, "4428298/4392843/4476075": {"title": "Festival Customs - Christmas", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1038, Page 48", "Page 48"], "url": "https://www.duchas.ie/en/cbes/4428298/4392843/4476075", "text": "\n(continued from previous page)\nOur box would if it had a tongue,Nine or ten shillings would do it no wrong:All silver, no brass;Bad halfpence won't pass.The company:Your cellar door are locked,And we are like to choke,And it's all for the drink,That we sing, boys, sing.\n\n\n\nSaint Patrick's Day.This feast is kept every year on the seventeenth day of March, in honour of Saint Patrick. It is not only kept in Ireland but all over the world. On this day the people in Ireland pull shamrocks and wear them in their hats or coats, and send some of them away to their friends in other countries such as America and England, for this little plant grows in no other country. Long ago when Saint Patrick was journeying through Ireland preaching and teaching, he came to the high king at Tara. He began to tell him of Our Lord's birth, death and resurrection, and the story of the Trinity. He tried to explain the mystery but in words the king not understand. Then looking towards the ground, Saint Patrick pulled a little shamrock and lifting it in his hand he told the king of the three persons and one only God. Then the king believed. Ever since, these little shamrocks are worn on this date, because they grow in every field\n(continues on next page)\n", "school_info": "School: Coill-Chéim", "metadata": [{"Location:": "Calhame, Co. Donegal", "Teacher:": "\nSeán Mac Cuinneagáin\n"}, {"Informant": "P. Mc Closkey"}, {"Language": "English"}]}, "4428296/4392242/4480217": {"title": "St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1037, Page 145", "Page 145"], "url": "https://www.duchas.ie/en/cbes/4428296/4392242/4480217", "text": "\nSt Patrick's Day is held on the 17th March. Great honour is shown to St Patrick in Ireland, and especially here in Donegal. On that day Mass is celebrated in each church, and Hymns to St. Patrick are sung. Each man, woman and child is wearing a bunch of Shamrocks.Some are wearing green harps and badges of St. Patrick. After Mass crowds of young men playing bands, and carrying banners, march through the towns, followed by admiring crowds. That night Ceilidhs, and Irish Concerts are held. Boxes of Shamrocks are sent to our absent friends in foreign lands.\n", "school_info": "School: Leitir Mhór", "metadata": [{"Location:": "Lettermore, Co. Donegal", "Teacher:": "\nEilís Ní Bhaoghaill\n"}, {"Collector": "Philomena Boyle", "Gender": "female", "Address": "Lettermore, Co. Donegal"}, {"Language": "English"}]}, "4428316/4394123/4482700": {"title": "Féilí na Bliana - Lá Fhéile Pádraig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1042, Page 339", "Page 339"], "url": "https://www.duchas.ie/en/cbes/4428316/4394123/4482700", "text": "\nLá'l PádraicBa mhór an lá é seo ins an cheanntar seo roimhe seo. Chuir mé síos  moran fa dtaoibh de nuair a scríobh mé fa Druimnafionaigle.Bhí droch-chleachtadh ar an lá sin comh maith leis an déagh rud. Bhíodh dream beag agus shaoileadh (?) siad nar cóir an lá seo a leigint thart gan  an seamróg  a bháitheadh. Is furast leithscéal  fhagháil nuair atá mian ag duine an rud a dheanadh.\n\n\n\nBíonn teintreacha amuigh ag na daoine ar an oidhche seo (Meitheamh 23adh). Bíonn ceann mór in gach uile bhaile. Cuireann siad an teine ar an bhall is airde sa bhaile sa dóigh go mbéidh sí le feiceail ag na bailtibh uilig thart, bíonn na bailte annsin uilig ag dréim cia aca a bheás an ceann is mó.Cruinnigheann an t-aos óg thart fá'n teine go mbíonn sé mall san oidhche agus mar bhfuil callan agus gleo annsin ní lá go fóill é.Cúpla ar bith atá mór le chéile agus a bhfuil súil aca gabhail i gcionn an t-saoghail gan mhoill b'fearra daobhtha fanacht amach  ua'n soluis na geobhaidh siad Tally ho ar an teine.Cuireann an t-sean bhunadh  teine bheag daobhtha féin taob' amuigh de'n teach agus deireann siad\n(continues on next page)\n", "school_info": "School: Cill Chartha", "metadata": [{"Location:": "Kilcar, Co. Donegal", "Teacher:": "\nEighneachan Ó Muireadhaigh\n"}, {"Language": "Irish"}]}, "4493758/4417252/4531616": {"title": "Festival Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1111, Page 240", "Page 240"], "url": "https://www.duchas.ie/en/cbes/4493758/4417252/4531616", "text": "\nThe people    say an hour of prayers on St. Patrick's Day. This was always a custom because when St. Patrick was in Ireland he had a certain day for the people to go to a cross.\n\n\n\nLong ago, the people of this place used to go on St Stephen's Day to kiss the Cross on Bulbin. Bulbin is a hill in Clonmany, Innishowen, Co Donegal. Some people pray for an hour on that day.\n(continues on next page)\n", "school_info": "School: St Oran's, Buncrana", "metadata": [{"Location:": "Buncrana, Co. Donegal", "Teacher:": "\nSeán Mac Éibhir\n"}, {"Informant": "John Mc Laughlin", "Gender": "male", "Age": "71", "Address": "Sladran, Co. Donegal"}, {"Language": "English"}]}, "4493771/4418737/4534304": {"title": "Saint Brigid's Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1114, Page 297", "Page 297"], "url": "https://www.duchas.ie/en/cbes/4493771/4418737/4534304", "text": "\nOn this day it is customary for the people to wear a bunch of shamrock in their coats in honor of St. Patrick as it was with the little plant that he first taught the pagans of Ireland, the true faith. It is also a custom for the bands to go out playing  the old national airs such as, the \"Wearing of the Green\". One famous band which still carries out this custom is the Gleneely band.Shamrocks are sent to the members of the family who are in exile. In the evening it is customary for the old men of the district to go to the town for a \"wee drop\".\n", "school_info": "School: Clochar na Trócaire, Carn Domhnaigh", "metadata": [{"Location:": "Ballylosky, Co. Donegal", "Teacher:": "\nAn tSr. M. Beirín Ní Bhaoighill\n"}, {"Language": "English"}]}, "4493776/4419269/4535277": {"title": "Feast and Festivals - St Brigid's Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1116, Page 121", "Page 121"], "url": "https://www.duchas.ie/en/cbes/4493776/4419269/4535277", "text": "\n(continued from previous page)\npeople put one over every door.\"Poundies\" is a local name for mashed potatoes. In some houses when the crosses are made they are wrapped in a white cloth and holy water is shaken on them Then they are left out all night. This cloth is a cure for a sore head and for the toothache. It is called bratóg Bhrighde. Some people put out a bowl in under a bush and if it rains that night the water in the bowl is kept as a cure for sickness.\n(continues on next page)\n\n\n\nOn that day shamrocks and emblems are worn by Catholics, Protestants and Presbyterians. The old people say:_\"On Patrick's Day throw candle and candle stick away\"The Sunday before lent is called \"Whispering Sunday\", because of the old people \"match-making\" when going to and from Chapel. The next day is called Galloping Monday because of the rush to get married.The next day is Shrove Tuesday because of boys and girls who wished to get married to people their parents didn't like left to the last day and kept it secret. On this day Pancakes are made for evening tea, and it is commonly known as Pancake Tuesday.\n\n\n\nChildren get up early to see the sun dance at  6. o'clock. It is supposed to give three Skips at this hour. In the afternoon they gather at an Easter House made of sods some time before.\n(continues on next page)\n", "school_info": "School: Glassalts", "metadata": [{"Location:": "Glasalt or Treanfasy, Co. Donegal", "Teacher:": "\nM. P. Ó Dochartaigh\n"}, {"Language": "English"}]}, "4493811/4422834/4538633": {"title": "How Saint Patrick's Day is Spent Locally", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1124, Page 159", "Page 159"], "url": "https://www.duchas.ie/en/cbes/4493811/4422834/4538633", "text": "\nOn the day before St. Patrick's day we gather a big bunch of shamrocks for to wear the next day.About a week or ten days before the feast my mother sends some shamrocks to friends in America and England.On the morning of St. Patrick's day every person wears a small bunch of shamrocks in their coats to the Church.Some of them wear badges with the picture of St. Patrick on it.About fifty or sixty years ago the people believed that St. Patrick's day was not spent well without everyone in the house getting some whiskey, even the baby in the cradle.\n", "school_info": "School: Aughaclay", "metadata": [{"Location:": "Templemoyle, Co. Donegal", "Teacher:": "\nSeán Ó Beirn\n"}, {"Collector": "Brigid Mc Laughlin", "Gender": "female", "Age": "12", "Address": "Malin, Co. Donegal"}, {"Language": "English"}]}, "4562118/4561068/4562248": {"title": "Féilí na Bliana", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0020, Page 0067", "Page 0067"], "url": "https://www.duchas.ie/en/cbes/4562118/4561068/4562248", "text": "\n(continued from previous page)\nDreoilin, Dréoilin,rí na n-éan.\n\n\n\nFadó thosuigh na daoine a gcur fataí agus ní bheadh siad sásta go mbeadh na scoltóga gearrtha ar an Áoine roimh an lá a chuiridís iad. Nuair a bíodh siad  curtha acú luachta ortha in Onór Naomh Pádhraig. Cuirtear splannc teine ins an mála  coirce in Onoir an teine a lás Naomh Pádhraigh i gCnoc Sláinne. Ní raibh fáth ar bith leis an obair sin acht bí go leor  pisreóga ag na daoine fadó    sin é an chreid a bhí acú. nuair nach raibh aon eolas eile acú.Lá BealtaineFadó agus an fhaid o shoin bhíodh fásann ag na mná bhíodh siad ag siubhal in dhiaidh na bá bainne agus iad ag rádh  \"iman bó(?)\n(continues on next page)\n", "school_info": "School: Cúl Árann (Clochar)", "metadata": [{"Location:": "Coolaran, Co. Galway", "Teacher:": "\nAn tSr Fionnbharr Nic Chárthaig\n"}, {"Collector": "Crís Ní Choncarra", "Gender": "female", "Address": "Turloughmore Common, Co. Galway"}, {"Informant": "Padraig Ó Uigínn", "Gender": "male", "Address": "Turloughmore Common, Co. Galway"}, {"Language": "Irish"}]}, "4583316/4579043/4588036": {"title": "Saint Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0051, Page 0307", "Page 0307"], "url": "https://www.duchas.ie/en/cbes/4583316/4579043/4588036", "text": "\nOn the seventeenth day of March, St. Patrick's Day occurs each year, and this day is kept holy, because it is the anniversary of Patrick's death. The evening before, children go out, gathering shamrock, to wear next day in their coats going to Mass. Grown-up people also wear badges. The shamrock has three green leaves and it is mostly found under hedges, and in mossy places. The leaves are rounded.St. Patrick was buried in Downpatrick, with Saint Brigid, and Saint Columcille, when he died in the year 461. On the mountain, called Croagh Patrick, in County Mayo, he prayed that Eire should neve lose the faith, and we are told his prayer was granted.People collect shamrock, and send it to their friends in exile, to remind them of St. Patrick's Day. These are delighted when they get it, for it makes them think of Eire, their native land.\n", "school_info": "School: Druim", "metadata": [{"Location:": "Drum, Co. Galway", "Teacher:": "\nMáiréad Ní Dhubháin\n"}, {"Collector": "Tess Rafferty", "Gender": "female", "Age": "13", "Address": "Larraga, Co. Galway"}, {"Language": "English"}]}, "4583331/4580248/4591695": {"title": "Festival Customs - Chalk Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0055, Page 0120", "Page 0120"], "url": "https://www.duchas.ie/en/cbes/4583331/4580248/4591695", "text": "\nOn Chalk Sunday, the first Sunday in Lent, all eligible unmarried men and women are chalked on returning from Mass on Sunday.\n\n\n\nSt. Patrick' Day:-On St. Patrick's day the people wear shamrock, the men wear it either in their hats or their buttonholes, and the women wear it pinned on their outer garments.  Harps are also worn.  People also always a piece of shamrock to their friends in other countries, so although they are out of Ireland they can wear their shamrock.There was an old custom known as \"Drowning the Shamrock\", but people often abused this by getting drunk.\n", "school_info": "School: Baile Mór Síl Anmchadha (Laurencetown)", "metadata": [{"Location:": "Laurencetown, Co. Galway", "Teacher:": "\nSeán Ó Cogaidhín\n"}, {"Language": "English"}]}, "4613682/4608153/4623305": {"title": "St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0018, Page 275", "Page 275"], "url": "https://www.duchas.ie/en/cbes/4613682/4608153/4623305", "text": "\nCaint a chualas ó mo shéan-athair, Domhnall Pléamonn, ceithre scór bliadhain d'aois.18adh Márta 1938St. Patrick's Day is on the 17th March. People wear shamrock on that day in honour of St. Patrick. Ten years ago the shops used be opened in towns. The people from my district used go to Tuam and attend last mass there. There used be a procession after last mass and the children from the schools of the parish used march in the procession. Banners were carried in the procession and the band, which was first, played \"St Patrick's Day\" and other national airs. It is forbidden by law to open public houses on St. Patrick's Day at present.My grandfather said they he heard that St. Patrick visited Killbannon. He heard the older people say that St. Patrick was passing Lavally lake about nightfall and he saw a light out in the lake. He went to a house which was situated near the lake and inquired about the light. The people told him that they had seen the light  appear and disappear often and they were afraid to go out at night. St. Patrick said prayers on the shore of\n(continues on next page)\n", "school_info": "School: Leath-bhaile", "metadata": [{"Location:": "Levally, Co. Galway", "Teacher:": "\nSéamus Ó Maoldhomhnaigh\n"}, {"Collector": "Domhnall Pléamonn", "Gender": "male", "Address": "Cartron, Co. Galway"}, {"Informant": "Domhnall Pléamonn", "Relation": "grandparent", "Gender": "male", "Age": "80"}, {"Language": "English"}]}, "4622968/4618225/4628643": {"title": "Féilí na Bliana - Lá Fhéile Pádraig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0071, Page 052", "Page 052"], "url": "https://www.duchas.ie/en/cbes/4622968/4618225/4628643", "text": "\nLá Saoire  mór é Lá'l Pádraic in Éirinn. Bhí siad ag caitheamh seamróg ina gcuid cótaí in-oinéir do Naomh Pádraic. Is leis an mbláth sin a theasbáin sé an creideamh fadó. Bíonn síad ag caitheamh uaithne ina gcuid cótaí freisean. Mar gheall go bé an chéad Árd Easbog a bhí ar Éirinn é caithtear an uaithne an lá sin dhó. Cuireann lá'l Páraic na Sean-Ghaedhib i gcuimhne dhóibh agus caitheann siad cláirseach an lá sin i gcuimhne do'n ghléas ceóil a bhí aca. Is maith le daoine as Éirinn atá imthighthe thar sáile an tSeamróg fhághail. Cuireann a muintir aca í. Bhiodh fuisce i  chuile theach fadó. Bhiodh síad ag ól sláinte Phádraic.\n\n\n\nLá'l Mhic Dara (16adh Iúil)Bíonn patrún sa gCeathramhain Ruaidh. Bíonn spraoidhe ag na daoine ann an lá sin. Téigheann go leor daoine gan Ceathramhain Ruaidh le a bheith ag an bPatrún. Bíonn rástaí sa gCeathramhain Ruaidh an lá sin. Bíonn milseáin ag na daoine. Bíonn síad ag déanamh go leor cleasanna. Lá'l Mhic Dara bíonn chuile dhuine ag ól. Bíonn ceol sa gCeathramhain Ruaidh an lá sin. Bíonn daoine thiar i gCuigéal an lá sin. Bíonn ól 's spraoidhe aca ann. Bíonn siad ag ceannacht milseán agus ubhlaí. Bíonn chuile dhuine ag ól an lá sin.\n", "school_info": "School: An Druim", "metadata": [{"Location:": "Drim, Co. Galway", "Teacher:": "\nMicheál Ó Concheanainn\n"}, {"Language": "Irish"}]}, "4622994/4621848/4628930": {"title": "St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0078, Page 051", "Page 051"], "url": "https://www.duchas.ie/en/cbes/4622994/4621848/4628930", "text": "\nSt Patrick's day always falls on 17th March and on that day there does be a procession held in every Parish. My father told me that he played the fife for years with the brass band. They used to march in a procession around the parish and hundreds of people used to follow them.  St. Patrick's day everybody wears something green and they also wear the Shamrock on that day. The reason they used to wear the green because it is our National colour. St Patricks day the fair is held in Castleblekeney and the people gather's from all the local villages and come's in to Castleblakeney. In the evening they go into the shops and  they all get drunk it is an old saying to drown the Shamrock\n", "school_info": "School: Gallach", "metadata": [{"Location:": "Gallagh, Co. Galway", "Teacher:": "\nBean Uí Mhaoiléidigh\n"}, {"Collector": "Michael Keane", "Gender": "male", "Address": "Rathbaun, Co. Galway"}, {"Language": "English"}]}, "4622978/4619865/4629370": {"title": "Nósanna Lá Fhéile Pádraig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0074, Page 276", "Page 276"], "url": "https://www.duchas.ie/en/cbes/4622978/4619865/4629370", "text": "\nCaitheann an t-aos óg cláirseach nó ribín uaithne nó comhartha éicint eile Lá Fhéile Pádhraic. Glaoidhtear ar an gcomhartha sin Crosóg Pádhraic.Bronntanas ar bith fághtar Lá Fhéile Pádhraic glaoidhtear air Pota Phádhraic.\n\n\n\nBhí Márta ag iarraidh na sean Bó Riabhaigh a mharbhuigh acht chionn air. Agus deirtear go d’iarr sé trí lá ar iasacht ar Aibreán le h-aghaidh í a feannadh. Glaoidhtear ar an céad trí lá d’Aibreán laetheannta na Bó Riabhaigh.\n\n\n\nDeirtear gur chuir na Lochannaigh potaí ime i dtaisge i Log an Ime fadó. Agus fuair fear éicint dhá phota ann. Glaoidhtear Log an Ime ar an log ó shoin. In-aice leis an Log tá carraig mhór\n(continues on next page)\n", "school_info": "School: Coill Maolacáin", "metadata": [{"Location:": "Kilmeelickin, Co. Galway", "Teacher:": "\nAnna M. Ní Loingsigh\n"}, {"Language": "Irish"}]}, "4622985/4620886/4630609": {"title": "Lá Fhéile Stiofáin", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0076, Page 182", "Page 182"], "url": "https://www.duchas.ie/en/cbes/4622985/4620886/4630609", "text": "\n(continued from previous page)\nsiad rann seoDreóilín dreóilín ríogh na (?)Is mór éa muirín is beag é (?)Eirigh suas a bhean an thigheAgus tabhair pinginn nódó don dreóilín In áiteacha eile níl siad chomh dutracht- ach agus a bhíodh siad fadó. Tagann Lá Fhéile Stiopháin ar an séadh lá fichead de mí na Nodlag. Sin é an lá indiadh Lá Nodhlag. Máire Nic AodhagáinCill BhrighdeÓMairtín Mac AodhagáinCill Bhrighde\n\n\n\nLá le PádhraigBíonn cruinneadh mór annseo Lá le Pádhraig. Bíonn óg agus\n(continues on next page)\n", "school_info": "School: Clochar ar an bhFáirche", "metadata": [{"Location:": "Clonbur, Co. Galway", "Teacher:": "\nSiúr Iarfhlaith Ní Mhóráin\n"}, {"Collector": "Máire Nic Aodhagáin", "Gender": "female", "Address": "Kilbride, Co. Mayo"}, {"Informant": "Mairtín Mac Aodhagáin", "Gender": "male", "Address": "Kilbride, Co. Mayo"}, {"Language": "Irish"}]}, "4602703/4596962/4632527": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0081, Page 234", "Page 234"], "url": "https://www.duchas.ie/en/cbes/4602703/4596962/4632527", "text": "\n(continued from previous page)\nCertain day people gathered there and rub a cloth of the ball and keep that cloth. They say it would cure a sick person.\n\n\n\nLong ago the people made\n(continues on next page)\n", "school_info": "School: Maigh Locha (Cailíní)", "metadata": [{"Location:": "Moylough, Co. Galway", "Teacher:": "\nEibhlín, Bean Uí Challaráin\n"}, {"Collector": "May Haverty", "Gender": "female"}, {"Informant": "Mrs T. Haverty", "Gender": "female", "Age": "81", "Address": "Springlawn, Co. Galway"}, {"Language": "English"}]}, "4613725/4613169/4643691": {"title": "St Patrick's Cross", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0409, Page 121", "Page 121"], "url": "https://www.duchas.ie/en/cbes/4613725/4613169/4643691", "text": "\nSt. Patrick's cross was worn on the left shoulder of the garment. It was made from ribbons and worn on St. Patrick's day and left on the garment until Lady day. Then it was burned. All the children wore them.\n", "school_info": "School: Dromclough (C.),", "metadata": [{"Location:": "Kilcarra Beg, Co. Kerry", "Teacher:": "\n-\n"}, {"Collector": "Bridie Flaherty", "Gender": "female"}, {"Informant": "Mary Kirby", "Gender": "female", "Age": "72"}, {"Language": "English"}]}, "4644827/4613040/4651174": {"title": "St Patrick's Crosses", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0408, Page 179", "Page 179"], "url": "https://www.duchas.ie/en/cbes/4644827/4613040/4651174", "text": "\nSilk and velvet little ribbons were sewn on to a cardboard cross covered with ribbon. A nice like bunch of ribbons were sewn on to each end of the cross and the nicest bunch was kept for the centre of the cross. On St Patrick's day the children wore these crosses on their shoulders. They were very fond of these brightly coloured crosses. The old people saved up pieces of ribbon from hats and bonnets and kept them for favourite children coming to the house, for the purpose of making these crosses.\n\n\n\nSmall eggs were collected and boiled with blossoms of furze and grass to colour them. Then the children who usually visited the house, and the children of the house went out into a field on Easter Sunday and some one threw the eggs one\n(continues on next page)\n", "school_info": "School: An Drom Clochach (B.)", "metadata": [{"Location:": "Dromclogh, Co. Kerry", "Teacher:": "\nPártholán Ó Ruadhacháin\n"}, {"Collector": "Mrs Norah Costello", "Gender": "female", "Occupation": "assistant teacher"}, {"Informant": "Michael Costello", "Gender": "male", "Age": "78", "Address": "Ballyhorgan East, Co. Kerry"}, {"Language": "English"}]}, "4672094/4669421/4672369": {"title": "Folklore - St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0166, Page 038", "Page 038"], "url": "https://www.duchas.ie/en/cbes/4672094/4669421/4672369", "text": "\nWe have St. Patrick's Day on the 17th March and on that day Mass is said. The men wear shamrock in their hats, and the women and girls wear green ribbons or badges on their right shoulders. The people here in Ireland send shamrock to their  friends in America, and they are very thankful to get it, as it puts them in mind of Ireland. On St. Patrick's Day the people have processions, and if there was a difference in the football beforehand, it is settled on that day.\n", "school_info": "School: Cluainín Mór", "metadata": [{"Location:": "Cooga, Co. Sligo", "Teacher:": "\nSs. Ó Murchú, Seán Ó Murchú\n"}, {"Language": "English"}]}, "4678379/4673728/4681926": {"title": "Festival Customs - Saint Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0417, Page 319", "Page 319"], "url": "https://www.duchas.ie/en/cbes/4678379/4673728/4681926", "text": "\nSaint Patrick's Day occur's on the seventeenth of March. It is a holiday of obligation. It was upon that day Saint Patrick died. It is not kept holy in any other country.Early that morning they go out picking the shamrock and they wear it on their coats. The shopkeepers sell a lot of broaches in which the image of Saint Patrick's head is. On that day there are processions and on that day also there are matches played in Croke-Parke in Dublin\n", "school_info": "School: Bouleenshere (B.), Baile Thaidhg, Tráighlí", "metadata": [{"Location:": "Booleenshare, Co. Kerry", "Teacher:": "\nJeremiah M. Healy\n"}, {"Collector": "Christy Mulquinn", "Gender": "male", "Address": "Caherulla, Co. Kerry"}, {"Informant": "John Mulquinn", "Gender": "male", "Address": "Caherulla, Co. Kerry"}, {"Language": "English"}]}, "4678391/4675767/4682728": {"title": "Lá Fhéile Pádraig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0421, Page 174", "Page 174"], "url": "https://www.duchas.ie/en/cbes/4678391/4675767/4682728", "text": "", "school_info": "School: Scoil N. Breandán", "metadata": [{"Location:": "Ballynagall or Ballydavid, Co. Kerry", "Teacher:": "\nTadhg Ó Caomháin\n"}, {"Informant": "Seamus Mac Éoin", "Gender": "male", "Age": "80", "Address": "Ballinknockane, Co. Kerry"}, {"Language": "Irish"}]}, "4672101/4670194/4683349": {"title": "Festival Customs - St Bridget's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0167, Page 0753", "Page 0753"], "url": "https://www.duchas.ie/en/cbes/4672101/4670194/4683349", "text": "\nIt was the custom on St Bridget's night for the oldest girl of the house to bring in a bundle of rushes before the supper was eaten. When the supper was over the youngest person of the house divided the rushes in equal amounts among all that were in the house. Then they peeled the rushes and when that was done all the peeled rushes were put together and wax or tallow was put around the rushes and so a candle was made. The man of the house lit the candle and left it lit that night in honour of St Bridget and by doing that St Bridget kept away any sickness from them during the year.\n\n\n\nThe 17th March is always honoured in\n(continues on next page)\n", "school_info": "School: Dún Béicín", "metadata": [{"Location:": "Doonbeakin, Co. Sligo", "Teacher:": "\nMáire Nic Giolla Geanainn\n"}, {"Collector": "Winnie Dunleavy", "Gender": "female", "Address": "Dunowla, Co. Sligo"}, {"Language": "English"}]}, "4687714/4686472/4689731": {"title": "Féilí na Bliana - Lá Fhéile Pádraig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0434, Page 152", "Page 152"], "url": "https://www.duchas.ie/en/cbes/4687714/4686472/4689731", "text": "\nó Phóilín Ní FhoghludhaSr. Uacht. an Dr.Cill-OrglanAll the people, around here wear shamrock on St. Patrick's Day. Some of the men put a bit of shamrock on their hats, and they keep it there until Palm Sunday when they substitute Palm for it.\n", "school_info": "School: Killorglin (C.)", "metadata": [{"Location:": "Killorglin, Co. Kerry", "Teacher:": "\nÚna Nic Coluin\n"}, {"Collector": "Póilín Ní Fhoghludha", "Gender": "female", "Address": "Killorglin, Co. Kerry"}, {"Language": "English"}]}, "4687714/4686473/4689734": {"title": "Féilí na Bliana - Lá Fhéile Pádraig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0434, Page 153", "Page 153"], "url": "https://www.duchas.ie/en/cbes/4687714/4686473/4689734", "text": "\nó   C. Ní CobhthuaidhAbha na GairridheCill-OrglanLong ago on St Patrick's Day, people used to go out and bring in a bit of sally-tree, and burn it into a cinder and put the sign of a cross on the left-hand shoulder.\n", "school_info": "School: Killorglin (C.)", "metadata": [{"Location:": "Killorglin, Co. Kerry", "Teacher:": "\nÚna Nic Coluin\n"}, {"Collector": "C. Ní Cobhthuaidh", "Gender": "female", "Address": "Ownagarry, Co. Kerry"}, {"Language": "English"}]}, "4687719/4687007/4708670": {"title": "Féilte na Bliana - Lá Fhéile Pádraig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0435, Page 384", "Page 384"], "url": "https://www.duchas.ie/en/cbes/4687719/4687007/4708670", "text": "\nAspol mór na h-Éireann do b'eadh Pádraigh. Onóirimíd é ar an 17adh lá de Márta. Chaitheadh muintir na h-Éireann an t-seamrógín ar an lá seo mar is léi a mhúin sé an creideamh ceart do mhuintir na h-Éireann.Téigheadh na cumman mór thímpeall na sráide ag mársáil fadó agus bíodh úirlis éigin cun ceóil a sheint ag gach duine díobh. Téigheadh duine rómpa a n-áirde ar capall agus bíodh an capall sin gléasta suas go deas le ribíní agus géaga glasa.\n\n\n\nTosnuigheadh Inid lá Nodhlag Beag agus críocnuigheadh sé ar lá roimh Céadaoin an Luaithridh sin Mart na h-Inide. Pósadh na daoine i rith na haimsire sin. Téigheadh na daoine go h-áit i bparóiste na Tuaithe ar a glaodhtar \"An Patrún\" agus dhéanadh siad na chleamhnaistí ansan. Dá gcífheadh fear ó'n áit seo bean ó áit eile oireamhnac i gcóir pósadh ní thagadh siad abhaile gan\n(continues on next page)\n", "school_info": "School: Dubhghlas (C.)", "metadata": [{"Location:": "Douglas, Co. Kerry", "Teacher:": "\nEibhlín, Bean de Róiste\n"}, {"Collector": "Síle Máire Ní Dhuígín", "Gender": "female", "Address": "Killorglin, Co. Kerry"}, {"Informant": "Seán P. Ó Dhuigín", "Gender": "male", "Age": "86", "Address": "Killorglin, Co. Kerry"}, {"Language": "Irish"}]}, "4687719/4687011/4708689": {"title": "Féilte na Bliana - Lá Fhéile Bríde", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0435, Page 388", "Page 388"], "url": "https://www.duchas.ie/en/cbes/4687719/4687011/4708689", "text": "\n(continued from previous page)\naon oidhche ól ná iththe aca an am san mar nár geibhidís an t-airgead cun é bheith aca.\n\n\n\nÓnóiridís lá le Pádraig i gcomhnuidhe go mór mhór i nÉirinn. Caithidís seamróg agus ribíní uaithne ortha an lá san. Téigeadh na buachaillí agus na cailíní isteach sa t-sráid agus bíodh mór-siubhal ann.Ar dtúis do bíodh na capaill ag siubhal agus buachaillí beaga ar a muin. Do bíodh ribíní iol-dathacha  ceangailte le muiníl na gcapall. Bhíodh croise gá caitheamh ag na buachaillí. Díreach in a ndiaidh do bíodh na cailíní scoile ar siubhal agus iad go léir gléasta suas in éadaig bána agus iad ag féachaint go h-áluinn. Ar theacht an tráthnóna do bíodh rinnce agus seint ceóil ar siubhal ar fud na sráide\n", "school_info": "School: Dubhghlas (C.)", "metadata": [{"Location:": "Douglas, Co. Kerry", "Teacher:": "\nEibhlín, Bean de Róiste\n"}, {"Collector": "Cáit Ní hEachthegeirn", "Gender": "female", "Address": "Tullig More, Co. Kerry"}, {"Informant": "Mícheál de hÓr", "Gender": "male", "Age": "73", "Address": "Tullig More, Co. Kerry"}, {"Language": "Irish"}]}, "4701700/4693776/4721641": {"title": "Festival Customs - St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0169, Page 228", "Page 228"], "url": "https://www.duchas.ie/en/cbes/4701700/4693776/4721641", "text": "\nOn St Patricks Day,Throw the candle and candle-stick away.As after St Patrick's Day, the days are getting long, and the nights are getting short.\n", "school_info": "School: Páirc Árd (High Park)", "metadata": [{"Location:": "Carrowgilhooly, Co. Sligo", "Teacher:": "\nEoghan Ó Conaill\n"}, {"Collector": "Kathleen Browne", "Gender": "female", "Address": "Carrowbrickeen, Co. Sligo"}, {"Informant": "Mrs Browne", "Gender": "female", "Age": "56", "Address": "Carrowbrickeen, Co. Sligo"}, {"Language": "English"}]}, "4701657/4690282/4725780": {"title": "Weather-Lore", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0155, Page 0584", "Page 0584"], "url": "https://www.duchas.ie/en/cbes/4701657/4690282/4725780", "text": "\n(continued from previous page)\na Catholic is dying, a lighted (blessed) candle is kept in his or her hand.Each family takes a certain number of candles (containing a certain percentage of fine beeswax- 65% I think) to the local Church in the morning.One candle is only taken home, as the remainder are given as an offering and taken possession of by the Parish Priest.Whenever a violent storm accompanied by thunder and lightning is raging or whenever there is \"big wind\" and people are nervous a blessed candle is lighted and kept burning until the danger passes away.\n\n\n\nThe Feast of the National Apostle is nowadays celebrated in a very becoming religious manner in the Parish of Ahamlish, and altogether different from what it was forty or even thirty years ago. The shamrock is worn by men\n(continues on next page)\n", "school_info": "School: Cliffoney (B.)", "metadata": [{"Location:": "Cliffony, Co. Sligo", "Teacher:": "\nPatrick Mc Hugh\n"}, {"Collector": "Patrick Mc Hugh", "Gender": "male", "Age": "54", "Occupation": "múinteoir", "Address": "Cliffony, Co. Sligo"}, {"Language": "English"}]}, "4706359/4706107/4726003": {"title": "St Patrick's Day Crosses (Girls)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0448, Page 198", "Page 198"], "url": "https://www.duchas.ie/en/cbes/4706359/4706107/4726003", "text": "\n'Tis well I remember when I was a little girl going to Kilmurry school, all the little girls used to wear crosses on St Patrick's day to honour St. Patrick. I used to make a beautiful cross for that day. The first thing I got was two pieces of stiff card-board, one piece longer than the other, then covered these pieces with some nice pieces of silk and I sewed them together in the shape of a cross.For about a month before St. Patrick's day I used to be gathering the nicest bits of silk or satin I could find to cut them into narrow strips to make nice, neat, fluffy little bundles of them. I then sewed one bundle on each of the four ends and one on the centre of the cross.Then my cross was complete and ready to wear on my left arm on St. Patrick's day and for a whole week after going to school. There wasn't any  \"meas\" on any little girl that had not a cross for St Patrick's day. Now, ye are all too\n(continues on next page)\n", "school_info": "School: Cnuicín na hAbhann", "metadata": [{"Location:": "Knockeennahone, Co. Kerry", "Teacher:": "\nMáiréad, Bean Uí Chéirín\n"}, {"Collector": "(name not given)", "Gender": "unknown"}, {"Informant": "Mrs J. D. Riordan", "Gender": "female", "Address": "Barna, Co. Kerry"}, {"Language": "English"}]}, "4706359/4706109/4726004": {"title": "St Patrick's Day Crosses (Girls)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0448, Page 200", "Page 200"], "url": "https://www.duchas.ie/en/cbes/4706359/4706109/4726004", "text": "\n(continued from previous page)\nwear on our arms crosses made from different coloured ribbons. A dressmaker called Mary Kelly used to make those crosses and give them to the children she liked. I got one from her once and I used to wear it like the rest. The brighter the colours in the cross the better we liked it and the more proud we were when we were wearing  it on St. Patrick's Day.Recorded byJeremiah D. RiordanBarna,Scartaglen\n\n\n\nI remember when I was a little boy going to Knockeenahone School all the little boys wore crosses on St Patrick's Day to honour St Patricks.These crosses were very hard to be made. I used always to make my  own cross. The first thing I got when I was making my cross was a plain piece of paper. Then I got a cup and I put the mouth of the cup down on the paper and I drew a\n(continues on next page)\n", "school_info": "School: Cnuicín na hAbhann", "metadata": [{"Location:": "Knockeennahone, Co. Kerry", "Teacher:": "\nMáiréad, Bean Uí Chéirín\n"}, {"Collector": "Mary Connell", "Gender": "female", "Address": "Knockeennahone, Co. Kerry"}, {"Informant": "Jeremiah D. Riordan", "Gender": "male", "Address": "Barna, Co. Kerry"}, {"Language": "English"}]}, "4701770/4701320/4727220": {"title": "Christmas Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0188, Page 087", "Page 087"], "url": "https://www.duchas.ie/en/cbes/4701770/4701320/4727220", "text": "\n(continued from previous page)\nSmaller groups have harmonicas or fifes or tin whistles. Some of them have a good step dancer with them and then they collect money. Gradually this custom is dying out - one or two groups now only visiting where formerly there used to be as many as ten or twelve.\n\n\n\nShamrock badges and green ribbons are worn - the men wear the Shamrock in their hats.\n\n\n\nPancakes are made and eaten in almost every house in the district.\n\n\n\nUntil quite recently old people used to go from house to house begging eggs - These poor travelling people were well known to people of fifty years ago. Some names of those  which I have heard my father ( RIP ) mention were Kitty the Maid, Mary High Bog, Soft Ann, John Sampey. These travelled great distances and brought the news from one place to another.\n", "school_info": "School: St. Michael's Clooncunny", "metadata": [{"Location:": "Clooncunny, Co. Sligo", "Teacher:": "\nÚna, Bean Uí Stondúin\n"}, {"Language": "English"}]}, "4701695/4693421/4727581": {"title": "St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0165, Page 164", "Page 164"], "url": "https://www.duchas.ie/en/cbes/4701695/4693421/4727581", "text": "\nSt Parick's Day falls on 17th March and it is well to observe it as a holiday in remembrance of our Irish Saint. In olden times people looked forward to pleasure and amusement on that day. It was a great day for fairs and markets where young people gathered together for pleasure and business combined.The girls were prettily dressed in gay colours and always wore green ribbon either in bands or bows upon their hair. The men wore shamrocks which was carefully picked and arranged in their buttonholes. Very often the men came from these fairs or markets   \"Mag-a-lore\".    But provided they reached their own houses without causing any trouble, they were usually forgiven the offence of the extra glass by their better half. This was called \"drowing the Sharmock\" which was only a friendly way of greeting one another.Annie MorrisonSt. Anne's N.S.\n", "school_info": "School: St Anne's, Easkey", "metadata": [{"Location:": "Easky, Co. Sligo", "Teacher:": "\nCáit Nic Eoin\n"}, {"Collector": "Annie Morrison", "Gender": "female", "Address": "Fortland, Co. Sligo"}, {"Language": "English"}]}, "4701691/4693045/4744016": {"title": "St Patrick's Cross", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0163, Page 253", "Page 253"], "url": "https://www.duchas.ie/en/cbes/4701691/4693045/4744016", "text": "\nLong ago, on St Patrick's Day every Irish person used to wear a cross on his shoulder.It was made of white paper and green ribbons. This was worn in honour of St. Patrick who brought the true faith to Ireland.\n", "school_info": "School: Stuacán", "metadata": [{"Location:": "Muingwore, Co. Sligo", "Teacher:": "\nBríd Ní Mhiadhaigh\n"}, {"Collector": "Bridget Best", "Gender": "female", "Age": "14", "Address": "Tullylin or Ballyfeenaun, Co. Sligo"}, {"Informant": "Mrs M. Best", "Gender": "female", "Address": "Tullylin or Ballyfeenaun, Co. Sligo"}, {"Language": "English"}]}, "4713256/4711996/4744538": {"title": "Lá Fhéile Pádraig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0456, Page 480", "Page 480"], "url": "https://www.duchas.ie/en/cbes/4713256/4711996/4744538", "text": "\nLá ‘le Pádraig1.Lá ‘le Pádraig is mé im shuidhe i dtig tabhairneBhí cuileactha áluinn le’m ais ag ól,Bhí meidhre mánla na gruaige báineA súil mar áirne is a gruaidh mar rós,Bhí dísce sáir-fhear ‘na suidhe ar cláir ann.A thug searc is grádh ceart do’n reilteann ógFear súiste is ráine is maighistir sgoláiríA sgríobhann a lán agus a léigheann go leór.11.In easnamh111.\t\t\t(an máighistir scoile)Sin a mhúineann na sagairt clúmhailBráthair is ughdair léighinn sa bhFrainncLucht thigthibh uasail is an dtighthibh cuairteIs na dochtúirí a dheineann leighisIm bhrógh beidh buachaill imgunna beidh púdairIs deas mo “thrús” is mo “caroline”Ag síor ól brannda seadh bhím gan amhrasNuair a bhíonn na drúid bocht so ag rómhar go doimhin1V. \t\t\t(An Feirmeóir)Frighim im thréigean agus treabhaim na réidh-chnuic\n(continues on next page)\n", "school_info": "School: Ráithín (B.)", "metadata": [{"Location:": "Raheen, Co. Kerry", "Teacher:": "\nDiarmuid Ua Cróinín\n"}, {"Informant": "Siobhán Ní Chodhlata", "Gender": "female", "Age": "71", "Address": "Annagh Beg, Co. Kerry"}, {"Language": "Irish"}]}, "4713263/4712870/4744741": {"title": "Customs on St Bridget's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0458, Page 051", "Page 051"], "url": "https://www.duchas.ie/en/cbes/4713263/4712870/4744741", "text": "\n(continued from previous page)\nto town a few days after and they buy porter and they (-) it to a certain house in the district and they hold a dance called a biddy-ball there on a certain night. Long ago they used give the money they used gather to the poor people of the district.A white rag was tied to a bush near the house so that St. Bridget would bless it. This rag was kept throughout the year and it was rubbed to certain sores.\n\n\n\nSt. Patrick's Day falls on the seventeenth of March.1) On St. Patrick's Day the Catholics of Ireland wear shamrock on their coats in honour of St. Patrick.2) There are big parades in cities on St. Patrick's Day.3) Long ago the men used to go to town on St. Patrick's Day and they used drink porter and whiskey and they called this \"The Patrick's Pot\".\n\n\n\nLike Samhain Bealtaine was a great feast by the pagans and they used have a lot of pagan customs at that time. Later on some these customs died out but up to about\n(continues on next page)\n", "school_info": "School: Faithche (B.)", "metadata": [{"Location:": "Faha West, Co. Kerry", "Teacher:": "\nSeán Ó Muircheartaigh\n"}, {"Language": "English"}]}, "4758451/4745062/4759786": {"title": "St Patrick's Festival", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0230, Page 173", "Page 173"], "url": "https://www.duchas.ie/en/cbes/4758451/4745062/4759786", "text": "\n173St. Patrick's Festival.On the 17th of March every year the great festival of \"Our National Apostle\" St. Patrick is celebrated with joy and pleasure by the Irish at home and abroad.This holy Saint died as he had lived in the grace and friendship of God. We honor his feast more than that of any other Saint because he was our converter to Christianity. Throughout St. Patrick's Day many festivals are held all over Ireland and when the night approaches concerts, dances and many\n(continues on next page)\n", "school_info": "School: Cartrún", "metadata": [{"Location:": "Cartronavally, Co. Roscommon", "Teacher:": "\nCáit, Bean Uí Cheallaigh\n"}, {"Collector": "Annie Smith", "Gender": "female", "Address": "Tawnycurry, Co. Leitrim"}, {"Informant": "John Mac Hugh", "Gender": "male", "Age": "66", "Address": "Tents, Co. Leitrim"}, {"Language": "English"}]}, "4758480/4747575/4762187": {"title": "Festival Customs - St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0840, Page 026", "Page 026"], "url": "https://www.duchas.ie/en/cbes/4758480/4747575/4762187", "text": "\nSt Patrick's Day is another of our great feasts. On that day all the people wear shamrock and a badge of St. Patrick.  They do that to honour St Patrick. St Patrick's Day fall on the seventeenth of March and it is a holy day of obligation. It was on that day that St Patrick died.\n\n\n\nWe all are very glad when Christmas comes. We have holidays from school. The young children get sweets, oranges, apples and chocolate from Santa Claus. Some of them get toys and other things. It was on that day that Our Lord\n(continues on next page)\n", "school_info": "School: Clonmore, Piltown", "metadata": [{"Location:": "Clonmore, Co. Kilkenny", "Teacher:": "\nBríd Nic Aodhgáin\n"}, {"Language": "English"}]}, "4713232/4709723/4778262": {"title": "Forges", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0450, Page 242", "Page 242"], "url": "https://www.duchas.ie/en/cbes/4713232/4709723/4778262", "text": "\n(continued from previous page)\nfire is always made in a certain place and in out district both smiths work together.\n\n\n\nLong ago the people used to make their own harps and crosses for St. Patrick's day. They used to be made from a piece of round paper. They used to stick a pen in their hand so as to get a drop of blood to colour them. They used to put different kinds of colours on them and also made a cross out of a bit of green ribbon and sew it on to the paper. They used to colour the harps with yokes of eggs and with green so that they would have something to wear in honour of St. Patrick's Day.\n\n\n\nThe names of our fields at home are, the Kiln field, the big pound and the small pound, The cottage meadow, the meadow near the house the long meadow the small meadow, the bitter field, the big field, the drain field, the bog field, the middle inch and the last inch, the haggard above the house, and the haggard below the house, the páircín and the inch near the bridge. There is a kiln in the kiln field and that is how it got its name. The cows were  kept in the pounds and that is how they got their names. The meadow near the house got its name because it is near the house. The small meadowgot its\n(continues on next page)\n", "school_info": "School: Cnoc Breac", "metadata": [{"Location:": "Knockbrack, Co. Kerry", "Teacher:": "\nSéamus Ó Conchubhair\n"}, {"Language": "English"}]}, "4706346/4704675/4779954": {"title": "Festival Customs - St Brigid's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0444, Page 452", "Page 452"], "url": "https://www.duchas.ie/en/cbes/4706346/4704675/4779954", "text": "\n(continued from previous page)\nsome time ago - school girls used to dress up a little doll - which was called a \"Bríghdeóg\" around in their arms from house to house in honour of St Bridget. They got food in many houses, and money also, and there was always a welcome for St Bridget's \"Bríghdeóg.\" But that custom is now done away with - in this district only boys and men go around that night as on the Wren's Day and they divide the money or perhaps spend it on drink.\n\n\n\nSt Patrick's Day falls on the 17th March. That day is a national holiday as well as being a holyday, and everybody goes to Mass. Shamrock is gathered and worn by people on their coats and caps - in honour of St Patrick and to remind us of the old tradition of St Patrick's explanation of the Trinity by means of the Shamrock. Badges in the form of harps, crosses, etc are worn by the children. Micky Reidy ( of Kilmore, Rathanny ) says that long ago the people used to go to town to drink  \" their Patrick's pot \". When the old people were drunk on St Patrick's day they used say:-\" St Patrick's day we'll dance a jigWith the hat my father wore\".\"Chalk Sunday\" according to Michael Scanlon (Clogherclemin) is the 1st Sunday after Ash Wednesday and the people who got married during Shrove are chalked but Peggy Dorgan of Gortnaleha, Rathanny says that \"Chalk Sunday\"\n", "school_info": "School: O'Brennan, Baile Mhic Ealgóid, Tráighlí", "metadata": [{"Location:": "Tonreagh Lower, Co. Kerry", "Teacher:": "\nPádraig Ó Loingsigh\n"}, {"Collector": "Micky Reidy", "Gender": "male", "Address": "Kilmore, Co. Kerry"}, {"Language": "English"}]}, "4742108/4736668/4815516": {"title": "Féilte na Bliana - Lá Fhéile Pádraig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0471, Page 131", "Page 131"], "url": "https://www.duchas.ie/en/cbes/4742108/4736668/4815516", "text": "\nNíor tháinig Naomh Pádraig go dtí an paróiste seo   Dubhairt sé go raibh muinntear na tuatha go maith, macánta agus níor gádh dó teacht cun íad do bheannúghadh.Bailigheann na buachaillí seamróg maidin lae Fhéile Pádraig. agus caitheann gach duine gas mór seamróige ar a chaipín   Caitheann na cailíní crosanna pádraig nó cláirsighe glasa ar a nguailne.Chuireadh na sean-daoine bochta slat-sailighe isteach sa teine agus annsan do dheinidís figúir na croise ar guailnibh na leanbhaí óga le barr na slaite dóighte.Théigheadh na feirmeóirí san áit seo go Cillorglain an lá san fad ó, acht anois chaithfidís  fanamhaint sa bhaile. Lá saoire mór i lár an earraig a beadh an lá so agus théigheadh na feirmeóirí go dtí an baile-mór ag ceannacht síl-coirce, nó guano igcóir an earraig.  agus nuair  do chasadh feirmeóir le feirmeóir eile sa sráid deireadh sé \"mo Phota Phádraig ort\".\n(continues on next page)\n", "school_info": "School: Gort Buidhe", "metadata": [{"Location:": "Gortboy, Co. Kerry", "Teacher:": "\nGilbert Mac Gearailt\n"}, {"Informant": "Domhnall Ó Cróinín", "Gender": "male", "Age": "57", "Address": "Gortboy, Co. Kerry"}, {"Language": "Irish"}]}, "4742169/4741804/4815810": {"title": "Festival Customs -  St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0775, Page 282", "Page 282"], "url": "https://www.duchas.ie/en/cbes/4742169/4741804/4815810", "text": "\nFestival Customs.St. Patrick's DayOn St. Patrick's Day people wear a piece of shamrock. St Patrick's Day is on the 17th of March. It is a holiday for everyone. People have concerts and dances on St. Patrick's night in honour of St. Patrick. He was the patron saint of Ireland a long time ago. He went about preaching to the people the story of the cross. St. Patrick is buried in Downpatrick.  It is said that the Shamrock hides itself till after Patrick's Day.Vera Spooner\n", "school_info": "School: Kilmeague, Naas", "metadata": [{"Location:": "Kilmeage, Co. Kildare", "Teacher:": "\nBean Mhic Thomáis\n"}, {"Collector": "Vera Spooner", "Gender": "female"}, {"Language": "English"}]}, "4798697/4791021/4923198": {"title": "Customs of St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0252, Page 106", "Page 106"], "url": "https://www.duchas.ie/en/cbes/4798697/4791021/4923198", "text": "\nThere are many customs connected with St. Patrick's day. On that day every one has shamrock, medals and ribbon in their coats, in honour of St. Patrick. On that night concerts are held in halls and houses. Long ago on St. Patrick's day the fair used to be held in Strokestwon on the 17th of March. The people used to go to the fair to \"drown\" the shamrock. On that day there also used to be faction fights, two parties would start the fight with ash plants and black thorn sticks but that custom is over now. Since St. Patrick's day is a bank holiday. Any one who has cousins in America sends the shamrock across the sea.\n", "school_info": "School: Corraslira", "metadata": [{"Location:": "Corraslira, Co. Roscommon", "Teacher:": "\nBean Uí Dhubhláin\n"}, {"Collector": "Mary Stapleton", "Gender": "female", "Address": "Drumman, Co. Roscommon"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "female", "Address": "Drumman, Co. Roscommon"}, {"Language": "English"}]}, "4925220/4791579/4925551": {"title": "St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0253, Page 131", "Page 131"], "url": "https://www.duchas.ie/en/cbes/4925220/4791579/4925551", "text": "\nSt Patricks dayAll the people wear shamrock on St Patricks day in honour of St Patrick and it would not grow in any other country except Ireland The people in Ireland who have friends in other countries send them a peice for that day.The reason we wear the, shamrock is because it was St Patrick himself that set it and it would not grow in any other country. It is always kept a holiday in this district and the people wear the shamrock to mass. The boy-scouts paraded the four streets of Strokestown and play the air of St Patrick and some play music and some beat the drum\n", "school_info": "School: Carniska", "metadata": [{"Location:": "Carrownaskeagh, Co. Roscommon", "Teacher:": "\nRichard Healy\n"}, {"Language": "English"}]}, "4769961/4762957/4925999": {"title": "Saint Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0778, Page 131", "Page 131"], "url": "https://www.duchas.ie/en/cbes/4769961/4762957/4925999", "text": "\nEvery year there is a feast held in honour of Saint Patrick. On that day the people wear shamrock and the children wear badges. The badges the children wear are green in colour. The people wear shamrock because when St Patrick came to Ireland he used the shamrock in explaining that there were Three Divine Person in one God. Saint Patrick’s father was an officer in the Roman army. Some say that Saint Patrick was a native of France and more say he (way) was born in England. There was a King in Ireland at this time namely Niall of the Nine Hostages. This name was given to him(e) because he brought a\n(continues on next page)\n", "school_info": "School: Rathangan (B.)", "metadata": [{"Location:": "Rathangan, Co. Kildare", "Teacher:": "\nS. Mag Lionnáin\n"}, {"Language": "English"}]}, "4798725/4793659/4926825": {"title": "St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0259, Page 037", "Page 037"], "url": "https://www.duchas.ie/en/cbes/4798725/4793659/4926825", "text": "\nSaint Patrick is the Patron Saint of Ireland and all over Ireland as well as in this district his feastday is celebrated.Everyone wears the shamrock and children wear harps and green ribbons too. For weeks and days before hand the Post Office is busy posting boxes of shamrock to absent friends in England, America, and other far off countries.Bands parade that day and football matches are held throughout\n(continues on next page)\n", "school_info": "School: Cúl Seachtaine", "metadata": [{"Location:": "Coolshaghtena, Co. Roscommon", "Teacher:": "\nCaitlín Nic Dhonnchadha\n"}, {"Collector": "Ethna Connor", "Gender": "female", "Address": "Clooncashel More, Co. Roscommon"}, {"Language": "English"}]}, "4798660/4787960/4926998": {"title": "Hidden Treasure", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0234, Page 373", "Page 373"], "url": "https://www.duchas.ie/en/cbes/4798660/4787960/4926998", "text": "\n(continued from previous page)\nat night.\n\n\n\nSt Patrick's day falls on the 17th of March. That day all the people go to Mass and wear a shamrock in their coats in honour of St Patrick. Children wear green ribbons on their hair and little badges in their coats. The band plays. People in Ireland send a box of shamrock to their friends in other countries. On St Patrick's night there is a Céilidhe and Irish songs are sung and Irish music is played. The girls are dressed in Irish costumes.About a quarter of a mile outside Boyle there is a well and St Patrick visited it. There were two fish in it and\n(continues on next page)\n", "school_info": "School: Tighmhanach", "metadata": [{"Location:": "Tivannagh, Co. Roscommon", "Teacher:": "\nMrs E. Jordan\n"}, {"Language": "English"}]}, "4742114/4737117/4936253": {"title": "Lá Fhéile Pádraig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0472, Page 218", "Page 218"], "url": "https://www.duchas.ie/en/cbes/4742114/4737117/4936253", "text": "\nLá le PádraigLá saoire bliantamhail iseadh Lá le Pádraig. Caiteann gach duine píosa seamróige an lá úd mar is leis an t-seamróig a mhúin Naomh Pádraig Rún na Tríonóide dúinn.Fadó théigheadh na daoine isteach go dtí tig tabhairne agus fluicheadh siad an tseamróg istig le h-uisge beatha agus bídís ag ól is ag ól go dtí go mbídís bog meidhreach. Caithidís cláirseacha ar a gcota. Iad féin a deineadh na cláirseacha. Do bheirid ubh agus priocaidís a lámha le biorán. Asnsan deinidís an buidheachán agus an fhuil do mheascadh. Cuiridís ar a muilte é. Ba dheas leath iad d'fheiscint an lá san nuair a bhíodh siad déanta suas aca.Páganaigh do beadh na Seana Ghaedhil. Ní raibh fhios aca mar gheall ar Dia. D'abhradís an ghrian, an ghealach, agus na réalta. Sara bhfuair Naomh Padráig bás dubhairt sé ná gcaillfeadh Éire creideamh Críost go deó. Níor tháinig Naomh Pádraig riamh go Ciarraidhe ach dheirtear gur bheannuigh sé uaibh é.Sé m'athair Mícheal Ó Seághda ó Chalathanuisge a innis an sgeal so dom.\n", "school_info": "School: Curraichín (C.)", "metadata": [{"Location:": "Curraheen, Co. Kerry", "Teacher:": "\nEibhlín Ní Chonchobhair\n"}, {"Informant": "Mícheal Ó Seághda", "Relation": "parent", "Gender": "male", "Address": "Callahaniska, Co. Kerry"}, {"Language": "Irish"}]}, "4798737/4794723/4938295": {"title": "St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0263, Page 360", "Page 360"], "url": "https://www.duchas.ie/en/cbes/4798737/4794723/4938295", "text": "\nSt Patrick's Day.Every one wears shamrock on St. Patrick's Day. Long ago people used to drown the shamrock - that means they used to drink a lot of intoxicating drink on St. Patricks Day.There wore the shamrock on their shoulders. They made crosses from ribbons. Sometimes they made rosettes of different colours.Now-a-days people wear badges and harps. St Patrick visited Oran. There is a holy-well in it. There was a statue erected there a few years ago.St. Patrick was the first parish priest of Oran. People visit Oran on the last Saturday in July.\n", "school_info": "School: Clover Hill", "metadata": [{"Location:": "Lissagallan, Co. Roscommon", "Teacher:": "\nBean Uí Mhaoilealaigh\n"}, {"Collector": "Sheila Quigley", "Gender": "female"}, {"Informant": "Mrs Quigley", "Gender": "female", "Age": "46", "Address": "Rathconor, Co. Roscommon"}, {"Language": "English"}]}, "4798737/4794724/4938298": {"title": "St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0263, Page 361", "Page 361"], "url": "https://www.duchas.ie/en/cbes/4798737/4794724/4938298", "text": "\nSt. Patricks Day Long ago children used to wear crosses on their shoulders made of different colour ribbons on St. Patrick's Day.At present people wear in honour of St. Patrick, harps, bows, rosettes, and badges, which they buy in shops.These are made from green, white, and yellow ribbons. People also wear shamrock on that day. This is the parish of Oran.People often get cured whey they are praying at the well. Olive Raftery,Cloverhill N.S.Roscommon.Information received from:-Miss N. Kennedy (age 26)CloverhillRoscommon\n", "school_info": "School: Clover Hill", "metadata": [{"Location:": "Lissagallan, Co. Roscommon", "Teacher:": "\nBean Uí Mhaoilealaigh\n"}, {"Collector": "Olive Raftery", "Gender": "female"}, {"Informant": "Miss N. Kennedy", "Gender": "female", "Age": "26", "Address": "Lissagallan, Co. Roscommon"}, {"Language": "English"}]}, "4922103/4852435/4948488": {"title": "A St Patrick's Day Custom", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0525, Page 067", "Page 067"], "url": "https://www.duchas.ie/en/cbes/4922103/4852435/4948488", "text": "\nA St Patrick’s Day CustomWhen I was a school boy I remember my mother on St Patrick’s day, getting a sally or willow, put it into the fire until the end of it became ignited, then putting out the flame and making on the right shoulder of every member of the family the sign of the cross with the blackened or burned end of the stick.Narrator: Ml. Fitzgerald, Lickadoon. Age 45 Yrs.\n\n\n\nAn Easter Custom.On Shrove Tuesday a small portion of meat left after dinner, was wrapped up and fixed to the rafters and was left there until Easter Sunday morning. This was known as the Bickeen (bícín). On Easter Sunday morning each member of the family would get a small morsel of this on awaking.This custom was continued in our household up to twenty years ago.Narrator: Ml. Fitzgerald, Lickadoon. Age 45\n", "school_info": "School: Knockea, Ballysheedy", "metadata": [{"Location:": "Knockea, Co. Limerick", "Teacher:": "\nMl. Fitzgerald\n"}, {"Informant": "Michael Fitzgerald", "Gender": "male", "Age": "45", "Address": "Lickadoon, Co. Limerick"}, {"Language": "English"}]}, "4811614/4802148/4948555": {"title": "St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0276, Page 419", "Page 419"], "url": "https://www.duchas.ie/en/cbes/4811614/4802148/4948555", "text": "", "school_info": "School: Ardgroom", "metadata": [{"Location:": "Ardgroom, Co. Cork", "Teacher:": "\nR. Ó Hurdail\n"}, {"Language": "English"}]}, "4922029/4920148/4948912": {"title": "Festival Customs - St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0506, Page 081", "Page 081"], "url": "https://www.duchas.ie/en/cbes/4922029/4920148/4948912", "text": "\nSt Patrick's Day falls on the 17th March every year, because on that day St Patrick was buried in Downpatrick.  He is the patron Saint of Ireland. It is public holiday and works of all kinds are closed down, special services are held in the churches, and a very special hymn is sung called \"St Patrick's Breastplate\".It is an old custom for everybody to wear a spray of shamrock on that day, because when St Patrick was teaching the people about God with the three leaf shamrock explaining to them how there were three persons in the Godhead and they were all co-equal.Irish harps and green ribbons and crosses are worn on St Patrick's Day also.St Patrick's Day is a feast day. It is a break in the seven weeks of Lent. It is customary to have dances and concerts and Ceilidhthe are also held.Long ago the Public houses used to be open and it was customary to threat each other with drink called \"Patrick's Pot\", but now St Patrick's Day is a sober day and\n(continues on next page)\n", "school_info": "School: Áth Dara (C.)", "metadata": [{"Location:": "Adare, Co. Limerick", "Teacher:": "\nMáire Boardman\n"}, {"Collector": "Phyllis Miller", "Gender": "female", "Age": "14", "Address": "Graigue, Co. Limerick"}, {"Language": "mixed"}]}, "4922037/4921119/4953707": {"title": "May Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0508, Page 73", "Page 73"], "url": "https://www.duchas.ie/en/cbes/4922037/4921119/4953707", "text": "\n(continued from previous page)\nneighbour's property so that he may loose a lot of his cattle by sickness, his cows will bring no calfs, pigs, sheep and horses all suffer in some way.  No pishogue can work against an ass, the reason the old people give for this being that Our Lord travelled on an ass several times during his life on earth.  For this reason also, it is said, there is a dark stripe on an ass's back, crossed by a dark stripe on his sholders in the form of a cross.  The drunkard of whom it is said \"he would drink the cross off an ass's back\" is utterly and entirely hopless.  Because of the ass's immunity from pishogues it is lucky to have an ass with your stock.\n\n\n\nSt. Patrick's Day.The custom of \"drowning the shamrock\"\n(continues on next page)\n", "school_info": "School: Cromadh (C.)", "metadata": [{"Location:": "Croom, Co. Limerick", "Teacher:": "\nBríd, Bean Mhic Eoin\n"}, {"Language": "English"}]}, "4922049/4847557/4955620": {"title": "Féilí na Bliana i gContae Luimnigh - St Patrick's", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0511, Page 330", "Page 330"], "url": "https://www.duchas.ie/en/cbes/4922049/4847557/4955620", "text": "\nSaint Stephen's day is on the 26th of December. It is the day after Christmas day. It is called St. Stephen's day because he died on that day. On Saint Stephen's day the children go around from house to house with a holly bush decorated with ribbons and a wren's nest on it with a wren or an imitation of one in it. When they go to the houses they start singing. \"The wren the wren the king of all birds.St. Stephen's day she was caught in the furze\n(continues on next page)\n", "school_info": "School: Baile an Tobair, Baile an Londraigh", "metadata": [{"Location:": "Ballintober, Co. Limerick", "Teacher:": "\nTadhg Ó Tuama\n"}, {"Collector": "Sheila Carey", "Gender": "female"}]}, "4922052/4847844/4955697": {"title": "Saint Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0512, Page 051", "Page 051"], "url": "https://www.duchas.ie/en/cbes/4922052/4847844/4955697", "text": "\n1st StanzaSt Patrick's Day has come and goneWith nought left to remind usOf the cross-road dance and carrying onIn the land we've left behind us.2nd.Through every town in County DownAnd all the way to KerryThe bands would play \"St.Patrick's Day\",To make the girls merry.3rdThe music there would thrill the heartOf either saint or sinnerAnd when the piper got a startThey all forgot their dinner.4thTo Keneficks cross just after MassThe boys and girls would wanderAnd from Cullane each Colleen BawnWould march toward Ballylander.\n(continues on next page)\n", "school_info": "School: Baile an Londraigh (B.)", "metadata": [{"Location:": "Ballylanders, Co. Limerick", "Teacher:": "\nSeán Ó Buachalla\n"}, {"Informant": "E. J. Ryan"}, {"Language": "English"}]}, "4770004/4766022/4956411": {"title": "New Year's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0828, Page 088", "Page 088"], "url": "https://www.duchas.ie/en/cbes/4770004/4766022/4956411", "text": "\nOn New Year's Eve the band played up and down the town at midnight. The Protestant Church bell was then tolled to ring out the Old Year and ring in the New. On New Year's Day the woman of the house would not allow anyone to sweep the floor. If the floor was swept she believed her luck for the year would be taken away. Neither would she give away an alms because if she did she would be as poor by the end of the year as the person who whom she gave the charity.\n\n\n\nOn Christmas Even all the men ceased to work. For the twelve days of Xmas they enjoyed themselves with the money which they had been saving for months before. On Little Xmas Day they always had a dance to mark the close of the Festive Season.\n\n\n\nSt Valentines day falls on the 14th February every year. One of the Customs is, that people send Valentines to their friends all over the world   Valentines are long pieces of paper, with all sorts of rhymes and verses on them\n\n\n\nSt. Patrick's Day occurs on the 17th March. It\n(continues on next page)\n", "school_info": "School: St John of God Convent, Rathdowney", "metadata": [{"Location:": "Rathdowney, Co. Laois", "Teacher:": "\nThe Sisters\n"}, {"Language": "English"}]}, "4770004/4766086/4956683": {"title": "Potato Digging", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0828, Page 152", "Page 152"], "url": "https://www.duchas.ie/en/cbes/4770004/4766086/4956683", "text": "\n(continued from previous page)\ngreat diggers and spoke mostly Irish. The old people around here have many old Irish words got from the diggers.\n\n\n\nWhen the potatoes were all dug and in the pits we would have what was called \"A grating night\". A Michael-mas goose, would be killed and selected potatoes would be grated in the raw state  then squeezed and baked on a griddle. Starch would also be made from potatoes on May Day.\n\n\n\nOn St Patrick's Day we would all have Patrick's Crosses and my father would blacken a sally rod and mark the Sign of the Cross on our shoulders with it on.\n\n\n\nOn certain feasts my mother would make the round of Stations of the Cross in the ruins of a church that\n(continues on next page)\n", "school_info": "School: St John of God Convent, Rathdowney", "metadata": [{"Location:": "Rathdowney, Co. Laois", "Teacher:": "\nThe Sisters\n"}, {"Language": "English"}]}, "4922063/4849049/5010842": {"title": "Nature", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0514, Page 274", "Page 274"], "url": "https://www.duchas.ie/en/cbes/4922063/4849049/5010842", "text": "\nShamrocks were worn by the men on their hats. A cross was made from ribbons of many colours and hung in the house. It used be a big thing.A sally cipin was burnt in the fire and a Cross  made with it on the shirt sleeve of every child. The child went on its knees and made the sign of the Cross while the mother or father made the other Cross with the sally. The father and mother also had the Cross made on their own sleeve.The sign of the Cross was  and is still made on eggs that are being put hatching.\n", "school_info": "School: Coill Beithne (C.), Baile Mhistéala", "metadata": [{"Location:": "Kilbeheny, Co. Limerick", "Teacher:": "\n-\n"}, {"Language": "English"}]}, "4770049/4769205/5015041": {"title": "Ash Wednesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0837, Page 145", "Page 145"], "url": "https://www.duchas.ie/en/cbes/4770049/4769205/5015041", "text": "\nNo special meaning here.\n\n\n\nPancakes were generally made for the evening meal, plenty of buttter and eggs being used, as it was the last day of feasting before vigorous fast of Lent.\n\n\n\nNowadays barm-bracks containing rings  are bought from bakery for H - Eve. Children may play games with nuts and apples - ducking fro apple, snap-apple and the three saucers. Wheat is burned on bars of grate like the nuts; but many children now attending school here never saw nuts or wheat burned on bars of the grate. The  PUCA  is said to go about on this night destroying nuts, apples and berries. Children are warned never to touch fruit   on bushes after Nov. Day.No tricks are played as in other parts of midlands. Colcannon   is not made on Hallow Eve.\n\n\n\nUnnoticed\n\n\n\nSchool-girls wore Patrick's Crosses until about 40 years ago.    These were made of a circle of white paper    4\"  or 4 1/2\" in diameter. Narrow gaily coloured silk or satin ribbon was stitched across, star shaped design, ends finished off  with tiny bows. They also  wore great bows of green silk ribbon or hair (?). Men, women and little boys wore  bunches of shamrock. The men went to the nearest town to \"drown their shamrock\" having saved a few shillings specially for this purpose. Many indulged too freely in the cheap whiskey and bad porter, coming home much the worse of the day's wear.\n", "school_info": "School: Loughteague, Stradbally", "metadata": [{"Location:": "Loughteeog, Co. Laois", "Teacher:": "\nBrigid Keane, Brighid Ní Chatháin\n"}, {"Language": "English"}]}, "4922146/4856343/5016363": {"title": "Saint Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0537, Page 178", "Page 178"], "url": "https://www.duchas.ie/en/cbes/4922146/4856343/5016363", "text": "\nSaint Patrick's day is kept in memory of Saint Patrick in Ireland on the 17th of March.The customs that are observed in this locality on Saint Patrick's day are wearing the harp, a beautiful bunch of Shamrocks or an image of Saint Patrick in your coat.There is a Mass on Saint Patrick's day. Before Mass travellers stand at the gate selling harps.In Ireland the festival is kept as a religious and national holiday. There are processions after Mass on Saint Patrick's day. At night Irish Dances Conserts and Ceilidhes are held.In the forenoon the Churches are packed with fervant worshippers and Irish Sermons are preached at all the masses in the large cities and towns.No nation honours or celebrates its National Festival as the Irish do.Eibhlís Ní Mheachra\n", "school_info": "School: Cill na Naomh", "metadata": [{"Location:": "Kilnaneave, Co. Tipperary", "Teacher:": "\nMícheál Ó Flannagáin\n"}, {"Collector": "Eibhlís Ní Mheachra", "Gender": "female"}, {"Language": "English"}]}, "4922168/4857909/5019039": {"title": "St Patrick's Cross", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0542, Page 348", "Page 348"], "url": "https://www.duchas.ie/en/cbes/4922168/4857909/5019039", "text": "\nI know at least two houses where there are numbers of these stuck in the roof inside.The custom of putting them up is dead but the crosses still remain. Some of them are about one foot in height and all are partly ‘x’ shaped thus:-  ( diagram ) . One man told me he remembers having seen them put up on St. Patrick’s Eve. They were not used as a charm or cure of any kind but to use his own words “ they were put up in the memory of the faith brought by Patrick “.  In a couple of samples I found no nail but a timber peg driven right through which acts as a holdfast by which the cross is affixed to the roof. I have seen one house where there are several of these crosses and side by side with them several samples of Tadhg a Gheimhridh.\n", "school_info": "School: Cill Chuimín, Durlas Éile", "metadata": [{"Location:": "Kilcommon, Co. Tipperary", "Teacher:": "\nDonnchadh Ó Cuinnéain\n"}, {"Language": "English"}]}, "5009219/4999079/5019804": {"title": "Festival Customs - St. Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0870, Page 348", "Page 348"], "url": "https://www.duchas.ie/en/cbes/5009219/4999079/5019804", "text": "\nSt Patricks day.The seventeenth of March is the feast-day of Saint Patrick, the patron saint of Ireland.  On that day every Irish - person wears the shamrock, the symbol of their faith.This custom originated from the time of Saint Patrick, when he explained the mystery of the Trinity in the following manner.While trying to convert the pagans he was at a loss to explain the mystery of the Trinity.Looking at the ground he chanced to see the shamrock which immediatly solved his difficulties.Since then every Irish catholic wears a spray of shamrock in memory of that eventful day.\n", "school_info": "School: Ballycullane", "metadata": [{"Location:": "Ballycullane, Co. Wexford", "Teacher:": "\nSeán Ó Dubhghaill\n"}, {"Collector": "Mary Walshe", "Gender": "female"}, {"Language": "English"}]}, "4922259/4865047/5022180": {"title": "St Patrick's Cross", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0571, Page 197", "Page 197"], "url": "https://www.duchas.ie/en/cbes/4922259/4865047/5022180", "text": "\nSt Patricks cross was worn by the children long ago on St Patricks Day. They were made in the schools the day before. Each child brought an egg to the school which was used for colouring the cross, the yoke of the egg was used for colouring the part, and the green part was coloured with the juice of some plant. When the badges were made any egg which was left over were sold, and sweets bought for the children.Along with the badges the children wore shamrock, men also wore shamrock in their caps from St. Patricks Day till Palm Sunday then they wore Palm instead.\n", "school_info": "School: Ardfinnan (B.), Cahir", "metadata": [{"Location:": "Ardfinnan, Co. Tipperary", "Teacher:": "\nW. J. Nugent\n"}, {"Language": "English"}]}, "4922236/4863169/5053302": {"title": "St Brigid's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0560, Page 388", "Page 388"], "url": "https://www.duchas.ie/en/cbes/4922236/4863169/5053302", "text": "\nOn the eve of St. Brigid's Day people hang out pieces of ribbon or a scarf to get the saint's blessing as she passes by.\n\n\n\nOn St. Brigid's Day people used to dress a broom and dance with it.\n\n\n\nThe sign of the Cross was made (while the Three Divine Persons were invoked) with the burnt end of a hazel stick on the left shoulder of every man and boy in the house. If a member of the family were named Patrick it fell on him to perform the rite. Girls wore crosses made of cardboard and covered with various coloured ribbons.\n\n\n\nMany marriages take place on Shrove Tuesday. Pancakes are made on that night on account of the fast for Lent. A ring is hidden in one pancake, and who ever gets the ring is supposed to be\n(continues on next page)\n", "school_info": "School: Mullinahone (C.)", "metadata": [{"Location:": "Mullinahone, Co. Tipperary", "Teacher:": "\nMáire Ní Shéaghdha\n"}, {"Informant": "John Norton", "Gender": "male", "Age": "73", "Occupation": "shopkeeper", "Address": "Mullinahone, Co. Tipperary"}, {"Language": "English"}]}, "4922265/4865639/5055255": {"title": "St Patrick's Cross", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0572, Page 403", "Page 403"], "url": "https://www.duchas.ie/en/cbes/4922265/4865639/5055255", "text": "\nSt Patrick's CrossLong ago it was an old custom here in the school to make St Patricks Cross to wear on St Patrick's Day. The day before was spent making and colouring them. Each child brought an egg. The yellow colour was got from the yoke of this. The green was made by squeezing the juice of the plant called the pennyworth. Any surplus eggs were sold at the shop and sweets bought and distributed amongst the drawers.Diagram   St Patrick's CrossThe whole circle was cut out and worn on St Patrick's Day\n", "school_info": "School: An Churrach (Crogh), Árd Fhionáin", "metadata": [{"Location:": "Curragh, Co. Tipperary", "Teacher:": "\nMícheál Ó Dubhshláine\n"}, {"Informant": "Mícheál Ó Domhnaill", "Gender": "male", "Age": "55", "Address": "Knockballiniry, Co. Tipperary"}, {"Language": "English"}]}, "5008837/4959927/5076903": {"title": "Lore Connected with St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0665, Page 262", "Page 262"], "url": "https://www.duchas.ie/en/cbes/5008837/4959927/5076903", "text": "\nLore Connected With St Patrick's DayOn St Patrick's (Day) Eve long ago the people made badges for the children, and on St Patricks Day the children wore them on their shoulders. All the shops were open and the men enjoyed themselves drinking in the public house. They would take the shamrock out of their hats, and drown it in the glass of stout. This was called drowning the shamrock. It was a great day for the (publication) publican and seed merchant. It was a custom for the farmer's to buy all the seed they needed on St Patricks Day.Nanjo Atkinson,ChannonrockLouthDundalk.\n", "school_info": "School: Louth (C.)", "metadata": [{"Location:": "Louth, Co. Louth", "Teacher:": "\nM. Ní Chasaide\n"}, {"Collector": "Nanjo Atkinson", "Gender": "female", "Address": "Chanonrock, Co. Louth"}, {"Language": "English"}]}, "5008886/4963862/5077964": {"title": "St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0680, Page 081", "Page 081"], "url": "https://www.duchas.ie/en/cbes/5008886/4963862/5077964", "text": "\nSt. Patrick's day falls on the 17th of March. It is a holiday of obligation. Long ago it used to be a big business day for all the shops. The country people always used to come out to city or town and do their shopping, but, it is changed now there is no business done on St. Patrick's Day. It is honoured as a great feastday. All the Irish people wear a piece of shamrock. The children wear ribbons on their heads.\n", "school_info": "School: Naomh Pádhraic (C.), Droichead Átha", "metadata": [{"Location:": "Drogheda, Co. Louth", "Teacher:": "\nM. Bhreathnach, M. Ní Dhubhainn\n"}, {"Informant": "Mrs Leonard", "Gender": "female", "Address": "Greenbatter, Co. Louth"}, {"Language": "English"}]}, "5008866/4962204/5078757": {"title": "Customs Connected with St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0674, Page 263", "Page 263"], "url": "https://www.duchas.ie/en/cbes/5008866/4962204/5078757", "text": "\nNo 2Customs connected withSt. Patricks Day.1. At present the children of Tenure wear shamrock on St. Patricks day.2. The old people wear shamrock also.3. The men wear the shamrock on their caps on the left hand side and the women wear it on the fronts of their coats.4. About quarter of a century ago the girls of Tenure made their own badges in the school to wear on St. Patricks day.5.  They used to get pieces of white paper and cut them into a round shape.6. Then they used to sew on two pieces of green ribbon together in the shape of a cross and sew it into the round piece of paper.7. On St Patricks day the girls of Tenure used to wear those crosses on their shoulders.8. Mrs Connolly who now lives at Tenure said that when she was a girl she lived in Fieldstown and that the girls of Fieldstown used to make badges.\n(continues on next page)\n", "school_info": "School: Tenure", "metadata": [{"Location:": "Tinure, Co. Louth", "Teacher:": "\nS. Ó Cathail\n"}, {"Collector": "Kitty Mc Cullough", "Gender": "female", "Age": "14"}]}, "5008877/4963040/5080476": {"title": "St Patrick's Day in Collon", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0677, Page 128", "Page 128"], "url": "https://www.duchas.ie/en/cbes/5008877/4963040/5080476", "text": "\nLong ago there used to be a very big fair in Collon on St. Patrick's Day. Many things were sold at it, sheep, pigs, horses, cows, hens, geese, and turkeys. The children enjoyed themselves also at it for there were sweetstalls at it. There were also clothes at it. This fair was stopped about 1900. The men and women who sold things at this fair usually spent their money on strong drink.The old people of Collon say that long ago the people used to drink from they got up on that morning till they went to bed at night.An old man in Collon tells a story that on St. Patrick's day an old woman came into Collon from Crosstown to Mass and after Mass she got a little top heavy and when she was going along the road with a few pints in her she used to fall and every time she fell she said, Oh Holy St. Patrick and all that I'm suffering for you.A person in Collon says that St. Patrick's Day was not originally on the 17th March but that there were two parties and\n(continues on next page)\n", "school_info": "School: Collon (Erasmus Smith)", "metadata": [{"Location:": "Collon, Co. Louth", "Teacher:": "\nE. Ní Earchadha\n"}, {"Informant": "Mr F. Halfpenny", "Gender": "male", "Address": "Starinagh, Co. Meath"}, {"Informant": "Ms Abraham", "Gender": "female", "Address": "Collon, Co. Louth"}, {"Language": "English"}]}, "5008892/4964429/5082167": {"title": "Festival Customs - Bonfire Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0682, Page 085", "Page 085"], "url": "https://www.duchas.ie/en/cbes/5008892/4964429/5082167", "text": "\nBonfire NightIn this district the bonfire is lighted on 29th June.  The young people gather furze bushes, sticks etc and put them in one big heap, and at night (say 9 or 10 o'c) they set fire to it, and cheer and make merry while it is blazing.(The above is dying out).Patrick Carry (Scoláire)Got from: Mrs Mary Carry (42)Oldbridge,Drogheda\n\n\n\nSt. Patrick's DayLong ago the children used to cut a laural bush on St. Patrick's Day and decorate it with pieces of coloured cloth and candles (like the May Bush).  When they had it decorated they used to sing and dance around it.This is not done at all now.P. Lennon (Scoláire)Got from: Patrick Lennon (47)Sheephouse,Drogheda\n", "school_info": "School: Donore", "metadata": [{"Location:": "Donore, Co. Meath", "Teacher:": "\nMaighréad Nic Eóin\n"}, {"Collector": "P. Lennon"}, {"Informant": "Patrick Lennon", "Gender": "male", "Age": "47", "Address": "Sheephouse, Co. Meath"}, {"Language": "English"}]}, "4922383/4876302/5083090": {"title": "St Bridget's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0621, Page 411", "Page 411"], "url": "https://www.duchas.ie/en/cbes/4922383/4876302/5083090", "text": "\n(continued from previous page)\nto give her a shilling or so. And she say rounds herself for people who cannot come to the well for 2 shillings. Besides St Brigid's Day which is always on Feb 1st there is another big feast day connected with St Brigid in the same place. It is Saturday night before the last Sunday in July. People come from all parts of the country travel to the well late in the evening and stay there all night long until morning, praying, dancing, and singing, and I may add drinking heavily at two public houses which are quite near the well. This custom has been carried on here for years and years and the number of pilgrims are increasing year by year.\n\n\n\nThis is a great national holiday in Lahinch. The people and children wear emblems of\n(continues on next page)\n", "school_info": "School: Lahinch", "metadata": [{"Location:": "Lehinch, Co. Clare", "Teacher:": "\nDónall Ó Ríordáin\n"}, {"Informant": "John O' Dwyer", "Gender": "male", "Age": "72", "Address": "Calluragh South, Co. Clare"}, {"Language": "English"}]}, "5044787/5038083/5084034": {"title": "Festival Customs - St Brigid's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0963, Page 480", "Page 480"], "url": "https://www.duchas.ie/en/cbes/5044787/5038083/5084034", "text": "\nSt Brigid's Day falls on the 1st of February is the feast day of the patroness of Ireland. People make a stations to her well on that day. There is one of them at Oughteraugh, and every 1st of February people make a station to that well. The water from that well is said to be a cure for a pain in the back. Another custom on St. Brigid's Day is to make a cross out of rushes and hang it up in the house for protection. It is called St. Brigid's Cross. On St. Brigid's Day children gather flowers and leave them round the door in honour of St. Brigid.\n\n\n\nIt is a great day of rejoicing all over the world with the Irish people. It is the custom to wear shamrocks badges and harps and to send them to friends in other countries. In olden years parades were in every town in Ireland. ' Drums beat the march times such as '' The wearing of the Green '' '' The Boys of Wexford '' '' O Donnell Abu '' and '' God save Ireland '' Nowadays dances and concerts are held all over Ireland on\n(continues on next page)\n", "school_info": "School: Tomena", "metadata": [{"Location:": "Gortullaghan, Co. Cavan", "Teacher:": "\nT. Mac Uidhir\n"}, {"Informant": "Eileen O' Reilly", "Gender": "female", "Address": "Gortmore, Co. Cavan"}, {"Language": "English"}]}, "5044793/5038691/5084372": {"title": "St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0965, Page 136", "Page 136"], "url": "https://www.duchas.ie/en/cbes/5044793/5038691/5084372", "text": "\nIt was a custom long ago, that on St Patrick's, the people went to a town such as Dowra or Blacklion, where they beat the Drum. There was also bands from different places. The members of the band usually wore green hats, and green ties, They marched up and down the street for about an hour. They also sang songs about St Patrick's Day. They generally had a big dance that night, nd a very large crowd gathered to it. Some of them got drunk and they began to fight and say.St Patricks Day  in Ireland the fields are fresh, and gran, with a brand new hat on each man's head, and a nice beck tie thats newly made with the right foot first, they march along to St Patricks Day parade, This is another, which they also recited.St Patrick was a gentleman His name is celebrated on the seventeenth of March the Irish consecrate Some\n(continues on next page)\n", "school_info": "School: Tullycasson", "metadata": [{"Location:": "Ardvagh, Co. Cavan", "Teacher:": "\nname not given\n"}, {"Collector": "Mary M. Mc Grath", "Gender": "female", "Address": "Tullynacross, Co. Cavan"}, {"Informant": "Felix Dolan", "Gender": "male", "Address": "Tullynacross, Co. Cavan"}, {"Language": "English"}]}, "5044855/5044240/5087574": {"title": "St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0982, Page 043", "Page 043"], "url": "https://www.duchas.ie/en/cbes/5044855/5044240/5087574", "text": "\nWe get a holiday from school on St. Patrick's Day.  The people wear the shamrock in their buttonholes on St. Patrick's Day because St. Patrick preached to the people that there were three persons in the one God in the Holy Trinity.  Years ago when Patrick's Day would come the old people used to say \"St. Patrick's Day trow your old coat away\".  There is generally a hunt on St. Patrick's Day in this district.\n", "school_info": "School: Derrylane", "metadata": [{"Location:": "Derrylane, Co. Cavan", "Teacher:": "\nMabel Lougheed\n"}, {"Collector": "Gwennie Mc Hugh", "Gender": "female", "Address": "Drumkilroosk, Co. Cavan"}, {"Informant": "Mrs Mc Hugh", "Gender": "female", "Age": "40", "Address": "Drumkilroosk, Co. Cavan"}, {"Language": "English"}]}, "5044839/5043120/5093892": {"title": "Festival Customs - St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0978, Page 194", "Page 194"], "url": "https://www.duchas.ie/en/cbes/5044839/5043120/5093892", "text": "\nSt. Patrick's Day was always a day of great rejoicing in this district. The religious observances were always faithfully carried out in this district; the remainder of the day was spent in merrymaking in various forms. In the days of my grandfather it was customary to hold Home Rule meetings on that day. Many a time the demand for Irish Independence was repeated on that day. \"Patrick's Crosses\" were worn by all children, and shamrocks by all grown ups. Every mother, no matter how busy used to make Patrick's crosses for her children. No one ever appears in Public on St Patrick's Day without a Shamrock. The men\n(continues on next page)\n", "school_info": "School: Árd-chill", "metadata": [{"Location:": "Ardkill More, Co. Cavan", "Teacher:": "\nBean Uí Chonalláin\n"}, {"Collector": "James Joseph Conlon", "Gender": "male", "Address": "Drumnalaragh, Co. Cavan"}, {"Language": "English"}]}, "5070789/5063673/5094807": {"title": "Festival Customs - St Blaise's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1000, Page 140", "Page 140"], "url": "https://www.duchas.ie/en/cbes/5070789/5063673/5094807", "text": "\n(continued from previous page)\nthroats. On his day red flannel is blessed in the churches in Dublin.\n\n\n\nSt. Martin's Day falls on the 2nd of August. It is not kept as a holiday. No one observes the customs. Long ago the people said that it was unlucky to boil eggs on St. Martin's Day because you would be using water.\n\n\n\nSt. Patick's Day falls on the 17th march. This is a great festival and very much honoured in places like Dublin and other big places. On this day people wear shamrocks in honour of St. Patrick. They also send shamrocks to their friends\n(continues on next page)\n", "school_info": "School: Virginia (B)", "metadata": [{"Location:": "Virginia, Co. Cavan", "Teacher:": "\nE. O' Reilly\n"}, {"Collector": "Willie Stephens", "Gender": "male", "Address": "Virginia, Co. Cavan"}, {"Language": "English"}]}, "5070803/5065697/5097349": {"title": "St Stephen's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1005, Page 255", "Page 255"], "url": "https://www.duchas.ie/en/cbes/5070803/5065697/5097349", "text": "", "school_info": "School: Lisnagirl (1)", "metadata": [{"Location:": "Lismagiril, Co. Cavan", "Teacher:": "\nHarriett Kinkade\n"}, {"Collector": "H. Kinkade", "Gender": "female", "Occupation": "teacher"}, {"Language": "English"}]}, "5070830/5068474/5098767": {"title": "Saint Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1014, Page 114", "Page 114"], "url": "https://www.duchas.ie/en/cbes/5070830/5068474/5098767", "text": "\nSaint Patrick's Day is celebrated on the seventeenth of March each year. It is kept a holiday in honour of the death of Saint Patrick. All the people of Ireland wear shamrocks on Saint Patrick's Day .When Saint Patrick was explaining the mystery of the Blessed Trinity on Easter Sunday at Tara to the pagans they could not understand how there could be three persons in one God. Saint Patrick stooped and plucked a shamrock and showed them that as there were three leaves on one stem there were three persons on one God. The pagans then understood the meaning of the Blessed Trinity and since then the people of Ireland always wear shamrocks on Saint Patrick's Day.The people of Ireland send shamrocks to their friends in other countries for Saint Patrick's Day as all the people of Ireland like to have shamrocks on that day. It is said that the shamrocks won't grow on any soil except Irish soil.\n(continues on next page)\n", "school_info": "School: Cullies", "metadata": [{"Location:": "Cullies, Co. Cavan", "Teacher:": "\nJames Clarke\n"}, {"Collector": "Anna Lynch", "Gender": "female", "Address": "Drumhillagh North, Co. Cavan"}, {"Language": "English"}]}, "5070830/5068475/5098774": {"title": "Saint Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1014, Page 115", "Page 115"], "url": "https://www.duchas.ie/en/cbes/5070830/5068475/5098774", "text": "\n(continued from previous page)\n[-]\n\n\n\nSaint Patrick's Day is celebrated on the seventeenth of March of each year. It is kept as a national holiday all over Ireland. It is kept as a holiday in honour of the Death of Saint Patrick.Saint Patrick brought the true faith to Ireland and one Easter Sunday when he was explaining the Blessed Trinity at Tara the pagans could not understand how there were three persons in one God. Saint Patrick picked up a shamrock and showed them that there were three leaves in one stem. The shamrock is still worn on St Patrick's Day in honour of Saint Patrick. Shamrocks are sent to other countries as it is said they wont grow in any soil except Irish soil. People send shamrocks to their relatives in other countries as no matter where any Irish man goes he always likes to get a shamrock on that DayGreen badges are\n(continues on next page)\n", "school_info": "School: Cullies", "metadata": [{"Location:": "Cullies, Co. Cavan", "Teacher:": "\nJames Clarke\n"}, {"Collector": "Annie Magorry", "Gender": "female", "Address": "Cullies, Co. Cavan"}, {"Language": "English"}]}, "5070830/5068476/5098777": {"title": "Saint Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1014, Page 116", "Page 116"], "url": "https://www.duchas.ie/en/cbes/5070830/5068476/5098777", "text": "\n(continued from previous page)\nalso worn in some places instead of shamrock. People send Saint Patrick's Day cards to their friends for that Day.\n\n\n\nSaint Patrick's Day is celebrated on the seventeenth of March each year. It is kept a Bank holiday, a Church holiday, and a state holiday. Saint Patrick died on this day and since then it is always kept a holiday in Ireland.It was Saint Patrick that brought the Christian Faith to Ireland. The first time Saint Patrick came to Ireland he was brought as a slave. For six years he herded sheep and swine on the Slemish mountains in Antrim. After six years he ran away and got  a ship to bring him to his own home. While he was at home he could not forget the Irish people. He commenced to study for the priest-hood to come back to Ireland to teach the people there. He was ordained priest and consecrated bishop then\n(continues on next page)\n", "school_info": "School: Cullies", "metadata": [{"Location:": "Cullies, Co. Cavan", "Teacher:": "\nJames Clarke\n"}, {"Collector": "Monica Lynch", "Gender": "female", "Address": "Drumamuck Glebe, Co. Cavan"}, {"Language": "English"}]}, "5009143/4991021/5099985": {"title": "St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0752, Page 030", "Page 030"], "url": "https://www.duchas.ie/en/cbes/5009143/4991021/5099985", "text": "\nThe Feast of St. Patrick falls on the 17th March. It is kept as a great festival because St. Patrick brought the true faith to Ireland. He is the National Apostle of Ireland and the men and women wear shamrock and the young girls and boys wear badges and shamrock because it was by the shamrock that Saint Patrick taught the true faith to the people  He said, \"As there are three leaves on one stem, in the same way there are Three Divine Persons in One God.\" St. Patrick also banished the snakes out of Ireland.\n", "school_info": "School: Mercy Convent, Baile Mathúna", "metadata": [{"Location:": "Ballymahon, Co. Longford", "Teacher:": "\nSr. M. Clement\n"}, {"Collector": "Mary Conlon", "Gender": "female", "Address": "Ballymahon, Co. Longford"}, {"Language": "English"}]}, "5009143/4991099/5100168": {"title": "St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0752, Page 108", "Page 108"], "url": "https://www.duchas.ie/en/cbes/5009143/4991099/5100168", "text": "\nSt. Patrick's Day falls on the 17th March.On that day we wear shamrocks and harps. It is said that St. Patrick plucked a shamrock one day when he was preaching the Faith to the people and he said \"As there are three leaves on one stem, there are Three Persons in One God\"Usually the local brass band plays Irish airs. It is considered very lucky to get a four-leaved shamrock. We always send shamrock to our exiles.\n", "school_info": "School: Mercy Convent, Baile Mathúna", "metadata": [{"Location:": "Ballymahon, Co. Longford", "Teacher:": "\nSr. M. Clement\n"}, {"Language": "English"}]}, "5009187/4995818/5106171": {"title": "Saint Stephen's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0764, Page 348", "Page 348"], "url": "https://www.duchas.ie/en/cbes/5009187/4995818/5106171", "text": "\n(continued from previous page)\nWhen the people of the house have enjoyed the wren boys to their hearts content they give them a few pennies to bury the wren so the wren boys depart. They continue like this from house to house dancing and singing in each house as they go along.They very often have a handsome sum of money at the end of the day.\n\n\n\nOn St. Patrick's Day the girls wear crosses and the boys wear harps or badges.The girls crosses are made in the following mannerThere is a round piece of cardboard or a strong piece of paper got and there is about four coloured pieces of ribbons.The cardboard is cut in the form of a circle and the coloured pieces of ribbons are sown on to it in the form of a cross.Generally green and white ribbons are used in making the crosses.\n(continues on next page)\n", "school_info": "School: Achadh na Garron (Aughnagarron)", "metadata": [{"Location:": "Aghnagarron, Co. Longford", "Teacher:": "\n-\n"}, {"Collector": "Brigid Reilly", "Gender": "female", "Address": "Cloghchurnel, Co. Longford"}, {"Language": "English"}]}, "5008908/4965942/5107136": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0686, Page 204", "Page 204"], "url": "https://www.duchas.ie/en/cbes/5008908/4965942/5107136", "text": "\nWhen the priest was collecting pennies at mass one day, he said to a man - \"What is Matrimony? \"Hell upon earth for some Me Lord\", the man answered. This happened in Walterstown Chapel.\n\n\n\nWhen going out in the morning you say :- \"God bless all I'll meet today.\" When you meet anyone you say - \"God spare you your health.\" When workmen come into dinner they say :- \"God save all here.\" When lying down in bed you say \"The Lord go between us and hell.\" At any time you say - \"Thanks be to God we lived so long and did so little harm.\"\n\n\n\nThe children used to get a round piece of paper and put green ribbon on a cross-shape on it. The spaces between would be covered with bunches of ribbon. Girls wore these crosses in front and boys wore them on the shoulder. Some boys used to paint their crosses instead of putting ribbons on them.\n", "school_info": "School: Walterstown", "metadata": [{"Location:": "Walterstown, Co. Meath", "Teacher:": "\nProinseas, Bean Uí Cheallaigh\n"}, {"Collector": "M. B. Kelly", "Address": "Monktown, Co. Meath"}, {"Informant": "Mrs J. Kelly", "Gender": "female", "Age": "80", "Occupation": "pensioner", "Address": "Brownstown, Co. Meath"}, {"Language": "English"}]}, "5008982/4973694/5112777": {"title": "Feast-Days - Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0706, Page 515", "Page 515"], "url": "https://www.duchas.ie/en/cbes/5008982/4973694/5112777", "text": "\nThe people have a custom on Shrove Tuesday night. They make pan-cakes and fry bacon on that night. They do that, as it is an old custom on the eve of the lenten fast. They fast from bacon, for the seven weeks of lent after that.The pan-cakes are made very thin on a pan. Late on that night, the people eat the pan-cakes, and tea, and bacon.\n\n\n\nLong ago, the people used to wear green ribbons on St Patrick's day, when going to Mass.They used to wear green and gold crosses, with the harp in the centre.Other people used to wear green sashes on the right shoulder, and a bow on the left shoulder with the picture of a shamrock either in gold or white on it.A good share of men when they came home from Mass would go\n(continues on next page)\n", "school_info": "School: Maio", "metadata": [{"Location:": "Trohanny, Co. Meath", "Teacher:": "\nMáire Ní Chreaig\n"}, {"Collector": "Lena Carolan", "Gender": "female", "Address": "Druminiskin, Co. Meath"}, {"Language": "English"}]}, "5009008/4976617/5120887": {"title": "St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0714, Page 464", "Page 464"], "url": "https://www.duchas.ie/en/cbes/5009008/4976617/5120887", "text": "\nThe principal emblems worn here on the Feast of St. Patrick are:-(a) Shamrock;(b) Harps;(c) St. Patrick's Crosses;(d) St. Patrick's Medal;(e) Green ribbons;(f) St. Patrick's Badges.Shamrock -is plucked the day before and is worn by men in their hats and by women in their coats.People believe that when the palm and shamrock are worn together Ireland will be free.A Four-leaved shamrock is considered lucky and is eagerly searched for before pinning it on.The custom of \"drowning the shamrock\" was common but has now been entirely done away with.\n(continues on next page)\n", "school_info": "School: Grangegeeth", "metadata": [{"Location:": "Grangegeeth, Co. Meath", "Teacher:": "\nSeósaimhín, Bean Uí Dhubhghaill\n"}, {"Language": "English"}]}, "5009108/4987360/5123580": {"title": "Lady Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0742, Page 307", "Page 307"], "url": "https://www.duchas.ie/en/cbes/5009108/4987360/5123580", "text": "\nLady Day is on the feast of the Assumption and people make stations at the holy wells.\n\n\n\nSt Patrick's day is the 17th March. Everyone wears shamrock in their hats and coats on that day . Everyone who can wears green- a green ribbon or a badge tied around a shamrock branch. It is a national holiday and everyone has a free day. That night the men \"drown\" the shamrock in a glass of whiskey. They dip the shamrock into the spirit and then they drink it.If we have friends over the sea we send them boxes of shamrock to wear on that day.\n", "school_info": "School: Loughanvally", "metadata": [{"Location:": "Loughanavally, Co. Westmeath", "Teacher:": "\nMrs. O'Connor\n"}, {"Language": "English"}]}, "5009109/4987513/5124173": {"title": "St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0742, Page 461", "Page 461"], "url": "https://www.duchas.ie/en/cbes/5009109/4987513/5124173", "text": "\nThe 17th March is the feast of the National Apostle St Patrick. There are great celebrations in Dublin on that day.There is great rejoicing all over Ireland and by the Irish in other countries. The shamrock is worn by everyone on that day. The boys wear badges made from green ribbons and girls wear green ribbons in their hair.Some years ago it was the custom for men to go to the public houses to get drunk to celebrate the feast. That time is past.The Irish people pick the shamrocks and send some of them to their friends in America and other foreign countries.\n", "school_info": "School: Moyvore", "metadata": [{"Location:": "Moyvore, Co. Westmeath", "Teacher:": "\nMrs Kelly\n"}, {"Collector": "Bridie Dalton", "Gender": "female", "Address": "Moyvore, Co. Westmeath"}, {"Collector": "Mary Teresa Murtagh", "Gender": "female", "Address": "Piercetown, Co. Westmeath"}, {"Collector": "Carmel O' Kelly", "Gender": "female", "Address": "Moyvore, Co. Westmeath"}, {"Collector": "Annie Cormack", "Gender": "female", "Address": "Shinglis, Co. Westmeath"}, {"Language": "English"}]}, "5044741/5035734/5136764": {"title": "Festival Customs - St Stephen's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0921, Page 029", "Page 029"], "url": "https://www.duchas.ie/en/cbes/5044741/5035734/5136764", "text": "\nOn Stephen's Day the \"Wren Boys\" go round. They are boys dressed up with masks and carrying a holly bush with some rags to represent the wren. They go from door to door collecting money.\n\n\n\nEverybody wears shamrock in memory of St. Patrick.\n\n\n\nBeing the last day before lent this is a great day for parties. People eat pancakes in which they have put a ring, a sixpenny bit and a button.\n\n\n\nOn May day the people dress up a bush and light candles and call it a May bush. When the candles are burnt out the bush is set afire - it is usually a gorse bush.\n", "school_info": "School: Ballinatone, Rathdrum", "metadata": [{"Location:": "Ballinatone Lower, Co. Wicklow", "Teacher:": "\nMiss Stuart, Miss Campbell\n"}, {"Collector": "James King", "Gender": "male", "Address": "Crone More, Co. Wicklow"}, {"Language": "English"}]}, "5044661/5029840/5143012": {"title": "May Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0903, Page 456", "Page 456"], "url": "https://www.duchas.ie/en/cbes/5044661/5029840/5143012", "text": "\nOn May eve a May bush is made. May flowers and candles are put on it. The candles are lit and the children catch hands and dance around it.On St Peter and Paul's night a bonfire is lit in some townlands. The people come from a long distance to it. Everybody brings sticks for the fire. They dance around it until twelve o'clock and then they take a lighting branch in their hands and run through the crops with them.On Michaelmas day a fair is held in Graig-na-managh. One from every house goes to it. They bring home with them apples and onions which they get on the fair.\n\n\n\nIn olden times it was customary for people to eat fish on St Patrick's day. They never used to eat meat. Children gather shamrocks the evening before for their elders to wear in their coats or caps. Children get St Patrick's badges for the day from teachers or shopkeepers\n", "school_info": "School: Drummond", "metadata": [{"Location:": "Drummin, Co. Carlow", "Teacher:": "\nP. Ó Murchadha\n"}, {"Collector": "Ellie Murphy", "Gender": "female", "Address": "Dranagh, Co. Carlow"}, {"Language": "English"}]}, "5044661/5029841/5143015": {"title": "St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0903, Page 457", "Page 457"], "url": "https://www.duchas.ie/en/cbes/5044661/5029841/5143015", "text": "\nSt Patrick's day is a great holyday. St Patrick established the faith in Ireland. He also planted the shamrock which will not grow in any other country. People wear it in honour of him on that day. The Irish send it to their friends who are in foreign countries as they like to have it to honour St. Patrick, and to remind them of their native place. In some places throughout Ireland and America they have parades on this day. They wear badges and harps. In olden times they made St Patrick's crosses. It was a custom to put a cross on your left arm with a burnt furze stump. It is not kept up in these days.\n", "school_info": "School: Drummond", "metadata": [{"Location:": "Drummin, Co. Carlow", "Teacher:": "\nP. Ó Murchadha\n"}, {"Collector": "Maggie Fluskey", "Gender": "female", "Address": "Ballynalour, Co. Carlow"}, {"Language": "English"}]}, "5044661/5029842/5143078": {"title": "St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0903, Page 459", "Page 459"], "url": "https://www.duchas.ie/en/cbes/5044661/5029842/5143078", "text": "\nOn St Patrick's day long ago a furze stick was burned in the fire and a cross was marked on your right arm with it. In olden times crosses were made of ribbons in the schools. \"On St Patrick's throw candles and candlesticks away and go to bed with the light of the day\".\n\n\n\nA bird in the hand is worth two in the bush,What you can do today don't leave until tomorrow,Set a thief to catch a thief,If you don't sow in the Spring you won't reap in the harvest,Live ass and you will get grass,.If the cat was churning it is often she would have her paws in it,When the goat goes to the door of the chapel she will not stop until she goes to the altar.It is an ill wind that does not blow someone good-Look after the pence and the pounds will look after them-\n(continues on next page)\n", "school_info": "School: Drummond", "metadata": [{"Location:": "Drummin, Co. Carlow", "Teacher:": "\nP. Ó Murchadha\n"}, {"Collector": "Lizzie Kelly", "Gender": "female", "Address": "Ballynabearna, Co. Wexford"}, {"Language": "English"}]}, "5044691/5032504/5146028": {"title": "St Brighid's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0910, Page 092", "Page 092"], "url": "https://www.duchas.ie/en/cbes/5044691/5032504/5146028", "text": "\n(continued from previous page)\nthey go to. The little boys buy sweets and other fruit with their money.\n\n\n\nSt Patrick's Day falls on the 17th of March. We wear a shamrock or a broach or a ribbon on that day. St Patrick's Day is a great Feast Day. It is a Holiday of obligation. There is no work done on that day. We go to Mass on that day. In years gone by St Patrick's Day used to be a great day for sport and dancing. There are conserts and plays on that night. Some people get married on that day. Long ago most of the Irishmen got drunk on that day, and they thought by so doing that they were honouring St Patrick\n\n\n\nThe Feast of Hollow'en falls on the 31st of October. We have great sport on that night. Boys and girls dress up and go around \"Juggying\" from house to house and getting money. They go to a certain house at midnight and they dance there all night. We put a tub of water on the floor and we dive for a sixpence or a apple. We hang a apple from the ceiling. We try to bit it without\n(continues on next page)\n", "school_info": "School: Rathmore, Tullow", "metadata": [{"Location:": "Rathmore, Co. Carlow", "Teacher:": "\nBean Uí Chonchobhair\n"}, {"Collector": "Gretta Loughlin", "Gender": "female", "Address": "Straboe, Co. Carlow"}, {"Language": "English"}]}, "5044699/5032936/5146136": {"title": "St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0911, Page 258", "Page 258"], "url": "https://www.duchas.ie/en/cbes/5044699/5032936/5146136", "text": "\nOn this day everyone wears shamrock. They also wear badges such as harps and pictures of St. Patrick. Long ago every one used to try and have fish on that day. They used have fish and potatoes on the morning of St. Patrick's Day.\n\n\n\nSt. Patrick's Day is on the 17th March. On that day it was the custom in the olden times to wear shamrock in honour of st. Patrick because it was by means of the shamrock that he explained the meaning of the Blessed Trinity to the pagans long ago.Another custom was that the people used to go to bed with the day - light. There is an old saying; \"On St. Patrick's day, throw candles and candle - sticks away and eat your supper with the light of the day.\"\n", "school_info": "School: Kildavin, Ferns", "metadata": [{"Location:": "Kildavin, Co. Carlow", "Teacher:": "\nTadhg de Brí\n"}, {"Collector": "Eily Harmon", "Gender": "female"}, {"Informant": "Mrs Sinnott", "Gender": "female", "Age": "66", "Occupation": "farmer's wife", "Address": "Kildavin, Co. Carlow"}, {"Language": "English"}]}, "5044699/5032936/5146139": {"title": "St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0911, Page 258", "Page 258"], "url": "https://www.duchas.ie/en/cbes/5044699/5032936/5146139", "text": "\nOn this day everyone wears shamrock. They also wear badges such as harps and pictures of St. Patrick. Long ago every one used to try and have fish on that day. They used have fish and potatoes on the morning of St. Patrick's Day.\n\n\n\nSt. Patrick's Day is on the 17th March. On that day it was the custom in the olden times to wear shamrock in honour of st. Patrick because it was by means of the shamrock that he explained the meaning of the Blessed Trinity to the pagans long ago.Another custom was that the people used to go to bed with the day - light. There is an old saying; \"On St. Patrick's day, throw candles and candle - sticks away and eat your supper with the light of the day.\"\n", "school_info": "School: Kildavin, Ferns", "metadata": [{"Location:": "Kildavin, Co. Carlow", "Teacher:": "\nTadhg de Brí\n"}, {"Collector": "Maggie Kavanagh", "Gender": "female"}, {"Informant": "Mr James Kavanagh", "Gender": "male", "Age": "59", "Occupation": "farmer", "Address": "Cranemore, Co. Carlow"}, {"Language": "English"}]}, "4921613/4885174/5148999": {"title": "Ruaig an Sionnaigh (The Fox Chase)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0294, Page 086", "Page 086"], "url": "https://www.duchas.ie/en/cbes/4921613/4885174/5148999", "text": "\n(continued from previous page)\nLady Geoffrey adtuaidh ó Bhlárnan,Sinéad Ní Coitrigh is í fagháil bháis ann,Do chuireamar sa talamh, is a h-eirball anáirde.\n\n\n\nLá ’le Pádruig, is mé im TabhairneImeasc na sár-fhear ag ól na digheDo bhí fear súist’ is ránn ann,Is máighistir scoláirí do thuig a lán Is do léigh go leor.Do labhair gach n-aon aca, go ciúin deas bhéiseach,‘Á moladh féin leis an gcailín óg.An cailín óg:!Do labhair an spéir bhean go ciúin deas bhéaseach,Ní molfainn féin an té sáil is mó,Ach an (t) cíos cirte léigheanntaAn cíos a dhéanamh ó bh’ té ba mhian liom, A bhuailfinn ’dtreo.An múinteoir:Is mé d’ fhoghlaim na sagairt clúdach Na bráithre múinte a thagann ó’n Rome.Lucht dlighe is claide phuadar (powder)Is na dochtúirí a dhein a leigeasAn mheilt bhíonn bhuachalla,\n(continues on next page)\n", "school_info": "School: Drom Mór (B.), Beantraí", "metadata": [{"Location:": "Dromore, Co. Cork", "Teacher:": "\nÉamonn Ó Conchobhair\n"}, {"Collector": "Eamonn Ó Conchúbhair", "Gender": "male"}, {"Informant": "Mícheál Ó Briain", "Gender": "male", "Address": "Dromore, Co. Cork"}, {"Language": "Irish"}]}, "4921693/4890627/5153748": {"title": "St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0324, Page 240", "Page 240"], "url": "https://www.duchas.ie/en/cbes/4921693/4890627/5153748", "text": "\nIn my young days children - that is school girls - used to wear a cross on their right Shoulder on St Patrick's Day. The crosses were made of strips of stong brown paper, or cardboard or strong canvas. Pieces of coloured ribbons or cloth or cotton or silk were sewn on to the four ends and to the centre. It was a little girl's greatest ambition to have a nice Cross and she wold leave no opportunity pass, that she would not gather materials for her cross. Dress-makers used to be frequently visited for cuttings of silks or any material of a gay colour. The gayer the ribbons the grander the cross.\n(continues on next page)\n", "school_info": "School: Cnoc an Chuilinn, An Ráth Mhór", "metadata": [{"Location:": "Caherbarnagh, Co. Cork", "Teacher:": "\nNóra, Bean Uí Dhuinnín\n"}, {"Collector": "Nora Dineen", "Gender": "female", "Age": "49", "Occupation": "múinteoir", "Address": "Hollymount, Co. Cork"}, {"Language": "English"}]}, "5008944/4969038/5167499": {"title": "Old Festival Customs - St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0695, Page 247", "Page 247"], "url": "https://www.duchas.ie/en/cbes/5008944/4969038/5167499", "text": "\nThe 17th March is St. Patrick's Day. The people wear shamrock on that day. There is also Irish music, and Irish concerts that day.\n\n\n\nOn Shrove Tuesday all the people make some pan-cakes. There is a ring put in them and children have great fun trying to get the ring.\n\n\n\nOn St Brigid's  Day the children dress up the dash of a churn, and go from house to house with it. They dance with the dash in their hands. This is called the Brideóg. This custom is not carried out in my district at present.\n\n\n\nOn Ash Wednesday the people go to the Church to get Blessed ashes on their\n(continues on next page)\n", "school_info": "School: Cloncarneel", "metadata": [{"Location:": "Cloncarneel, Co. Meath", "Teacher:": "\nMáire, Bean Uí Bhreacáin\n"}, {"Collector": "Janie Dunne", "Gender": "female", "Address": "Corballis, Co. Meath"}, {"Language": "English"}]}, "4921759/4904085/5168033": {"title": "Saint Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0356, Page 441", "Page 441"], "url": "https://www.duchas.ie/en/cbes/4921759/4904085/5168033", "text": "\nThis was a day that was looked forward to years ago as the people then hadnt such chance for amusement as now   After mass on Saint patricks day the local band out and its members paraded the village and played national airs for a couple of hoursAt 3 oclock the young people went to the cross-roads where platforms were usually laid. There they danced and enjoyed themselves until cow time at seven oclock. The older people generally went for a drink and some times came home nice and merry. It was hard to blame them as the drink that time was so cheap porter was only 2 1/2d a pint and whisky 2d a glass.   Very often the young people were so anxious for the dancing that they often neglected to go to mass on that day. A story is told of a band fiddler who was a bit tough about going to mass when any body was around who was anxious to dance to his music. One Saint Patricks day the curate who had heard of the dance starting at Guineys Bridge surprised the dancers who ran in\n(continues on next page)\n", "school_info": "School: Cnoc an Chláraigh, Séipéal na Carraige", "metadata": [{"Location:": "Knockaclarig, Co. Cork", "Teacher:": "\nDavid Ó Ceallacháin\n"}, {"Language": "English"}]}, "4811673/4811270/5168259": {"title": "Folklore - St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0344, Page 045", "Page 045"], "url": "https://www.duchas.ie/en/cbes/4811673/4811270/5168259", "text": "\nSt Patrick's day falls on the 17th of March.We do not know for certain that St Patrick's birthplace but it is probable he was born in Scotland. His father was a magistrate in a Roman colony.Having been taken captive by Niall of the Nine Hostages and having spent six years as a slave herding cattle on Slemish mountain in Antrim he escaped and made his way back to his family.On Easter Sunday morning he presented himself at the court of King Laeghaire at Tara\n(continues on next page)\n", "school_info": "School: Tullach (Tullig)", "metadata": [{"Location:": "Tullig More, Co. Cork", "Teacher:": "\nD. Ó Mathúna\n"}, {"Collector": "Nell Barrett", "Gender": "female", "Age": "14", "Address": "Killeenleigh, Co. Cork"}, {"Informant": "Mr John Healy", "Gender": "male", "Age": "34", "Address": "Killeenleigh, Co. Cork"}, {"Language": "English"}]}, "4921914/4900202/5168536": {"title": "Festival Customs - Saint Brigid's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0394, Page 178", "Page 178"], "url": "https://www.duchas.ie/en/cbes/4921914/4900202/5168536", "text": "\n(continued from previous page)\nMary Eliza Driscoll VII\n\n\n\nLong ago it was the custom that all Irish people should wear shamrock on Saint Patrick's Day, because when Saint Patrick was explaining (to a king) about the Three Divine Persons a sprig of shamrock sprang up at his feet.If an old man met another man, he asked him if he had his \"Patricks Pot\" yet.  This meant had he a \"pint\" yet that day.  If he had not, both would have one then.Both boys and girls wore harps and rosettes made of green ribbon; men wore shamrock on their hats also.\n", "school_info": "School: Cluain Uamha (C.)", "metadata": [{"Location:": "Cloyne, Co. Cork", "Teacher:": "\nE. Geeleher\n"}, {"Collector": "Marie O' Brien", "Gender": "female"}, {"Informant": "Mr J. O' Brien", "Gender": "male", "Address": "Cloyne, Co. Cork"}, {"Language": "English"}]}, "4921711/4892832/5170489": {"title": "Lá Fhéile Pádraig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0345, Page 167", "Page 167"], "url": "https://www.duchas.ie/en/cbes/4921711/4892832/5170489", "text": "\n1La Feile Padraig im shuidhe idtigh tabhairneMar a raibh cuideachta sár – fhear lein taoib ag ólBhí meidre mna ann na gcuaca in breaghtheBhí a cneas mar bláth agus a gruadh mar órBiodar sár- fhir na suidhe os cionn clár annThug searc is grádh ar fad do’n maighdin éigFear súiste is rainne ‘gus maighistir sgoláiríDo shiubhlaig a lán is do léig go leor11Do labhair gac aon aca a bpáirt le céileA’ moladh ‘mbréithre le beál na n-ógNo feacaint a mbféidir aon chuínse in ao’ corAdh fághail gan faoiseamh cun dul ‘na dtreoDo labhair an speir – bhean mall, tais, maordáNí gradhfainn fein an t-é is ailne snódhAc an t-e is gunta is geíre cun an cios a dheánamh‘Se ba inian liom a cás im threo111Do labhair an maigistir sgoile:-Mise mhuineann an sagart clumhailAgus gac saghas prionnsa da bfuil le fagháilSás laidne fhogluim ‘gus Gréig a sgrúdu’Is na Doctuiri seo a dheineann leigheasSin cun suibal me bim mear luthmharIs deas í mo triubhas is mo Caroline\n(continues on next page)\n", "school_info": "School: St Theresa's, Coachford", "metadata": [{"Location:": "Clontead More, Co. Cork", "Teacher:": "\nTimothy Forde\n"}, {"Informant": "Tadg Ó Murcadha", "Gender": "male"}, {"Language": "Irish"}]}, "4921754/4903690/5170812": {"title": "St Patrick's Cross", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0355, Page 495", "Page 495"], "url": "https://www.duchas.ie/en/cbes/4921754/4903690/5170812", "text": "\nThe Irish people hold great celebrations on the 17 March in honour of St Patrick. Everybody wear a shamrock on that day and some people send them to America and to England. It was with the three leaf shamrock that St Patrick explained to the Irish people that there are three persons in God. It was St Patrick that brought  the true faith to Ireland first. In older times all the little children used wear crosses made of green and  coloured ribbons on their shoulders in honour of St Patrick. It was an old custom for people to visit each other's houses on that day. When people met on that morning their first salute to each other was my Patrick's Pot on\n(continues on next page)\n", "school_info": "School: Doire Gealbhan (B.), Ceann Tuirc", "metadata": [{"Location:": "Derrygalun, Co. Cork", "Teacher:": "\nMáire de Lonndra\n"}, {"Collector": "Jimmie Walsh", "Gender": "male"}, {"Informant": "Mr P. Walsh", "Gender": "male", "Address": "Derrygalun, Co. Cork"}, {"Language": "English"}]}, "4921733/4901448/5180680": {"title": "Festival Customs - Saint Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0351, Page 217", "Page 217"], "url": "https://www.duchas.ie/en/cbes/4921733/4901448/5180680", "text": "\nThis was a day that was looked forward to years ago, as the people then hadn't such chance for amusements as now.After mass on Saint Patricks day, the local band came out and its members paraded the village, and played national airs for a couple of hours.At 3 oclock the young people went to the cross-roads, where platforms were usually laid and there they danced and enjoyed themselves until cow-time 7 o o'clock. The older people generally went for a drink and some came away nice and merry. It was hard to blame them, as the drink that time was so cheap, porter 2 1/2 d a pint and whiskey 2d a glass.Very often the young people were so anxious for the dancing, that they neglected to go to mass on that day. A story is told of a blind fiddler, who was a bit \"tough\" about attending mass, when anybody  was round, who was anxious to dance to his music. On Saint Patrick's day, the curate, who had heard of the dance starting very early at Guiney's bridge, surprised the dancers, who ran in all directions. The blind fiddler, all unconscious of what had happened, continued on with his playing. The went on up to him in a\n(continues on next page)\n", "school_info": "School: Séipéal na Carraige", "metadata": [{"Location:": "Rockchapel, Co. Cork", "Teacher:": "\nDonncha Ó Géibheannaigh\n"}, {"Collector": "Ita O Shea", "Gender": "female"}, {"Informant": "Daniel Walsh", "Gender": "male", "Address": "Knockahorrea East, Co. Cork"}, {"Language": "English"}]}, "4921824/4909533/5184392": {"title": "Emblems and Objects of Value - Crosses - St Patrick's Cross", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0374, Page 109", "Page 109"], "url": "https://www.duchas.ie/en/cbes/4921824/4909533/5184392", "text": "\nWhile I remember, and to this day my father brings in a bit of a sally stick every St. Patrick's morning, puts one end in the fire to blacken it, and with the burnt end makes a cross on the right sleeve of his coat and on the sleeve of each member of the family in honour of St. Patrick.\n", "school_info": "School: Baile Tighe Dhomhnaill, Malla", "metadata": [{"Location:": "Baltydaniel West, Co. Cork", "Teacher:": "\nDomhnall de Barra\n"}, {"Language": "English"}]}, "5177598/5172092/5185331": {"title": "Feast of Saint Patrick", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0585, Page 059", "Page 059"], "url": "https://www.duchas.ie/en/cbes/5177598/5172092/5185331", "text": "\nThe feast of St. Patrick is celebrated on the 17th March. It is a day of rejoicing at home and abroad.At home it is marked by celebrations pagents and processions - everything is done to do honour to Ireland's greatest Saint. It is a day on which the Irish exile turns his thoughts homewards, where with that the \"inward eye he plucks the green little shamrock from his native heath.The tender plants is displayed by  young and old, and the cailins tie their swinging plaits with bands of emerald green. It is a day of goodwill amongst the Gael and the old dissensions are forgotten when they \" drown the sharmrock \"  in the local public house.People who are abstaining from drink for the Lenten Season usually indulge heavily on \" Paddys day \". It is the belief that every drink taken merits a reward and adds to the glory and memory of St. Patricks on drinking each others health it is customary to say \"Saint Patricks pot he'll forget us not\". This saying is attributed to the belief that the saint has the privilegs of judging the Irish on the day of general judgment.\n\n\n\nShrove Tuesday is the day preceding Ash Wednesday of the Lenten Season. It is the last day of Shrove\n(continues on next page)\n", "school_info": "School: Clonlara", "metadata": [{"Location:": "Cloonlara, Co. Clare", "Teacher:": "\nDll. Ó Heoghanáin\n"}, {"Collector": "Josie Moloney", "Gender": "female", "Address": "Cloonlara, Co. Clare"}, {"Informant": "Tim Mc Inerney", "Gender": "male", "Age": "54", "Occupation": "labourer", "Address": "Mountcatherine, Co. Clare"}, {"Language": "English"}]}, "5177602/5172480/5185618": {"title": "St Brigid's Day - February 1st", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0586, Page 095", "Page 095"], "url": "https://www.duchas.ie/en/cbes/5177602/5172480/5185618", "text": "\n(continued from previous page)\nSt Brigid. I never saw it done.\n\n\n\nThis is a general holidays here now. Formerly public houses were open and the men visited them  \"to drink the health of the Saint\"  to drown the Shamrock.This is a step in the light direction to honour St Patrick by keeping his feast in proper manner. People were the Shamrock. Men wear it on their ears and hats and women wear it on their coats.I heard children used to wear crosses long ago. Now they use a harp or a green ribbon to tie the Shamrock.Patrick is a very common name here. A baby born near or on the feast gets\n(continues on next page)\n", "school_info": "School: Belvoir, Kilkishen", "metadata": [{"Location:": "Belvoir, Co. Clare", "Teacher:": "\nBríd Ní Chadhla\n"}, {"Language": "English"}]}, "5177652/5177129/5190612": {"title": "Saint Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0599, Page 125", "Page 125"], "url": "https://www.duchas.ie/en/cbes/5177652/5177129/5190612", "text": "\nwould not be known. They get a little bird called the wren and put him on the holly branch which one of them carry. They get money in nearly all the houses they go to. Some of the boys go on bicycles so that they can go a good distance from the village. Some of them carry mouth organs with them and others only sing.(l) St. Patricks DayWhen Patrick was a boy he was brought to Ireland from Wales, and he was sold as a slave to Milcho. He was put to herd sheep and cows\n(continues on next page)\n", "school_info": "School: Cora Caitlín (B.)", "metadata": [{"Location:": "Newmarket on Fergus, Co. Clare", "Teacher:": "\nP. Mac Conmara\n"}, {"Collector": "Seamus Ó Longaigh", "Gender": "male", "Age": "11", "Address": "Newmarket on Fergus, Co. Clare"}, {"Language": "English"}]}, "5177652/5177131/5190615": {"title": "Saint Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0599, Page 127", "Page 127"], "url": "https://www.duchas.ie/en/cbes/5177652/5177131/5190615", "text": "\nThe feast day that I am going to talk about is called St. Patrick's Day. It is a great day in Ireland, the feast   is held on the 17th of March. The people wear a piece of Shamrock on that day the shamrock does not grow in any other country but Ireland.The people of Ireland at the time of Patrick were pagans. He went to every County town and village in Ireland except to Co Clare. He blessed Clare from Knock Patrick which is across the shannon.The people of Clare especially from west Clare went across the shannon to hear him.Padraig MachanUltaigLatoonNewmarket on Fergus\n", "school_info": "School: Cora Caitlín (B.)", "metadata": [{"Location:": "Newmarket on Fergus, Co. Clare", "Teacher:": "\nP. Mac Conmara\n"}, {"Collector": "Padraig Mac an Ultaig", "Gender": "male", "Age": "14", "Address": "Latoon South, Co. Clare"}, {"Language": "English"}]}, "5162119/5155776/5196597": {"title": "St Patrick's Crosses", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0564, Page 403", "Page 403"], "url": "https://www.duchas.ie/en/cbes/5162119/5155776/5196597", "text": "\nSt Patrick's crosses were made of cardboard.  This cardboard was about three inches in diameter and was shaped round.  One short strip of cardboard and another long one were crossed in the middle for form a cross.The cross was covered all over with a green ribbon.   The peoplde used to wear the crosses on their shoulders on St Patrick's Day.   The children had smaller ones and the big people had larger ones.   They were made in the shops and some people made them at home.   The people wore them in honour of St Patrick,\n", "school_info": "School: Nuadhan (Noan),  Dúrlas Éile", "metadata": [{"Location:": "Noan, Co. Tipperary", "Teacher:": "\nMáire Ní Ghormáin\n"}, {"Collector": "Tessie Shanahan", "Gender": "female", "Address": "Kilcarney, Co. Tipperary"}, {"Language": "English"}]}, "4921807/4908992/5196899": {"title": "Saint Patrick's Cross", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0369, Page 655", "Page 655"], "url": "https://www.duchas.ie/en/cbes/4921807/4908992/5196899", "text": "\nLong ago the people used to wear a cross on their shoulder on Saint Patrick's Day in honour of Saint Patrick.The people used to make them themselves. This is how they used to make them. They would join two pieces of cardboard together in the form of a cross. Then they would cover it with silk and ribbons of all colours. Sometimes they used to wear them until \"Lady Day\" that is the twenty-fifth of March. These crosses however are not worn now but a piece of shamrock or a harp is worn instead.\n", "school_info": "School: Clochar na Trócaire, Malla", "metadata": [{"Location:": "Mallow, Co. Cork", "Teacher:": "\nNa Siúracha\n"}, {"Informant": "Mrs Leckey", "Gender": "female", "Address": "Mallow, Co. Cork"}, {"Language": "English"}]}, "5177626/5173938/5199846": {"title": "St Patrick's Day 17th March", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0591, Page 323", "Page 323"], "url": "https://www.duchas.ie/en/cbes/5177626/5173938/5199846", "text": "\nIn our own day, St. Patrick's day is recognised as a National Holiday.I remember thirty years ago, it was the chief market day in Scariff, our market town.  The farmers used to bring to market their supplies of early potatoes for sale also cabbage plants were always bought.  The people here do not grow Cabbage plants.  They buy them from the Ogonallo thrifty farmers who make a great deal of money from the sale of them.  It used to be a great day for drinking at the local public houses but that is all done away with.  Men wear the  shamrocks on their hats or their coats and so do the women and children.  In my young days, children (girls) always wore Crosses.  (Diagram of St. Patrick's Day Cross) The ground was made of velvet or silk and the Cross made of fancy beads or bits of bright colour.  These are no longer worn in our locality - instead they wear harps and a bit of green ribbon on their hair.Forty years ago an organization called \"Foresters\" used to come to Ballinahinch, the residence of a very good gentleman landlord called Cap. O Callaghan.  He gave them permission to spend the day in the grounds and the public were allowed to go in for the day.\n(continues on next page)\n", "school_info": "School: Lúbán Díge (Bodyke)", "metadata": [{"Location:": "Bodyke, Co. Clare", "Teacher:": "\nBríd, Bean Uí Chadhla\n"}, {"Language": "English"}]}, "5177649/5176754/5202222": {"title": "Féilí na Bliana - Lá Fhéile Pádraig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0598, Page 197", "Page 197"], "url": "https://www.duchas.ie/en/cbes/5177649/5176754/5202222", "text": "\nAll people wear shamrocks. Little boys & girls ribbons & harps. Some wear St. Patrick's crosses, bought, made of green ribbons. Drowning the shamrock - taking intoxicating liquor.Four-leafed shamrock, much sought after, suppsoed to bring luck. Saw my mother & she had only to walk out & she could pick them up. Did it on one occasion for  a Limerick visitor to his very great joy.\n\n\n\nGreatest time for matchmaking. Some say - \"What's bound in spring is loosened in autumn\"\n", "school_info": "School: Meelick (B.)", "metadata": [{"Location:": "Meelick, Co. Clare", "Teacher:": "\nEoghan Ó Néill\n"}, {"Language": "English"}]}, "4921760/4904247/5215861": {"title": "Saint Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0357, Page 109", "Page 109"], "url": "https://www.duchas.ie/en/cbes/4921760/4904247/5215861", "text": "\nIt was a great custom in this district to take the Patrick's Pot. Probably, it was to honour our conversion from Paganism. The result was that people imbibed too freely on that day.\n\n\n\nMarriages were celebrated in the home of the bride in the early years of  the last century. The priest got his offerings from the guests and the priest also partook of the dinner\n\n\n\nStraw-boys did not appear until about forty years ago. Some were invited so as not to cause disturbance. As a rule they behaved very well but on some occasions they caused trouble. The good fellows danced and got some drinks and the others showed rowdy conduct and had to be forcibly ejected. A dragthe procession of cars in a wedding was called - saddle horses 1st then all went on horse-back, the bride went to Church riding behind one of HER friends, and returned with one of HIS friends. Bonfires greeted them at cross-roads - Bridegroom threw them money.\n", "school_info": "School: Carrigaline, Ráth Mhór", "metadata": [{"Location:": "Carrigaline, Co. Cork", "Teacher:": "\nEibhlín, Bean Mhic Conchoille\n"}, {"Informant": "J.C. Dineen", "Gender": "male"}, {"Language": "English"}]}, "5215813/5214659/5221350": {"title": "Festival Customs - St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138D, Page 02_020", "Page 02_020"], "url": "https://www.duchas.ie/en/cbes/5215813/5214659/5221350", "text": "\nOn St. patrick's Day the people wear shamrock. The women and children wear it in their coats and the men wear it in their hats.On St. Patrick's Day every man has to drink a glass of whiskey. St PAtrick ordered them to drink \"Bun Padraig\". It is called \"Drowning The Shamrock\".-------------------------------------------------------Shrove Tuesday-------------------------------------------------------Long ago many marriage\n", "school_info": "School: St Bridget's", "metadata": [{"Location:": "Derrymore, Co. Mayo", "Teacher:": "\nMáire Uí hOistín\n"}, {"Collector": "Áine Ní Oistín", "Gender": "female", "Address": "Derrymore, Co. Mayo"}, {"Language": "English"}]}, "5215614/5207193/5236167": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0090D, Page 13_008", "Page 13_008"], "url": "https://www.duchas.ie/en/cbes/5215614/5207193/5236167", "text": "", "school_info": "School: Doirín Dáimh Dheirg / Dereendafderg", "metadata": [{"Location:": "Derrindaffderg, Co. Mayo", "Teacher:": "\nLiam Seóighe\n"}, {"Collector": "Síghle Ní hAodha", "Gender": "female", "Address": "Derrindaffderg, Co. Mayo"}, {"Language": "Irish"}]}, "5215813/5214896/5237491": {"title": "St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138D, Page 06_043", "Page 06_043"], "url": "https://www.duchas.ie/en/cbes/5215813/5214896/5237491", "text": "\nBefore St. Martin's Day in every house something is killed. Most people kill a goose. They spill some of the blood.\n\n\n\nOn November Night the fairies destroy the black-berries and from that out no one eats the black-berries. The boys of the village pull heads of cabbage and go around striking the doors with them.\n\n\n\nSt. Patrick told every man to drink a glass of whiskey to celebrate bun [?]\n(continues on next page)\n", "school_info": "School: St Bridget's", "metadata": [{"Location:": "Derrymore, Co. Mayo", "Teacher:": "\nMáire Uí hOistín\n"}, {"Collector": "Seán Máirtín Caoigín Ó hOistín", "Gender": "male"}, {"Language": "English"}]}, "5215813/5215014/5237854": {"title": "St Stephen's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138D, Page 09_004", "Page 09_004"], "url": "https://www.duchas.ie/en/cbes/5215813/5215014/5237854", "text": "\n(continued from previous page)\nwould have danced the people would give them the money.\n\n\n\nIt was an old custom to put up crosses on the houses on St Brigid's Day.Bu they do not put them up now\n\n\n\nSt Valintins Day the 14 of Febuary. it is pan cake day. In other lands. the people do make a lot of pan-cakes in honour of St Valinte.FeburaryValentins\n\n\n\nOn St Patrick Day the people weare the Shamrock in honour of St Patrick. wear\n", "school_info": "School: St Bridget's", "metadata": [{"Location:": "Derrymore, Co. Mayo", "Teacher:": "\nMáire Uí hOistín\n"}, {"Collector": "Tomás Ó Tónra", "Gender": "male"}, {"Language": "English"}]}, "5215813/5215464/5240066": {"title": "St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138D, Page 17_009", "Page 17_009"], "url": "https://www.duchas.ie/en/cbes/5215813/5215464/5240066", "text": "\nSt Patricks day is kept in honoured of St Patrick. The people wear shamrock and it is said that it is right for every man to wet the shamrock on that day. People also wear little harps in honour of St Patrick.\n\n\n\nOn palm Sunday people get palm in the Chaple and they keep the palm till the next year. Then when the new palm is got the old palm is burned. The shape of a cross is made on the people's forehead.\n", "school_info": "School: St Bridget's", "metadata": [{"Location:": "Derrymore, Co. Mayo", "Teacher:": "\nMáire Uí hOistín\n"}, {"Collector": "Máire Ní Raghallaigh", "Gender": "female"}, {"Language": "English"}]}, "5236078/5218282/5240812": {"title": "St Patrick's Deed", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0088E, Page 10_006", "Page 10_006"], "url": "https://www.duchas.ie/en/cbes/5236078/5218282/5240812", "text": "\nOnce when St Patrick was passing by a field he saw a farmer ploughing. The farmer kept on ploughing and did not salute him. St Patrick was not pleased, the earth opened and swallowed the horses and man.\n\n\n\nOnce there was a woman from Luckaun and she was visiting in a house in Curvey very late. One of the people of the house left her at home. On their way at a house called Heanan's they heard the clapping of hands and the crying and they said that was the banshee.\n", "school_info": "School: Achadh Fobhair", "metadata": [{"Location:": "Aghagower, Co. Mayo", "Teacher:": "\nHannah T. Kevilla\n"}, {"Collector": "Jack Sheridan", "Gender": "male", "Address": "Aghagower, Co. Mayo"}, {"Language": "English"}]}, "5260488/5259305/5263189": {"title": "Names of Animals", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1054B, Page 04_030", "Page 04_030"], "url": "https://www.duchas.ie/en/cbes/5260488/5259305/5263189", "text": "\n(continued from previous page)\nhouse we keep our cow in is a byre\n\n\n\nSt Patricks day is great day for music all the bands  be out and all the children be following the band. Every man and woma and child does have in a Three Leafed  Shamrock\"\n\n\n\nEaster Sunday is another great day\n(continues on next page)\n", "school_info": "School: Mín a Ghabhann (Meenagowan)", "metadata": [{"Location:": "Meenagowan, Co. Donegal", "Teacher:": "\nSéamus Ó Glacáin\n"}, {"Collector": "Seán Ó Rusail", "Gender": "male", "Address": "Ranny, Co. Donegal"}, {"Language": "English"}]}, "5215784/5209853/5277836": {"title": "Saint Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0095C, Page 02_032", "Page 02_032"], "url": "https://www.duchas.ie/en/cbes/5215784/5209853/5277836", "text": "\nOn St Patrick's day people wear shamrock in honour of Saint Patrick. Once when he was teaching the Irish people the mystry of the Blessed Trinity they could not understand how there were three persons in One God. St Patrick stooped down and picked a shamrock and showing it to them and said  \"As there are three leaves on one stem so there are three persons in One God\".\n", "school_info": "School: Gleann an Dúin - Prison", "metadata": [{"Location:": "Prison East, Co. Mayo", "Teacher:": "\nMáire A. Ní Dhocartaigh\n"}, {"Collector": "Mary Kate Kelly", "Gender": "female", "Address": "Prison North, Co. Mayo"}, {"Language": "English"}]}, "5215784/5209937/5277915": {"title": "St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0095C, Page 03_055", "Page 03_055"], "url": "https://www.duchas.ie/en/cbes/5215784/5209937/5277915", "text": "\nOn St. Patrick's day all the girls wear blue ribbons and the boys gather sham-rock for their jackets.\n", "school_info": "School: Gleann an Dúin - Prison", "metadata": [{"Location:": "Prison East, Co. Mayo", "Teacher:": "\nMáire A. Ní Dhocartaigh\n"}, {"Collector": "Annie M. Reilly", "Gender": "female", "Address": "Prison North, Co. Mayo"}, {"Language": "English"}]}, "5274069/5271275/5282785": {"title": "Folklore - Customs on St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0592F, Page 10_031", "Page 10_031"], "url": "https://www.duchas.ie/en/cbes/5274069/5271275/5282785", "text": "\n31                10 March 1938.              Folklore        Long ago there was a lot of customs attached to St Patrick's day.     The people used to make Crosses from card board and pin them on their shoulders.                Children held feasts on St Patricks day,the men used to be saving money ,for a month previous so that day  they could enjoy themselves and drink enough on that day which they called St Patrick's Pot.\n", "school_info": "School: Drumandoora N.S.", "metadata": [{"Location:": "Drumandoora, Co. Clare", "Teacher:": "\nLiam Mac Aodhaire, Liam Airley\n"}, {"Collector": "Chris Brody", "Gender": "male", "Address": "Killanena, Co. Clare"}, {"Informant": "Mr Pat. Moloney", "Gender": "male", "Address": "Killanena, Co. Clare"}, {"Language": "English"}]}, "5274069/5271347/5282970": {"title": "Folklore - Customs of St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0592F, Page 12_033", "Page 12_033"], "url": "https://www.duchas.ie/en/cbes/5274069/5271347/5282970", "text": "\n33             15 th March 1938.                  Folklore.Long ago there were a lot of customs attached to St Patricks Day.   The people used to make Crosses out of cardboard and pin them on their shoulders.                   The young people held feasts on St Patricks Day.                The men were saving their money for a month before St Patricks Day and on that a crowd of men would go to some public house and stay there untill the next morning drinking and this name was put on it St Patricks Pot\n", "school_info": "School: Drumandoora N.S.", "metadata": [{"Location:": "Drumandoora, Co. Clare", "Teacher:": "\nLiam Mac Aodhaire, Liam Airley\n"}, {"Collector": "Annie Moloney", "Gender": "female", "Address": "Killanena, Co. Clare"}, {"Informant": "Jack Holloran", "Gender": "female", "Address": "Corbehagh, Co. Clare"}, {"Language": "English"}]}, "5274069/5271405/5283011": {"title": "Folklore - Customs About St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0592F, Page 13_036", "Page 13_036"], "url": "https://www.duchas.ie/en/cbes/5274069/5271405/5283011", "text": "\n36.               15 th march 1938.Long ago there was a lot of Customs attached to St Patrick's Day.          Crosses were made by the people from green cardboard and worn on the shoulders.                  Children held feasts on St Patrick's Day. The men used to be saving money for the previous so that they could enjoy themselves on that day.   Customs about St. Patrick's Day.\n", "school_info": "School: Drumandoora N.S.", "metadata": [{"Location:": "Drumandoora, Co. Clare", "Teacher:": "\nLiam Mac Aodhaire, Liam Airley\n"}, {"Collector": "Bridie Woods", "Gender": "female", "Address": "Fahy, Co. Clare"}, {"Informant": "John Woods", "Gender": "male", "Address": "Fahy, Co. Clare"}, {"Language": "English"}]}, "5274069/5271479/5283047": {"title": "Folklore - Patrick's Day Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0592F, Page 15_038", "Page 15_038"], "url": "https://www.duchas.ie/en/cbes/5274069/5271479/5283047", "text": "\n38.                  15 th March 1938                    Folklore.On the 17 th .inst St.Patrick.s day will be celebrated with its usual costoms and blessings.On the day everybody will wear shamrocks and the young boys and girls will wear harps.      Some time ago everybody used to have green handkerchiefs for that-dayand the day was spent feasting and visiting.                  It is customary also to exchange greetings cards for this day and as St.\n(continues on next page)\n", "school_info": "School: Drumandoora N.S.", "metadata": [{"Location:": "Drumandoora, Co. Clare", "Teacher:": "\nLiam Mac Aodhaire, Liam Airley\n"}, {"Collector": "Bridie Mac Mahon", "Gender": "female", "Address": "Fahy, Co. Clare"}, {"Informant": "Michael Brody", "Gender": "male", "Address": "Killanena, Co. Clare"}, {"Language": "English"}]}}