{"4678382/4674280/4688011": {"title": "Éamonn an Chnoic", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0418, Page 337", "Page 337"], "url": "https://www.duchas.ie/en/cbes/4678382/4674280/4688011", "text": "\nEamonn a' Chnuic (4)Cé hé sin amuigh ar maidin go moch,Ag réabadh mo doruisín dúnta;Mise Eamonn an Cnuic atá báidhte fuar fliuchÓ shíor siubhal sléibhte is gleannta.Mo ghrádh tú is mo chuid ní'l áit agamsa duit,Muna gcasfhainn ort bun mo ghúnaMar go bhfuil pudar go tiugh d'á shéideadh amuigh,A dhéanfadh sinn araon a mhúscailt.2Má seasuighim-se 'sa rith go seachtmhain ó indiuTiocfad go minic ad' fheachaint,Is fágfad-sa 'gat, bábáinín mic,In imeall do bhrollaig gléigeal.Mo ghrádh tú is mo chuid is ná deinse é sinIs ná cuimhnig ar an olc a dheanamh,Mar d'á bhfágfá sa agam bábáinín micNíor b'aon tairbhe duit sa tsaoghal é.Sé mo léan ghéar a bean gan me féin is tú sealSiar is ó dheas chun lonndain,Nú sa Ghréig amach ó Éirinn ar fad Mara leigfhinn seal mo rún leat.\n(continues on next page)\n", "school_info": "School: An Bloscaod Mór", "metadata": [{"Location:": "Great Blasket Island, Co. Kerry", "Teacher:": "\nMáire Nic Gearailt\n"}, {"Informant": "Eibhlís Bean Uí Ceárna", "Gender": "female"}, {"Informant": "Pádraig Ó Guithín", "Gender": "male"}, {"Language": "Irish"}]}, "4922085/4850846/4943208": {"title": "A Ghost Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0520, Page 144", "Page 144"], "url": "https://www.duchas.ie/en/cbes/4922085/4850846/4943208", "text": "\n(continued from previous page)\n[-]\n\n\n\nOnce upon a time there lived a man named Eamonn an Cnuic. After the Siege of Limerick 1690, he had to stay on the hills behind Doon and Cappawhite. The English were after him, and there was a price of £1000 on his head.One day he met British Officers hunting on the Slieve Felim mountains. He stayed with them all day, and every-thing that used to come along he could shoot it, but they couldn't. They were surprised and they said that he had as good a shot as Eamonn an Cnuic. Then he told them who he was. The men were so pleased that when they went back, they got the price taken off his head. One night as he was staying with his friends, his first cousin cut off his head with a hay-knife. He took it to Clonmel\n(continues on next page)\n", "school_info": "School: Cappamore (B.)", "metadata": [{"Location:": "Cappamore, Co. Limerick", "Teacher:": "\nJames McCarthy\n"}, {"Collector": "Patrick O' Donoghue", "Gender": "male", "Age": "11", "Address": "Knocknacarriga, Co. Limerick"}, {"Language": "English"}]}, "4922198/4860069/4944717": {"title": "Eamon an Chnoic", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0550, Page 338", "Page 338"], "url": "https://www.duchas.ie/en/cbes/4922198/4860069/4944717", "text": "\nNed of the hills an Galloping Hogan often resorted to a den of theirs between Pallas and Annfield near the Clodagh to lie in wait for the straggling parties of the Borrisoleigh soldiers on their ? return home in the evening after pursuing the wild Irish during the day.Hogan was a smith apprentice at Ballycahill, after putting on a shoe one day of a dragoons horse, he mounted the horse to ride for his own amusement, while the soldier was drinking, the soldier vowed vengenance when they met the threats were repeated \"well said Hogan taking a pistol out of his pocket, said, \"I will have the first of the joke and he shot the soldier, seeing his case was desperate he fled and joined Ned Ryan of the Hills.Ned Ryan was born in the parish of Upperchurch previous to the year 1690. He was intended for the Priesthood, he was educated on the continent but he did not become a priest and he returned to Upperchurch. He was pursued\n(continues on next page)\n", "school_info": "School: Inch, Borrisoleigh", "metadata": [{"Location:": "Inch, Co. Tipperary", "Teacher:": "\nMrs Delaney\n"}, {"Collector": "Edmond Butler", "Gender": "male", "Address": "Annfield, Co. Tipperary"}, {"Language": "English"}]}, "4922083/4850651/4949681": {"title": "Éamon a' Chnoic", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0519, Page 314", "Page 314"], "url": "https://www.duchas.ie/en/cbes/4922083/4850651/4949681", "text": "\nThe most famous Rapparee in this locality was \"Ned of The Hill\" / Eamon Ó Riain. He is so well known & so much talked of as almost that he might be regarded as a National Hero.He was born near Hollyford or between Drombane & Hollyford in Co. Tipperary.In his youth he was sent to France to study for the priesthood. During one of his visits home from France he saw a sherrif or some baliffs \"driving\" a widow's cattle. He, with some others, resisted them. Some of the Sherrif's party were killed & Ned went back to France no more. This must have been some time prior to the sieges of Limk. in 1690-91 because it is said Eamon was with the Irish army at Limk. I never heard of anything connecting him with Sarsfield's famous ride through this district. I have always heard of Galloping Hogan leading Sarsfield. Ned of The Hill must have known some ofthe district as well as Hogan but I never heard any mention of him that connection.After the \"Wild Geese\" had sailed away from Limk. Ned remained at home - or rather he took to the hills - these\n(continues on next page)\n", "school_info": "School: Faill Uí Chléirigh", "metadata": [{"Location:": "Foilycleara, Co. Limerick", "Teacher:": "\nMl. Ó Heachthigheirn\n"}, {"Informant": "Mr James Mahon", "Gender": "male", "Age": "33", "Occupation": "farmer", "Address": "Curraghakimikeen, Co. Limerick"}, {"Language": "English"}]}, "4922083/4850655/4949722": {"title": "Éamon a' Chnoic", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0519, Page 318", "Page 318"], "url": "https://www.duchas.ie/en/cbes/4922083/4850655/4949722", "text": "\nEamon ui Cnuic & his Hidden Treasure as related by Mr Jas Maher, Groughmakeen, Farmer, aged 33 yrs.Eamon called one day at a house in Laccnagoneeny (Leaca na gConiní) where lived people named Dawson. The dinner was almost ready & Ned waited for it. He had a considerable amount of treasure, gold etc with him. The potatoes were boiled and the woman of the house was going to \"strain\" them. Ned said he would go out and hide the treasure. She scarcely had the dinner on the table when he back again, so he could not have gone far. He was betrayed and murdered soon after, and the treasure was never found. People named Whelans are living in the place now. The place is marked on the sketch map. (I heard a Radio Play on the wireless some time ago & the 1st scene was laid in Laccnagoneeny I wonder did the writer know of above story?) In that play I heard Ned was married to a Miss Mary Leahy from Kilkenny. I never heard the from the people here around. I have heard he is buried in the graveyard in Doon (where I expect to be some day myself). His grave can not be pointed out.\n", "school_info": "School: Faill Uí Chléirigh", "metadata": [{"Location:": "Foilycleara, Co. Limerick", "Teacher:": "\nMl. Ó Heachthigheirn\n"}, {"Informant": "Mr James Maher", "Gender": "male", "Age": "33", "Occupation": "farmer", "Address": "Curraghakimikeen, Co. Limerick"}, {"Language": "English"}]}, "4922160/4857100/5015457": {"title": "Éamonn an Chnoic", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0540, Page 003", "Page 003"], "url": "https://www.duchas.ie/en/cbes/4922160/4857100/5015457", "text": "\nWho is the minstrel by yonder lone towerHis harp all so tenderly touching with skillOh who could it be but young Ned of the hillSamuel Louer has rescued the name of a true son of Tipperary from oblivion Edmund Knock O Ryan was born in the parish of Hollyford about thirty years prior to the Siege of Limerick. The Ryans of Knock (Cnoc) belonged to the landed gentry and Eamonn was sent to Paris to study for the priesthood. While on holidays (if the surrepticious visits hither and thither to the continent deserve the name) he had the misfortune to slay an English soldier in some sort of brawl. This precluded any further clerical studies. Besides to avoid the merciless arm of the Sasanac he had to go on the run. Eventually he became a Rapparee a sort of irregulars made up mostly of men outlawed for their political affiliation and support of the Jacobite cause. He fought with Sarsfield at the Siege of Limerick and was a member of the famous night riders\n(continues on next page)\n", "school_info": "School: Lackamore, Tulach Sheasta", "metadata": [{"Location:": "Lackamore, Co. Tipperary", "Teacher:": "\nMáire, Bean an Diolúnaigh\n"}, {"Collector": "Mary Anne Mackey", "Gender": "female", "Address": "Gleno, Co. Limerick"}, {"Informant": "Mr Michael O' Dwyer", "Gender": "male", "Age": "46", "Address": "Killeen, Co. Tipperary"}, {"Language": "English"}]}, "4922164/4857504/5016446": {"title": "Éamonn a' Chnoic", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0541, Page 03", "Page 03"], "url": "https://www.duchas.ie/en/cbes/4922164/4857504/5016446", "text": "\nÉamonn a’ ChnuicDeirtear annso gur i nDrom Bán i gCo. Thiobrad Árann a rugadh Éamonn timcheall na bliana 1660. Dar ndóig Éamonn Ó Riain a ainm agus nior tugadh Éamonn a Chnuic air go dtí go mbéigin dó dul ar a theiceadh ó shaighdiuirí Shasana nuair a bhí sé ina fear óg.De réir na sgéalta bhí muinntear Éamoinn neamh spleadach go leor agus bhí sé ceapaighthe aca sagart a dhéanamh da mhac dá mba thoil Dé é. Chuige sin cuireadh chuig choláiste go dtí an Róimh agus chaith sé stad ann le sagartóireacht.   Uair dá raibh sé sambailt ar a shaoire  tá sé ráidhte gur mharbhuigh sé báille a bhí ar dream a tháinig le mnaoi boicht( comharsa d’Éamonn ) a chur as seilbh toisc ná raibh sé na cumas an cios a d’íoc don tigheara talmhan\n(continues on next page)\n", "school_info": "School: Cumán an Lín", "metadata": [{"Location:": "Commanealine, Co. Tipperary", "Teacher:": "\nSeanán Mac Mathúna\n"}, {"Language": "Irish"}]}, "4922169/4858018/5017124": {"title": "Gortkelly Castle", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0543, Page 043", "Page 043"], "url": "https://www.duchas.ie/en/cbes/4922169/4858018/5017124", "text": "\nAndrew Ryan was the man who built Gortkelly Castle. Andrew was a servant to a noted man at the time named Rueben Lee who owned Gurtnaskehy. Rueben was a highway man and a Cromwellian protestant who kept his money hidden in a hole or valley which was then the custom. Rueben used to go to a particular spot every morning of his life. Ryan was watching closely and succeeded in finding the spot where the gold was hidden and stole it. With this money he purchased Gortkelly, Glenbeg and Gortatooda, he also built the castle. It is said that he wet the mortar with sour milk but he died in the poor house afterwards.\n\n\n\nWhen Ned of the Hill came back from France, it is said that he fought at Limerick and that he was on the run after that. He used be going around the hills of Upperchurch and Hollyford. Once he was stopping at a house in Gurtnaskehy. There was an old woman living in it by herself. She had only one cow and she was going to be taken from her because she could not pay her rent. When the sheriff came to take the cow Ned killed one of his men and there was a price on his head afterwards. One night he was stopping\n(continues on next page)\n", "school_info": "School: Garrdha na Cailce (Garnakilla)", "metadata": [{"Location:": "Garranakilka, Co. Tipperary", "Teacher:": "\nSéamus Ó Riain\n"}, {"Language": "English"}]}, "4922169/4858018/5017126": {"title": "Gortkelly Castle", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0543, Page 043", "Page 043"], "url": "https://www.duchas.ie/en/cbes/4922169/4858018/5017126", "text": "\nAndrew Ryan was the man who built Gortkelly Castle. Andrew was a servant to a noted man at the time named Rueben Lee who owned Gurtnaskehy. Rueben was a highway man and a Cromwellian protestant who kept his money hidden in a hole or valley which was then the custom. Rueben used to go to a particular spot every morning of his life. Ryan was watching closely and succeeded in finding the spot where the gold was hidden and stole it. With this money he purchased Gortkelly, Glenbeg and Gortatooda, he also built the castle. It is said that he wet the mortar with sour milk but he died in the poor house afterwards.\n\n\n\nWhen Ned of the Hill came back from France, it is said that he fought at Limerick and that he was on the run after that. He used be going around the hills of Upperchurch and Hollyford. Once he was stopping at a house in Gurtnaskehy. There was an old woman living in it by herself. She had only one cow and she was going to be taken from her because she could not pay her rent. When the sheriff came to take the cow Ned killed one of his men and there was a price on his head afterwards. One night he was stopping\n(continues on next page)\n", "school_info": "School: Garrdha na Cailce (Garnakilla)", "metadata": [{"Location:": "Garranakilka, Co. Tipperary", "Teacher:": "\nSéamus Ó Riain\n"}, {"Informant": "Denis Buttler", "Gender": "male", "Age": "87", "Address": "Knockfune, Co. Tipperary"}, {"Language": "English"}]}, "4922167/4857795/5018210": {"title": "Eamonn a' Chnoic", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0542, Page 234", "Page 234"], "url": "https://www.duchas.ie/en/cbes/4922167/4857795/5018210", "text": "\nAbout two hundred and seventy years ago Eamonn a Chnuic was alive. He was born in Knockmihil which is in the parish of Drombane in the seventeenth century. He fought at the Siege of Limerick in 1691. Ned was married to a girl named Eileen. One day when he was riding on his horse on the top of one of the surrounding hills he met a number of hunters. He stood talking to them in the midst of whom was a lady who said she often went hunting alone. Ned asked her if she would be lonely and she said, \"no, I would not be lonely, but I would be afraid of Eamonn a Chnuic.\" \"I am the man,\" said Ned. They fell off their horses and the lady also got a weakness. Eamonn told them that he was not a robber, but that he robbed the rich and gave the spoils to the poor. After sometime Ned got married to Eileen in Doon and they lived in Foilaclug.He was studying in France for the priesthood but he \"spilled blood\" when fighting with another student and he had to come home where he found his home\n(continues on next page)\n", "school_info": "School: Cluain Mhurchais (Hollyford)", "metadata": [{"Location:": "Hollyford, Co. Tipperary", "Teacher:": "\nLiam Ó Donnchadha\n"}, {"Collector": "Kitty Davern", "Gender": "female"}, {"Informant": "Mr Jermiah O' Dwyer", "Gender": "male", "Address": "Bahagha, Co. Tipperary"}, {"Language": "English"}]}, "4922218/4861471/5018578": {"title": "Candle-Making Long Ago", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0555, Page 236", "Page 236"], "url": "https://www.duchas.ie/en/cbes/4922218/4861471/5018578", "text": "\n(continued from previous page)\n[/]\n\n\n\nEamonn an Cnuic the famous raparee, was born in the latter part of the seventeenth century. He was so called because his birth-place was Knock Mehil, Co. Tipperary. One day three gentlemen who were shooting birds met him but they did not recognise him. They were bad shots and they shot but a few birds. Eamonn an Cnuic said that he would fill all their bags with birds. They agreed and lent him a gun and ammunition. Then he started to shoot birds. At every shot he killed a bird. he kept on shooting until the bags were\n(continues on next page)\n", "school_info": "School: Scoil na mBráthar, Caiseal", "metadata": [{"Location:": "Cashel, Co. Tipperary", "Teacher:": "\nAn Br. B. E. Ó hOireabháird\n"}, {"Collector": "Colm O' Hegarty", "Gender": "male", "Address": "Charterschool Land, Co. Tipperary"}, {"Informant": "Mr D. O' Hegarty", "Gender": "male", "Address": "Charterschool Land, Co. Tipperary"}, {"Language": "English"}]}, "4922218/4861473/5018580": {"title": "The Murder of Eamonn an Chnoic", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0555, Page 238", "Page 238"], "url": "https://www.duchas.ie/en/cbes/4922218/4861473/5018580", "text": "\nAbout a week after Eamonn An Cnuic was pardoned he went to stay with a cousin of his for a night. As he was entering his cousin's yard his horse came to a stand-still. Do what he might he could not get his horse to move. At last he got it to go into the stable. Then he got a halter and with the help of his cousin he tied it securely; but the horse broke it. He locked the stable door then and went to bed because by that time it was night. He was only a few hours in bed when he woke up and heard his horse whinnying in the stable. At the same time his cousin came into the room. Eamonn said to him \"I dream that you were cutting off my\n(continues on next page)\n", "school_info": "School: Scoil na mBráthar, Caiseal", "metadata": [{"Location:": "Cashel, Co. Tipperary", "Teacher:": "\nAn Br. B. E. Ó hOireabháird\n"}, {"Collector": "Colm O' Hegarty", "Gender": "male", "Address": "Charterschool Land, Co. Tipperary"}, {"Informant": "Mr D. O' Hegarty", "Gender": "male", "Address": "Charterschool Land, Co. Tipperary"}, {"Language": "English"}]}, "4922168/4857961/5019121": {"title": "The Raparees", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0542, Page 400", "Page 400"], "url": "https://www.duchas.ie/en/cbes/4922168/4857961/5019121", "text": "\nOf these there seems to be no account. I heard a little from James Doherty of Ned of the Hill. According to his story Eamonn was born near Drombane a couple of fields from the place on the Thurles road known as the Metal Bridge. His real name was Ned Ryan. He was for a long time looked upon by many as a sort of Brennan on the Moor robbing the rich, feeding the poor. He gave me the following rhyme in Irish referring to the Raparee's death\"Tomas bán a Faill a' CluigA bain an ceann o'Eamonn a'Chnuic\"His assassin was his own first cousin. Now he had it seems first cousins named O'Dwyer bán and Ryan bán and which of the families was responsible cannot according to the above rhyme be ascertained. Old people are reticent about the matter and will tell you \"better leave these things dead\". According to my informant Eamonn was killed at Foilclug near Hollyford. His head was taken to Clonmel by his assassin and his body was buried in a field near the spot known as Peg bán's Hollow. His grave\n(continues on next page)\n", "school_info": "School: Cill Chuimín, Durlas Éile", "metadata": [{"Location:": "Kilcommon, Co. Tipperary", "Teacher:": "\nDonnchadh Ó Cuinnéain\n"}, {"Language": "mixed"}]}, "4922228/4862621/5021013": {"title": "Ned of the Hill", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0559, Page 053", "Page 053"], "url": "https://www.duchas.ie/en/cbes/4922228/4862621/5021013", "text": "\nNed Ryan was born in Drombane about six miles from Thurles Co. Tipperary. When he was young he was educated in a hedge-school in the locality. Then he was sent to the continent to complete his education. He used to come home occassionally on his holidays and on one occasion when he was at home there was an eviction in the locality and he went to it. A row arose during the eviction between the soliders and the people and Ned Ryan was amongst them and he got into trouble with the soliders. Some of the soldiers were killed and Ned Ryan had to go \"on his keeping\" through the mountains. Then he joined a band called the Tories or Rapparees and was made leader of them. They used to rest and hide in the mountains by day and they used to go plundering on the settlers during the night. The soldiers used to search every day for him and they could not get\n(continues on next page)\n", "school_info": "School: Loch an Cheanntaigh (Loughkent), Cathair Dhúin Iascaigh", "metadata": [{"Location:": "Loughkent West, Co. Tipperary", "Teacher:": "\nMícheál Ó Laighin\n"}, {"Collector": "Thomas Mc Loughlin", "Gender": "male", "Address": "Woodinstown, Co. Tipperary"}, {"Language": "English"}]}, "4922317/4869469/5053971": {"title": "Éamonn an Chnoic", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0584, Page 080", "Page 080"], "url": "https://www.duchas.ie/en/cbes/4922317/4869469/5053971", "text": "\nEamonn a Cnoic or Eamonn O'Ryan was born at Knockmahill, Upperchurch.  His mother was one of the O'Dwyer clan.  Eamonn was a splendid type of Tipperary man, brave, tall and handsome.  He held the rank of Captain in the Irish Army and fought at the battle of Aughrim and Limerick under the command of Sarsfield.  After the signing of the treaty at Limerick he chose the outlaw's bold career.  With a price on his head he was looked for through Tipperary and Limerick.  He was engaged to be married to a Co. Kilkenny girl named Leahy.  The marriage was to take place at Doon.  On the morning of his wedding Eamonn was invited to the house of a man named Roubeen Lee of Gorthnaskhey, who had a fine breakfast laid for him, and in the meantime sent his erveant man to Borrisoleigh for the Military to arrest him.\n(continues on next page)\n", "school_info": "School: Ros Mor", "metadata": [{"Location:": "Rossmore, Co. Tipperary", "Teacher:": "\nMaitiú Ó Cinnéide\n"}, {"Collector": "Seán Grant", "Gender": "male", "Address": "Ballindrummeen, Co. Tipperary"}, {"Informant": "Diarmuid Ó Duibhir", "Gender": "male", "Address": "Rossmore, Co. Tipperary"}, {"Language": "English"}]}, "4922305/4868708/5054558": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0581, Page 308", "Page 308"], "url": "https://www.duchas.ie/en/cbes/4922305/4868708/5054558", "text": "\nThe Rebel on his steed is Eamonn a' CnuicOh! for an artists soul to paint that rebel on his steedWith Phelims mountains at his back above the heathery meadId paint a gallant swordsman then with purpose in his eye.That fought the age-old fight for us when war clouds hung on highIIBut who could paint a face like his type of his country's soul. His lips like chiselled granite when he led towards freedom's goalHis eyes like dancing sunbeams when the Gael had won the fight,He ruled Phelims like a king with sword that flashed for right. IIIHe charged with Berwick at the\n(continues on next page)\n", "school_info": "School: Anacarty (B.)", "metadata": [{"Location:": "Annacarty, Co. Tipperary", "Teacher:": "\nLiam Ó Dómhnaill\n"}, {"Informant": "Michael Schofield", "Gender": "male", "Address": "Newtown, Co. Tipperary"}, {"Language": "English"}]}, "4922305/4868710/5054560": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0581, Page 310", "Page 310"], "url": "https://www.duchas.ie/en/cbes/4922305/4868710/5054560", "text": "\n(continued from previous page)\nFor thirty years he rode and fought and laughed at every foe. The silver shone thro his dark hair ere traitor struck the blow.That robbed the Phelims of their chief brave Eamonn of the Hill.That sang and fought for freedom with heart and steadfast will.Phelims are a continuation of the Keeper Hills, north of Cappawhite.\n\n\n\nEamonn a CnuicNed O Ryan or Eamonn a Cnuic was a member of an old Killnamanagh family.He was born in 1670, educated on the continent and being a very cultured man was skilled in\n(continues on next page)\n", "school_info": "School: Anacarty (B.)", "metadata": [{"Location:": "Annacarty, Co. Tipperary", "Teacher:": "\nLiam Ó Dómhnaill\n"}, {"Informant": "Mr Michael Schofield", "Gender": "male", "Address": "Newtown, Co. Tipperary"}, {"Language": "English"}]}, "4922314/4869230/5071059": {"title": "Ned O' the Hills", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0583, Page 163", "Page 163"], "url": "https://www.duchas.ie/en/cbes/4922314/4869230/5071059", "text": "\nNed of the Hills was supposed to be very good at shooting. One day a gentleman went out on the \"Hills\" and he met a man and the man was talking to him for a while and the gentleman said to him \"Do you know Ned of the Hills\" and he said \"I am Ned of the Hills\". The gentleman told Ned to go into his house and if he was in any danger to go into a box in the corner, then to whistle and a big dog would come in and to put out his hand and catch the dogs tail and the dog would run up on the hills and leave him there. All happened as they had planned.\n\n\n\nNed of the hills was an outlaw who lived in Athshanboy in the parish of Drombane. he was a very wicked man who took many mens' lives and every body dreaded him on account of his wickedness. One day a man met him\n(continues on next page)\n", "school_info": "School: An Bealach, Crosaire an Ghúlaigh", "metadata": [{"Location:": "Ballagh, Co. Tipperary", "Teacher:": "\nDiarmuid Mac Fhloinn\n"}, {"Informant": "Mr T. Connors", "Gender": "male", "Address": "Skehanagh, Co. Tipperary"}, {"Language": "English"}]}, "4922314/4869230/5071069": {"title": "Ned O' the Hills", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0583, Page 163", "Page 163"], "url": "https://www.duchas.ie/en/cbes/4922314/4869230/5071069", "text": "\nNed of the Hills was supposed to be very good at shooting. One day a gentleman went out on the \"Hills\" and he met a man and the man was talking to him for a while and the gentleman said to him \"Do you know Ned of the Hills\" and he said \"I am Ned of the Hills\". The gentleman told Ned to go into his house and if he was in any danger to go into a box in the corner, then to whistle and a big dog would come in and to put out his hand and catch the dogs tail and the dog would run up on the hills and leave him there. All happened as they had planned.\n\n\n\nNed of the hills was an outlaw who lived in Athshanboy in the parish of Drombane. he was a very wicked man who took many mens' lives and every body dreaded him on account of his wickedness. One day a man met him\n(continues on next page)\n", "school_info": "School: An Bealach, Crosaire an Ghúlaigh", "metadata": [{"Location:": "Ballagh, Co. Tipperary", "Teacher:": "\nDiarmuid Mac Fhloinn\n"}, {"Informant": "Dennis Hayes", "Gender": "male", "Address": "Ballagh, Co. Tipperary"}, {"Language": "English"}]}, "4922314/4869231/5071072": {"title": "Ned O' the Hills", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0583, Page 164", "Page 164"], "url": "https://www.duchas.ie/en/cbes/4922314/4869231/5071072", "text": "\n(continued from previous page)\nand the man not knowing who he was said \"There is a terrible man going round by the name of Ned of the Hills and everyone he meets he shoots them\" and Ned of the Hills said \"I am the man\" and he told him that Ned of Hills would harm nobody only those that would inform on him and he told the man to pass on. Then the soldiers said that they would give a reward to anyone who would bring them the head of Ned of the Hills sot there were some people who killed him at Foilacluig near Hollyford and they were bringing his head to Clonmel when they heard that he was freed and some say that they threw his head into the moat of Ardmayle.\n\n\n\nNed of the Hills was born in Drombane. He went to college to be a priest and he came home on his holidays and there was a war in Ireland at that time. He was a lover of his country and he fought for it.\n(continues on next page)\n", "school_info": "School: An Bealach, Crosaire an Ghúlaigh", "metadata": [{"Location:": "Ballagh, Co. Tipperary", "Teacher:": "\nDiarmuid Mac Fhloinn\n"}, {"Informant": "Denis Hayes", "Gender": "male", "Address": "Ballagh, Co. Tipperary"}, {"Language": "English"}]}, "4922314/4869232/5071073": {"title": "Ned O' the Hills", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0583, Page 165", "Page 165"], "url": "https://www.duchas.ie/en/cbes/4922314/4869232/5071073", "text": "\n(continued from previous page)\nWhen he went back to college he would not be taken in because the priests would not take anyone that had been fighting.\n\n\n\nA priest named Fr Sheehy who lived near this place was hanged. His head was put on a spear outside the barracks in Clonmel. His sister walked up and down the street watching patiently until she got it down off of the spear at night and she took it away in her apron. A man called Maude who lived in Dundrum said it would make a beautiful crow's nest and it was noticed that the crows never built their nests in Dundrum until the nuns took it and made a convent of it. They built in the place ever since.\n\n\n\nA priest named Father Sheehy\n(continues on next page)\n", "school_info": "School: An Bealach, Crosaire an Ghúlaigh", "metadata": [{"Location:": "Ballagh, Co. Tipperary", "Teacher:": "\nDiarmuid Mac Fhloinn\n"}, {"Informant": "Mrs Kearns", "Gender": "female", "Address": "Goold's Cross, Co. Tipperary"}, {"Language": "English"}]}, "4922315/4869331/5071516": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0583, Page 264", "Page 264"], "url": "https://www.duchas.ie/en/cbes/4922315/4869331/5071516", "text": "\n(continued from previous page)\nwould come back again. Foolishly enough they did so, and it is often cast up to us still, and we are called. \"The Tipperary people who burned their mother\n\n\n\n49 In olden times a landlord had a widow's son hanged wrongfully. The widow prayed that when the Landlord died there would a tree grow from his heart. The landlord was buried in Tipperary Church-yard and an ash tree has grown from his heart\n\n\n\nNed of the Hill lived in Foilmacduff near Hollyford. The landlords wanted to catch him and to save himself, he had a to make a cave in a valley. The cave was so well made that if the landlords went into it, \"Ned of the Hill\" could turn on a river, drown the landlord and save himself. He went to live with his brother in law and one night he cut off his head and went to Cashel with it to get the money offered as a reward by the Governer but got nothing\n(continues on next page)\n", "school_info": "School: Gleannach (Glenough)", "metadata": [{"Location:": "Glenough Lower, Co. Tipperary", "Teacher:": "\nBean Uí Bhreasail\n"}, {"Language": "English"}]}, "4922315/4869362/5071626": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0583, Page 295", "Page 295"], "url": "https://www.duchas.ie/en/cbes/4922315/4869362/5071626", "text": "\n(continued from previous page)\nAnd fell from the bottom to the top. He was out in the middle of the ocean when a train car came in his sight. He saw a barefooted boy with his boots on and it rained all day that night.\n\n\n\nFood left after firrets is good for chin cough. A male fern dry is good for Anthony's fire. Eat three meals of nettles in the month of May and it is good for the blood. Rib grass applied to a wound stops the bleeding.\n\n\n\nA penny wise and a penny foolish. Early to bed and early to rise makes a man healthy wealthy and wise. The early bird catches the worm. Too late to spare when all is spent. Plough deep while sluggards sleep and you will have corn to sell and to keep. Better go to bed supperless than raise a debt.\n\n\n\nNed of the hill lived in a valley in\n(continues on next page)\n", "school_info": "School: Gleannach (Glenough)", "metadata": [{"Location:": "Glenough Lower, Co. Tipperary", "Teacher:": "\nBean Uí Bhreasail\n"}, {"Language": "English"}]}, "4922315/4869362/5071627": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0583, Page 295", "Page 295"], "url": "https://www.duchas.ie/en/cbes/4922315/4869362/5071627", "text": "\n(continued from previous page)\nAnd fell from the bottom to the top. He was out in the middle of the ocean when a train car came in his sight. He saw a barefooted boy with his boots on and it rained all day that night.\n\n\n\nFood left after firrets is good for chin cough. A male fern dry is good for Anthony's fire. Eat three meals of nettles in the month of May and it is good for the blood. Rib grass applied to a wound stops the bleeding.\n\n\n\nA penny wise and a penny foolish. Early to bed and early to rise makes a man healthy wealthy and wise. The early bird catches the worm. Too late to spare when all is spent. Plough deep while sluggards sleep and you will have corn to sell and to keep. Better go to bed supperless than raise a debt.\n\n\n\nNed of the hill lived in a valley in\n(continues on next page)\n", "school_info": "School: Gleannach (Glenough)", "metadata": [{"Location:": "Glenough Lower, Co. Tipperary", "Teacher:": "\nBean Uí Bhreasail\n"}, {"Language": "English"}]}, "4922169/4858052/5130194": {"title": "History", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0543, Page 077", "Page 077"], "url": "https://www.duchas.ie/en/cbes/4922169/4858052/5130194", "text": "\nWhen Ned of the Hill came back from France. It is said he fought at Limerick and he was on the run after that. He used to be going around the hills of Upperchurch and Hollyford. Once he was staying at a house in Gurtnaskaha. There was an old woman living in the house by herself. She had only one cow and she was going to be taken off her, because she did not pay her rent. When the sheriff came to take the cow Ned killed one of them and there was a price for his head after that. One night he was stopping with a man named Dwyer who lived in Foilaclough, and the man and his wife cut off Neds head and were taking it to Clonmel when they found out that he had obtained his pardon. Neds body was buried in Fiolaclough but it was afterwards taken up and buried in Doon.\n", "school_info": "School: Garrdha na Cailce (Garnakilla)", "metadata": [{"Location:": "Garranakilka, Co. Tipperary", "Teacher:": "\nSéamus Ó Riain\n"}, {"Informant": "Patrick Bourke", "Gender": "male", "Age": "58", "Address": "Shevry, Co. Tipperary"}, {"Language": "English"}]}}