{"4428331/4396269/4481511": {"title": "Story of Lough Finn", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1048, Page 30", "Page 30"], "url": "https://www.duchas.ie/en/cbes/4428331/4396269/4481511", "text": "\nAs Finn & his companions hunted over Ireland the game became scarce & retreated into the wild & well wooded regions of the glens & mountains. Finn pursued them to these haunts and this brought him at length to Glen-Fada-na Shalga, (The long glen of the chases) in Donegal near Glenties. They had travelled all day without seeing a house but as darkness set in they spied a light in Glenleighan south of the Gweebarra river. They drew towards the light & found a man called Leighan living there with his son & daughter.Finn asked for food but the old man, when he saw the large company, shook his head & said he had scarcely enough for his own household but that he would share what he had & added that in the morning he would show them the lair of a wild bull & if they could kill him there would be plenty for all.Finn agreed & they all went to bed for the night, their beds being of heather spread on the earthen floor. All were early astir next morning & Leighan sent his son Feargowan with them to show them the haunt of the wild bull.\n(continues on next page)\n", "school_info": "School: Beitheach (Beagh)", "metadata": [{"Location:": "Beagh, Co. Donegal", "Teacher:": "\nMaitiú Mac Suibhne\n"}, {"Informant": "Pat Gaorgan", "Gender": "male", "Age": "75", "Address": "Ardara, Co. Donegal"}, {"Language": "English"}]}, "4428344/4397319/4482150": {"title": "Scéal Loch Finne", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1051, Page 1", "Page 1"], "url": "https://www.duchas.ie/en/cbes/4428344/4397319/4482150", "text": "\nFuair an loch a ainm uadh Finn an Chinn Bháin. Badh deirbhfúir do'n Fhear Ghamhain Finn agus bhí sí i na mnaoi óig san am a thárladh an sgéal seo síos. Fáthach mór garbh do badh é, Fear-gamhain. Ní dhéarn sé ariamh rud ar bith a h-iarradh air acht bhí sé cinnte an rud eile do dheanamh. Bhí fáthach mhór eile fa chúpla míle dhe dar b'ainm Manannan na Troda agus ní raibh siad ag cur le chéile go ró-mhaith. Anois bhí eagla a chroicinn ar Mhanannan roimh Fearghamhain agus cheap sé go mbéadh saoghal sona suaimhneach aige féin acht b'é an fáthach eile tá amháin chuir sé sgéala chuig 'n Fhearghamhain nuar a bhí sé ag pilleadh 'un na bhaile indhiadh a bheith ar chuairt gan due bealach Mhín an Áil ar a bháis, nó go rabh much bhán agus a trí cinn óga annsin, agus  nach bhfághfadh duine ar bith saor o fheirg na muice sin. Comh luath géar 'gus chualaidh 'n Fhearghamhain an sgéal seo nach siúd anonn go Mín an Áil\n(continues on next page)\n", "school_info": "School: Scoil an Chlochair, Na Gleanntaí", "metadata": [{"Location:": "Glenties, Co. Donegal", "Teacher:": "\nAn tSr. M. Deuglán\n"}, {"Language": "Irish"}, {"Location": "Lough Finn"}]}, "4461441/4395062/4499143": {"title": "Seilg Ghleann Léithín", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1046, Page 159", "Page 159"], "url": "https://www.duchas.ie/en/cbes/4461441/4395062/4499143", "text": "\nBhí sin ann ibhfad ó choin nuair a ghannuigh an t-seilg ar Fiannaibh Éireann i nGleann na Smól, smaoithigh Fionn go mbfeárr do tarraingt an Ghleann Fhada na Sealg. Nuair a tháinig siad fhad le loch Finne, bhí an oidhche orthu agus thionntuigh siad sios ar thaobh na láimhe clí bealach Gleann Léichinn. Chonnaic siad solus agus thárraing siad air. Bhí bóthog deánta sa’ tsliabh agus fear n-a chomhnuidhe ann, dar b’ainm do Leichinn. Bhí mac agus ingean aige, Feardómhain a bhí ar an mac agus Finngheal ar an ingean.Dubhairt Fionn go rabh ocras orthú agus d’fiafruigh siad do an rabh fhios\n(continues on next page)\n", "school_info": "School: Mín na Croise", "metadata": [{"Location:": "Meenacross, Co. Donegal", "Teacher:": "\nMáire C. Ní Choileáin\n"}, {"Informant": "Máire Uí Choileáin", "Gender": "female", "Age": "34", "Occupation": "múinteoir", "Address": "Glencolumbkille, Co. Donegal"}, {"Language": "Irish"}]}, "4428337/4396596/4499701": {"title": "Scéal - Loch Finne", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1049, Page 261", "Page 261"], "url": "https://www.duchas.ie/en/cbes/4428337/4396596/4499701", "text": "\nSgéal : - Loch FinneAmras Ó Caoimhghín- Mín na Sróine                                                   Na Cruacha                                                   An Clochán                                                   LeithbhearrAos 51Tógadh é  5 mhíle ón ait thuas agus fuair sé seo ó na athair nuair a bhí sé 12 d'aois.Bhí seanduine ina chómhnuidhe le na mhac Forghamhain agus le na inghean Finngheal i gcró fód cómhgharach ag Loch Finne, atá istigh i lár shleibhte Thír Chonaill. Bhí na Fianna ag dul thart  'seilg cómhgharach ag an loch lá amháin. Ní raibh sgian na ranna leo agus nuair nach raibh ní thiocfadh leo mórán seilge a dhéanamh. Tháinig an-ocras ortha agus rinne siad amach go mb'fheárr tarraingt ar an chnó go bhfeicfeadh siad an bhfuighidh siad aon rud le h-ithe. Rinne . Dubhairt an seanfhear leo nach raibh rud ar bith aige-san le tabhairt dóibh ach ar seisean \"Tá fhios ag mo mhac áit a bhfuil tarbh allta 7 rachaidh sé libh agus thig libh é a mharbhadh\" Chuaidh Forghamhain leo agus theasbáin an tarbh dóibh ach theip ar na Fianna uilig a mharbhadh. Annsin chuaidh an Forghamhain de léim ar dhruim an tairbh agus ní raibh i bhfad gur mharbh sé é. Reannadh an tarbh ina cheithre cheathramhna\n(continues on next page)\n", "school_info": "School: Na Cruacha", "metadata": [{"Location:": "Croaghgorm or Blue Stack Mountains, Co. Donegal", "Teacher:": "\nMáire C. Ní Chinnéide\n"}, {"Collector": "Máire Ní Chaoimhghín", "Gender": "female", "Address": "Meenasrone South, Co. Donegal"}, {"Informant": "Amras Ó Chaoimhghín", "Relation": "parent", "Gender": "male", "Age": "51", "Address": "Meenasrone South, Co. Donegal"}, {"Language": "Irish"}]}, "4493703/4412707/4528367": {"title": "How Lough Finn Got its Name", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1096, Page 108", "Page 108"], "url": "https://www.duchas.ie/en/cbes/4493703/4412707/4528367", "text": "\nOnce upon a time the Fianna Eireann lived in Connaught. One day when they were out hunting they came to a place called Glen Leighan in Co. Donegal. A man named Leighan ruled this place. He had a daughter named Finngeal and a son named Fear Ghamhain. The Fianna went into their house and as they were hungry they asked for something to eat. When they had finished the meal Leighan told the Fianna that there was a wild bull on Achla mountain and that he wished them to go and kill it. They agreed to go and Fear Ghamhain went with them\n(continues on next page)\n", "school_info": "School: Stranorlar", "metadata": [{"Location:": "Stranorlar, Co. Donegal", "Teacher:": "\nBean Mhic Giolla Chomhghaill\n"}, {"Collector": "Mary Mulrine", "Gender": "female", "Age": "12", "Address": "Stranorlar, Co. Donegal"}, {"Informant": "Brigid Herron", "Gender": "female", "Age": "20", "Occupation": "domestic worker", "Address": "Glenaboghil, Co. Donegal"}, {"Language": "English"}, {"Location": "Lough Finn"}]}, "4428338/4396729/5079664": {"title": "An Feardhomhan Crom", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1049, Page 471", "Page 471"], "url": "https://www.duchas.ie/en/cbes/4428338/4396729/5079664", "text": "\nLá do na laetha agus uair de na h-uaire da rabh na Fianna i n-Éirinn tháinig siad a sheilg go Gleann Fada na Sealg. Tháinig an oidhche ortha ag Loch Finne agus thionntuigh siad síos bealach Ghleann Leichín. Chonnaic siad solas agus tharraing siad air. Bhí teach beag fód annseo agus fear darbh ainm Leichín a mhac Feardhomhán agus a inghean Finngheal ‘na gcomhnuidhe annseo. Chuir siad fáilte mhór roimhe na Fianna acht ní rabh biadh ar bith le tabhairt dobhtha acht dubhairt Leichín go gcuirfeadh sé a mhac leobhtha ag éirghe gréine fhad leis an áit a rabh tarbh fiadhain. Ag bodharanacht an lae d’imthigh na Fianna agus an Feardhomhán ar lorg an tairbh. Tháinig siad fhad le carraic mhór sa deireadh agus d’aithin siad go rabh an tarbh comhgrach nó mhothuigh siad é ag buairfidh. Leig an Feardhomhán fead-ghlaic agus tháinig an tarbh ag rachaidh. Nuair a chonnaic Goll seo chuaidh sé i bhfolach acht ní dheachnidh an Feardhomhán nó bhí sé na shaighdiúr mhaith. Léim sé ar dhroim an tairbh agus leag sé é. Annsin tháinig Goll a chuideadh agus idir an bheirt aca mharbhuigh siad é. D’fheann siad annsin é agus d’iomchar\n(continues on next page)\n", "school_info": "School: An Ghrafaidh (Graffy)", "metadata": [{"Location:": "Graffy, Co. Donegal", "Teacher:": "\nProinnsias Ua Braonáin\n"}, {"Collector": "Róis Éilís Ní Chába", "Gender": "female", "Age": "16"}, {"Informant": "Bríghid Nic Daibhid", "Relation": "grandparent", "Gender": "female", "Address": "Meenamanragh, Co. Donegal"}, {"Language": "Irish"}]}}