{"4427869/4352244/4435991": {"title": "The Successive Principals of the School", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0103, Page 045", "Page 045"], "url": "https://www.duchas.ie/en/cbes/4427869/4352244/4435991", "text": "\n(continued from previous page)\nThe lease for the plot was granted by the parish priest Very Revd, John O'Malley to Stephen Heskin, Ballyrourke, Neale; Patrick Burke, Loughnagankey, Neale, and Patrick O'Connor, Neale Village, for a period of 900 yards.  The lease is dated 25th July 1883 and was forwarded on the 9th March 1888 to Most Reverend John MacEvilly. Archbishop of Tuam. The present trustees use The Archbishop of Tuam, Right Reverend Dean Dalton and Very Reverend Canon Healy P.P. (Kilmaine).\n\n\n\n43 - 46 - 46A.Cure for headache - measuring the head etc.\n\n\n\n47.Shrove - Pancake Night. St. John's Day - Bonfire.St. Martin's Day - Killing of a goose.Three tests for future lifeName-Chriatian name of future husband. (Cont.)\n", "school_info": "School: The Neale (B.)", "metadata": [{"Location:": "Neale, Co. Mayo", "Teacher:": "\nTomás Mac an Bháird\n"}, {"Language": "English"}]}, "4428101/4378204/4443868": {"title": "May Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0638, Page 18", "Page 18"], "url": "https://www.duchas.ie/en/cbes/4428101/4378204/4443868", "text": "\n(continued from previous page)\nunless they twist the churn.Mrs. FlynnFortwilliamGlencairnCo. WaterfordAge 54\n\n\n\nShroveDuring the season of Shrove rich farmers go around making matches for their daughters.Shrove starts after Christmas and the people enjoy making matches for their daughters.\n\n\n\nMichaelmas Day falls on the 29th of September. People kill geese a few days before Michaelmas and eat them. These are called Michaelmas geese.\n", "school_info": "School: Glencairn", "metadata": [{"Location:": "Glencairn, Co. Waterford", "Teacher:": "\nEibhlín Ní Dhuibhir\n"}, {"Informant": "Mrs. Flynn", "Relation": "unknown", "Gender": "female", "Age": "54", "Address": "Fortwilliam, Co. Waterford"}, {"Language": "English"}]}, "4428101/4378240/4443876": {"title": "Shrove", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0638, Page 23", "Page 23"], "url": "https://www.duchas.ie/en/cbes/4428101/4378240/4443876", "text": "\nThe historic period of Shrove ends on Shrove Tuesday, the day before Ash Wednesday. A great feast is held in every house bidding goodbye to all luxuries. The woman of the house is very busy making pancakes for the feast.All the young men and women who did not get settled down during Shrove must go to Sceilg Island to get married. This is an island off Kerry where the time is later than in the rest of Ireland. A list of humurous rhymes are made up by the prime boys of the district about the bachelors and old maids who did not get married during Shrove.Mrs O'NeillGlencarin  S.O.Co WaterfordAge 58\n", "school_info": "School: Glencairn", "metadata": [{"Location:": "Glencairn, Co. Waterford", "Teacher:": "\nEibhlín Ní Dhuibhir\n"}, {"Informant": "Mrs O' Neill", "Gender": "female", "Age": "58", "Address": "Glencairn, Co. Waterford"}, {"Language": "English"}]}, "4428158/4382681/4449032": {"title": "Rhymes - The Wren-Boys' Rhyme", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0653, Page 31", "Page 31"], "url": "https://www.duchas.ie/en/cbes/4428158/4382681/4449032", "text": "\n(continued from previous page)\nA couple of coppers will do you no harm,I know this woman is a very good woman,She'll give me a penny to bury the Wren.Written by: William Conlon (Pupil)Cheekpoint.\n\n\n\n2. Shrove Tuesday.Shrove Tuesday, Shrove Tuesday.Jack went out to plough.His mother made pancakes but didn't know how.She twisted them she turned them,And she made them so black.She put too much pepper in them,And poisoned poor Jack.\n", "school_info": "School: Faithlegg (B.), Portláirge", "metadata": [{"Location:": "Faithlegg, Co. Waterford", "Teacher:": "\nPeter Lyons\n"}, {"Collector": "William Condon", "Address": "Cheekpoint, Co. Waterford"}, {"Language": "English"}]}, "4428214/4386505/4456509": {"title": "Shrove, Lenten and Easter Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0794, Page 247", "Page 247"], "url": "https://www.duchas.ie/en/cbes/4428214/4386505/4456509", "text": "\nShrove Lenten & Easter Customs---Patrick Graham, Lucan, Co. Dublin. son of a Sergeant in the Great War. Born and reared in town of Lucan. His fathers have lived here for many generations.Shrove Tuesday is the eve of Ash Wednesday, the beginning of Lent, a season of prayer and fasting. Pancakes are made on that day. It is a custom of the people to keep the holly from Christmas to make a fire with it to fry the pancakes. First the woman of the house gets a dish and puts some flour in it. Then she gets new milk and bread soda and lard and mixes\n(continues on next page)\n", "school_info": "School: Lucan (B.)", "metadata": [{"Location:": "Lucan, Co. Dublin", "Teacher:": "\nM. Mac Rois\n"}, {"Collector": "Patrick Graham", "Gender": "male", "Address": "Lucan, Co. Dublin"}, {"Language": "English"}]}, "4428214/4386507/4456510": {"title": "Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0794, Page 249", "Page 249"], "url": "https://www.duchas.ie/en/cbes/4428214/4386507/4456510", "text": "\nDesmond Kelly. Lucan, Co. Dublin aged 13yrs. Born and reared in Lucan. and all his father's have lived in Lucan for many years.Shrove Tuesday 29.4.38Every year on Shrove Tuesday people make what are called pancakes. It is an old custom to keep \"Christmas Holly\" to make a fire to cook the Shrove Pancake. It is when the first panful is cooked that the little children some in asking for something to eat, and each gets a pancake. After a while they come in looking for more.Pancakes are made in this way: you get some flour, baking-powder, margarine, lemons, new milk, sugar and eggs. The flour is put into a basin, and mixed with some new milk, then a little sugar is added, the eggs and all mixed together and put into the pan with some\n(continues on next page)\n", "school_info": "School: Lucan (B.)", "metadata": [{"Location:": "Lucan, Co. Dublin", "Teacher:": "\nM. Mac Rois\n"}, {"Collector": "Desmond Kelly", "Gender": "male", "Age": "13", "Address": "Lucan, Co. Dublin"}, {"Language": "English"}]}, "4428214/4386510/4456511": {"title": "Shrove, Lenten and Easter Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0794, Page 251", "Page 251"], "url": "https://www.duchas.ie/en/cbes/4428214/4386510/4456511", "text": "\nEvery year, on the tuesday before Ash Wednesday, pancakes are made.  This is an old Irish custom, Ash Wednesday is the beginning of Lent, and Lent is a time of fast and prayer, and the old words come true, \"The fast before the Feast\".  The fast of Lent lasts until noon on Holy Saturday, and the feast is on Easter Sunday.  The pancakes for Shrove Tuesday are made with flour, eggs, sugar, new milk, margarine, baking powder and the juice of a lemon.  The flour and the baking powder and the margarine are all mixed together in a dish, then the eggs are beaten up, in a dish, and the milk is poured in, then the (dish) bowl is emptied into the dish and all are\n(continues on next page)\n", "school_info": "School: Lucan (B.)", "metadata": [{"Location:": "Lucan, Co. Dublin", "Teacher:": "\nM. Mac Rois\n"}, {"Collector": "Martin Keegan", "Gender": "male", "Age": "14", "Address": "Sarsfield Terrace, Co. Dublin"}, {"Language": "English"}]}, "4428214/4386512/4456512": {"title": "Shrove, Lenten and Easter Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0794, Page 253", "Page 253"], "url": "https://www.duchas.ie/en/cbes/4428214/4386512/4456512", "text": "\nOver in Newcastle they have this old custom at  Shrove Tuesday; they get three pancakes and cover them with treacle.  Then they stick a sixpence in the treacle on one, and then put the pancakes on a string, and two boys hold the string, one at each end.  Then any boy or girl who wants to get the sixpence is blindfolded before he searches for the money and when he gets the pancakes on which the sixpence is he keeps the sixpence.  It is great fun looking at them trying to get the sixpence.\n(continues on next page)\n", "school_info": "School: Lucan (B.)", "metadata": [{"Location:": "Lucan, Co. Dublin", "Teacher:": "\nM. Mac Rois\n"}, {"Collector": "Joseph Greene", "Gender": "male", "Age": "13", "Address": "Ballydowd, Co. Dublin"}, {"Language": "English"}]}, "4428214/4386514/4456513": {"title": "Shrove, Lenten and Easter Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0794, Page 255", "Page 255"], "url": "https://www.duchas.ie/en/cbes/4428214/4386514/4456513", "text": "\nLent is a period of time that comes once a year and lasts for nearly six weeks.  It begins on Ash Wednesday and ends on Holy Saturday.  There is an old custom of eating pancakes on Shrove Tuesday, the day before Lent begins.  The woman of the house gets flour, buttermilk, fat, margarine and lemons.  Then she gets a dish and puts the amount of flour she wants into it, then she mixes the margarine with the flour and puts the buttermilk  along with the margarine and mixes them thoroughly.  When she has these mixed, she gets the fat and melts it in the frying pan, and when it is ready\n(continues on next page)\n", "school_info": "School: Lucan (B.)", "metadata": [{"Location:": "Lucan, Co. Dublin", "Teacher:": "\nM. Mac Rois\n"}, {"Collector": "Francis Stapleton", "Gender": "male", "Age": "13", "Address": "Lucan, Co. Dublin"}, {"Language": "English"}]}, "4428214/4386516/4456514": {"title": "Shrove, Lenten and Easter Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0794, Page 257", "Page 257"], "url": "https://www.duchas.ie/en/cbes/4428214/4386516/4456514", "text": "\nPatrick Graham18 Weir ViewLucan13 years 6 monthsHe got this story from his father whose people have lived in Lucan for many generations and served as sergeant in the Great War.Sarsfield's Castle There is an old legend about a castle in the southern portion of Vesey's Demesne, where Sarsfield lived in the seventeenth century.It is said that, on the third of October every three years, Sarsfield riding on a white horse comes out on the top of the castle and shoots a bullet from a musket into the air in the direction of Limerick.  It is said that whoever finds the bullet and digs three feet under where it was\n(continues on next page)\n", "school_info": "School: Lucan (B.)", "metadata": [{"Location:": "Lucan, Co. Dublin", "Teacher:": "\nM. Mac Rois\n"}, {"Collector": "Patrick Graham", "Gender": "male", "Age": "13", "Address": "Weirview, Co. Dublin"}, {"Language": "English"}]}, "4428071/4375051/4457377": {"title": "Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0151, Page 382", "Page 382"], "url": "https://www.duchas.ie/en/cbes/4428071/4375051/4457377", "text": "\nOn Shrove Tuesday night everybody mkes a pancake and it is therefore called \"Pancake night\". The old men also put aside their pipes and don't touch them again till Lent is over.\n", "school_info": "School: Droichead na Daoile", "metadata": [{"Location:": "Lackalustraun, Co. Mayo", "Teacher:": "\nMáire, Bean Uí Ghallchobhair\n"}, {"Language": "English"}]}, "4428148/4381908/4458241": {"title": "Old Customs Connected with Shrove Tuesday and Ash Wednesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0650, Page 269", "Page 269"], "url": "https://www.duchas.ie/en/cbes/4428148/4381908/4458241", "text": "\nThis old custom is still carried out of making pan-cakes on Shrove Tuesday. Long ago they made cakes which they called cream cakes. They put cream, flour, sugar and salt in these cakes. Then they poured the batter on a griddle and cooked it over a fire of wheaten-straw. These were supposed to taste sweet, even sweeter than the ones that are made nowadays.On Shrove tuesday night they used to eat what they called late supper. This meal consisted of meat, potatoes and cabbage. This was done so that they would be able to bear the black fast on Ash Wednesday better, as they would not use butter, eggs, milk or bread made with milk from that day until Easter.\n", "school_info": "School: Baile Uí Dhuibh, Kilmeaden", "metadata": [{"Location:": "Ballyduff West, Co. Waterford", "Teacher:": "\nCaitlín Madders\n"}, {"Informant": "Mrs de Lacey", "Relation": "unknown", "Gender": "female", "Address": "Kilmeadan, Co. Waterford"}, {"Language": "English"}]}, "4428132/4380803/4460716": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0646, Page 334", "Page 334"], "url": "https://www.duchas.ie/en/cbes/4428132/4380803/4460716", "text": "\nPósann na daoine timceall an ceanntair seo san inid. Na laetheannta atá oireamhnach cun pósadh dar le na daoine iseadh Dia Domhnaigh, Dia Máirt, Diardaoin agus Dia Sathairn agus gach mhí ach Mí na Bealtaine. Déantair cleamhnaistí san ceanntar seo. Tugtar airgead mar spré. Bhíodh na daoine ag pósadh ins na tihthibh timceall nóca naoi bliadhanta ó shoin. Bíodh cóisire ag na daoiniabh a bhíodh ag pósadh.\n", "school_info": "School: Cúl na Sméar, Dúngarbhán", "metadata": [{"Location:": "Coolnasmear Lower, Co. Waterford", "Teacher:": "\nEibhlín, Bean Uí Mhathúna\n"}, {"Collector": "Pádraig Ó Dúnfhúrtaigh", "Gender": "male"}, {"Informant": "Domhnall Ó Dúnfurtaigh", "Relation": "unknown", "Gender": "male", "Age": "63", "Occupation": "feirmeoir"}, {"Language": "Irish"}]}, "4427943/4360018/4462765": {"title": "Local Marriage Customs - Shrove", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0120, Page 80", "Page 80"], "url": "https://www.duchas.ie/en/cbes/4427943/4360018/4462765", "text": "\nShroveFrom the Twelfth Day to Ash Wednesday is called Shrove.  Long ago it was called Seraft.  The word Seraft is supposed to be the old Irish for Shrove.Pancake Night.The night before Ash Wednesday is called Pancake Night.  In every home there is a feast of pancakes at night in preparation for the long fast during Lent.  Meat also forms part of the feast.  In some houses a ring for marriage, a rag for virginity and a stick for the old maid are put in the cakes. My grandparents told me this story.Celine Warde\n\n\n\nThe night before Ash Wednesday is called Pancake Night. In every home there is a feast of pancakes at night in preparation for the long fast during Lent. Meat also forms pat of the feast. In some houses a ring for marriage, a rag for virginity, and a stick for the old main are put in the cakes.\n", "school_info": "School: Loughkeeren", "metadata": [{"Location:": "Knockatemple, Co. Mayo", "Teacher:": "\nAnna M. Warde\n"}, {"Collector": "Celine Warde", "Gender": "female"}, {"Informant": "(name not given)", "Relation": "relative (other than parent or grandparent)", "Gender": "female"}, {"Language": "English"}]}, "4427995/4365715/4468814": {"title": "An Inid", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0132, Page 176", "Page 176"], "url": "https://www.duchas.ie/en/cbes/4427995/4365715/4468814", "text": "\n'Sí an Inid an tráth de'n bhliladhain ó'n lá deiridh de Nodlaig go dtí Céadaoin an luaithridh. Tá an t-am seo leagtha amach le h-aghaidh pósadh agus caitheamh ainsire de gach saghas. Tugtar Máirt na h-Inide ar an lá deiridh de'n Inid. Déanann muintetear na h-áite seo trosgadh ó feóil an lá sin. Bíonn cácaí  friochtáin againn le h-aghaidh an tae. Ní imrigheann na daoine cártaí ná ní bhíonn caitheamh aimsire ar bith aca an oidhche sin. Níor chualaidh na sean-daoine fá caitheamh salainn ar na buachaillí óga agus ar na cailíní óga annseo ariamh fé mar atá i n-áiteacha eileBríghid Ní FhlannghaileRang a VII\n\n\n\nDéantar teine cnámh ag an gcros bhóthar nó i n-aice an tighe. Tagann na cómharsannaí ar fad agus deireann siad an paidrín ag siubhal thart timcheall na teine. Tugann gach duine splannc leis agus caitheann sé isteach sa mbárr fataí no coirce é. Creideann siad go gcuireann sé feabhas ar an mbárr.\n", "school_info": "School: Gleann Cuileann", "metadata": [{"Location:": "Glencullin Lower, Co. Mayo", "Teacher:": "\nMáire Ní Loinn\n"}, {"Collector": "Bríghid Ní Fhlannghaile", "Gender": "female"}, {"Language": "Irish"}]}, "4427982/4363713/4468830": {"title": "An Inid", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0129, Page 233", "Page 233"], "url": "https://www.duchas.ie/en/cbes/4427982/4363713/4468830", "text": "\nBíonn an Inid ann ón 6adh lá d'Eanair go dtí an Cargas. Tugtar oidhche Inide ar an Máirt roimh Céadaoin a' Luaithrigh. Bíonn pus mór ar na cailíní nach bpósann an oidhche sin. Deirtear go mbíonn siad ag briseadh na potaí le feirg.\n\n\n\nSgéal – Ag Tógáil ImeBhí bean ann fado agus bhí sé ba bhainne aice agus níor bfheidir leithe im a fhághail ó na cuid bainne agus an bhliadhain roimhe sin bhíodh an domhan d’im aici.Lá amháin tháinig fear isteac agus d’innis an bhean an sgéal dó. Dubhairt an fear lei an bainne a chur insan gcuinneoig agus annsin dhún an fear féin an doras agus thosuigh siad ag déanamh an maistreadh. Dubhairt sé annsin an chead bhean a thiocfadh go dtí an teach go mbeadh an t-im lei.Taréis tamall thainig bean go dtí an doras agus bhuail sí air acht dubhairt an bhean lei fanacht amuig. Greamuigheadh í ar an talamh le biorain agus diarr sí ar Dia í a leigint isteach. Leig bean a’ tighe isteac í ar deireadh agus chuir siad ag déanamh an maistreadh í. Ní raibh siad ábalta an loinithe a tharraingt as an gcuinneóig leis an méid ime a bhí ann. Is dóice go raibh an t-im lei.\n", "school_info": "School: Droimslaod", "metadata": [{"Location:": "Drumsleed, Co. Mayo", "Teacher:": "\nMaire, Bean Mhic Suibhne\n"}, {"Collector": "Eibhlin Mhic Manamon", "Gender": "female"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "female", "Age": "65"}, {"Language": "Irish"}]}, "4428016/4368436/4471704": {"title": "Festival Customs - Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138, Page 108", "Page 108"], "url": "https://www.duchas.ie/en/cbes/4428016/4368436/4471704", "text": "\nPancakes are made in most homes on this night. The ring is put in the cake and the old superstition that whoever gets it will marry first is attached to the finding of the ring\n\n\n\nCrowds attend morning mass and get the holy ashes. They bring home some of it to those who have not been to mass. There is a pious belief that the ashes should not be rubbed off on any account until the day is over. Some farmers in this district like to sow their oats on this day.\n\n\n\nA great number attend Mass and visit the Blessed Sacrament during the day.\n\n\n\nGood Friday is observed something like a holiday. Very little work is done and almost everyone young and old go to the church and perform the Stations of the Cross\n\n\n\nEaster Sunday there is great rejoicing for the feast. The young children and some of the grown ups to rise very early to see the sun dancing.\n\n\n\nThe people believe that it is not lucky to bathe at Whitsuntide as it is a season of accidents.\n\n\n\nAll crops are supposed to be sown before this date. There is a tradition that no one should touch clay this day. The children erect\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire, Leac an Anfa, Cathair na Mart", "metadata": [{"Location:": "Leckanvy, Co. Mayo", "Teacher:": "\nAn tSr. Treasa\n"}, {"Language": "English"}]}, "4427992/4365178/4475253": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0131, Page 361", "Page 361"], "url": "https://www.duchas.ie/en/cbes/4427992/4365178/4475253", "text": "", "school_info": "School: Ceathrú Thaidhg", "metadata": [{"Location:": "Carrowteige, Co. Mayo", "Teacher:": "\nPádraig Mag Shamhráin\n"}, {"Collector": "Máire C. Ní Maolalaidh", "Gender": "female", "Address": "Curraunboy, Co. Mayo"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "female", "Age": "46", "Address": "Curraunboy, Co. Mayo"}, {"Language": "Irish"}]}, "4428261/4389749/4477286": {"title": "Halloween", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1030, Page 40", "Page 40"], "url": "https://www.duchas.ie/en/cbes/4428261/4389749/4477286", "text": "\n(continued from previous page)\nCan take the piece out of the water with his mouth can keep it.Another game at Hallowe’en is to tie an apple to the roof and let it swing and try to get a bite out of it without touching it.Another one is to put a tub of water on the floor with an apple in it and throw something in it. If the thing they throw sticks in an apple the person gets the apple.\n\n\n\nShrove Tuesday, the day before Ash Wednesday, is usually known as Cock Tuesday in this district. If two people are getting married and do not before then they are supposed to let the cock crow on them. It is the last day for getting married before Lent.It is also known as pancake night and pancakes are made then.\n", "school_info": "School: Cavangarden", "metadata": [{"Location:": "Cavangarden, Co. Donegal", "Teacher:": "\nRebecca C. R. Mitchell\n"}, {"Collector": "May Carberry", "Gender": "female", "Address": "Tullyhorky, Co. Donegal"}, {"Language": "English"}]}, "4428287/4391912/4478657": {"title": "Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1036, Page 129", "Page 129"], "url": "https://www.duchas.ie/en/cbes/4428287/4391912/4478657", "text": "\nAsh Wednesday is the first day of Lent. The day that preceeds [sic] Ash Wednesday is called Shrove Tuesday.About eighty or ninety (years) ago the marriages were celebrated on or before Shrove Tuesday. Many people got married on Shrove Tuesday. On this account the young people kept a sharp watch on the chapel, in case anyone should get married on the quiet.Half a century ago matchmaking was very common in this parish. The would be groom would take his best companion and go off to the nearest public house for a bottle of whiskey.Then the two would set off to the bride's house. Soon his companion tells the occupants of the house their business. He boasts of\n(continues on next page)\n", "school_info": "School: Na Frasa", "metadata": [{"Location:": "Frosses, Co. Donegal", "Teacher:": "\nSeán Mac Robhartaigh\n"}, {"Collector": "Bernadetta Mc Hugh", "Gender": "female", "Age": "16", "Address": "Frosses, Co. Donegal"}, {"Informant": "Mr George Waugh", "Gender": "male", "Age": "75", "Address": "Frosses, Co. Donegal"}, {"Language": "English"}]}, "4498009/4345394/4501018": {"title": "Boxty", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0088, Page 333", "Page 333"], "url": "https://www.duchas.ie/en/cbes/4498009/4345394/4501018", "text": "\n(continued from previous page)\nto bake.  It used to take a half hour to bake.  Then the family would sit down and ate it with butter.  It was the custom to ate it hot.\n\n\n\nPotato cakes are made from boiled potatoes.  They are mixed with flour and salt.  It is put on the pan, and flattened out, and cut into slices.  It takes about twenty minutes to cook, and is eaten piping hot with plenty of butter.\n\n\n\nPan cakes are made on Shrove Tuesday night.  Flour is put into a bowl mixed with eggs, butter, and sugar.  It is put on a warm pan to bake.  The pan must be buttered well so that it will not stick.  When the bottom is done, it is turned.  It is eaten hot.\n", "school_info": "School: Ceathrú an Chalaidh", "metadata": [{"Location:": "Carraholly, Co. Mayo", "Teacher:": "\nBrian Mac Aodhgáin\n"}, {"Collector": "Ena Ní Ceallaigh", "Gender": "female", "Address": "Carrowcally, Co. Mayo"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "female", "Address": "Carrowcally, Co. Mayo"}, {"Language": "English"}]}, "4498309/4383965/4507543": {"title": "Festival Customs - Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0785, Page 23", "Page 23"], "url": "https://www.duchas.ie/en/cbes/4498309/4383965/4507543", "text": "\n(23)Festival Customs  Shrove TuesdaySkerries, Co. DublinOn \"Shrove Tuesday\" or \"Pancake Tuesday\" as the people of Skerries call it pancakes are made instead of the usual meals. The people eat a great lot of them because they have to fast next day. The pancakes are made of buttermilk, eggs, and flour, and the children love to be mixing the makings. George Pratt,Rush Road,Skerries.\n", "school_info": "School: Skerries (St. Patrick's : Boys)", "metadata": [{"Location:": "Skerries, Co. Dublin", "Teacher:": "\nT. Mc Namee\n"}, {"Collector": "George Pratt", "Gender": "male", "Address": "Rush Road, Co. Dublin"}, {"Language": "English"}]}, "4493675/4409815/4520769": {"title": "Festival Customs - Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1087, Page 234", "Page 234"], "url": "https://www.duchas.ie/en/cbes/4493675/4409815/4520769", "text": "\nShrove Tuesday falls six weeks before Easter and there are a few superstitions in connection with it. On that day people always make pancakes and long ago they used to put rings, buttons and thimbles inside them. There was usually a party on that night and whoever got the ring, it was thought that they would be the first of that company to be married. Whoever would get the button would be a bachelor and the person, who would get the thimble, would be an old maid.\n", "school_info": "School: Glentidaly", "metadata": [{"Location:": "Glentidaly, Co. Donegal", "Teacher:": "\nM. M. Heron\n"}, {"Collector": "Margery Malseed", "Gender": "female", "Address": "Clooney, Co. Donegal"}, {"Informant": "Mrs Mc Bride", "Gender": "female", "Address": "Roughan, Co. Donegal"}, {"Language": "English"}]}, "4493771/4418738/4534297": {"title": "Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1114, Page 298", "Page 298"], "url": "https://www.duchas.ie/en/cbes/4493771/4418738/4534297", "text": "\nIn this district this day is called \"Pancake Tuesday\", as the evening meal usually consists of pancakes. In one of the pancakes a ring is put, in another a coin and in another a button and in another a medal. The person who gets the ring will be married before a year is over. The one who gets the money will be very rich. The person who gets the button will never be married and the one who gets the medal will have a religious vocation.\n\n\n\nRUNAWAY  MONDAYThis is the Monday before Shrove Tuesday and it is given this name because secret marriages were arranged and, lest anyone would see them going to the Church the groom went one way and the bride another.  \"Trotting Tuesday\" is also\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire, Carn Domhnaigh", "metadata": [{"Location:": "Ballylosky, Co. Donegal", "Teacher:": "\nAn tSr. M. Beirín Ní Bhaoighill\n"}, {"Language": "English"}]}, "4493779/4419901/4535338": {"title": "Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1117, Page 45", "Page 45"], "url": "https://www.duchas.ie/en/cbes/4493779/4419901/4535338", "text": "\nTuesday the first of March was Shrove Tuesday or Pancake Tuesday and the reason why it is called \"Shrove Tuesday\" I do not know.My mother always bakes lovely pancakes for our tea on \"Pancake Tuesday\" when we go home from school.Shrove Tuesday is the day before Lent and everybody is rushing to get married on \"Shrove Tuesday\" as they are not allowed to get married in Lent. I have heard that there were over twenty marriages on \"Shrove Tuesday\" at Drung Chapel.Lent is the time when our Lord was in the wilderness to be tempt by the Devil, and he fasted for forty days, and forty nights. The following day is \"Ash Wednesday\" when everybody should \"put out their ashes\"Arthur PeoplesCastlecary N.S.\n", "school_info": "School: Castlecary", "metadata": [{"Location:": "Ballyrattan, Co. Donegal", "Teacher:": "\nMary S.J. Donaghy\n"}, {"Collector": "Arthur Peoples", "Gender": "male", "Address": "Castlecary, Co. Donegal"}, {"Language": "English"}]}, "4566073/4564575/4574299": {"title": "New Year's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0028, Page 0313", "Page 0313"], "url": "https://www.duchas.ie/en/cbes/4566073/4564575/4574299", "text": "\n(continued from previous page)\ngather money and they are called mummers. It is a custom that people ring bells to ring out the old year, and to ring in the new year.\n\n\n\nShrove Tuesday is the day before Ash Wednesday and is the last day for getting married before Lent. Shrove Tuesday night is called pan-cake night because on that night pan-cakes are made with a button and ring put into them. Who ever gets the ring will be married before twelve months and who ever gets the button will be an old maid.Ash Wednesday is the\n(continues on next page)\n", "school_info": "School: Cill a' Lachtáin", "metadata": [{"Location:": "Killallaghtan, Co. Galway", "Teacher:": "\nSeosamh Ó hAllmhuráin\n"}, {"Collector": "Johnie Headd", "Gender": "male", "Address": "Killoran, Co. Galway"}, {"Informant": "Mrs Headd", "Relation": "parent", "Gender": "female", "Age": "45", "Address": "Killoran, Co. Galway"}, {"Language": "English"}]}, "4569070/4569004/4586994": {"title": "Shrove Tuesday and Ash Wednesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0042, Page 0418", "Page 0418"], "url": "https://www.duchas.ie/en/cbes/4569070/4569004/4586994", "text": "\nLong ago the people used to have a lot of customs for Shrove Tuesday and Ash Wednesday.Shrove Tuesday night they used to make pan-cakes and for that reason it is called pan-cake night. They used to have meat also on that night because they used to fast from it during the Lent.Ash Wednesday the people used to begin fasting. They used to go to Mass in the morning and put a cross on their foreheads with holy ashes. Others who used not go to Mass used to burn\n(continues on next page)\n", "school_info": "School: Cill a' Ghaimhrín (Killgevrin)", "metadata": [{"Location:": "Kilgevrin, Co. Galway", "Teacher:": "\nProinsíos P. Ó Doláin\n"}, {"Collector": "Mary Mannion", "Gender": "female"}, {"Informant": "Patrick Mannion", "Gender": "male", "Age": "60", "Address": "Tonmoyle, Co. Galway"}, {"Language": "English"}]}, "4583360/4583115/4588208": {"title": "An Inid", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0062, Page 0188", "Page 0188"], "url": "https://www.duchas.ie/en/cbes/4583360/4583115/4588208", "text": "\nSé an t'am is mó de'n bhliain a bpósann na daoine thart annseo san Inid.Chuala mé na sean-daoine ag rádh dhá bpósfhadh tú i dtús na h-Inide go mbeadh ádh airgid ort agus dhá bpósfhadh tú i ndeireadh na h-Inide go mbeadh an t-ádh ar do chlann.Thart ins an áit seo bionn an cleamhnas déanta seachtmhain roimh an bpósadh agus corr dhuine eile a bhíonn cruadhóig pósta orra orra ní bhíonn an cleamhnas déanta acht cúpla lá nuair a phósanns siadDeireann siad nuair a bhíonn's fear ag dul ag iarraidh mn[?] deireann siadDia Luain soirDia Máirt siarDiardaoin sonaidhe soir nó siar,Nuair a bhíonn sé 'na oidhche téigheann beirt nó triúr ag iarraidh na mná agus bíonn buidéal aca nuair a théigheann siad isteach bíonn siad ag cur síos ar eachtraibh an t-saoghail agus nuair a bhíos siad sáthach teann leis an gcailín óg a iarraidh tarrnuigheann duine aca amach an buidéal agus annsin tosuigheann siad ag caint faoi'n gcleamhnas. Iarann siad (siad) spré freisin agus bfhéidir go bfhuigheadh siad sgór nó dhó punt nó mara mbeadh sin ag an gcailín gheobfhadh sí bó bfhéidir nó cúpla budóg nó rud ecínt eile. Acht pe rud a fhághann an cailín óg mar spré socruightear sa gcleamhras é. Bíonn an cleamhnas déanta seachtmhain nó cúpla lá sul a ndeantar an pósadh.\n(continues on next page)\n", "school_info": "School: An Tulach", "metadata": [{"Location:": "Tully, Co. Galway", "Teacher:": "\nTadhg Ó Séaghdha, Máire, Bean Uí Dhuigneáin\n"}, {"Collector": "Áine Ní Fhatharta", "Gender": "female", "Age": "13", "Address": "Ballynahown, Co. Galway"}, {"Language": "Irish"}]}, "4583360/4583117/4588209": {"title": "An Inid", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0062, Page 0190", "Page 0190"], "url": "https://www.duchas.ie/en/cbes/4583360/4583117/4588209", "text": "\n(continued from previous page)\nBíonn bainfheis aca an uair sin bíonn an bhainfheis i dtig an chailín ar dtús agus i dtig an fhir annsin.\n\n\n\nIns an Inid is mó a phósann na daoine a bhíos ag dul a pósa[?] Bíonn an Inid ann ó Nodlag go dtí Céadaoin na Luaithre. Sé an chéad rud a déannan an fear a dteastuigheann an bhean uaidh ná a dhul go dtí cara dhó atá ciallmhar tuigsionach agus deireann leis a dhul go dtí a léithéid seo do mhnaoí ghá h-iarraidh dhó. Geibheann sé buidéal poitín do'n teachtaire agus nuair a tagann an oidhche buaileann mo dhuine isteach i dtigh an chailín óig. Ní bhionn sé i bfhad istigh nuair a innsigheann sé nach ar cuairt agus tarrnuigheann sé aníos an buidéal as a phóca. Tugann sé thart ar muinntir an tíghe é agus tosnuigheann air ag innseacht faoí an méid talamh atá ag an bhfear a bhfuil an bhean ag teastáil uaidh, an méid beithidhigh, caoirigh, agus gach rud dhá bfhuil aige.Má bhíonn fear a'tíghe sásta leis an sgéal sin cuirtear an cheist ar an gcailín óg agus má bhionn sí sin sásta ceaptar amach oidhche an chleamhnais.Tugann an buachaill cuireadh do cheathrar no cúigear a mbíonn gaol aige leób agus déanann muinntir na mná óige an rud céadhna. Bailigheann siad lé chéile i dteach an cleamhnais. Bíonn damhsa agus rí-rá aca annsin go maidin. Téidheann an buachaill óg go dtí an seomra agus socruigheann sé fhéin agus fear a' tighe\n(continues on next page)\n", "school_info": "School: An Tulach", "metadata": [{"Location:": "Tully, Co. Galway", "Teacher:": "\nTadhg Ó Séaghdha, Máire, Bean Uí Dhuigneáin\n"}, {"Collector": "Siobhán Ní Churraidhin", "Gender": "female"}, {"Informant": "Maitiú Ó Curraidhin", "Gender": "male", "Age": "70", "Address": "Keeraunnagark North, Co. Galway"}, {"Language": "Irish"}]}, "4583331/4580247/4591692": {"title": "Festival Customs - St Brigid's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0055, Page 0119", "Page 0119"], "url": "https://www.duchas.ie/en/cbes/4583331/4580247/4591692", "text": "\n(continued from previous page)\nand kept there by means of a scallop.  At the end of the scallop there is a whole potato put.  When the corn and potatoes are being planted the grains are taken from this cross and mixed with the seed and planted.  The potatoe is also taken and planted.It is the custom now to dress up a big doll in white and go about saying\"Here is St. Brigid dressed in whiteGive her something in honour of the night\".\n\n\n\nShrove Tuesday:On the Tuesday before Ash Wednesday it is the custom to make pan-cakes.  In the pan-cakes there is always a ring, a piece of stick and a pea.  Whoever gets the ring will be married first, the piece of stick is for poverty and who-ever gets the pea will travel round the world.  The male members of the family are treated to punch.\n", "school_info": "School: Baile Mór Síl Anmchadha (Laurencetown)", "metadata": [{"Location:": "Laurencetown, Co. Galway", "Teacher:": "\nSeán Ó Cogaidhín\n"}, {"Language": "English"}]}, "4602669/4594061/4614920": {"title": "Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0001, Page 432", "Page 432"], "url": "https://www.duchas.ie/en/cbes/4602669/4594061/4614920", "text": "\nPan-cakes are made that night.  Chalk-Sunday- (l) Bachelors are chalked on chalk-Sunday.May Day- Crops are supposed to be brought on a May morning.\n\n\n\nFowl are killed for St Martin and the blood is sprinkled in the four corners of the house.  St John's Day.  Bon-fires are lighted at every cross-roads.Halloween- People dive for apples and play games on Halloween.During the three big festivals of Christmas Candles are lighted on the windows.Twelve candles or \"Dips\" are lighted.\n(continues on next page)\n", "school_info": "School: Breac-chluain", "metadata": [{"Location:": "Brackloon, Co. Galway", "Teacher:": "\nLiam Ó Seachnasaigh\n"}, {"Collector": "Mary Hurley", "Gender": "female"}, {"Language": "English"}]}, "4602740/4599987/4632823": {"title": "Shrove", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0195, Page 060", "Page 060"], "url": "https://www.duchas.ie/en/cbes/4602740/4599987/4632823", "text": "\nThe week before Lent is called Shrove week.  There are different names for some of the days in Shrove week.  Thursday is called clipping Thursday.  This name was given to it because on that day the people get their hair and nails cut, because it is said that if they cut them in Lent they will have no luck for the season of Lent.  Some people do this in honour of the suffering of Our Lord.  Monday is called galloping Monday because so many people get married on that day, and long ago the people used to gallop home on horses from the Church.  Tuesday is called pancake Tuesday, because on that day the people make pancakes.  When they are turning them they throw them up in the air and if they\n(continues on next page)\n", "school_info": "School: Coillte Clochair (C.)", "metadata": [{"Location:": "Kiltyclogher, Co. Leitrim", "Teacher:": "\nSorcha Ní Mhuireagáin\n"}, {"Collector": "Mary B Leonard", "Gender": "female", "Address": "Agho"}, {"Informant": "Mr Patrick Leonard", "Gender": "male", "Age": "67", "Address": "Agho"}, {"Language": "English"}]}, "4649689/4647458/4651061": {"title": "Festival Customs and Beliefs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0211, Page 024", "Page 024"], "url": "https://www.duchas.ie/en/cbes/4649689/4647458/4651061", "text": "\n(continued from previous page)\ndung and place it on a chair. Twelve rush candles are placed standing in cow dung and lit, in honour of the twelve apostles. Each member of the family puts his or her name on one of the candles. The rosary is recited around the chair and lighted candles. What ever candle quenches first the person it was named after will die first. The cow dung is put in the couples of the house, and left there. It cues a swelling if boiled into a cake.On Saint Brigid's day a cross is made in her honour. This cross is made of straw. It is hung inside over the kitchen door that day, and that evening it is buried in the meadow and left there. It is believed that the house will have luck during the year.\n\n\n\n24On Shrove Tuesday it was customary not to drink milk in (their) tea, or eat eat bread made with milk.  Instead pancakes wet with water were made and eaten and the tea was drunk black.\n(continues on next page)\n", "school_info": "School: Ceis Carraigín", "metadata": [{"Location:": "Keshcarrigan, Co. Leitrim", "Teacher:": "\nTomás Mag Fhionnáin\n"}, {"Collector": "Bridgie Doran", "Gender": "female"}, {"Language": "English"}]}, "4666574/4663258/4667629": {"title": "Chalk Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0401, Page 054", "Page 054"], "url": "https://www.duchas.ie/en/cbes/4666574/4663258/4667629", "text": "\nChalk SundayChalk Sunday is an old and a varied custom which is caried out in every district.  It falls on the first day in Lent.  Any person who is not married or who could be married is chalked on the back by the youngsters around the district.\n\n\n\nPancake NightPancake Night falls on the last day in October.  On this night pancakes are made on a ring, a piece of cloth and a threepenny bit are mixed up in the pancake.  When it is baked it is cut in slices and the people who are inside take their choice (in - deleted) the slices.  Who ever gets the ring is supposed to be married the first, and who ever gets the cloth is supposed to be poor for the rest of his life, and the person who gets the threepenny bit is supposed to be rich for the rest of his life.\n", "school_info": "School: Baile an Bhunánaigh (B.)", "metadata": [{"Location:": "Ballybunnion, Co. Kerry", "Teacher:": "\nP. Ó Hailin\n"}, {"Collector": "Micael Purcell", "Gender": "male", "Address": "Ahafona, Co. Kerry"}, {"Language": "English"}]}, "4672087/4669060/4672289": {"title": "Folklore", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0164, Page 028A", "Page 028A"], "url": "https://www.duchas.ie/en/cbes/4672087/4669060/4672289", "text": "\nFolkloreSeraft is the name applied to the time between the end of Christmas and the beginning of Lent.  Some people think it got its name from the angels.In old times it was considered a very important time in Ireland.  When the celebrations and joys of Christmas were over people looked forward to the seraft.  It comes before the Spring season.  During that time general preparations were made for the work of the coming year.  Houses had to be mended and various operations had to be done.  One of these preparations made was a preparation for marriage.If a man was a bachelor his first task was to try and get a wife.  The first thing he\n(continues on next page)\n", "school_info": "School: Enniscrone (B.)", "metadata": [{"Location:": "Inishcrone, Co. Sligo", "Teacher:": "\nH. Faughman\n"}, {"Collector": "John Hallinan", "Gender": "male", "Address": "Knockagower, Co. Sligo"}, {"Language": "English"}]}, "4605949/4605150/4673103": {"title": "Festival Customs -  Shrove", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0207, Page 073", "Page 073"], "url": "https://www.duchas.ie/en/cbes/4605949/4605150/4673103", "text": "\nShrove which is the time proceeding Lent is called in this district \"Seraft\". In Shrove marriages most frequently take place because in Lent the marriages are disallowed by the Church.The Sunday before Ash Wednesday is commonly called \"Puss Sunday\". All girls who did not get married are supposed to have a puss but in a leap year the Sunday becomes puss Sunday for the men.On Shrove Tuesday which is called pancake Tuesday in this district there are many pancakes made which are eaten at the supper that night.\n", "school_info": "School: Drumshanbo (C.)", "metadata": [{"Location:": "Drumshanbo, Co. Leitrim", "Teacher:": "\nMargaret Flynn\n"}, {"Language": "English"}]}, "4687714/4686475/4689737": {"title": "Féilí na Bliana - Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0434, Page 155", "Page 155"], "url": "https://www.duchas.ie/en/cbes/4687714/4686475/4689737", "text": "\nOn Shrove Tuesday night the boys go around with ropes to bring the unmarried women to Skelligs to dip them in the water: this is done to make them  hurry on in getting married.Long ago people used to make up a piece of poetry about them called a \"Skelligs' List\".The people of this district also make pancakes on Shrove Tuesday night. They have them for their tea with the juice of lemon and\n(continues on next page)\n", "school_info": "School: Killorglin (C.)", "metadata": [{"Location:": "Killorglin, Co. Kerry", "Teacher:": "\nÚna Nic Coluin\n"}, {"Collector": "Siobhán Ní Ríordáin", "Gender": "female", "Address": "Killorglin, Co. Kerry"}, {"Language": "English"}]}, "4687722/4687414/4690088": {"title": "An Inid", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0437, Page 048", "Page 048"], "url": "https://www.duchas.ie/en/cbes/4687722/4687414/4690088", "text": "\nPósann formhór na daoine ins an Inid agus cuid eile i ndiaidh Dhomnach Cásga.Sé Mairt na hInide an lá deirneach agus pósann cuid mhaith des na daoine. Nuair a bhiodh an buachaill ag déanamh an cleamhnas cuireann sé dá sheandana go tig an cailín agus bíonn dhá bhata agus buidéal whiskey aca.Muiris O Gríbhthín, Glaise VII Rang.ó PheigBean Mhichíl Uí Mhorónaigh, Glaise, 75 bl.\n\n\n\nAn Goban Saor agus a Mhac.Chualas m'athair ag rádh go raibh gobán saor ana cliste ann fadó.Ní raibh aige acht an aon mac amháin agus bhí sé 'na amadán.De bhrígh sin ba mhaith leis an Gobán Saor bean ciallmhar a bheith aige.Lá amháin tuga athar croiceann caorach dá mhac agus dúbairt sé leis é do dhíol ar an margadh agus an croiceann agus a luach do thabairt abhaile chuige.Nuair a scrois an buachaill an margadh cuaidh sé isteach i siopa.D'fhiafraig fear an tsiopa de an mór a bhí ar an gcroiceann.Dúbhairt an bhuachaill go raibh an croiceann agus a luach uaidh.Do thosnuig fear an tsiopa ag gáiridhe fé agus dúbhairt sé leis go raibh se 'na amadán. Fé dheire do chuaidh sé isteac i siopa ina raibh cailín óg d'iarr sé uirthí an croiceann agus a luach a thabairt dó.Bhí fios aici go maith cad a bhí uaidh.Fuair sí siosúr agus do ghearr sí an ola\n(continues on next page)\n", "school_info": "School: Cromán (B.)", "metadata": [{"Location:": "Cromane, Co. Kerry", "Teacher:": "\nStiophán Ó Cobhthaigh\n"}, {"Collector": "Muiris O Gríbhthín", "Gender": "male", "Address": "Cromane Upper, Co. Kerry"}, {"Informant": "Peig Bean Mhichíl Uí Mhorónaigh", "Gender": "female", "Age": "75", "Address": "Cromane Upper, Co. Kerry"}, {"Language": "Irish"}]}, "4687719/4687007/4708675": {"title": "Féilte na Bliana - Lá Fhéile Pádraig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0435, Page 384", "Page 384"], "url": "https://www.duchas.ie/en/cbes/4687719/4687007/4708675", "text": "\nAspol mór na h-Éireann do b'eadh Pádraigh. Onóirimíd é ar an 17adh lá de Márta. Chaitheadh muintir na h-Éireann an t-seamrógín ar an lá seo mar is léi a mhúin sé an creideamh ceart do mhuintir na h-Éireann.Téigheadh na cumman mór thímpeall na sráide ag mársáil fadó agus bíodh úirlis éigin cun ceóil a sheint ag gach duine díobh. Téigheadh duine rómpa a n-áirde ar capall agus bíodh an capall sin gléasta suas go deas le ribíní agus géaga glasa.\n\n\n\nTosnuigheadh Inid lá Nodhlag Beag agus críocnuigheadh sé ar lá roimh Céadaoin an Luaithridh sin Mart na h-Inide. Pósadh na daoine i rith na haimsire sin. Téigheadh na daoine go h-áit i bparóiste na Tuaithe ar a glaodhtar \"An Patrún\" agus dhéanadh siad na chleamhnaistí ansan. Dá gcífheadh fear ó'n áit seo bean ó áit eile oireamhnac i gcóir pósadh ní thagadh siad abhaile gan\n(continues on next page)\n", "school_info": "School: Dubhghlas (C.)", "metadata": [{"Location:": "Douglas, Co. Kerry", "Teacher:": "\nEibhlín, Bean de Róiste\n"}, {"Collector": "Síle Máire Ní Dhuígín", "Gender": "female", "Address": "Killorglin, Co. Kerry"}, {"Informant": "Seán P. Ó Dhuigín", "Gender": "male", "Age": "86", "Address": "Killorglin, Co. Kerry"}, {"Language": "Irish"}]}, "4687719/4687008/4708678": {"title": "Féilte na Bliana - Inid", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0435, Page 385", "Page 385"], "url": "https://www.duchas.ie/en/cbes/4687719/4687008/4708678", "text": "\n(continued from previous page)\niad bheith pósta le na chéile. Nuair ná bhíodh airgead ag daoine cun an spré do thabhairt do cailín is amhlaidh a tabharfhaidís beithidhigh do'n fear chéile. Bíodh cóisire mór aca nuair bhídís ag dul cun pósadh.\n\n\n\nBí Máirt na h-Inide an lá deirneach d'Inid, lá mór spóirt iseadh an lá seo. Bailigheann buacaillí óga na h-áite isteac sa bhaile nó sa chathair an tráthnóna agus gach buachaill agus cailín oireamhnach nár pósadh ar feadh na h-Inide do casaidís téada mór thímpeall ortha agus tiománaidís go dtí Sgeilg iad. Déanfaidís pancóga an oidhche san, sin sean nós agus bíodh an spórt aca á chaitheamh suas féacaint cioca a bheadh oireamhnach i gcóir pósadh nó cioca ná bheadh.\n\n\n\nSan allód bíodh na daoine níos críostamhla na mar atáid anois. Sa tráth san bíodh\n(continues on next page)\n", "school_info": "School: Dubhghlas (C.)", "metadata": [{"Location:": "Douglas, Co. Kerry", "Teacher:": "\nEibhlín, Bean de Róiste\n"}, {"Collector": "Síle Máire Ní Dhuígín", "Gender": "female", "Address": "Killorglin, Co. Kerry"}, {"Informant": "Seán P. Ó Dhuigín", "Gender": "male", "Age": "86", "Address": "Killorglin, Co. Kerry"}, {"Language": "Irish"}]}, "4687719/4687012/4708695": {"title": "Féilte na Bliana - An Inid", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0435, Page 389", "Page 389"], "url": "https://www.duchas.ie/en/cbes/4687719/4687012/4708695", "text": "\nIs sa t-am seo de'n bhlian a dheinidís na cleamhnaistí go léir. Má bíodh buachaill nú cailín in aois pósta in aon tigh bíodh na tuismigtheóra ag féichint amach cun cailín nú buachaill oireamhnach d'fhághailt dóibh. Is i dtig tábháirne a dheinidís na cleamhnaistí agus bíodh siad ag ithe agus ag ól. Nuair a bhíodh an cleamhnas déanta aca dhíolaidís an spré. Tugaidís beithidhig mar spré do'n lánamhain fadó mar is flúirsighe a bhíodh siad aca ná airgead.\n\n\n\nFadó ní bíodh cead ag na daoine uibhe d'ithe ná bainne do cur ins an tae ar feadh Carrghase. Bíodh na dlighthe i bhfad níos déine ná mar átáid anois. Aimsear trosgaidh a bheadh Carrghais i gcomhnaí. Fadó choimeádidís na dlighthe a dhein an eaglais go beacht ansan bíodh eagla an domhain ortha na dlighthe do bhriseadh.\n(continues on next page)\n", "school_info": "School: Dubhghlas (C.)", "metadata": [{"Location:": "Douglas, Co. Kerry", "Teacher:": "\nEibhlín, Bean de Róiste\n"}, {"Collector": "Cáit Ní hEachthegeirn", "Gender": "female", "Address": "Tullig More, Co. Kerry"}, {"Informant": "Mícheál de hÓr", "Gender": "male", "Age": "73", "Address": "Tullig More, Co. Kerry"}, {"Language": "Irish"}]}, "4687719/4687022/4708731": {"title": "Féilte na Bliana - Aoine an Chéasta", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0435, Page 399", "Page 399"], "url": "https://www.duchas.ie/en/cbes/4687719/4687022/4708731", "text": "\n(continued from previous page)\nGobnait Ní Chonncubhair,Rín,Cill-Orglan,Ciarraidhe\n\n\n\nAinm an duine a bhfuaras an t-eolas uaidh:-Sean D. Ó h-Airtnéid  (44)Leath Fhearranm,Cill - Orglanm,CíarraidheDo théigheadh na daoine a bhíodh fásta suas go dtí an baile mór an lá san fadó chun spórt agus caitheamh aimsire a bheith aca féin. Sé Máirt na h-Inide an lá deireannach chun pósadh do dhéanamh go dtí go mbíodh an Carragas i leath taoibh.Geibheadh buachaillí óga téada láidire fada agus ceangalidís na cailíní tímcheall ficidh sa sé no triocadh bliadhna ionnta. Deireadh siad ba ceart iad do thógaint go Sgeilig Mhicíl ós rud é nár phósadh siad ar\n(continues on next page)\n", "school_info": "School: Dubhghlas (C.)", "metadata": [{"Location:": "Douglas, Co. Kerry", "Teacher:": "\nEibhlín, Bean de Róiste\n"}, {"Collector": "Bríd Ní hAirtnéid", "Gender": "female", "Address": "Laharan, Co. Kerry"}, {"Informant": "Sean D. Ó hAirtnéid", "Gender": "male", "Age": "44", "Address": "Laharan, Co. Kerry"}, {"Language": "Irish"}]}, "4687719/4687080/4708894": {"title": "Féilte na Bliana - Laethanta na Bó Riabhaí", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0435, Page 457", "Page 457"], "url": "https://www.duchas.ie/en/cbes/4687719/4687080/4708894", "text": "\n(continued from previous page)\nannsan. Aon tig in a mbíodh sean-duine tugann siad aire mhaith do's na h-ainmidhe Laethanta na Riabhaice. Choimeáidís istig iad agus tugaidís biadh mhaith dhoibh. Bíodh eagla mór ar na sean-daoine go dtuitfeadh siad i bpoll-bportaig no in aon áit eile. Máirín Ní CorcardhaGurránCill-Orglan\n\n\n\nFadó do bhíodh taoide mór ann an oidhche Máirt na h-Inide agus do glaodach na sean-daoine ainm ar an dtaoide sin seo é an\n(continues on next page)\n", "school_info": "School: Dubhghlas (C.)", "metadata": [{"Location:": "Douglas, Co. Kerry", "Teacher:": "\nEibhlín, Bean de Róiste\n"}, {"Collector": "Máirín Ní Corcarda", "Gender": "female", "Address": "Garrane West, Co. Kerry"}, {"Informant": "Padraig Ó Coistealbha", "Gender": "male", "Age": "60", "Address": "Garrane West, Co. Kerry"}, {"Language": "Irish"}]}, "4706349/4704976/4713926": {"title": "Lore Connected with Certain Days and Feasts - St Bridget's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0445, Page 339", "Page 339"], "url": "https://www.duchas.ie/en/cbes/4706349/4704976/4713926", "text": "\nSt Bridget's NightThis is also called Biddy's Night.On the night before St Bridget's day young men dress up in the queerest clothes they can get, and put masks on their faces. One of them carries a melodeon, and another a rag-doll which is called a \"Biddy.\" They go around from house to house collecting money. With the money they buy a foot-ball or pay the expenses of a dance.\n\n\n\nShrove Tuesday night is called \"pan-cake night.\" as it is the custom to have pan-cakes for the supper.Marriagable people who do not get married during Shrove as said to go to Sceligs in that night. A poem called a Sceligs list is made about them.\n", "school_info": "School: Kilsarcon (B.), Fearann Fuar", "metadata": [{"Location:": "Kilsarkan West, Co. Kerry", "Teacher:": "\nSs. Ó Murchadha\n"}, {"Collector": "John O' Connor", "Gender": "male", "Address": "Dromultan, Co. Kerry"}, {"Language": "English"}]}, "4701700/4693778/4721655": {"title": "Festival Customs - Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0169, Page 230", "Page 230"], "url": "https://www.duchas.ie/en/cbes/4701700/4693778/4721655", "text": "\nShrove Tuesday, or another name for it is pan-cake night. The why it is called that. Long ago Lent was a forbidden time of marriage and anyone that was to get married got married before Lent and anyone, that didn't get married used to spend the whole day talking of all used to get married, and then it was too late to make bread, for the supper, and they had to do with pancakes.\n", "school_info": "School: Páirc Árd (High Park)", "metadata": [{"Location:": "Carrowgilhooly, Co. Sligo", "Teacher:": "\nEoghan Ó Conaill\n"}, {"Collector": "Francies Mc Gowan", "Address": "Skreen, Co. Sligo"}, {"Informant": "Mrs Mc Gowan", "Gender": "female", "Age": "52", "Address": "Skreen, Co. Sligo"}, {"Language": "English"}]}, "4701749/4698669/4724860": {"title": "Pancake Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0183, Page 393", "Page 393"], "url": "https://www.duchas.ie/en/cbes/4701749/4698669/4724860", "text": "\nPancake Tuesday owes its origin to the fact that in the early ages of the Church people took pancakes to the Church and ate them while they were waiting to be shrived. Since that time people continue the custom of making pancakes on Shrove Tuesday or the Tuesday before Ash Wednesday. Children have a rhyme which they sing on that day. 'Pancake Tuesday is a very happy day,If you don't give us holiday,We'll all run away'People put primroses on the doorsteps on the eve of May day to let the good fairies play on them, or to keep the bad fairies out.\n", "school_info": "School: Knockminna", "metadata": [{"Location:": "Knockmoynagh, Co. Sligo", "Teacher:": "\nMáire Ní Scannláin\n"}, {"Language": "English"}]}, "4713243/4710931/4726733": {"title": "Shrove and Skelligs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0454, Page 019", "Page 019"], "url": "https://www.duchas.ie/en/cbes/4713243/4710931/4726733", "text": "\nThe majority of the young people get married in Shrove. The Easter feast went faster out at skelligs than it did in other Kerry.If a person was late to marry here and if he went to the skelligs he was early to enough to marry. They went to mass at Skelligs and they were chalked on the back. This Sunday is called chalk Sunday.When those who did not marry came home there was a song made about them, and this song was called a \"Skellig's List. This song often caused trouble, and this is why they say, Had you a rough time at Skelligs.\n\n\n\nThe old people made a great many things them-selves.They made castle-tops by cutting off the top of a spade-tree. Then they made the top of it round and the pointed it at the end. They got a nail and they drive it in the middle of the top. This nail is called a spear. Then a cord was wound around the the top, and there was a button put on one end of the cord to\n(continues on next page)\n", "school_info": "School: Anabla", "metadata": [{"Location:": "Anablaha, Co. Kerry", "Teacher:": "\nSeán Ó Súilleabháin\n"}, {"Collector": "Pat Kerrisk", "Gender": "male", "Address": "Inchicorrigane West, Co. Kerry"}, {"Language": "English"}]}, "4701770/4701320/4727221": {"title": "Christmas Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0188, Page 087", "Page 087"], "url": "https://www.duchas.ie/en/cbes/4701770/4701320/4727221", "text": "\n(continued from previous page)\nSmaller groups have harmonicas or fifes or tin whistles. Some of them have a good step dancer with them and then they collect money. Gradually this custom is dying out - one or two groups now only visiting where formerly there used to be as many as ten or twelve.\n\n\n\nShamrock badges and green ribbons are worn - the men wear the Shamrock in their hats.\n\n\n\nPancakes are made and eaten in almost every house in the district.\n\n\n\nUntil quite recently old people used to go from house to house begging eggs - These poor travelling people were well known to people of fifty years ago. Some names of those  which I have heard my father ( RIP ) mention were Kitty the Maid, Mary High Bog, Soft Ann, John Sampey. These travelled great distances and brought the news from one place to another.\n", "school_info": "School: St. Michael's Clooncunny", "metadata": [{"Location:": "Clooncunny, Co. Sligo", "Teacher:": "\nÚna, Bean Uí Stondúin\n"}, {"Language": "English"}]}, "4713242/4710823/4728443": {"title": "Shrove", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0453, Page 320", "Page 320"], "url": "https://www.duchas.ie/en/cbes/4713242/4710823/4728443", "text": "\nIt is during shrove most of the people get married in this locality. It starts on the sixth of January and ends up on the Tuesday before Ash Wednesday.If a boy or girl wants to get married first the boy sends an account to the girl that he is going to marry. It is a man that is sent with an account of the match for it is counted bad look to send a woman. If both parties agree they appoint a day to go to KillarneyWhen they meet in Killarney that day they go into a public-house and they talks matter over. They also settle the number of cattle, and horses that are to go with the farm.\n(continues on next page)\n", "school_info": "School: Clais na nGearrán", "metadata": [{"Location:": "Clashnagarrane, Co. Kerry", "Teacher:": "\nTadhg Ó Conchubhair\n"}, {"Language": "English"}]}, "4723815/4716006/4760348": {"title": "May Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0934, Page 330", "Page 330"], "url": "https://www.duchas.ie/en/cbes/4723815/4716006/4760348", "text": "\n(continued from previous page)\nthe following year.Anyone wanting to take the butter from other people's cows would have to get up early on May morning and go fasting to whatever cows they wanted to take the butter from. It would then be necessary to take a little milk from each teat of every cow into the mouth. If the person spoke or if any person spoke to him before completing the work the charm  would be spoiled.\n\n\n\nAlso known as Pancake Tuesday was a day when a feast was held as it was the day before Lent. Pancakes were made for the supper on the night before  Lent and a feast of bacon and eggs was prepared.This was true in the Irish speaking days as one expression used by a prospective groom was \"beidh bean agam Oidhche Inide ag róstadh bagúin damh\".A great number of weddings used to be celebrated about Shrove Tuesday. The market before it was called Sweeping Thursday (in Carrickmacross) and the Irish Speakers called the market after it:-\"Margadh na Ragaidí\"  (the market of the Refuse)\n", "school_info": "School: Cor Críochach", "metadata": [{"Location:": "Corcreeghagh, Co. Monaghan", "Teacher:": "\nSs. Ó Muireadhaigh\n"}, {"Language": "mixed"}]}, "4758455/4745464/4779167": {"title": "Shrove Tide", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0231, Page 237", "Page 237"], "url": "https://www.duchas.ie/en/cbes/4758455/4745464/4779167", "text": "\n237Shrove tideMarriage customsShrove is the name given to the time of the year when most people get married. It begins on the sixth day of January and ends on the day before Ash Wednesday which is called Shrove Tuesday or Pan cake Tuesday as it is an old custom to have pan cakes for tea on that day before the fast of Lent begins.Monday and Wednesday are counted the luckiest days of the week to get married and strange to say some regard them as unlucky. In America and (another) other countries people always get married on Sunday.Long ago the priest used to go to the houses and marry the pair in the house of the Bride but now the ceremony is performed in the church. Matchmaking is carried on in this district nowadays but (now) some time ago there used to be a man in every district whose duty it was to bring couples together and in this way he made his living. It has happened occasionally that the bride and groom never met till the morning of their\n(continues on next page)\n", "school_info": "School: Drom Bhaoghalláin", "metadata": [{"Location:": "Ardcarn, Co. Roscommon", "Teacher:": "\nM. Pagnam\n"}, {"Collector": "Maggie O' Brien", "Gender": "female"}, {"Language": "English"}]}, "4706346/4704676/4779972": {"title": "Festival Customs - Chalk Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0444, Page 453", "Page 453"], "url": "https://www.duchas.ie/en/cbes/4706346/4704676/4779972", "text": "\n(continued from previous page)\nis the last Sunday of Shrove, and that  on that day the men used have chalks and chalked everybody that was the age to get married but did not.\n\n\n\nMrs E. Reidy of Maglass, aged 70, said she never heard of Chalk Sunday, but of something similar called \" Punching Day \". If a father did not get his daughters or sons ( who were well marriageable ) married during Shrove he was attacked and punched with sticks by people who dressed up as wren boys. When they entered the house they said \" Why did you not get your son ( or daughter )  married this year ?  \". Then they commenced punching or prodding him with the sticks and often \"made him sore\". She told me that she heard of 2 marriageable daughters who dressed up one night in mens' clothes and attacked their own father for not making any effort to get them married. She said that when they went to confession afterwards they were refused absolution until they did penance.This \" Punching Day \" was generally held on Shrove Tuesday night as far as she knows.Shrove Tuesday falls on the night before Ash Wednesday. Pancakes are made and eaten - as a farewell feast to Shrove.Easter Sunday is the first Sunday after Lent. In the old times, no eggs were eaten during Lent therefore there were many eggs spared for Easter Sunday. Tea was taken black on \"Black Fast Days\". Pots of eggs\n\n\n\nShrove Tuesday falls on the night before Ash Wednesday. Pancakes are made and eaten as  a farewell feast to Shrove.\n\n\n\nEaster Sunday is the first Sunday after Lent. In the old times no eggs were eaten during Lent therefore there were many eggs spared for Easter Sunday. Tea was taken black on \" Black Fast Days \". Pots of eggs\n(continues on next page)\n", "school_info": "School: O'Brennan, Baile Mhic Ealgóid, Tráighlí", "metadata": [{"Location:": "Tonreagh Lower, Co. Kerry", "Teacher:": "\nPádraig Ó Loingsigh\n"}, {"Language": "English"}]}, "4742169/4741805/4815814": {"title": "Festival Customs - Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0775, Page 283", "Page 283"], "url": "https://www.duchas.ie/en/cbes/4742169/4741805/4815814", "text": "\nFestival CustomsShrove TuesdayShrove Tuesday is seven weeks before Easter. There is always a feast in every house. People eat pan-cakes and other nice things on Shrove Tuesday. Ash Wednesday comes after Shrove Tuesday. Boys go and play games out in the fields or by the roadside. The boys put cord along the road to tangel the girls up in it.Vera Spooner.If a child or a foal is born on Whit Sunday or Monday it should be put in the ground and two sticks put cross ways + over it or it will either be killed itself or kill someone.\n", "school_info": "School: Kilmeague, Naas", "metadata": [{"Location:": "Kilmeage, Co. Kildare", "Teacher:": "\nBean Mhic Thomáis\n"}, {"Collector": "Vera Spooner", "Gender": "female"}, {"Language": "English"}]}, "4742073/4732793/4822307": {"title": "Stampy", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0460, Page 538", "Page 538"], "url": "https://www.duchas.ie/en/cbes/4742073/4732793/4822307", "text": "\n(continued from previous page)\namount for a cake - it was wet with sour cream and kneaded into a dough in the usual way. It was flattened out in the shape of a cake, cut in quarters and baked in a griddle. When baked it was eaten while hot with butter on it. New milk was served with it.\n\n\n\nThe juice extracted from the potato pulp was kept and used as starch.\n\n\n\nPancakes were made on Shrove Tuesday night to celebrate the finish of the Shrove.\n\n\n\nThe fat of cows and goats - the latter fat better for tallow - was melted and poured into the candle moulds while hot. The moulds were made of pewter or tin and were of different sizes. Three cotton threads were used for making the wick. These were attached to a nail which was\n(continues on next page)\n", "school_info": "School: Baile an Oileáin (B.)", "metadata": [{"Location:": "Ballinillane, Co. Kerry", "Teacher:": "\nEoghan Ua Muircheartaigh\n"}, {"Collector": "Hanna Teahan", "Gender": "female", "Occupation": "teacher"}, {"Informant": "Mrs Teahan", "Gender": "female", "Age": "67", "Address": "Fieries, Co. Kerry"}, {"Language": "English"}]}, "4798725/4793661/4926829": {"title": "Shrove", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0259, Page 039", "Page 039"], "url": "https://www.duchas.ie/en/cbes/4798725/4793661/4926829", "text": "\nShrove begins on the seventh of January and it ends on the Tuesday before Ash Wednesday. During that time a number of marriages take place. The night before Ash Wednesday is called Shrove night. On that night pan cakes are made and there is great feasting in every house on account of the next day being a fast day.\n(continues on next page)\n", "school_info": "School: Cúl Seachtaine", "metadata": [{"Location:": "Coolshaghtena, Co. Roscommon", "Teacher:": "\nCaitlín Nic Dhonnchadha\n"}, {"Collector": "Dick Fallon", "Gender": "male", "Address": "Moneen, Co. Roscommon"}, {"Informant": "Mrs Fallon", "Gender": "female", "Age": "38", "Address": "Moneen, Co. Roscommon"}, {"Language": "English"}]}, "4798660/4787954/4926992": {"title": "Games", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0234, Page 368", "Page 368"], "url": "https://www.duchas.ie/en/cbes/4798660/4787954/4926992", "text": "\n(continued from previous page)\nhis duck on the granny and each one on his turn had to peg at it to see who could knock it off, and when you knocked it off you ran as quickly as you could and Tig any one of them before they would get away.  The one caught had to put his \"duck\" on the granny and the game began again.\n\n\n\nShrove-tide is being looked forward to because  on Shrove Tuesday it is custom to have pan-cakes for the tea.  On that day people have great feasts because it is the last day before Lent which is the time for fast and penance.Shrove Tuesday\n(continues on next page)\n", "school_info": "School: Tighmhanach", "metadata": [{"Location:": "Tivannagh, Co. Roscommon", "Teacher:": "\nMrs E. Jordan\n"}, {"Collector": "James Brennan", "Address": "Cashel, Co. Roscommon"}, {"Informant": "Mrs Brennan", "Relation": "parent", "Gender": "female", "Address": "Cashel, Co. Roscommon"}, {"Language": "English"}]}, "4811586/4799381/4931307": {"title": "Shrovetide", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0265, Page 078", "Page 078"], "url": "https://www.duchas.ie/en/cbes/4811586/4799381/4931307", "text": "\nShrovetideShrovetide is the time of year when most marriages take place in this locality.It is remarked that Saturday is an unluvky day for a marriage to take place.May is supposed to be an unlucky month for a marriages to take place.It is believed that Monday and Tuesday are both unlucky days on which to get married.Money is usually given as a fortu to the bride when getting married, and sometimes livestock is given along with the money. Again, livestock only is given as a dowry. It is usual for a wedding-feast  to be held in the house of the bride.A number of young men dressed in straw - \"straw-boys\" - come to the wedding feast at night.\n(continues on next page)\n", "school_info": "School: Baile Uí Mhuireadhaigh", "metadata": [{"Location:": "Ballymurray, Co. Roscommon", "Teacher:": "\nEibhlín Ní Ghealbháin\n"}, {"Informant": "James Lough", "Gender": "male", "Address": "Cloonconra, Co. Roscommon"}, {"Informant": "Mrs Mary K. Lough", "Gender": "female", "Address": "Cloonconra, Co. Roscommon"}, {"Language": "English"}]}, "4921935/4911352/4932667": {"title": "Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0480, Page 369", "Page 369"], "url": "https://www.duchas.ie/en/cbes/4921935/4911352/4932667", "text": "\nShrove TuesdayOn Shrove Tuesday evening pancakes are made.  A gold ring is put in one and a silver ring in another.  The gold ring, is to the finder, marriage and the person who gets the silver ring will enter the religious life.A button is sometimes put in and this indicates that the person will be an old maid or a bachelor.The evening and part of the night is spent dancing.Songs and ghost stories follow but when ten o'clock comes all retire to be up early next morning for the Lenten devotions.\n", "school_info": "School: Glin (C.)", "metadata": [{"Location:": "Glin, Co. Limerick", "Teacher:": "\nBean Mhic Cárthaigh\n"}, {"Language": "English"}]}, "4922323/4870119/4933191": {"title": "Present Day and Ancient Customs of Shrove", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0602, Page 019", "Page 019"], "url": "https://www.duchas.ie/en/cbes/4922323/4870119/4933191", "text": "\nShrove is the time of the year set apart for marriages generally in the Country. It is sorry to see the grand old custom of weddings and \"ganders\" dead.When a man had money for his son or daughter he was on the (loock) look out of a farm of land about to be given up by a farmer to his son. Aman went between parties called a \"speacaer\" A meeting place in the nearest Village or place was agreed on. If the couple about to be married were unknown to each other they had to be present at this place, and if they liked each other the money was arranged and such questions were invariably asked \"How much turbary? \"is it far from the house. How far is the school, and Church and well. How many rooms how big are they. What living is the old couple going to keep. How much arable land, meadowing, grazing. Tillage. How long ago was the house thatched ect. A day is appointed to walk the land and if everything is as it was \"painted\" at the meeting place the match is declared made. and there is feasting for the remainder of the day. Often daring\n(continues on next page)\n", "school_info": "School: Lacken (C.), Cill Mhichíl", "metadata": [{"Location:": "Lacken, Co. Clare", "Teacher:": "\nBean Uí Mhaonaigh\n"}, {"Collector": "Mary Kenny", "Gender": "female", "Address": "Knockmore, Co. Clare"}, {"Informant": "Mrs Kenny", "Gender": "female", "Age": "51", "Address": "Knockmore, Co. Clare"}, {"Language": "English"}]}, "4769990/4764539/4933758": {"title": "Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0824, Page 143", "Page 143"], "url": "https://www.duchas.ie/en/cbes/4769990/4764539/4933758", "text": "\nShrove Tuesday is the first Tuesday in March.That night is called \"pancake night\" and there are many old customs carried out. On that night people make pancakes,and put a ring in the pancake and then they say that whoever gets the ring will get married.They also blow horns at old maids and bachelors.\n", "school_info": "School: Castlecuffe, Mountmellick", "metadata": [{"Location:": "Castlecuffe, Co. Laois", "Teacher:": "\nJ. Devereux\n"}, {"Collector": "Betty Brennan", "Gender": "female"}, {"Informant": "Mrs Mary Daly", "Relation": "grandparent", "Gender": "female"}, {"Language": "English"}]}, "4921945/4912214/4934176": {"title": "Old Festival Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0483, Page 190", "Page 190"], "url": "https://www.duchas.ie/en/cbes/4921945/4912214/4934176", "text": "\n(continued from previous page)\nand others spend it in giving an all night's dance to their friends, in some house in the neighbourhood.In this district wren-boys go about not alone on St. Stephen's Day, but during the evening of Christmas Day as well. At one time the local wren-boys always brought a dead wren, tied on a holly bush with them. The bush was decorated with ribbons and was carried by the leader of the party. It was killed on Christmas Day night when the men went out with sticks and stones, hunted it and then beat it to death. But this custom of carrying the dead wren has gone out of use here-around for many years.Pancake NightShrove Tuesday night is known locally as Pancake Night. On that night people especially children bake pancakes and eat their fill of them. The reason supposed for his custom is that people might have an\n\n\n\nPancake Night.Shrove Tuesday night is known locally as pancake night.  On that night people, especially children bake pancakes and eat their fill of them.  The reason supposed for the custom is that people might have an\n(continues on next page)\n", "school_info": "School: Shanagolden (B.)", "metadata": [{"Location:": "Shanagolden, Co. Limerick", "Teacher:": "\nTomás Ó Loingsigh\n"}, {"Collector": "Eoin Curran", "Gender": "male"}, {"Language": "English"}]}, "4921963/4913816/4935554": {"title": "November's Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0488, Page 254", "Page 254"], "url": "https://www.duchas.ie/en/cbes/4921963/4913816/4935554", "text": "\n(continued from previous page)\nmarried first.\n\n\n\nShrove TuesdayMany marriages take place on Shrove Tuesday because it is the last day for getting married until Lent is ended. Pancakes are made on that day so as to have a feed of eggs before the forty long days of fasting. There is a custom in this district called Sceilg. All the boys and some men go around the surrounding districts with long ropes. Every bachelor they meet they tie him with the ropes. When they have many caught they tie them all to trees, in the town they tie them to lamp-posts.\n(continues on next page)\n", "school_info": "School: Scoil an Churnánaigh, Caisleán Nua Thiar", "metadata": [{"Location:": "Newcastle, Co. Limerick", "Teacher:": "\nPr. Ó Fionnmhacháin\n"}, {"Collector": "James Fitzgerald", "Gender": "male", "Address": "Glendiheen, Co. Limerick"}, {"Informant": "Tim Aherne", "Gender": "male"}, {"Language": "English"}]}, "4921971/4914423/4936890": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0491, Page 035", "Page 035"], "url": "https://www.duchas.ie/en/cbes/4921971/4914423/4936890", "text": "\nThere once lied in Broadford a cooper named William Mc Glynn and he was also a butcher on a small scale. Many is the story he told at the farmers' houses when he was there killing the pigs. Before he came to Broadford he spent some time in England and many adventures he had when he was there. One one occasion he was in the upper storey of a house and got into some row with the people of the house. He was pushed out the window getting a fall of some 26' to the ground. His landlady was surprised to meet him the following morning. She asked him how he was, \"I am alright\" said William,\" but that is a very high step you have to your door.\n\n\n\nShrove is the usual time for boys and girls to get married. Long ago there were alot of customs attached to Shrove, such as matchmaking, straw-boys, hauling home, Pancake night and Sceilg.\n(continues on next page)\n", "school_info": "School: Broadford, Ráthluirc", "metadata": [{"Location:": "Broadford, Co. Limerick", "Teacher:": "\nSiobhán Nic Phiarais\n"}, {"Collector": "Patrick Curtin", "Gender": "male", "Address": "Knockglass, Co. Limerick"}, {"Language": "English"}]}, "4723809/4715429/4939262": {"title": "Customs on Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0929, Page 064", "Page 064"], "url": "https://www.duchas.ie/en/cbes/4723809/4715429/4939262", "text": "\nCustoms on Shrove Tuesday.On Shrove Tuesday it is the custom of the people to go to Confession and get pardon for their sins, because they want to start the holy season of Lent in a pious manner. The people who are going to get married, like to be married before Lent comes in. On that night a number of people come together in one house and start to sing and dance. The woman of the house makes pan-cakes and puts a ring in one of them. It is generally supposed that the person who gets the ring will be married before the year will be out. On Shrove Tuesday people used to fill small paper-bags of common ashes and bring them with them to Mass on ash Wednesday to get them blessed. Many people fry bacon and eat it on Shrove Tuesday night because you cannot eat on Wednesday because it is a fast day.\n", "school_info": "School: Cill Eirc", "metadata": [{"Location:": "Killark, Co. Monaghan", "Teacher:": "\nS. Mac Druaidhe\n"}, {"Language": "English"}]}, "4921991/4915963/4946260": {"title": "Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0496, Page 045", "Page 045"], "url": "https://www.duchas.ie/en/cbes/4921991/4915963/4946260", "text": "\nShrove Tuesday in the olden days was a day of much rejoicing, and many of the old customs still survive, while others are spoken of yet. Most of the marriages of the year were celebrated on that day, and it was in connection with those marriages, that all those old customs are spoken of. In the old days, the marriages were usually celebrated in the evening at the house of the bride. After the ceremony, supper was taken and a great number of the friends of each party were invited to the\n(continues on next page)\n", "school_info": "School: Fíodhnach (C.), Ráthluirc", "metadata": [{"Location:": "Feenagh, Co. Limerick", "Teacher:": "\nÁine, Bean Uí Ghrádaigh\n"}, {"Collector": "Bridie O' Leary", "Gender": "female", "Address": "Kilmurry (Archer), Co. Limerick"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "male", "Age": "circa 50", "Occupation": "farmer", "Address": "Kilmurry (Archer), Co. Limerick"}, {"Language": "English"}]}, "4921994/4916325/4947280": {"title": "Shrove", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0497, Page 039", "Page 039"], "url": "https://www.duchas.ie/en/cbes/4921994/4916325/4947280", "text": "\nShrove begins on the sixth of January, and ends on Shrove Tuesday. It is a custom for people to get married in Shrove. It is also a custom for old men to be match-making between young boys and girls. They also put old men made of sticks outside the doors of unmarried girls. They also put wheels of cars, cocks of rushes, spades and shovels, dressed with ribbons outside the doors.\n\n\n\nIt is unlucky for newly weds to go home the road they came or to get married on Monday or Tuesday. Before they are married people make an old man to frighten them\n", "school_info": "School: Dromcollchoille (B.)", "metadata": [{"Location:": "Dromcolliher, Co. Limerick", "Teacher:": "\nPádraig Ó Mathghamhna\n"}, {"Collector": "John Murphy", "Gender": "male", "Address": "Mundellihy, Co. Limerick"}, {"Informant": "Denis Barry", "Gender": "male", "Age": "circa 55", "Address": "Mundellihy, Co. Limerick"}, {"Language": "English"}]}, "4921994/4916333/4947286": {"title": "Shrove", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0497, Page 047", "Page 047"], "url": "https://www.duchas.ie/en/cbes/4921994/4916333/4947286", "text": "\nMatchmakers are still in vogue. It is a custom to borrow cattle and even flitches of bacon, when the matchmakers come to \"walk the land\"Eugene OSullivan told me what he heard of his grandmother's match. She was in a field, hurling with some other girls. Their ball was made of stucking thread and their hurleys were furge sticks. She was ordered to come in, that her match was made. She was so excited, that she took in her hurley. Her intended was very frightened lest he might not suit her and all the time, he kept a wary eye on that hurley in her hand. However, they were married and lived happily ever after.A man made a match for his son at the Fair of Newcastle West. When he came home, he said, \"Your match is made with a girl from Ardagh, my boy, you must go and see her.\" \"Yerra,\" father said the son, \"There's no need to go such a long journey for nothing, she'll do all right, she'll do. And she did.\n", "school_info": "School: Dromcollchoille (B.)", "metadata": [{"Location:": "Dromcolliher, Co. Limerick", "Teacher:": "\nPádraig Ó Mathghamhna\n"}, {"Collector": "Jerry Newman", "Gender": "male", "Address": "Dromcolliher, Co. Limerick"}, {"Language": "English"}]}, "4922073/4849971/4948856": {"title": "Customs for Shrove", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0517, Page 278", "Page 278"], "url": "https://www.duchas.ie/en/cbes/4922073/4849971/4948856", "text": "\nSt. Brigid's Cross made of reed and fixed to the roof of the house. House would thus be never destroyed by fire.\n\n\n\nThe mother should not go to the marriage of her eldest child. No one should get married in the harvest because whatever is bound in the harvest shall be loosed in the spring. A girl should never put on all her wedding dress before the marriage. A lot of people get married in Shrove. The Sunday before ash Wednesday is chalk and people chalk all those not married. The night before ash Wednesday is pancake night. The old people used to hand up a piece of meat and take it down on Easter Monday and whoever will eat a piece of it will be free from sickness all the year. The mother should never go to the funeral of her eldest son. Monday for health, Tuesday for wealth, Wednesday the best day of all. Thursday for losses, Friday for crosses and Saturday no day at all.\n", "school_info": "School: Fedamore (B.)", "metadata": [{"Location:": "Fedamore, Co. Limerick", "Teacher:": "\nMartin Moloney\n"}, {"Collector": "Sean Mac Cartaigh", "Gender": "male"}, {"Informant": "Mrs Mac Carthy", "Gender": "female", "Age": "40"}, {"Language": "English"}]}, "4922073/4849973/4948882": {"title": "Customs on the Dead", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0517, Page 280", "Page 280"], "url": "https://www.duchas.ie/en/cbes/4922073/4849973/4948882", "text": "\nPeople give away some salt May Day to their neighbours. Other people give away fuel. The water that washed the corpse should be thrown out in direction the corpse should go to the church. You should wash the sheet where the dead person was if you didn't want to go you could dip the corner of the sheet in the water. People say it is not right to dig a grave on a Monday.\n\n\n\nOn Shrove Tuesday the people always hang up a price of meat. If the marriage ring falls off the hand during the marriage couple will have an unhappy life. The reason why all the people makes pancakes is because they can eat enough of eggs in the pancakes. That night is the night before the first day of Lent. The mother shouldn't go to her oldest son's marriage\n", "school_info": "School: Fedamore (B.)", "metadata": [{"Location:": "Fedamore, Co. Limerick", "Teacher:": "\nMartin Moloney\n"}, {"Informant": "Mrs Margaret Keogh", "Gender": "female", "Address": "Fedamore, Co. Limerick"}, {"Language": "English"}]}, "4922029/4920144/4948905": {"title": "Festival Customs - Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0506, Page 077", "Page 077"], "url": "https://www.duchas.ie/en/cbes/4922029/4920144/4948905", "text": "\nShrove Tuesday.Shrove Tuesday falls on the Tuesday before Ash Wednesday which is the first day of Lent.The Sunday, Monday and Tuesday before Ash Wednesday is claled the season of Shrove and during that time it is a custom among the people to have great feasting and merriment, dances and parties are held, and above all marriages take place.  The reason being that from Ash Wednesday to Easter Sunday which is the seven weeks of Lent people abstain from all luxuries and merriment.On Shrove Tuesday night, it is an old custom to have pancakes for tea and a ring is put in one of them, which means that the person who gets the ring  will be married soon and it is also a custom to toss pancakes on that night.In Ireland when flour was not plentiful the people used to make colcannon which consisted of boiled potatoes, mashed and green curley kale cabbage also boiled and mixed with the\n(continues on next page)\n", "school_info": "School: Áth Dara (C.)", "metadata": [{"Location:": "Adare, Co. Limerick", "Teacher:": "\nMáire Boardman\n"}, {"Collector": "Clarrie Alfred", "Gender": "male", "Age": "14", "Address": "Cummeen, Co. Limerick"}, {"Language": "English"}]}, "4770004/4766024/4956433": {"title": "Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0828, Page 090", "Page 090"], "url": "https://www.duchas.ie/en/cbes/4770004/4766024/4956433", "text": "\nShrove Tuesday night was called pancake night and on this night a large quantity of pancake were made and a ring was usually put in there and whoever got the ring was supposed to be married first. The reason why pancakes were made was because long ago the people used to have a black-fast on Ash Wednesday which was the day after Shrove Tuesday and on the night before, in order to use up all the milk and eggs they used to make pancakes.\n\n\n\nOn May morning every girl got up before sunrise and washed her face in the dew. If she allowed the sun to dry her face she believed she would be fair and beautiful. The master of the house cut a May-bush and walked three times round a well and by so doing thought he could take his neighbour's butter for the year. It was supposed to be unlucky to take milk from a farmer's house. Even now, there are superstitious women who will not even sell milk on May day. They also say that it is unlucky to bring a May bush inside the door.\n", "school_info": "School: St John of God Convent, Rathdowney", "metadata": [{"Location:": "Rathdowney, Co. Laois", "Teacher:": "\nThe Sisters\n"}, {"Language": "English"}]}, "4922122/4854237/4956911": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0530, Page 488", "Page 488"], "url": "https://www.duchas.ie/en/cbes/4922122/4854237/4956911", "text": "\nAncient ceremonial customs have practically died out in the district.  On the Eve of St. Martin's Day a cock is killed, the blood is sprinkled behind the door of the dwelling house and also on the doors of the out-houses.  The bird is usually killed behind the door and its blood is trailed around the kitchen.  On the feast day the cock is eaten.\n\n\n\n(b)  On the last day of Shrove - Shrove Tuesday - pancakes are made and the younger generation has an enjoyable feast that night.  Many are on the look out for the hidden ring in one of these cakes, the lucky finder is supposed to be married within twelve months.  All are watchful lest they find the concealed medal in another cake; whoever finds it will be either batchelor or maid or a religious.\n\n\n\nOn the Eve of All Souls Day candles are lighted on the windows which are left uncurtained that night.  A separate candle is lighted for each departed one to give it light on its journey for that night.  The lights are allowed to burn themselves out to the last.\n", "school_info": "School: Tír-Dhá-Ghlas (Terryglass)", "metadata": [{"Location:": "Terryglass, Co. Tipperary", "Teacher:": "\nSeán Ó Gliasáin\n"}, {"Language": "English"}]}, "4922138/4855962/5011425": {"title": "Shrove", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0536, Page 121", "Page 121"], "url": "https://www.duchas.ie/en/cbes/4922138/4855962/5011425", "text": "\nWe have Shrove from the 6th of January until Ash Wednesday.  People generally get married in Shrove.  Shrove is longer some years than others according to the time Easter Sunday falls on.  In olden times people did not get married any time of the year only in Shrove.  When people would be getting married first the match would be made.  Then they go to town to pay the money and arrange the day to be married.  If the boy and girl are from two different Parishes the boy would have to go to the Parish priest of his Parish to get permission in writing from him.  The girls parents would have to pay the marriage money.  The marriage usually would be on a Wednesday.\n", "school_info": "School: Clais", "metadata": [{"Location:": "Clash, Co. Tipperary", "Teacher:": "\nCristíona Ní Chearbhalláinn\n"}, {"Language": "English"}]}, "4922156/4856763/5012750": {"title": "Shrove-Tide Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0538, Page 288", "Page 288"], "url": "https://www.duchas.ie/en/cbes/4922156/4856763/5012750", "text": "\nIn olden times all the marriages used to take place in Shrove. Land, money, or cattle used to be given as dowries. The marriages used to take place late in the evenings. Before the marriage there used to be a big party in the girl's house. The bride used to drive home behind her husband usually in a side-car or on horseback. In later years they drove in a carriage and pair. They were followed by a procession of cars and men on horse-back. There used to be a great wedding that night in the man's house. Rows of tables were set along at each side of the kitchen. For the supper, they had bacon, mutton, beef, boiled geese and potatoes. The priests and big people used to attend the weddings and they used to\n(continues on next page)\n", "school_info": "School: Boher, Bushfield. Nenagh", "metadata": [{"Location:": "Boher, Co. Tipperary", "Teacher:": "\nMargaret A. Malone\n"}, {"Collector": "Mary O' Brien", "Gender": "female", "Address": "Curraghmore, Co. Tipperary"}, {"Informant": "Mrs Michael O' Brien", "Gender": "female", "Address": "Curraghmore, Co. Tipperary"}, {"Language": "English"}]}, "4922156/4856765/5012756": {"title": "Shrove-Tide Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0538, Page 290", "Page 290"], "url": "https://www.duchas.ie/en/cbes/4922156/4856765/5012756", "text": "\nShrove Tide was a great time of the year for getting married long ago. Shrove-Tide the people used to say, was from the feast of the Epiphany to Shrove Tuesday.When the people were matchmaking long ago, they used to take whiskey with them and there used to be a great spree. Money was nearly always given as a dowry. But in our local townlands of Scragg and Burgess there is colony of families called McGraths living all together. When the sons and daughters of the McGrath family were getting married instead of giving money an equal share of land was given to each of them and so tehy are all living near each other\n(continues on next page)\n", "school_info": "School: Boher, Bushfield. Nenagh", "metadata": [{"Location:": "Boher, Co. Tipperary", "Teacher:": "\nMargaret A. Malone\n"}, {"Collector": "Kitty Bray", "Gender": "female", "Address": "Curraghmore, Co. Tipperary"}, {"Informant": "Mrs Bray", "Gender": "female", "Address": "Curraghmore, Co. Tipperary"}, {"Language": "English"}]}, "4922156/4856768/5012759": {"title": "Shrove-Tide Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0538, Page 293", "Page 293"], "url": "https://www.duchas.ie/en/cbes/4922156/4856768/5012759", "text": "\nFor the dinner at a wedding party long ago they used to have roast geese and roast beef. At the dinner a man would go around with a plate collecting for the man with the pipes. After the dinner there would be dancing. In this part of the country the people always went with a horse for a famous piper who lived in Castleconnell O'Dowdall was his name. The music they had at their wedding and dances was the bagpipes and fiddle. Grandfather saw Mrs. Gleeson Curraghmore coming home behind her husband on a saddle horse and the wedding party on horseback too were all racing. The girl\n(continues on next page)\n", "school_info": "School: Boher, Bushfield. Nenagh", "metadata": [{"Location:": "Boher, Co. Tipperary", "Teacher:": "\nMargaret A. Malone\n"}, {"Collector": "Paddy Mc Grath", "Gender": "male", "Address": "Curraghmore, Co. Tipperary"}, {"Informant": "Tom Mc Grath", "Gender": "male", "Address": "Curraghmore, Co. Tipperary"}, {"Language": "English"}]}, "4770049/4769205/5015034": {"title": "Ash Wednesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0837, Page 145", "Page 145"], "url": "https://www.duchas.ie/en/cbes/4770049/4769205/5015034", "text": "\nNo special meaning here.\n\n\n\nPancakes were generally made for the evening meal, plenty of buttter and eggs being used, as it was the last day of feasting before vigorous fast of Lent.\n\n\n\nNowadays barm-bracks containing rings  are bought from bakery for H - Eve. Children may play games with nuts and apples - ducking fro apple, snap-apple and the three saucers. Wheat is burned on bars of grate like the nuts; but many children now attending school here never saw nuts or wheat burned on bars of the grate. The  PUCA  is said to go about on this night destroying nuts, apples and berries. Children are warned never to touch fruit   on bushes after Nov. Day.No tricks are played as in other parts of midlands. Colcannon   is not made on Hallow Eve.\n\n\n\nUnnoticed\n\n\n\nSchool-girls wore Patrick's Crosses until about 40 years ago.    These were made of a circle of white paper    4\"  or 4 1/2\" in diameter. Narrow gaily coloured silk or satin ribbon was stitched across, star shaped design, ends finished off  with tiny bows. They also  wore great bows of green silk ribbon or hair (?). Men, women and little boys wore  bunches of shamrock. The men went to the nearest town to \"drown their shamrock\" having saved a few shillings specially for this purpose. Many indulged too freely in the cheap whiskey and bad porter, coming home much the worse of the day's wear.\n", "school_info": "School: Loughteague, Stradbally", "metadata": [{"Location:": "Loughteeog, Co. Laois", "Teacher:": "\nBrigid Keane, Brighid Ní Chatháin\n"}, {"Language": "English"}]}, "4922161/4857218/5016287": {"title": "Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0540, Page 120", "Page 120"], "url": "https://www.duchas.ie/en/cbes/4922161/4857218/5016287", "text": "\nShrove Tuesday night was called 'pancake night' because the people make pancakes. They used to put a ring in one of them and they said whoever got it would marry first. There used to be great merry-making and feasting in the house on that night, because they said it was the last night before Lent.\n\n\n\nOn St. Stiophan's day wren boys go around from house to house. They dress up in coloured clothes and painted faces. They carry a holly bush decorated with ribbons.When they arrive at a house they go in and sing, play music and dance around the kitchen.\n(continues on next page)\n", "school_info": "School: Tuar, Tulach Sheasta", "metadata": [{"Location:": "Toor, Co. Tipperary", "Teacher:": "\nSíghle Ní Riain\n"}, {"Language": "English"}]}, "5017943/4859149/5018336": {"title": "The Local Roads", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0547, Page 179", "Page 179"], "url": "https://www.duchas.ie/en/cbes/5017943/4859149/5018336", "text": "\n(continued from previous page)\nand coming out at John's Clarke's lane. It was called \"bóthar an gaduidhe\".There is an old mass path at the front of our house. It was the path to Couraguneen chapel.\n\n\n\nOn Shrove Tuesday the people of this district gets married mostly.The people in every house in this district make pancakes on that day and puts a ring in the dough of one of them before baking and whoever gets the ring would be said to be married before the Shrove Tuesday of the following year.On May-day the people of each house makes a May-bush with flowers and blossomed blackthorn and then sticks it in the thatch over the door.  People would not give away anything on May Day for they say they would be giving away their luck.On Bonefire Night a bonefire is lighted in this district. What is burnt is a couple of blocks of deal and a load of turf and then a bottle of paraffin oil is sprinkled on it\n(continues on next page)\n", "school_info": "School: Shanakill, Roscrea", "metadata": [{"Location:": "Shanakill, Co. Tipperary", "Teacher:": "\nSeán Ó Ceallaigh\n"}, {"Collector": "Daniel Quinlan", "Gender": "male", "Address": "Shanakill, Co. Tipperary"}, {"Informant": "Mr Quinlan", "Relation": "parent", "Gender": "male", "Address": "Shanakill, Co. Tipperary"}, {"Language": "English"}]}, "5017943/4859151/5018341": {"title": "Local Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0547, Page 181", "Page 181"], "url": "https://www.duchas.ie/en/cbes/5017943/4859151/5018341", "text": "\n(continued from previous page)\nOn St. Patrick's Dy the people wear shamrocks and long ago they used wear a black sally cross on the right shoulder.\n\n\n\nOn Shrove Tuesday people used to boil meat and cabbage and potatoes and have them for supper.On Ash Wednesday people go to Mass and the priest puts it on our foreheads and gives them some to bring home.People used to eat only one meal on Good Friday.On St. Martin's Day people don't thresh till after dinner-time on account of St. Martin being killed on a threshing mill.\n\n\n\nThe people of this parish keep cows, horses, sheep, pigs, goats and cattle.The cows are tied by means of a \"bales\". It consists of two straight sticks with a piece of wire on top to hold them together. But long ago the people had blocks of wood driven into the ground in the cow house and the cows tied to them with a piece of rope. The Reavses tie the cows with the rope and block.\n(continues on next page)\n", "school_info": "School: Shanakill, Roscrea", "metadata": [{"Location:": "Shanakill, Co. Tipperary", "Teacher:": "\nSeán Ó Ceallaigh\n"}, {"Collector": "Lena Meehan", "Gender": "female", "Address": "Shanakill, Co. Tipperary"}, {"Informant": "Mrs Meehan", "Relation": "parent", "Gender": "female", "Address": "Shanakill, Co. Tipperary"}, {"Language": "English"}]}, "5009219/4999087/5019819": {"title": "Festival Customs - Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0870, Page 356", "Page 356"], "url": "https://www.duchas.ie/en/cbes/5009219/4999087/5019819", "text": "\nShrove Tuesday is the day before Ash Wednesday. Shrove Tuesday year's ago used to be one of the great day's of the year. Most of the people of long ago had old custom's for the feasts and great day's of the year. The custom of Shrove Tuesday is on that night all the people of long ago, and most of the people of to day still make pancake's, and it is also called pancake night. Most of the people had great custom for doing thing's on them special day's.\n", "school_info": "School: Ballycullane", "metadata": [{"Location:": "Ballycullane, Co. Wexford", "Teacher:": "\nSeán Ó Dubhghaill\n"}, {"Collector": "Bridie Kelly", "Gender": "female"}, {"Language": "English"}]}, "4922260/4865141/5022714": {"title": "Shrove Weddings", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0571, Page 291", "Page 291"], "url": "https://www.duchas.ie/en/cbes/4922260/4865141/5022714", "text": "\nOn Shrove Tuesday, about thirty years ago in the Catholic Church in Newcastle, about four miles from Ardfinnan, there were elven weddings, all celebrated at the one time. When they came out of the church they all formed one long procession and drove around the country. Then the procession broke up and each party went to the house of the bridegroom where the wedding party was held and where they enjoyed themselves till twelve o clock when they \"broke up\". Ash Wednesday being the first day in Lent all the celebrations finished at twelve o'clock. My mother, Mrs Doran, who told me this and who saw all the weddings at Newcastle lives now at Rochestown Ardfinnan\n", "school_info": "School: Árd Fhionáin (B.)", "metadata": [{"Location:": "Ardfinnan, Co. Tipperary", "Teacher:": "\nÁine Ní Fhoghludha\n"}, {"Language": "English"}]}, "4922236/4863169/5053304": {"title": "St Brigid's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0560, Page 388", "Page 388"], "url": "https://www.duchas.ie/en/cbes/4922236/4863169/5053304", "text": "\nOn the eve of St. Brigid's Day people hang out pieces of ribbon or a scarf to get the saint's blessing as she passes by.\n\n\n\nOn St. Brigid's Day people used to dress a broom and dance with it.\n\n\n\nThe sign of the Cross was made (while the Three Divine Persons were invoked) with the burnt end of a hazel stick on the left shoulder of every man and boy in the house. If a member of the family were named Patrick it fell on him to perform the rite. Girls wore crosses made of cardboard and covered with various coloured ribbons.\n\n\n\nMany marriages take place on Shrove Tuesday. Pancakes are made on that night on account of the fast for Lent. A ring is hidden in one pancake, and who ever gets the ring is supposed to be\n(continues on next page)\n", "school_info": "School: Mullinahone (C.)", "metadata": [{"Location:": "Mullinahone, Co. Tipperary", "Teacher:": "\nMáire Ní Shéaghdha\n"}, {"Collector": "Patricia Ahearne", "Gender": "female", "Address": "Mullinahone, Co. Tipperary"}, {"Informant": "Mrs Ahearne", "Gender": "female", "Address": "Mullinahone, Co. Tipperary"}, {"Language": "English"}]}, "4922266/4865687/5055328": {"title": "St John's Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0572, Page 450", "Page 450"], "url": "https://www.duchas.ie/en/cbes/4922266/4865687/5055328", "text": "\nSt. John's EveOn St. John's Eve it is an old custom for young men to light bonfires at the cross roads.\n\n\n\nMay EvePeople believe that a great deal of witchcraft was carried out on May Eve long ago. On that account people used to sprinkle Easter Water on the fields, crops, cattle and other animals.\n\n\n\nShrove TuesdayShrove Tuesday night is called Pancake Night. People made pancakes and put a ring in one of them. For the person who gets the ring it is looked on as a lucky omen.\n", "school_info": "School: Gormanstown, Árd Fhíonáin", "metadata": [{"Location:": "Gormanstown, Co. Tipperary", "Teacher:": "\nPeadar de Mhóiréis\n"}, {"Collector": "Maureen Marsh", "Gender": "female"}, {"Informant": "Mr Marsh", "Gender": "male", "Address": "Gormanstown, Co. Tipperary"}, {"Language": "English"}]}, "4922341/4871873/5072533": {"title": "Signs of Good and Bad Weather", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0608, Page 027", "Page 027"], "url": "https://www.duchas.ie/en/cbes/4922341/4871873/5072533", "text": "\n(continued from previous page)\nShrovetime.Kitty DonnellanCragnagourInchEnnis\n\n\n\nShrovetime               Shrovetime is the period from the last day of christmas until \"Ash Wednesday\".It is during this time all the \"matches\" take place.      Soon after the the young man gets the farm from his father ,they get him married .First of all the young man's parents and the young lady's parents meet in Ennis and her parents ask him how much land and stock  he has.                      They also go and walk the land and if it is good enough ,they arrange to go to Ennis again .When they all meet together again  her parents ask him what fortune he wants.The man generally asks more then he expects to get.So as soon as they have settled about the money ,they go into a solicitor and they \"draw  the writings\".Her parents also pay half the fortune on that day.       They next thing they do is to go to the best jeweller's shop and then he gets a ring for her.He keeps the ring until the day he is getting married .They go then and\n(continues on next page)\n", "school_info": "School: Inis Bheag (Inch), Inish", "metadata": [{"Location:": "Inch, Co. Clare", "Teacher:": "\nMícheál Ó Beolain\n"}, {"Collector": "Kitty Donnellan", "Gender": "female", "Address": "Cragnagower, Co. Clare"}, {"Language": "English"}]}, "5008834/4959607/5074112": {"title": "Festivals between Shrove Tuesday and Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0664, Page 259", "Page 259"], "url": "https://www.duchas.ie/en/cbes/5008834/4959607/5074112", "text": "\nThe day before Ash Wednesdy is called Shrove Tuesday. It is on a different date every year. It is the custom to make pan-cakes on that night, and it is know as \"pancake night\". People make fools of the children on that night by sending them from house to house for the pan-cake sieve. But who-ever they ask the sieve from will get a hand full of soot from the chimney and blacken their faces.Ash Wednesday is the next feast-day after Shrove Tuesday. It is the first day in Lent. Ashes are blessed in the chapels, and they are put on people's foreheads during Mass to remind them that when they die, they will turn to ashes. People fast from sweets or sugar in remembrance of Our Lord's forty day's fast.St. Patrick's Day is the next feast-day. It is held on the 17th of March each year. It is the custom to wear shamrock on that day, in remembrance of St. Patrick. Men and boys march in parades through the streets after Mass on that day.\n(continues on next page)\n", "school_info": "School: Kilcurry, Dundalk", "metadata": [{"Location:": "Kilcurry, Co. Louth", "Teacher:": "\nP. Ó Conaill\n"}, {"Language": "English"}]}, "4922343/4872001/5075280": {"title": "Shrove Tide in Lisroe", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0608, Page 153", "Page 153"], "url": "https://www.duchas.ie/en/cbes/4922343/4872001/5075280", "text": "\n18th January 1938.Nowadays it is usual for people to marry practically any time during the year but up to recent years Shrove tide was the most popular time for people to become joined in wedlock. This marriage season begins immediately the twelve days of Christmas have passed away and lasts until the first Day of Lent. Shrove Tuesday the day preceding Ash Wednesday is chosen by many as their marriage day in our district chiefly because marriages are forbidden during Lent.It is considered unlucky for people to marry in October or May. Neither will any body risk a life of bad luck by marrying on Mondays or Thursdays. The old people believe that once every seven years a Thursday occurs called Red Thursday ( Lá Crosta na mbliadhan) and that any body who marries on that day will have a life of troubles and crosses. As the exact year\n(continues on next page)\n", "school_info": "School: An Lios Rua, Cill Mháille", "metadata": [{"Location:": "Lisroe, Co. Clare", "Teacher:": "\nEibhlín Ní Chonalláin\n"}, {"Collector": "Mina Considine", "Gender": "female"}, {"Informant": "Jim Lynch", "Gender": "male", "Age": "82", "Address": "Lisroe, Co. Clare"}, {"Language": "English"}]}, "5008837/4959867/5076764": {"title": "Lore Connected with Shrove Tuesday and Ash Wednesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0665, Page 202", "Page 202"], "url": "https://www.duchas.ie/en/cbes/5008837/4959867/5076764", "text": "\nLong ago a lot of marriages would be celebrated before Shrove Tuesday and Lent.It is a custom to make pancakes and to have them for the tea in the evening, and on that evening people give pancake seive to other people, they call them in to the kitchen to give them a pancake and when they get them in they would have a saucer of polish and sutt wet and when the person would be eating the pancake, they would blacken their faces all, and that is called pancake seive.  On Ash Wednesday when people were not allowed to eat anything they had to eat gruel with nettles in it.\n", "school_info": "School: Louth (C.)", "metadata": [{"Location:": "Louth, Co. Louth", "Teacher:": "\nM. Ní Chasaide\n"}, {"Collector": "Sheela Malone", "Gender": "female", "Address": "Tullycahan, Co. Louth"}, {"Language": "English"}]}, "5008882/4963459/5077653": {"title": "Shrove-Tide Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0679, Page 083", "Page 083"], "url": "https://www.duchas.ie/en/cbes/5008882/4963459/5077653", "text": "\nYears ago people had many customs which they used carry on especially at Easter-tide, Christmastide and Shrovetide. At those periods also great feasting was carried on. At Christmastide all the married people would gather together and make up a rhyme called Seeilig's list.This was done because any body who lived on this Island could get married in Lent, for they had Lent later in the year on that Island, so that when it was Lent with those who did not live on the Island it was not Lent with them. Any person who wanted, could go over to this Island in Lent and get married. This is the reason all the married people made up this rhyme, and this rhyme was given\n(continues on next page)\n", "school_info": "School: Pres. Convent, Drogheda", "metadata": [{"Location:": "Drogheda, Co. Louth", "Teacher:": "\nSr. M. Patrick\n"}, {"Collector": "Alice Lyons", "Gender": "female", "Address": "Laytown, Co. Meath"}, {"Informant": "James Reilly", "Gender": "male", "Address": "Laytown, Co. Meath"}, {"Language": "English"}]}, "5008882/4963501/5077834": {"title": "Regarding Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0679, Page 125", "Page 125"], "url": "https://www.duchas.ie/en/cbes/5008882/4963501/5077834", "text": "\nToday - March 1st is Shrove Tuesday. The grown ups call it Shrove but the children call it Pancake day. It is a very old custom to make pancakes and is still carried out especially in Ireland and England. On the Wednesday after that the Catholice people receive ashes from the priest as he puts the ashes on the brow he says these words in Latin \"Remember man thou art but dust and into dust thou Shalt return\" On the morning of Shrove Tuesday the children go to school very early and write on the board \"Please sister be faithful and kind and dont let the pancakes go out of your mind for when you\n(continues on next page)\n", "school_info": "School: Pres. Convent, Drogheda", "metadata": [{"Location:": "Drogheda, Co. Louth", "Teacher:": "\nSr. M. Patrick\n"}, {"Collector": "Moira Hughes", "Gender": "female", "Address": "Pearse Park, Co. Louth"}, {"Informant": "Mrs B. Hughes", "Gender": "female", "Address": "Pearse Park, Co. Louth"}, {"Language": "English"}]}, "4922344/4872154/5078598": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0608, Page 306", "Page 306"], "url": "https://www.duchas.ie/en/cbes/4922344/4872154/5078598", "text": "\n3062 Oidhche inide gan feóil lá Nodhlag mór gan ím.Domhnach  Cásga gan arán.            Sin é mo ghearán.18    The greater part of the vast possession of Donal O'Brien ,Lord Clare were granted by William during the Williamite confiscations to Joost Van Kellel ,Earl of Albermarle .The properties were resold ,by Albermarle to Niochlas Wesrby Francis Barton and James Mc Donnell in the year 1689 -(History of Clare and the Dalcassian Clans p 294-dean White)Old Marcus Keane (agent)carried out a lot of evictions in Kilmaley -agent for Westbyand Marquis of Conynghan.Singleton agent before Marcus Keane. Westby gave a present of Knockmore ,Knockatonna and Rathcrona to old Marcus Keane.A lot of widows cursed Marcus Keane.A lot people evicted died on the roadside ,or went to the workhouse,a good many\n(continues on next page)\n", "school_info": "School: Cill Mháille (C.), Inis", "metadata": [{"Location:": "Kilmaley, Co. Clare", "Teacher:": "\nNóra Ní Asaoid\n"}, {"Language": "mixed"}]}, "5008889/4964002/5079278": {"title": "Festival Rhymes - Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0680, Page 220", "Page 220"], "url": "https://www.duchas.ie/en/cbes/5008889/4964002/5079278", "text": "\nDear little teacher be faithful and kindAnd dont let the pancakes go out of your mindFor when you were young you liked to get someSo please let us home at half past one\n\n\n\nMarried in May and you'll rue the day.Married in June and you'll whistle a tune.\n\n\n\nTwelfth Day throw the candle away,Candlemas Day throw candle and candlestick away.\n", "school_info": "School: Naomh Muire, Droichead Átha", "metadata": [{"Location:": "Drogheda, Co. Louth", "Teacher:": "\nSr. M. Bernard Mc Cabe\n"}, {"Collector": "Mary Breen", "Gender": "female", "Address": "Drogheda, Co. Louth"}, {"Informant": "Mr Breen", "Gender": "male", "Age": "60", "Address": "Drogheda, Co. Louth"}, {"Language": "English"}]}, "5008892/4964425/5082133": {"title": "Festival Customs - May Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0682, Page 081", "Page 081"], "url": "https://www.duchas.ie/en/cbes/5008892/4964425/5082133", "text": "\nThe old custom of dressing the May Bush is still observed in this district. The children get a hawthorn bush and dress it with flowers, coloured strings, and coloured papers. They go from house to house saying:\" A long life, a happy wife, and something for the May-Bush\".When evening comes they light candles on it and dance and sing around it.People sometimes gather May flowers and throw them on the roof of the house in honour of Our Lady.Patrick Carry(Sgoláire)Got from:-Mrs Mary Kevitt (62) Oldbridge,Drogheda.\n\n\n\nShrove Tuesday (or Pancake Night)Long ago on Shrove Tuesday night some people used to fill three bottles with water and place them outside on the windowsill.  It was thought that bachelors who had died would come back and drink the water.  In the morning the bottles were usually empty. Then the people of the house would go out to see if any of their property, such as barrows, wheels or gates were gone, and if they were they blamed the bachelors. It was said that one bachelor would steal from the other and leave it with the people he left behind him. Got from Patrick Lennonage 47Sheephouse Drogheda\n", "school_info": "School: Donore", "metadata": [{"Location:": "Donore, Co. Meath", "Teacher:": "\nMaighréad Nic Eóin\n"}, {"Collector": "Patrick Lennon", "Gender": "male"}, {"Informant": "Patrick Lennon", "Gender": "male", "Age": "47", "Address": "Sheephouse, Co. Meath"}, {"Language": "English"}]}, "5008892/4964430/5082170": {"title": "Festival Customs - Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0682, Page 086", "Page 086"], "url": "https://www.duchas.ie/en/cbes/5008892/4964430/5082170", "text": "\nShrove Tuesday:On Shrove Tuesday people usually made pancakes.They do so still, but not in the same way, because most of the people long ago when making pan-cakes used to put in one a button, in another a ring, and in another a piece of stick.  The person who got the ring was supposed to be married before the next Shrove Tuesday.  The person who got the button was supposed to be an old maid or if it were a man he would be an old bachelor. The person who got the stick was supposed to have bold children and would have to beat them.The above was told to me byMr Patrick Ward, Oldbridge, Drogheda (aged 84)Anna Reilly, (Scoláire), Oldbridge,Drogheda\n", "school_info": "School: Donore", "metadata": [{"Location:": "Donore, Co. Meath", "Teacher:": "\nMaighréad Nic Eóin\n"}, {"Collector": "Anna Reilly", "Gender": "female", "Address": "Oldbridge, Co. Meath"}, {"Informant": "Mr Patrick Ward", "Gender": "male", "Age": "84", "Address": "Oldbridge, Co. Meath"}, {"Language": "English"}]}, "4922383/4876304/5083091": {"title": "Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0621, Page 413", "Page 413"], "url": "https://www.duchas.ie/en/cbes/4922383/4876304/5083091", "text": "\nThis is an exciting day in Lahinch always as it is the last day for marriages before lent. If there is a marriage the church is crowded with young and old to see the bridal pair. to wish them joy. and to give them a good send off by showering rice or confetti on them. Up to a few years ago the bride groom used to throw up money as he could afford in the air.\"keese\" it was called and this created terrible noise and rows in the congregation as they were all out to get some of the money coming down to the ground. Children were often trampled on and hurt. On that night others are kept busy in the homes making pancakes for the tea and into this pancake batter is put a ring\n(continues on next page)\n", "school_info": "School: Lahinch", "metadata": [{"Location:": "Lehinch, Co. Clare", "Teacher:": "\nDónall Ó Ríordáin\n"}, {"Informant": "John O' Dwyer", "Gender": "male", "Age": "72", "Address": "Calluragh South, Co. Clare"}, {"Language": "English"}]}, "5044803/5040025/5083167": {"title": "Feast Days - Hallow Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0968, Page 326", "Page 326"], "url": "https://www.duchas.ie/en/cbes/5044803/5040025/5083167", "text": "\n(continued from previous page)\nThey used also to go out on Hallow Eve night to cut the yarrow, and put it in their stockings to dream on just like the wheat. They said when cutting:-''Good morning fair Yarrow,And twice good morning to theeBefore this time to-morrowMy true love appear to me.''They also got a full mouthful of water, and went off to listen at a neighbours' door. It was believed that the one with the water in her mouth, would hear the name of the man she was to marry. The people would be talking of him. These customs have died out here.\n\n\n\nEvery one long ago would try to have a young duck for this feast. It would be eaten with potatoes. Many people had bacon and oaten bread too - bread that was an inch deep and baked up to the fire standing almost straight on a bread iron. They would wash this down with  \"Sowens\" or buttermilk. This custom has now died out. We have no feast, we seldom have sowens, but we still have oaten bread but except children at school, few people have teeth good enough to eat it. Every one had good teeth long ago, and never thought of washing them either.\n", "school_info": "School: Tiercahan", "metadata": [{"Location:": "Tircahan, Co. Cavan", "Teacher:": "\nP. Ó Riain\n"}, {"Language": "English"}]}, "5044787/5038084/5084080": {"title": "Festival Customs - St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0963, Page 481", "Page 481"], "url": "https://www.duchas.ie/en/cbes/5044787/5038084/5084080", "text": "\n(continued from previous page)\nSt Patricks night. On that morning everyone goes to mass and receives Holy Communion in honour of his National Apostle.\n\n\n\nShrove Tuesday is the day before Ash Wednesday.It is a great custom to make a feast of pancakes on that night This is done because it is the last day before the seven weeks of fasting in Lent.Shrove Tuesday is generally called pancake Tuesday.At Shrove there is also a feast of eggs, and at Easter there is a feast of chickens. There are not many customs on Shrove Tuesday.\n", "school_info": "School: Tomena", "metadata": [{"Location:": "Gortullaghan, Co. Cavan", "Teacher:": "\nT. Mac Uidhir\n"}, {"Informant": "May Mc Manus", "Gender": "female", "Address": "Drumbeagh, Co. Cavan"}, {"Language": "English"}]}, "5044793/5038720/5084427": {"title": "Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0965, Page 165", "Page 165"], "url": "https://www.duchas.ie/en/cbes/5044793/5038720/5084427", "text": "\nShrove Tuesday was the last day before Lent for people to get married long ago. People would wait for Shrove to get married or if not they would have to wait until after Lent. Shrove Tuesday the people long ago would go to chapel and go round the stations That night the used to have a big feast. They would have every kind of food ready to eat. Especially anything they were going to keep lent on, they would eat their fill of it that night as Lent was coming in next day.\n\n\n\nLong ago the people used to fast on the Ash Wednesday until one or two o'clock, and then if they wanted anything to eat they would make oat meal bread, but this must be wet with water, for if milk was used that time it was the same as meat. All the tea that was used had to be taken without any milk. The old people nowadays\n(continues on next page)\n", "school_info": "School: Tullycasson", "metadata": [{"Location:": "Ardvagh, Co. Cavan", "Teacher:": "\nname not given\n"}, {"Collector": "Rose Ann Mc Govern", "Gender": "female", "Address": "Tullynacross, Co. Cavan"}, {"Informant": "James Mc Govern", "Gender": "male", "Address": "Tullynacross, Co. Cavan"}, {"Language": "English"}]}, "5044793/5038722/5084440": {"title": "Smut Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0965, Page 167", "Page 167"], "url": "https://www.duchas.ie/en/cbes/5044793/5038722/5084440", "text": "\nLong ago the first Sunday of Lent was called Smutt-Sunday.  This is because any person who would not get married before Lent would wear a smutt the first Sunday of Lent.  The grown up boys generally recited verses such as-: \"When Shrove comes again, I will do my level best, to get a nice little girl in a low neck dress\".\n\n\n\nIf any person got married Shrove Tuesday, that night they had a big feast and they invited all their friends to the house.  The woman of the house generally began to make pancakes, and  they are the pancakes that would please you, if you could be pleased.\n\n\n\nThe old people had great belief in drinking black tea on Ash Wednesday.  They would not eat any food of any kind that day.  They also kept Lent on some thing that they were in the habit of taking.\n(continues on next page)\n", "school_info": "School: Tullycasson", "metadata": [{"Location:": "Ardvagh, Co. Cavan", "Teacher:": "\nname not given\n"}, {"Collector": "Mary M. Mc Grath", "Gender": "female", "Address": "Tullynacross, Co. Cavan"}, {"Informant": "Edward Fitzpatrick", "Gender": "male", "Address": "Moneensauran, Co. Cavan"}, {"Language": "English"}]}, "5044793/5038724/5084447": {"title": "Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0965, Page 169", "Page 169"], "url": "https://www.duchas.ie/en/cbes/5044793/5038724/5084447", "text": "\nShrove Tuesday is the Tuesday before Lent and it is the last day for getting married, that is any person could not get married until Lent would be out.  Every body about would be watching for the young ladies and gentlemen to get married on Shrove Tuesday but devil a much of them get wed.  Then the old men and women would be mobbing them when they did not get married. -: They say the man or woman that will get married on Shrove Tuesday will never see a poor day.  On Shrove Tuesday every body would get their hair because it is not lucky to get it cut in Lent.  They say that the hair would fall off their heads if they got it cut in Lent.\n", "school_info": "School: Tullycasson", "metadata": [{"Location:": "Ardvagh, Co. Cavan", "Teacher:": "\nname not given\n"}, {"Collector": "Mary E. Mc Govern", "Gender": "female", "Address": "Legglass, Co. Cavan"}, {"Informant": "Terence Mc Govern", "Gender": "male", "Address": "Legglass, Co. Cavan"}, {"Language": "English"}]}, "5084255/4879216/5084778": {"title": "Máirt na hInide", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0629, Page 508", "Page 508"], "url": "https://www.duchas.ie/en/cbes/5084255/4879216/5084778", "text": "\nTráthnóna Máirt na h-Inide bailigeadh buachaillí an bhaile le céile agus aon fhear nó bean ionphósta a casadh ortha sa tsráid, chaithidís téád 'na dtimcheall agus tharrainghidís ar fuaid na sráide leo iad. Deirt go mbídís 'ghá mbreith leo chun na Sceilge ach is ag magadh a bhídís.Cáit Ní LaoigleisSráid Uí Sehanacháin,Cill Ruisa fuair an scéal so ó n-a h-athair.\n\n\n\nBíonn a lán pósadh san gceanntar so an lá sin. Deineann gach duine pancóga agus cuireann siad fáinne, cipín, raol, cnaipe, bonn, píosa éadaigh isteach ionnta,An duine a gheibheann an fáinne deirtear gurb'é is luatha pósfar, an duine a gheibheann an cipín beidh sé 'na bhacach, an duine a gheibheann an cnaipe beidh sé 'na thailliúir. Is minic a éaluigheann fear le cailín an oidhche sin.Peig Ní Dhomhnaill,Sráid Uí Mhórdha,Cill Ruisfuair an t-eolas so thuas sa baile.\n", "school_info": "School: An Clochar, Cill Ruis", "metadata": [{"Location:": "Kilrush, Co. Clare", "Teacher:": "\nAn tSr. Pól\n"}, {"Collector": "Cáit Ní Laoighleis", "Gender": "female", "Address": "Kilrush, Co. Clare"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "male", "Address": "Kilrush, Co. Clare"}, {"Language": "Irish"}]}, "5084255/4879216/5084779": {"title": "Máirt na hInide", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0629, Page 508", "Page 508"], "url": "https://www.duchas.ie/en/cbes/5084255/4879216/5084779", "text": "\nTráthnóna Máirt na h-Inide bailigeadh buachaillí an bhaile le céile agus aon fhear nó bean ionphósta a casadh ortha sa tsráid, chaithidís téád 'na dtimcheall agus tharrainghidís ar fuaid na sráide leo iad. Deirt go mbídís 'ghá mbreith leo chun na Sceilge ach is ag magadh a bhídís.Cáit Ní LaoigleisSráid Uí Sehanacháin,Cill Ruisa fuair an scéal so ó n-a h-athair.\n\n\n\nBíonn a lán pósadh san gceanntar so an lá sin. Deineann gach duine pancóga agus cuireann siad fáinne, cipín, raol, cnaipe, bonn, píosa éadaigh isteach ionnta,An duine a gheibheann an fáinne deirtear gurb'é is luatha pósfar, an duine a gheibheann an cipín beidh sé 'na bhacach, an duine a gheibheann an cnaipe beidh sé 'na thailliúir. Is minic a éaluigheann fear le cailín an oidhche sin.Peig Ní Dhomhnaill,Sráid Uí Mhórdha,Cill Ruisfuair an t-eolas so thuas sa baile.\n", "school_info": "School: An Clochar, Cill Ruis", "metadata": [{"Location:": "Kilrush, Co. Clare", "Teacher:": "\nAn tSr. Pól\n"}, {"Collector": "Peig Ní Dhomhnaill", "Gender": "female", "Address": "Kilrush, Co. Clare"}, {"Language": "Irish"}]}, "5044825/5042106/5086643": {"title": "Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0975, Page 144", "Page 144"], "url": "https://www.duchas.ie/en/cbes/5044825/5042106/5086643", "text": "\nShrove Tuesday is the day before Ash Wednesday.  It is called Pancake Day.  People make pancakes on that day.  If the day is snowy people go out and gather snow and mix it with the flour instead of milk or water.On that day people try to toss a pancake without touching it.  On Shrove Tuesday people send children from house to house for the loan of a pancake sieve.  They do this for fun.It is said that it is unlucky to get married on that day until after Lent.Many old customs are still attached to this day, but many have died out.  The only custom that is kept nowadays is making pancakes.\n", "school_info": "School: Cavan (1)", "metadata": [{"Location:": "Cavan, Co. Cavan", "Teacher:": "\nS. Ní Chiaráin\n"}, {"Collector": "Muriel Moorhead", "Gender": "female", "Address": "College Street, Co. Cavan"}, {"Language": "English"}]}, "5070748/5059357/5092943": {"title": "Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0988, Page 301", "Page 301"], "url": "https://www.duchas.ie/en/cbes/5070748/5059357/5092943", "text": "\nShrove tuesday or pancake Tuesday as it is sometimes called falls on the day before Lent or Ash Wednesday. Its date varies but it is always in February or March.     On that night people have pancakes (on that) for supper. Usually charms are put in the pancakes.     A lot of weddings take place on that day, as people do not get married during Lent.\n", "school_info": "School: Baile Mhic Aodha (Ballymachugh)", "metadata": [{"Location:": "Ballymachugh, Co. Cavan", "Teacher:": "\nS. Ní Dhuinnín\n"}, {"Collector": "Phyllis Reynolds", "Gender": "female", "Address": "Woodlawn, Co. Cavan"}, {"Language": "English"}]}, "5070768/5060886/5094328": {"title": "Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0993, Page 350", "Page 350"], "url": "https://www.duchas.ie/en/cbes/5070768/5060886/5094328", "text": "\nShrove Tuesday is the day before Ash Wednesday.It is the last day before Lent and a good many people got married that day.On Shrove Tuesday it is and old custom to eat a good meal on account of the poor meals that they eat during Lent. This meal consists of pancakes, tea, bacon and eggs.This is the way pancakes are made. A big pan is cleaned and hung over the fire. Then a porringer with a little buttermilk, a pinch of salt and soda in it is got and an egg is beaten. Next flour is got and put into it also. All is then mixed together with a spoon. After this the pan is greased and the pancake is put into it and hung over the fire to bake. When it is  baked it is taken of the fire and other pancakes are made the same way.When the pancakes are baked, the bacon is fried and the tea is got ready and all the family sit round and eat a good meal.\n", "school_info": "School: Crosserlough", "metadata": [{"Location:": "Crosserlough, Co. Cavan", "Teacher:": "\nL. Reilly\n"}, {"Language": "English"}]}, "5070803/5065637/5097274": {"title": "Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1005, Page 197", "Page 197"], "url": "https://www.duchas.ie/en/cbes/5070803/5065637/5097274", "text": "\nShrove Tuesday is the day before Lent, and is usually called \"Pancake Day\" because it is a very old custom to make pancakes for that day - hence the name \"Pancake Day\". Hot-cross buns are generally made for tea also. Concerts and Danes are finished for the season on this day.\n\n\n\nAsh Wednesday is the first day of Lent and is a church holiday for some of our schools, and many people attend worship on that day . It is also a Fast Day and most people abstain from meat and milk. It is a day, however, on which people work.\n\n\n\nGood Friday is a National and Church Holiday, and also a Fast Day. People of every denomination usually attend their place of worship on that day. It is considered the saddest day in the year, and all amusements are abandoned.\n\n\n\nOn Easter Saturday preparations are being made for the Festival the following day. In olden days it was customary for the poorer people to collect eggs in this day, and on visiting the houses they asked for a \"Cludog\" - meaning eggs - which they were rarely refused.\n", "school_info": "School: Lisnagirl (1)", "metadata": [{"Location:": "Lismagiril, Co. Cavan", "Teacher:": "\nHarriett Kinkade\n"}, {"Collector": "H. Kinkade", "Gender": "female", "Occupation": "teacher"}, {"Language": "English"}]}, "5070793/5064434/5097369": {"title": "The Famine Times", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1001, Page 340", "Page 340"], "url": "https://www.duchas.ie/en/cbes/5070793/5064434/5097369", "text": "\n(continued from previous page)\nas cutting the hills in a great many places and filled the hollows with the stuff out of the cutting giving employment to to people who came a considerable distance. There did not die many people from the effects of the failure in this locality and there was not much sickness although there was an epidemic of Scarlet Fever sometimes spreading from schools as there were not such precautionary measures as at present time although it was said that sickness was rife in many districts. I believe it was due to the unsanitary state of the hovels the people lived in then. There were other periods later when the potatoes failed causing much distress in Ireland.\n\n\n\nIn olden days it was customary with the people to hold a festival on the different feasts during the year. Most of those customs are dead and\n(continues on next page)\n", "school_info": "School: Lattoon", "metadata": [{"Location:": "Lattoon, Co. Cavan", "Teacher:": "\nP. Ó Hiorraí\n"}, {"Collector": "Rose Mc Gennis", "Gender": "female", "Address": "Coragh, Co. Cavan"}, {"Informant": "Mrs Mc Gennis", "Gender": "female", "Address": "Coragh, Co. Cavan"}, {"Language": "English"}]}, "5009169/4993896/5103129": {"title": "Shrove Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0759, Page 203", "Page 203"], "url": "https://www.duchas.ie/en/cbes/5009169/4993896/5103129", "text": "\nIn my district Soran, Ballinalee, Co. Longford Shrove Tuesday is called \"Pancake Day\". It is a day of great feasting and in every house a number of pancakes are baked. The dough is left in a basin for seven hours in honour of the seven weeks of Lent.    A small party of young people are invited to a neighbour's house Shrove Tuesday night. They play all sorts of tricks and games on cards, \"Old Maid\" being the favourite game.   In olden times the Sunday after Shrove Tuesday was called \"Puss Sunday\". All the ladies wore pusses because they were not married during Shrove.\n(continues on next page)\n", "school_info": "School: Soran, Longford", "metadata": [{"Location:": "Soran, Co. Longford", "Teacher:": "\nWilfred O'Callaghan\n"}, {"Collector": "Thomas Brady", "Gender": "male", "Address": "Soran, Co. Longford"}, {"Informant": "Frank Brady", "Gender": "male", "Age": "47", "Address": "Soran, Co. Longford"}, {"Language": "English"}]}, "5009169/4993899/5103135": {"title": "Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0759, Page 206", "Page 206"], "url": "https://www.duchas.ie/en/cbes/5009169/4993899/5103135", "text": "\nIn this district long ago Shrove Tuesday was honoured by having a great feast. Pancakes, tea and toast are what the consisted of. The pancakes were made in a dish. An egg was beaten up first, then a pinch of soda and salt was thrown in and a mug of butter-milk.   The reason the people made the pancake was because the men would not ask the girls to marry and therefore they would be vexed. They would not make the bread that day and then they would have to make pancakes that night. They would not turn the pancake when it\n(continues on next page)\n", "school_info": "School: Soran, Longford", "metadata": [{"Location:": "Soran, Co. Longford", "Teacher:": "\nWilfred O'Callaghan\n"}, {"Collector": "Kathleen Lee", "Gender": "female", "Address": "Soran, Co. Longford"}, {"Informant": "James Mollaghan", "Gender": "female", "Age": "79", "Address": "Soran, Co. Longford"}, {"Language": "English"}]}, "5008912/4966247/5106172": {"title": "Pancake Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0687, Page 119", "Page 119"], "url": "https://www.duchas.ie/en/cbes/5008912/4966247/5106172", "text": "\nIt is an old custom in this part of the country to make pancakes on Shrove Tuesday.  Some time ago when the fastings were very severe the people used to make pancakes and have a big feed of them before fasting and we still have the old custom.There is a great deal of trouble in making pancakes and it takes an hour or two to make enough for all in a house as they have to be made very thin.When people are making pancakes they get a big bowl and break some eggs into it and then they put in flour and castor sugar and mix it well.It is then poured in small quantities at a time into a well greased tin and each pancake is left on the pan for a few minutes to bake.\n", "school_info": "School: Johnstown", "metadata": [{"Location:": "Johnstown, Co. Meath", "Teacher:": "\nMiss H.C. Hickie\n"}, {"Collector": "Leo Boylan", "Gender": "male", "Age": "13"}, {"Language": "English"}]}, "5008940/4968576/5109142": {"title": "May Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0694, Page 261", "Page 261"], "url": "https://www.duchas.ie/en/cbes/5008940/4968576/5109142", "text": "\n(continued from previous page)\nleading to the house, and stables. This is to keep away ill-luck, and bring good fortune.\n\n\n\nLong ago, when the family of the house were seated round the fire on a Christmas night, there would be a brack laid on the table, and a bottle of whisky. The youngest child would spill the whiskey on the brack, and then set it on fire.\n\n\n\nSome people call Shrove Tuesday, pan-cake night, because we make pan-cakes.Most people make then very thick.Long ago the people used to play a trick on people.This is the way they used to play it.They used to tell the person that came in to go to such a house and to get a pan-\n(continues on next page)\n", "school_info": "School: Ballivor", "metadata": [{"Location:": "Ballivor, Co. Meath", "Teacher:": "\nT. Ua Conmhidhe\n"}, {"Language": "English"}]}, "5070818/5067282/5110626": {"title": "St Brigid's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1010, Page 413", "Page 413"], "url": "https://www.duchas.ie/en/cbes/5070818/5067282/5110626", "text": "\nSt Brigids Day On St Brigids Eve the people around the locality made crosses of either straw or rushes. Those crosses are called St Brigids Crosses and they are made very quaintly.First of all a light lath of wood is got. About two feet long of wood is needed. Then this lath is cut into halves and made into the shape of a cross. Then either the straw or rushes is got but generally they are made of straw and sometimes there is a centre of rushes put in them. About twelve rushes or straws are sufficient for to make one cross. Then whatever material is got it is woven in and out between each little lath until the cross is completed. When the cross is finished it looks very nice. After these crosses are made they are placed outside the door on the Eve of St Brigid. It is said that St Brigid call around and blesses these crosses. This is a great custom and is carried on each year around this locality on the eve of the feast day of St Brigid.\n\n\n\nIn olden days it was customary with the people to hold a festival on the different feasts during the year. Most of those customs are dead and gone. Not much of those customs are to be found in our district\n(continues on next page)\n", "school_info": "School: The Vale (An Gleann)", "metadata": [{"Location:": "Leiter, Co. Cavan", "Teacher:": "\nS. Ó Brolcháin\n"}, {"Language": "English"}]}, "5008972/4972317/5110741": {"title": "Old Shrove-Tide", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0704, Page 012", "Page 012"], "url": "https://www.duchas.ie/en/cbes/5008972/4972317/5110741", "text": "\nOld Shrove TideLong ago it was the custom in this district with with the people to make pancakes on Shrove Tuesday. The make them out of flour and they put eggs and sometimes and sometimes butter and sugar in them. They wet them with sour milk. They had another custom for their dinner and they put a ring in it. The person who would get the ring would (the) be married before that day twelve month. They had another custom of people getting married on Shrove Tuesday because the could not get married in Lent.\n", "school_info": "School: Girley, Kells", "metadata": [{"Location:": "Girley, Co. Meath", "Teacher:": "\nMáire, Bean Uí Mhic Mheanmain\n"}, {"Collector": "Martha Conry", "Gender": "female", "Address": "Fordstown, Co. Meath"}, {"Language": "English"}]}, "5008941/4968772/5110868": {"title": "Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0694, Page 452", "Page 452"], "url": "https://www.duchas.ie/en/cbes/5008941/4968772/5110868", "text": "\nShrove TuesdayFrom Eithne Conway who  got it from her mother. Some people call Shrove Tuesday Pancake night because we make pancakes. Most people make them very thick. Long ago people used to play a trick on someone. This is the way they uses to play it. They used to say to anyone that would come in \"Go to such a house for the pancake sieve. When he'd go to that house they'd tell him to go to another house and so on. They would make him go around until he would come to the house he was in first.\n\n\n\nAnother name for Shrove is Siraft.From Mrs. Kehoe, Coolronan. She heard it from her mother. Long ago they used to call Shrove\n(continues on next page)\n", "school_info": "School: Coolronan", "metadata": [{"Location:": "Coolronan, Co. Meath", "Teacher:": "\nBean Uí Chonmhidhe\n"}, {"Collector": "Eitne Conway", "Gender": "female"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "female"}, {"Language": "English"}]}, "5008941/4968772/5110869": {"title": "Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0694, Page 452", "Page 452"], "url": "https://www.duchas.ie/en/cbes/5008941/4968772/5110869", "text": "\nShrove TuesdayFrom Eithne Conway who  got it from her mother. Some people call Shrove Tuesday Pancake night because we make pancakes. Most people make them very thick. Long ago people used to play a trick on someone. This is the way they uses to play it. They used to say to anyone that would come in \"Go to such a house for the pancake sieve. When he'd go to that house they'd tell him to go to another house and so on. They would make him go around until he would come to the house he was in first.\n\n\n\nAnother name for Shrove is Siraft.From Mrs. Kehoe, Coolronan. She heard it from her mother. Long ago they used to call Shrove\n(continues on next page)\n", "school_info": "School: Coolronan", "metadata": [{"Location:": "Coolronan, Co. Meath", "Teacher:": "\nBean Uí Chonmhidhe\n"}, {"Informant": "Mrs Kehoe", "Gender": "female", "Address": "Coolronan, Co. Meath"}, {"Language": "English"}]}, "5008978/4972971/5111494": {"title": "The Festival Customs - St Brigid's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0705, Page 175", "Page 175"], "url": "https://www.duchas.ie/en/cbes/5008978/4972971/5111494", "text": "\nIn olden times St Brigid's Day was kept as a great Feast. On St Brigids Eve people used to make crosses of rushes or straw. They would hang them over the door and in the stables, and in the roof of the houses, to bring the blessing of St. Brigid on their home.\n\n\n\nThe old custom of making pancakes on Shorve Tuesday night has still remained in Ireland. On Shrove Tuesday night the people in nearly every house have a great feast of pancakes and bacon.\n\n\n\nLong ago anyone intended to get married would do so before Chalk Sunday. If anyone who was likely to get married and did not do so\n(continues on next page)\n", "school_info": "School: Ughtyneill", "metadata": [{"Location:": "Ughtyneill, Co. Meath", "Teacher:": "\nMaighréad, Bean Uí Chinnéide\n"}, {"Language": "English"}]}, "5008978/4972973/5111517": {"title": "The Festival Customs - Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0705, Page 177", "Page 177"], "url": "https://www.duchas.ie/en/cbes/5008978/4972973/5111517", "text": "\n(continued from previous page)\nboil the eggs. This is called the clúdóg.\n\n\n\nSt. Brigid's FeastIn older times St Brigid's feast was kept as a great feast on St Brigid's Eve the people used to gather green rushes and make crosses of them and they used to have a special supper of rice that night.\n\n\n\nIt was also known as Serapt Night. It was the old custom to have pancakes, bacon, and fish for supper. This is an old saying, \"It is a lonesome Seraft without bacon\".\n", "school_info": "School: Ughtyneill", "metadata": [{"Location:": "Ughtyneill, Co. Meath", "Teacher:": "\nMaighréad, Bean Uí Chinnéide\n"}, {"Collector": "Maire Ní Gabhann", "Gender": "female", "Address": "Coolnahinch, Co. Meath"}, {"Language": "English"}]}, "5008986/4974127/5111627": {"title": "Festival Customs - St Stephen's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0708, Page 019", "Page 019"], "url": "https://www.duchas.ie/en/cbes/5008986/4974127/5111627", "text": "\n(continued from previous page)\nSome of them keep whatever money they make but the majority I am afraid, leave it in the village \"pubs\" and perhaps it is that night when they are in an exceptionally jolly mood that the \"Wren Song\" is sung. I do not know it all myself but here are a few lines:\"The Wren, the Wren, the King of all birds;St Stephen's Day, he was caught in the furze.He dipped his bill in a barrel of beerTo wish you all a happy New Year.Her body is little, but her family is greatGet up, kind lady and give us a treat.\n\n\n\nSome of the children in this locality have pic-nics on Easter Sunday. They light a huge fire on the top of a hill and make tea and boil lots of eggs.\n\n\n\nLittle girls make a \"May-bus\". They decorate a bush with bits of ribbon, coloured pieces of paper, cloth and bunches of flowers. Then they hold each others hands and dance around it singing songs and reciting etc.\n\n\n\nIn bygone days the people used to keep all the Christmas holly and make a fire of it on Shrove Tuesday night. On this fire they would bake pancakes, and a merry feast was held.\n", "school_info": "School: Carlanstown", "metadata": [{"Location:": "Carlanstown, Co. Meath", "Teacher:": "\nSéamus Ó Gérbheannaigh\n"}, {"Language": "English"}]}, "5008974/4972514/5111628": {"title": "Feast Days - St Bridget's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0704, Page 263", "Page 263"], "url": "https://www.duchas.ie/en/cbes/5008974/4972514/5111628", "text": "\nOn St Bridget's day the local people used to make crosses out of straw and sticks these they would stick in the latch so as to bring luck on the house for the coming year. It is the custom in some places to dress up and go around on St Bridgets Eve and collect money. They generally dress up and recite rhymes.The usual customs on St. Patrick's are, the people wear pieces of shamrocks and harps in their coats and caps and when they have finished with it they drowned it.\n\n\n\nOn Shrove Tuesday Eve it is a custom to make pancakes and put a ring in them and it said that he that gets the ring will be married before the year is up and Tuesday is the last day before Lent.\n", "school_info": "School: Kilskeer (B.)", "metadata": [{"Location:": "Kilskeer, Co. Meath", "Teacher:": "\nMáirtín Ó Loingsigh, R. Ó Fithcheallaigh\n"}, {"Language": "English"}]}, "5008982/4973694/5112775": {"title": "Feast-Days - Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0706, Page 515", "Page 515"], "url": "https://www.duchas.ie/en/cbes/5008982/4973694/5112775", "text": "\nThe people have a custom on Shrove Tuesday night. They make pan-cakes and fry bacon on that night. They do that, as it is an old custom on the eve of the lenten fast. They fast from bacon, for the seven weeks of lent after that.The pan-cakes are made very thin on a pan. Late on that night, the people eat the pan-cakes, and tea, and bacon.\n\n\n\nLong ago, the people used to wear green ribbons on St Patrick's day, when going to Mass.They used to wear green and gold crosses, with the harp in the centre.Other people used to wear green sashes on the right shoulder, and a bow on the left shoulder with the picture of a shamrock either in gold or white on it.A good share of men when they came home from Mass would go\n(continues on next page)\n", "school_info": "School: Maio", "metadata": [{"Location:": "Trohanny, Co. Meath", "Teacher:": "\nMáire Ní Chreaig\n"}, {"Collector": "Philip Daly", "Gender": "male", "Address": "Doon, Co. Meath"}, {"Language": "English"}]}, "5008975/4972716/5113049": {"title": "Games I Play - Pancake Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0704, Page 490", "Page 490"], "url": "https://www.duchas.ie/en/cbes/5008975/4972716/5113049", "text": "\n8. On Shrove Tuesday we have pancakes.  We have great fun to see who would get the ring that is put in them.9. The amusements I have around the fireside are, listening to some old person telling stories or listening to someone singing songs or looking at them playing cards.\n\n\n\n10. People used to catch birds by sticking a bush in a field where there were black-heads because it was there the birds used to resort mostly.  They used to put bird-lime on the twigs of the bush and they used also put some birds in a cage to attract the other birds with their songs.  When the birds outside used to hear the cage-birds singing they would fly to this bush and sing on it along with cage-birds.  When they would try to go they could not because they were fastened\n(continues on next page)\n", "school_info": "School: Kilskeer (C.)", "metadata": [{"Location:": "Kilskeer, Co. Meath", "Teacher:": "\nMáire, Bean Uí Fhithcheallaigh\n"}, {"Collector": "Bridie Smyth", "Gender": "female", "Address": "Johnsbrook, Co. Meath"}, {"Language": "English"}]}, "5008996/4975205/5114289": {"title": "My Home District", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0711, Page 238", "Page 238"], "url": "https://www.duchas.ie/en/cbes/5008996/4975205/5114289", "text": "\n(continued from previous page)\nnumerous in Randlestown. There are seven old ruins in the district. People often went to America in former times. The townland is not mentioned in any old song or saying. The land is good and dry. There are three woods in the district they are Randlestown, Woodview and Moortown. There is one river named the Yellow river and one lake named Randlestown lake. There are many streams in Randlestown. Told to Liam Snow by William Allen, aged 45\n\n\n\nOn shrove Tuesday it is the custom to make pancakes with a ring in them. The person who gets the ring will be marries before the year is out.Told to Evelyn Curran by Patrick Curran, aged 60\n\n\n\nMy home district is Proudstown. There are eight families in Proudstown. There are thirty six people between all the families. The name Melady is the most common. The most of the houses are slated with one storey in them. There are three people of over 70. They know no\n(continues on next page)\n", "school_info": "School: Kilberry", "metadata": [{"Location:": "Kilberry, Co. Meath", "Teacher:": "\n-\n"}, {"Collector": "Liam Snow", "Gender": "male"}, {"Informant": "William Allen", "Gender": "male", "Age": "45"}, {"Language": "English"}]}, "5008996/4975208/5114304": {"title": "Halloween", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0711, Page 241", "Page 241"], "url": "https://www.duchas.ie/en/cbes/5008996/4975208/5114304", "text": "\n(continued from previous page)\nget three tins, and put clay in one, and water in the second, and a ring in the third; then they blindfold themselves, and put their hands into one of the tins. If they put their hand into the clay they are going to die; if they put their into the water they are going across the sea; if they put their hand into the ring they are to be married. Other people put water into a basin then they put a penny or sixpence into the basin and duck for them.\n\n\n\nOn shrove Tuesday it is the custom to make pancakes with a ring in them. The person who gets the ring will be married before the year is out. On May day the children light candles and hang ribbons on the may bush and every one has to give a penny. It was the custom that the first person to the well on may morning and got the first can of water no body could take the butter of the churn for the year.\n", "school_info": "School: Kilberry", "metadata": [{"Location:": "Kilberry, Co. Meath", "Teacher:": "\n-\n"}, {"Collector": "Liam Snow", "Gender": "male"}, {"Informant": "William Allen", "Gender": "male", "Age": "45"}, {"Language": "English"}]}, "5009049/4981094/5116946": {"title": "May Bush Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0727, Page 151", "Page 151"], "url": "https://www.duchas.ie/en/cbes/5009049/4981094/5116946", "text": "\n(continued from previous page)\nIt is decorated with wild flowers and some times with candles. Children go around to the doors, asking a penny or a candle for the May Bush. They dance and play and sing around the bush.\n\n\n\nPotatoes mashed and mixed with onions are cooked up and served up on \"Colcannon Night\" - Last night of September.Butter is put in a little hole on top of the Colcannon.\n\n\n\nPancakes are cooked on shrove Tuesday night\n\n\n\nThe St Brigid cross of rushes is still made in the Parish. It is placed over the door, and in old houses many are found in the thatch. About 20 years\n(continues on next page)\n", "school_info": "School: Raharney (B.)", "metadata": [{"Location:": "Raharney, Co. Westmeath", "Teacher:": "\nS. Ó Conmhidhe\n"}, {"Language": "English"}]}, "5008967/4971689/5117430": {"title": "Marriages", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0702, Page 189", "Page 189"], "url": "https://www.duchas.ie/en/cbes/5008967/4971689/5117430", "text": "\n(continued from previous page)\nare very lucky. Long ago everyone used to be married on a Sunday.A couple of hundred pounds was given in marriage as a fortune. There was often very hard bargaining. If there was not enough of money, stock, as cows, calves etc were added to it to pull it up to the sum asked.Marriages used to be celebrated in the evening. There was no nuptial Mass. Rich people were married in their homes.\n\n\n\nA piece of the holly used to decorate the house at Christmas was kept over till pancake night. It was then put under the frying pan to help to cook the pancakes.\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire, Ceannanus Mór", "metadata": [{"Location:": "Kells, Co. Meath", "Teacher:": "\nMáthais Íde\n"}, {"Collector": "Philomena Usher", "Gender": "female", "Age": "12"}, {"Language": "English"}]}, "5009063/4982669/5119614": {"title": "Pancakes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0731, Page 226", "Page 226"], "url": "https://www.duchas.ie/en/cbes/5009063/4982669/5119614", "text": "\nWhen you are making pancakes you get a bason and eggs, baking powder and flour. You put the flour in the bason and put a tea-spoonful of baking powder into the flour and mix it. Then break some eggs and mix them well then put some butter-milk in it and then put a ring button and a three penny bit in. Whoever gets the ring is going to be married, whoever gets the button is going to be an old maid or a batchelor and whoever gets the threepence is going to be very rich. When the dough is made you put it in to a pan and fry it and turn it and when it is done you divide it among the family to see who will be married or be an old maid or to see who will be rich. This is done on Shrove Tuesday before Lent.Wilma Simmonds. Age 11Belvedere OrphanageTyrrellspass2-12-1938\n", "school_info": "School: Tyrrellspass (2)", "metadata": [{"Location:": "Tyrrellspass, Co. Westmeath", "Teacher:": "\nMrs Payne\n"}, {"Collector": "Wilma Simmonds", "Gender": "female", "Age": "11", "Address": "Tyrrellspass, Co. Westmeath"}, {"Language": "English"}]}, "5009008/4976620/5120890": {"title": "Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0714, Page 467", "Page 467"], "url": "https://www.duchas.ie/en/cbes/5009008/4976620/5120890", "text": "\nShrove is a usual time for weddings in this district.From Little Christmas to Shrove Tuesday is here called Shrove.Most weddings take place on Shrove Tuesday.Shrove Tuesday is also called Pancake night.Pancakes are made in nearly every house for tea. Rings are sometimes rolled in the pancakes. Whoever gets the ring will be first to be married.Colcannon is made for supper. This consists of boiled mashed potatoes, onions, pepper and salt and sometimes new milk to moisten it. It is eaten with butter.\n", "school_info": "School: Grangegeeth", "metadata": [{"Location:": "Grangegeeth, Co. Meath", "Teacher:": "\nSeósaimhín, Bean Uí Dhubhghaill\n"}, {"Language": "English"}]}, "5009126/4989167/5121407": {"title": "Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0747, Page 244", "Page 244"], "url": "https://www.duchas.ie/en/cbes/5009126/4989167/5121407", "text": "\nEaster Sunday is the end of Lent. People eat a lot of eggs on that day. Sometimes children buy Easter eggs. People get up very early on that morning to see the sun dancing as it is supposed to dance with joy.\n\n\n\nShrove Tuesday is the last day before Lent and we always have a great feast on that night. The mother makes a great big dish of pancakes and she puts a ring in the batter. Whoever gets the ring will be married first.\n\n\n\nChildren put a bit of a rag or a bit of paper behind on the coat of someone that is not looking so that everyone that sees that person would laugh at him. These are called ash bags.\n", "school_info": "School: Ballinacliffy", "metadata": [{"Location:": "Ballynacliffy, Co. Westmeath", "Teacher:": "\nA. Ní Dhubhthaigh\n"}, {"Collector": "Pat Conaughton", "Gender": "male", "Age": "13", "Address": "Muckanagh, Co. Westmeath"}, {"Informant": "Mrs Conaughton", "Gender": "female", "Age": "45", "Address": "Muckanagh, Co. Westmeath"}, {"Language": "English"}]}, "5009108/4987356/5123464": {"title": "The Twelve Days of Christmas", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0742, Page 303", "Page 303"], "url": "https://www.duchas.ie/en/cbes/5009108/4987356/5123464", "text": "\n(continued from previous page)\nwill have a fruitful lucky year in Ireland. If it is an easterly wind the English will have all the prosperity. On twelfth day people take down all their Xmas decorations. They say water is changed into wine at midnight on Little Xmas night.\n\n\n\nShrove Tuesday is the day before Ash Wednesday. People make a lot of pancakes on that day. If there are any marriagable boys or girls out on that night they put a rope about them and drag them to be married. It is the last day that people have to get married on until Lent is over.\n\n\n\nOn Ash Wednesday we cannot use milk or butter at our meals. We have to eat brown bread and black tea at the breakfast and tea. We eat potatoes and fish at the dinner. In school we hang ash bags on each others backs.\n(continues on next page)\n", "school_info": "School: Loughanvally", "metadata": [{"Location:": "Loughanavally, Co. Westmeath", "Teacher:": "\nMrs. O'Connor\n"}, {"Language": "English"}]}, "5044741/5035734/5136765": {"title": "Festival Customs - St Stephen's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0921, Page 029", "Page 029"], "url": "https://www.duchas.ie/en/cbes/5044741/5035734/5136765", "text": "\nOn Stephen's Day the \"Wren Boys\" go round. They are boys dressed up with masks and carrying a holly bush with some rags to represent the wren. They go from door to door collecting money.\n\n\n\nEverybody wears shamrock in memory of St. Patrick.\n\n\n\nBeing the last day before lent this is a great day for parties. People eat pancakes in which they have put a ring, a sixpenny bit and a button.\n\n\n\nOn May day the people dress up a bush and light candles and call it a May bush. When the candles are burnt out the bush is set afire - it is usually a gorse bush.\n", "school_info": "School: Ballinatone, Rathdrum", "metadata": [{"Location:": "Ballinatone Lower, Co. Wicklow", "Teacher:": "\nMiss Stuart, Miss Campbell\n"}, {"Collector": "Cecil Ireland", "Gender": "male", "Address": "Bahana (Whaley), Co. Wicklow"}, {"Language": "English"}]}, "5044758/5036603/5137899": {"title": "Religious Customs - November Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0925, Page 114", "Page 114"], "url": "https://www.duchas.ie/en/cbes/5044758/5036603/5137899", "text": "\nNovember night.This night parties of men, boys & sometimes women& girls dress up in old cloths, wear all kinds of masks home made and bought & set out from house to house. They bring a concertina & sometimes a fiddle and sing and dance, recite or tell a story in each house into which they are admitted. There are no special songs or dances. The usual dance is a half-sett. They collect money, fruit, nuts tc & often get supper. In west Wicklow they call themselves -as in Wexford- mummers.\n\n\n\nShrove.The only special food this night is the pancake. This custom is kept up in practically every home still, & people have a superstition that it is better to stay at home this night.\n\n\n\nIn fairs-markets and practically all buying & selling the custom of giving back some of the purchase price for luck is still practiced.\n(continues on next page)\n", "school_info": "School: Castlemacadam", "metadata": [{"Location:": "Castlemacadam, Co. Wicklow", "Teacher:": "\nWm. Ffell\n"}, {"Language": "English"}]}, "5044574/5023485/5138881": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0801, Page 319", "Page 319"], "url": "https://www.duchas.ie/en/cbes/5044574/5023485/5138881", "text": "\nIggary Biggary Buy some liccary.Bumble aor jig.Any man who wants a wife.Generally wears a wig.OUT. spells out,And out you must go.Pop.\n\n\n\nA custom celebrated in my district on Shrove Tuesday, is, to procure three plates one filled with clay, another with water, and a ring placed on the other.A person is then blindfolded and sent over to put his hand on one of the plates. If he puts his hand on the plate containing the clay, he will be buried before the next year comes. If he puts his hand on the plate containing the water he will be drowned before that time twelve months. If he puts his hand on the plate con-training the ring, he will be married before that time twelve months. Another festival held in my district is \"Hallow\n(continues on next page)\n", "school_info": "School: Ród (B.)", "metadata": [{"Location:": "Rhode, Co. Offaly", "Teacher:": "\nP. Ó Maoldomhnaigh\n"}, {"Collector": "Mary O' Rourke", "Gender": "female"}, {"Informant": "Mrs O' Rourke", "Gender": "female", "Address": "Newtown, Co. Offaly"}, {"Language": "English"}]}, "5044597/5024739/5139049": {"title": "Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0806, Page 53", "Page 53"], "url": "https://www.duchas.ie/en/cbes/5044597/5024739/5139049", "text": "\n53Shrove TuesdayShrove Tuesday falls on the first of March. The people bake pancakes on that evening and sometimes a ring or sea pence is put into it. The boys and girls get excited trying who would get ring or the money. When the tea is over and the pancakes eaten, the children play games such as, table tennis, cards, rings, and draught. The children who are friends houses go home at eight o'clock. Children get out early from school to go for messages for their mothers. People get married on shrove Tuesday.James Doyle,Davitt St,Tullamore\n", "school_info": "School: Tullamore (St. Brigid's)", "metadata": [{"Location:": "Tullamore, Co. Offaly", "Teacher:": "\nP. Sheehy\n"}, {"Collector": "James Doyle", "Gender": "male", "Address": "Tullamore, Co. Offaly"}, {"Language": "English"}]}, "5044567/5023004/5142814": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0800, Page 059", "Page 059"], "url": "https://www.duchas.ie/en/cbes/5044567/5023004/5142814", "text": "\n(continued from previous page)\nOn St. Brigid's eve many people make a little cross of wood & put it over the door of the house.\n\n\n\nOn Shrove Tuesday pancakes are made & a ring is put in each - whoever gets the ring supposed to be married in a year's time.\n(continues on next page)\n\n\n\n(continued from previous page)\nOn St Martins day some people kill a fowl & sprinkle its blood on the door post. No mill wheel is turned on St. Martin's day & no machine is worked because St. Martin was killed by a mill wheel.\n\n\n\n(continued from previous page)\nOn St. Stephen's day the wren boys travel the district singing songs, dancing & playing violins; The people give them money. They dress in very funny clothes and put vizards on their faces. They generally have some rhyme. The rhyme in this locality is:-\"The wren, the wren, the king of the birds,St Stephen's day was caught in the furze;Altho' she was small her family was great,So rise up landlady & give us a treat;We followed her up & followed her down,We followed her into Rathangan town;We broke her back & we split her bill,And we caught her on top of Kilmantic hill;Up with the kettle & down with the pan,Give us our answer & let us be gone.\n", "school_info": "School: Bracknagh (2)", "metadata": [{"Location:": "Bracknagh, Co. Offaly", "Teacher:": "\nS. Mac Giobúin\n"}, {"Informant": "William Donegan", "Gender": "male", "Age": "64", "Address": "Ballyshane, Co. Offaly"}, {"Language": "English"}]}, "5044661/5029843/5143146": {"title": "Proverbs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0903, Page 460", "Page 460"], "url": "https://www.duchas.ie/en/cbes/5044661/5029843/5143146", "text": "\n(continued from previous page)\n-selves.A stitch in time saves nine.A rolling stone gathers no moss.Two hands are better than one.Make hay while the sun shines.\n\n\n\nOn Shrove Tuesday pancakes are made and people throw them up to stick them to the ceiling. Shrove Tuesday is also called Pancake Tuesday. On Ash Wednesday ashes are blest by the priest and put on the people's forehead. The ashes are got from the palm that is left over from the previous Palm Sunday. In olden times people were not allowed to use milk on their tea. This was called black fast.\n\n\n\nEveryone puts up a Maybush on May Eve. They get a skoch and dress it up with Mayflowers. Years\n(continues on next page)\n", "school_info": "School: Drummond", "metadata": [{"Location:": "Drummin, Co. Carlow", "Teacher:": "\nP. Ó Murchadha\n"}, {"Collector": "Richard J. Gladney", "Gender": "male", "Address": "St. Mullin's, Co. Carlow"}, {"Language": "English"}]}, "5044661/5029851/5143262": {"title": "The Horse", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0903, Page 468", "Page 468"], "url": "https://www.duchas.ie/en/cbes/5044661/5029851/5143262", "text": "\nLong ago a man who lived in St Mullins had an old horse which was not able to run very fast. He called him Finn mac Cool. He brought him to some race to run. When the race started people began to laugh at the horse as he was last. Before long the horse came second and the spectators were surprised. Just coming to the winning post he got first and won the race.\n\n\n\nIt is the custom with some people in this district to mark eggs with the date of the month so that when the eggs are hatched they would know how long the chickens took to come out. Other people believe that if you set eggs on Sunday you would have no luck with them. They also put iron in the nest in which the eggs are being hatched as it is supposed to safeguard the chickens against thunder or lightning.\n\n\n\nPeople got married on Shrove Tuesday in olden times, and the married couple used to ride a cow\n(continues on next page)\n", "school_info": "School: Drummond", "metadata": [{"Location:": "Drummin, Co. Carlow", "Teacher:": "\nP. Ó Murchadha\n"}, {"Collector": "Ellie B. Murphy", "Gender": "female", "Address": "Dranagh, Co. Carlow"}, {"Language": "English"}]}, "5044661/5029852/5143264": {"title": "Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0903, Page 469", "Page 469"], "url": "https://www.duchas.ie/en/cbes/5044661/5029852/5143264", "text": "\n(continued from previous page)\nhome for breakfast. When breakfast was over all the friends gathered and danced for a couple of hours. Then the married couple would go off on their honeymoon.\n\n\n\nShrove Tuesday is the last day before Lent and so it is usually given to feasting and joy because there can be no more amusement until Easter again. That is the reason it is a \"day of pancakes\". Everyone makes and eats pancakes. It is called Shrove Tuesday because on that day everyone is supposed to go to confession to be shriven or forgiven their sins in preparation for the Holy season of Lent. In Ireland Shrove Tuesday is a great day for marriages as they are forbidden in Lent. There is usually great fun, joy and dancing at these weddings.\n\n\n\nThere is but one holy well St Moling's well in this parish. It got its name from St Moling. The 17th June is St Moling's day. It was the custom long ago to visit the well on that day and do the pilgrimage but very few people visit it on that day now. A man from Kilkenny who was blind of one eye came some\n(continues on next page)\n", "school_info": "School: Drummond", "metadata": [{"Location:": "Drummin, Co. Carlow", "Teacher:": "\nP. Ó Murchadha\n"}, {"Collector": "Daniel Fluskey", "Gender": "male"}, {"Language": "English"}]}, "4798761/4796088/5148470": {"title": "Ainmhí Allta", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0298, Page 018", "Page 018"], "url": "https://www.duchas.ie/en/cbes/4798761/4796088/5148470", "text": "\n(continued from previous page)\néigin agus chuir sé a chos suas d'on bfear bí tor aitinn ar a chos agus do bhain an fear é amach agus chuaidh sé tslighe. Tamall indhiadh sin fuar an fear cos tinn agus ana-tinn ar fad. Tháinig an sionnach arís go dtí an fea r agus do chuir sé a chos ar a ghlúin agus d'fan sé go dtí go teasbáint an fear an cos tinn do agus do lighe í agus bhí sé slán arís agus deirtear gur dealg no píosa[?] gloine a bhí in-a gcois.\n\n\n\nShrove begins on the 6th of January and ends on Ash Wednesday. It was during this period in former years most of the marriages were celebrated in the rural districts. It was the custom for a man to go to any house where there was a girl of marriageable age and suggest the name of a certain man. This was known as match-making and the[?] man who went to the house was known as a match-maker.    A few days after, the parents of the\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire (Convent of Mercy)", "metadata": [{"Location:": "Skibbereen, Co. Cork", "Teacher:": "\nNa Siúracha\n"}, {"Collector": "Nora Ní Airtnéadaigh", "Gender": "female", "Address": "Aghills, Co. Cork"}, {"Informant": "Nóra Ní Airtnéadaigh", "Relation": "parent", "Gender": "female", "Age": "60", "Address": "Aghills, Co. Cork"}, {"Language": "English"}]}, "4798762/4796125/5149095": {"title": "Old Customs of Shrove Tuesday in Skibbereen, Co. Cork", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0298, Page 055", "Page 055"], "url": "https://www.duchas.ie/en/cbes/4798762/4796125/5149095", "text": "\n30 years ago.On that night \"Crackers\" (made of lead piping with powder, and fuse) were exploded in the streets of the town. Sometimes, these were thrown into shops and exploded with great noise.\"The townspeople gathered on the Square, and there a \"fireball\" made of rags, and soaked in paraffin oil was kicked by the young men and boys.\" The crackers were exploded here also. then a donkey would run madly down North Street followed by yelling youngsters who had tied an old tin can to his tail.  It was the usual custom that many couples were married on this day. There were often nine or ten weddings in the Catholic Church on this day.The \"Sceilg List\" was composed by the local wits on this night, and copies sent to parties who had not changed their state during the Shrove.All these customs recorded above are now defunct.\n", "school_info": "School: Tráigh Omna", "metadata": [{"Location:": "Drishanemore, Co. Cork", "Teacher:": "\nMícheál Ó Dálaigh\n"}, {"Collector": "Mícheál S. Ó Dálaigh", "Gender": "male"}, {"Language": "English"}]}, "4798759/4796037/5150157": {"title": "Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0297, Page 202", "Page 202"], "url": "https://www.duchas.ie/en/cbes/4798759/4796037/5150157", "text": "\nThis is called Mairc [?] in Irish.It is said that all the unmarried men and women have to go to Sceilg Micil on that night as a penance for not having got married during the Shrove.The 1st of April is called La na n-Amadan or All Fool's Day. People delight in making fools of others on that day.The 24th of June is St John's Day or La Sain Senen. On the Night before called [?] Sain Senin large fires called bonfires\n(continues on next page)\n", "school_info": "School: An Sciobairín", "metadata": [{"Location:": "Skibbereen, Co. Cork", "Teacher:": "\nMicheál Ó Cuileanáin\n"}, {"Collector": "Liam Ó Nualláin", "Gender": "male"}, {"Language": "English"}]}, "4921641/4887243/5152505": {"title": "Good Friday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0313, Page 037", "Page 037"], "url": "https://www.duchas.ie/en/cbes/4921641/4887243/5152505", "text": "\nGood Friday.1. Clothes must not be washed on that day.2. Milk should not be given away for free on that day.3. It is an old saying in this district that if a person falls sick on Good Friday he will not recover.\n\n\n\nShrove.1. Shrovetide begins on St. Stephen's Day and ends on Shrove Tuesday. This is a great time for matchmaking and marriages in country districts. 2. Pancakes are made for tea on Shrove Tuesday night.\n\n\n\nSt. Bridgid's Day.It is a custom to put a white cloth on a tree on that night.\n\n\n\n1.Everyone that can afford it has a \"November barm-brack\" for supper. Games are played with apples and nuts. A tub of water is placed in the middle of the floor. Some apples are put in\n(continues on next page)\n", "school_info": "School: Barr Liath, Droichead Banndan", "metadata": [{"Location:": "Baurleigh, Co. Cork", "Teacher:": "\nEibhlín Nic Gearailt\n"}, {"Language": "English"}]}, "4921693/4890647/5153753": {"title": "Shrove", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0324, Page 260", "Page 260"], "url": "https://www.duchas.ie/en/cbes/4921693/4890647/5153753", "text": "\nLong ago all the people used go to Millstreet fair on the sixth of January, which is the start of shrove \"to put their name on the book\" as they intended to look for a suitable partner in marriage. The parties that tried to get married and did not succeed in doing so were supposed to go to kiss the Sceilig's Rocks as a punishment for not getting married.The sceilig's Rocks are situated in the Kerry seaboard.  There would be\n(continues on next page)\n", "school_info": "School: Cnoc an Chuilinn, An Ráth Mhór", "metadata": [{"Location:": "Caherbarnagh, Co. Cork", "Teacher:": "\nNóra, Bean Uí Dhuinnín\n"}, {"Collector": "Jack Murphy", "Gender": "male", "Address": "Knocknaloman, Co. Cork"}, {"Informant": "Alexander O Sullivan", "Relation": "grandparent", "Gender": "male", "Age": "73", "Address": "Knocknaloman, Co. Cork"}, {"Language": "English"}]}, "4921638/4887124/5154101": {"title": "Religious - Shrove", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0312, Page 226", "Page 226"], "url": "https://www.duchas.ie/en/cbes/4921638/4887124/5154101", "text": "\nSkellig lists were published pairing single girls with elligible men. There were very often most unsuitable + unlikely pairs + often scathing remarks were made of the parties. Sometimes the men + girls were flattered + received compliments. The lists took the form of poetry.Shrove Tuesday night the boys went out with long ropes + when the girls came along they were caught in the ropes + dragged off to Skellig.Boys stood at the street corners armed with bags of soot or flour + when bachelors or maidens came along these were thrown at them.\n", "school_info": "School: Cill Moluda, Clanna Caoilte", "metadata": [{"Location:": "Kilmaloda, Co. Cork", "Teacher:": "\nLaura Nugent\n"}, {"Informant": "Mrs Nugent", "Gender": "female", "Age": "78", "Address": "Kilmaloda, Co. Cork"}, {"Language": "English"}]}, "4921915/4910716/5165311": {"title": "Festivals - Shrove", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0395, Page 030", "Page 030"], "url": "https://www.duchas.ie/en/cbes/4921915/4910716/5165311", "text": "\nIt is the custom on Shrove Tuesday night for people to make pancakes. This custom is still kept up and on Shrove Tuesday night the woman of the house makes pancakes for the supper.On Shrove Tuesday night a crowd of boys dress up in old clothes. They go around to the houses where an old maid or an old bachelor lives. They make an old woman for the bachelor by getting a turnip for the head and a bag of straw for the body. They dress it in old clothes and they put it up on the pier. For the old maid they make an old man. This is called the Stócach. Sometimes they make an old man or an old woman on the wall with paint. This is often very annoying because it is very hard to remove the stains.\n", "school_info": "School: Churchtown (Baile an Teampoill)", "metadata": [{"Location:": "Churchtown, Co. Cork", "Teacher:": "\nLiam Ó Briain\n"}, {"Language": "English"}]}, "4921915/4910717/5165314": {"title": "Festivals - Shrove", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0395, Page 031", "Page 031"], "url": "https://www.duchas.ie/en/cbes/4921915/4910717/5165314", "text": "\nShrove is the time when those who intend to get married marry. The old customs of Shrove are still carried out. On Shrove Tuesday night or pancake night the people in the country make pancakes for the supper.When the people of the houses are gone to bed on Shrove Tuesday a crowd of boys make a couple of Stocachs. Then they go to the houses where there are old maids or old bachelors and they put up a Stocach for each old maid and bachelor. Sometimes they put the Stocach on the pier or standing against the door and when the people of the house open the door in the morning the Stocach falls into the kitchen. Sometimes the boys paint a man on the wall of the house with tar. That is still more annoying as it is very hard to clean the tar off the wall. These customs are still carried out.When the boys are making a Stocach they get two flat pieces of\n(continues on next page)\n", "school_info": "School: Churchtown (Baile an Teampoill)", "metadata": [{"Location:": "Churchtown, Co. Cork", "Teacher:": "\nLiam Ó Briain\n"}, {"Collector": "Patrick Walshe", "Gender": "male", "Address": "Ballymacotter, Co. Cork"}, {"Language": "English"}]}, "4921916/4910811/5165423": {"title": "Shrove Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0395, Page 125", "Page 125"], "url": "https://www.duchas.ie/en/cbes/4921916/4910811/5165423", "text": "", "school_info": "School: Cill Mathúna", "metadata": [{"Location:": "Shanagarry, Co. Cork", "Teacher:": "\nC. Ó Muirighthe\n"}, {"Informant": "Patrick Maguire", "Gender": "male"}, {"Language": "English"}]}, "5008944/4969038/5167503": {"title": "Old Festival Customs - St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0695, Page 247", "Page 247"], "url": "https://www.duchas.ie/en/cbes/5008944/4969038/5167503", "text": "\nThe 17th March is St. Patrick's Day. The people wear shamrock on that day. There is also Irish music, and Irish concerts that day.\n\n\n\nOn Shrove Tuesday all the people make some pan-cakes. There is a ring put in them and children have great fun trying to get the ring.\n\n\n\nOn St Brigid's  Day the children dress up the dash of a churn, and go from house to house with it. They dance with the dash in their hands. This is called the Brideóg. This custom is not carried out in my district at present.\n\n\n\nOn Ash Wednesday the people go to the Church to get Blessed ashes on their\n(continues on next page)\n", "school_info": "School: Cloncarneel", "metadata": [{"Location:": "Cloncarneel, Co. Meath", "Teacher:": "\nMáire, Bean Uí Bhreacáin\n"}, {"Collector": "Janie Dunne", "Gender": "female", "Address": "Corballis, Co. Meath"}, {"Language": "English"}]}, "4921913/4900158/5168456": {"title": "Pancake Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0394, Page 136", "Page 136"], "url": "https://www.duchas.ie/en/cbes/4921913/4900158/5168456", "text": "\nLast Tuesday night was Pancake night. It was the first day of March. Pancakes are made of flour, and milk, and eggs, and sugar, and they mix them all together in a disk. I like pancakes very much. Pancakes are measured by a cup and are then put in the frying pan. They are left in the frying pan for ten minutes, five minutes on each side. They are then left to cool and when they are cool, sugar is spread on them and they are eaten then.\n\n\n\nThe \"Brúgh Daol.\" a well in the vicinity of the Parochial House was the place where the people of Cloyne got their water supply before the present system was installed. People live to this day who drew water + sold it to the inhabitants for a halfpenny a jug. A trout was in the well + it is said that if anybody, who suffered from any disease, went to the well one each of three successive mornings + saw the trout on each morning at the same time he or she would be cured. The water of this well was remarkably cool.\n", "school_info": "School: Baile Choitín (C.)", "metadata": [{"Location:": "Ballycotton, Co. Cork", "Teacher:": "\nCaitlín Ní Rignigh\n"}, {"Language": "English"}]}, "4921914/4900192/5168515": {"title": "Festival Customs - Halloween", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0394, Page 168", "Page 168"], "url": "https://www.duchas.ie/en/cbes/4921914/4900192/5168515", "text": "\n(continued from previous page)\n[-]\n\n\n\nLong ago, the people of Cloyne had many customs on Shrove Tuesday. They always had pancakes for tea. All the young people of the house wanted a piece of the first pancake. This they put under their pillow that night. It was then said that the person they dreamt of that night would be their future husband or wife. This old custom is still kept up. Another custom which they had was to take people who were out after a certain hour to \"shelig\" which was a sheep-pond up in Salleen. A number of men stole\n(continues on next page)\n", "school_info": "School: Cluain Uamha (C.)", "metadata": [{"Location:": "Cloyne, Co. Cork", "Teacher:": "\nE. Geeleher\n"}, {"Collector": "Esther Meany", "Gender": "female", "Address": "Cloyne, Co. Cork"}, {"Informant": "Mr T. Canavan", "Gender": "male", "Address": "Cloyne, Co. Cork"}, {"Language": "English"}]}, "4921914/4900198/5168526": {"title": "Festival Customs - All Souls' Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0394, Page 174", "Page 174"], "url": "https://www.duchas.ie/en/cbes/4921914/4900198/5168526", "text": "\n(continued from previous page)\nroad. She bade them \"good morning\" but they never answered her. She also noticed that they all carried bags on their backs. When she arrived at the market she told the people what she saw. Then the people told her that they were the souls doing penance, she met, and the bags on their backs were the bags of sins.\n\n\n\nShrove Tuesday (match making). Another very old custom long ago was match-making. It wasn't only the people themselves that were engaged making the match, but several other people. The girl would have her clothes a few weeks before it took place. The match may not be made until twelve o'clock at night and the pair would be\n(continues on next page)\n", "school_info": "School: Cluain Uamha (C.)", "metadata": [{"Location:": "Cloyne, Co. Cork", "Teacher:": "\nE. Geeleher\n"}, {"Collector": "Mary Eliza Driscoll", "Gender": "female"}, {"Informant": "Mrs Barry", "Gender": "female", "Address": "Cloyne, Co. Cork"}, {"Language": "English"}]}, "4921780/4906560/5178041": {"title": "Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0362, Page 228", "Page 228"], "url": "https://www.duchas.ie/en/cbes/4921780/4906560/5178041", "text": "\nMy aunt baked pan-cakes on Shrove Tuesday night.  They were very nice.  She used eggs, flour, butter, milk, baking-soda and salt in the making of them and she baked them in a pan.  We did not eat any of them on Ash Wednesday as we kept the fast as in olden times, but we used a little milk in our tea and even that was not used in olden times.There are very few marriages taking place at present on Shrove Tuesday as the people get married at any time now except Lent.In olden times there used be a great many marriages on Shrove Tuesday and very few would go away on their honey-moon.  They would spend it at home and have a great all night party.  The straw boys would visit them too.\n", "school_info": "School: An Gleantán, Lombardstown", "metadata": [{"Location:": "Glantane, Co. Cork", "Teacher:": "\nTomás Ó Colmáin\n"}, {"Collector": "Charlotte Mac Carthy", "Gender": "female", "Address": "Glantane, Co. Cork"}, {"Informant": "Mr Michael Desmond", "Gender": "male", "Address": "Skarragh, Co. Cork"}, {"Language": "English"}]}, "4921785/4906929/5178684": {"title": "Shrove", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0364, Page 145", "Page 145"], "url": "https://www.duchas.ie/en/cbes/4921785/4906929/5178684", "text": "\nIn this district marriages generally take place during Shrove. The last day of Shrove always falls on a Tuesday and is known as \"Shrove Tuesday\". There are certain days and months of the year that are said to be unlucky for getting married. These months are in Lent and advent and the month of May. Monday, Wednesday and Friday are the unlucky days. Long ago when an old maid or bachelor was not inclined to get married the neighbours were always sending them to \"Sculz\" which are huge rocks outside Kerry. There were also old customs carried on Shrove Tuesday night. One of these was the pancake making. These pancakes were made from a little flour, cream, eggs and sugar.  These ingredients were poured into an oven when in a liquid state and were then left bake for about ten minutes. Long ago matches were made in this district by an old man named Seán na brísze leaisir. This man was asked to each wedding and also got a few shillings for making the match. The bride and bridegroom and their followers went at that\n", "school_info": "School: Glaise Buí, Malla", "metadata": [{"Location:": "Glashaboy East, Co. Cork", "Teacher:": "\nConchobhar Ó Drisceoil\n"}, {"Informant": "Mrs Dan Cremin", "Gender": "female", "Address": "Knockavaddra, Co. Cork"}, {"Language": "English"}]}, "4921733/4901409/5180454": {"title": "The Drag", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0351, Page 178", "Page 178"], "url": "https://www.duchas.ie/en/cbes/4921733/4901409/5180454", "text": "\n(continued from previous page)\nlast car. The people in the sidecars also had a race to the church, and many the time some of the cars were turned and the people thrown out around the road, when they were crossing each other out.   Very funny things happened at weddings sometimes. Last Shrove Tuesday, twelve months. Laurence Keating of Stagmount was in the Drag, at Mary Murphy's marriage. He was so taken up trying to pass out his neighbour, that he never noticed his wife fell out, when he was going over a heap of stones, and didn't miss her until he reached the church.\n\n\n\nOn the first day of Shrove, some girls go to a lime-kiln and drop down a ball of thread, holding the end of it in their hand. Then they start to wind up the thread. After a while the thread is supposed to be held by her future husband. She asks who holds the thread and he will give his name.   They brush round the stack of oats 3 times, and their future husband is supposed to appear to them.\n(continues on next page)\n", "school_info": "School: Séipéal na Carraige", "metadata": [{"Location:": "Rockchapel, Co. Cork", "Teacher:": "\nDonncha Ó Géibheannaigh\n"}, {"Language": "English"}]}, "4921901/4899528/5182482": {"title": "Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0392, Page 006", "Page 006"], "url": "https://www.duchas.ie/en/cbes/4921901/4899528/5182482", "text": "\nEvery Shrove Tuesday my mother makes pancakes. Long ago the people used to play games and have sport in their houses. Some of the men of the house used to go out with ropes, and bring in the neighbours. Every Shrove Tuesday my mother gives us nuts and pancakes. She makes the pancakes with milk, and eggs, and flour. She makes about six dozen pancakes every Shrove Tuesday. Long ago the neighbours used to go to the neighbouring houses. The old people used to have dances and songs and music on Shrove Tuesday night. Long ago a certain man named Jackie the Lantern used to go around on Shrove Tuesday night. He used to have a lantern with him. Every person that he would catch, he would lead them astray. When the people would see the light, they would get dazzled from it.\n", "school_info": "School: Carrigaline (B.)", "metadata": [{"Location:": "Carrigaline, Co. Cork", "Teacher:": "\nJohn Wrin\n"}, {"Collector": "William Dennehy", "Gender": "male", "Address": "Carrigaline, Co. Cork"}, {"Informant": "Mrs O' Driscoll", "Gender": "female", "Age": "70", "Address": "Carrigaline, Co. Cork"}, {"Language": "English"}]}, "4921821/4909241/5182726": {"title": "Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0373, Page 206", "Page 206"], "url": "https://www.duchas.ie/en/cbes/4921821/4909241/5182726", "text": "\nThis night was called Sceilig's night. Boys used gather together in groups of six or seven and any girls who were not married on that day were taken to Sceiligs. Sceiligs was to take them with a rope round them to the nearest pump to hold them under the pump and let the water run on them. This night was also called pancake night. People honoured it by feasting on pancakes.\n", "school_info": "School: Currach an Ghála, Cill Úird", "metadata": [{"Location:": "Kilworth, Co. Cork", "Teacher:": "\nMáiréad, Bean Uí Shúilleabháin\n"}, {"Language": "English"}]}, "4921724/4893906/5183608": {"title": "Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0349, Page 223", "Page 223"], "url": "https://www.duchas.ie/en/cbes/4921724/4893906/5183608", "text": "\nIn years gone by Shrove Tuesday was a very interesting feast. The farmers especially made matches for their sons and daughters and got them married at Shrove. The local boys used visit the houses and take out all the unmarried girls and carry them to Skellig: Here in Blarney the ball-alley, which is in the lower village, was the Skellig of this district. They used have great sport playing mouthorgans, accordians, and singing, and would finish up with a good dance.The younger members of the community used look forward to teatime and even yet we all do, because our mothers make pancakes on that night. It is great sport tossing the pancake.Denis Linehan,11 Shamrock Tce, Blarney, Co. CorkMr J.D. Linehan, 11 Shamrock Tce, (51 yrs)\n", "school_info": "School: Colthurst, An Bhlárna", "metadata": [{"Location:": "Blarney, Co. Cork", "Teacher:": "\nS. Ó Laoghaire\n"}, {"Collector": "Denis Linehan", "Gender": "male", "Address": "Blarney, Co. Cork"}, {"Informant": "Mr J. D. Linehan", "Gender": "male", "Age": "51", "Address": "Blarney, Co. Cork"}, {"Language": "English"}]}, "4921840/4895807/5184874": {"title": "Festival Customs - Shrove", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0377, Page 216", "Page 216"], "url": "https://www.duchas.ie/en/cbes/4921840/4895807/5184874", "text": "\nShrove commences on the 6th of January and ends on Shrove Tuesday.In former times it was part of the year when most marriages took place, especially in country districts. The wedding party generally arrived at the church in the evening long ago. Now they generally take place in the morning. Any pair who were fit to get married and did not on Shrove Tuesday were brought to \"sceilg\" and threatened to be drowned and often got a good ducking. This custom has died out now and it is no loss.Long ago there was a fair held in Mallow on Shrove Tuesday and it was called the \"runaway fair'. It was called this name because a number of pairs used go to this fair and in the evening run away and get married.Up to the present day pancakes are made on Shrove Tuesday. On that night there is great feasting for the young folk.\n", "school_info": "School: An Ghráinseach, Mainistir Fhearmuighe", "metadata": [{"Location:": "Grange West, Co. Cork", "Teacher:": "\nPádraig Ó Díomsaigh\n"}, {"Collector": "Bridget O' Donnell", "Gender": "female", "Address": "Grange West, Co. Cork"}, {"Informant": "Mrs O' Donnell", "Gender": "female", "Age": "42", "Address": "Grange West, Co. Cork"}, {"Language": "English"}]}, "5177598/5172092/5185332": {"title": "Feast of Saint Patrick", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0585, Page 059", "Page 059"], "url": "https://www.duchas.ie/en/cbes/5177598/5172092/5185332", "text": "\nThe feast of St. Patrick is celebrated on the 17th March. It is a day of rejoicing at home and abroad.At home it is marked by celebrations pagents and processions - everything is done to do honour to Ireland's greatest Saint. It is a day on which the Irish exile turns his thoughts homewards, where with that the \"inward eye he plucks the green little shamrock from his native heath.The tender plants is displayed by  young and old, and the cailins tie their swinging plaits with bands of emerald green. It is a day of goodwill amongst the Gael and the old dissensions are forgotten when they \" drown the sharmrock \"  in the local public house.People who are abstaining from drink for the Lenten Season usually indulge heavily on \" Paddys day \". It is the belief that every drink taken merits a reward and adds to the glory and memory of St. Patricks on drinking each others health it is customary to say \"Saint Patricks pot he'll forget us not\". This saying is attributed to the belief that the saint has the privilegs of judging the Irish on the day of general judgment.\n\n\n\nShrove Tuesday is the day preceding Ash Wednesday of the Lenten Season. It is the last day of Shrove\n(continues on next page)\n", "school_info": "School: Clonlara", "metadata": [{"Location:": "Cloonlara, Co. Clare", "Teacher:": "\nDll. Ó Heoghanáin\n"}, {"Collector": "Josie Moloney", "Gender": "female", "Address": "Cloonlara, Co. Clare"}, {"Informant": "Tim Mc Inerney", "Gender": "male", "Age": "54", "Occupation": "labourer", "Address": "Mountcatherine, Co. Clare"}, {"Language": "English"}]}, "5177598/5172167/5185535": {"title": "Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0585, Page 134", "Page 134"], "url": "https://www.duchas.ie/en/cbes/5177598/5172167/5185535", "text": "\nShrove Tuesday is the day preceding Ash Wednesday of the Lenten Season.  It is the last day of Shrove and as marriages are not permitted during Lent it is a day of surprises and expectations a great number of marriages are celebrated on that day and the strains of music can be heard from many cabins where the young married couple and their friends are celebrating the occasion.Country people look upon it a day of surprises.  Bashful men who have been \"paying respects\" to some young lady are inclined to summon all their courage on Pancake night and ask her for her hand in marriage.  The astute girl is also inclined to give him encouragement, with profitable results.  This leads to many marriages which the local people have not expected and consequently give much food for \"gossip\".  What are locally known as \"runaways\" are quite common on Shrove Tuesday.  When the consent of the parents is withheld the boy and girl often elope and this gives rise to the term \"runaway\".Marriageable ladies whose prospects of\n(continues on next page)\n", "school_info": "School: Clonlara", "metadata": [{"Location:": "Cloonlara, Co. Clare", "Teacher:": "\nDll. Ó Heoghanáin\n"}, {"Collector": "Kitty Hamilton", "Gender": "female", "Address": "Cloonlara, Co. Clare"}, {"Informant": "Martin Moloney", "Gender": "male", "Age": "60", "Occupation": "farmer", "Address": "Cloonlara, Co. Clare"}, {"Language": "English"}]}, "4921856/4896642/5189735": {"title": "Shrove and its Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0382, Page 084", "Page 084"], "url": "https://www.duchas.ie/en/cbes/4921856/4896642/5189735", "text": "\nShrove begins the day after Little Christmas and ends on Shrove Tuesday.  They call the first sunday in Shrove \"The Look out Sunday,\" because they say that the boys and girls who are of marriageable age are looking out for a suitable spouse on that day.  About twenty years ago they used to make many matched between people in Shrove, and there used to be several marriages during that period.The Match.- There was a certain old man in each district who was very good for making matches  If there was a famer's daughter of marriageable and if she had a \"fortune\", and if her father knew a young farmer who had a farm he would send this messenger to the father of the young man to know if he was satisfied to take in his own daughter, as a wife for his own son.  Sometimes they might ask the son himself if he would be satisfied.  Then the messenger would praise the young girl.  Then they would ask him what \"fortune\" she had and he would tell them.  Then if they were all satisfied, they would name a special day to meet at a fair or at a market to start the match.  That day they would come together in some public house, and they used to have great discussion, the father and mother of the young couple would be there, and the young couple themselves and relatives from both sides.  Sometimes they might be arguing for an hour or two over five or ten pounds of the \"fortune\".  Then\n(continues on next page)\n", "school_info": "School: Cnoc na Biolaraighe", "metadata": [{"Location:": "Watergrasshill, Co. Cork", "Teacher:": "\nDll. Mac Carrthaigh\n"}, {"Collector": "Crissie O Riordan", "Gender": "female", "Address": "Skahanagh South, Co. Cork"}, {"Informant": "Patrick O' Riordan", "Relation": "parent", "Gender": "male", "Age": "circa 60"}, {"Language": "English"}]}, "4921818/4895319/5190860": {"title": "Shrove", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0372, Page 374", "Page 374"], "url": "https://www.duchas.ie/en/cbes/4921818/4895319/5190860", "text": "\nShroveShrove is from January 6th till Shrove Tuesday, the day before Ash Wednesday.Many people get married in Shrove especially farmers.When a girl is to get married her father and some men go match - making to the residence of the young man whom they intend the girl to marry.They walk all his farm, look at his cattle, horses, and pigs, and all the value he has.They examine the dwelling house.They then see how much money it is worth.The match - making lasts all night.They have a very pleasant time.They have plenty whiskey and all kinds of eating and drinking.About a week after this the young man comes to the girls house to know would they like each other.They discuss there the day that they will go to buy their wedding style and the ring.The young man comes to the girls house two or three times before they are married.The girl decides the day they will get married.They then arrange with the Priest.The day that they get married the young man and the girl meet at the Church with a crowd of friends from each side.When the marriage ceremony is over\n(continues on next page)\n", "school_info": "School: Béal Átha hUbhla (C.)", "metadata": [{"Location:": "Ballyhooly, Co. Cork", "Teacher:": "\nMáire, Bean Uí Chaoimh\n"}, {"Collector": "Peggie Lombard", "Gender": "male", "Address": "Killathy, Co. Cork"}, {"Informant": "David Lombard", "Gender": "male", "Age": "80", "Address": "Killathy, Co. Cork"}, {"Language": "English"}]}, "5177611/5173159/5192992": {"title": "Shrovetide", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0588, Page 167", "Page 167"], "url": "https://www.duchas.ie/en/cbes/5177611/5173159/5192992", "text": "\nShrovetide is a period from the sixth of January to Ash Wednesday and it is a time in which matches and marriages take place.Before a marriage takes place a friend to either of the parties go and introduce the match. If the parents are satisfied they meet in town and fix about the fortune. Then the land \"is walked\" and the day is fixed for the marriage. After the marriage the couple go away on a honeymoon for about a month and when they come home a dance is given.Wednesdays are the favourite days on which people get married. It is counted unlucky for a girl to marry in green or to tear her dress on the wedding day or to meet her mother the first Sunday after coming home, or to meet a funeral on the day of the marriage.\n", "school_info": "School: Carrowbawn, Cill Dá Lua", "metadata": [{"Location:": "Carrowbaun, Co. Clare", "Teacher:": "\nMáire, Bean Uí Ghadhnair\n"}, {"Language": "English"}]}, "4921807/4909026/5196998": {"title": "Shrove", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0369, Page 689", "Page 689"], "url": "https://www.duchas.ie/en/cbes/4921807/4909026/5196998", "text": "\nThe period of the year between the feast of the Epiphany and Ash Wednesday is called \"Shrove\". It is during this time that most local marriages take place. This is due to the great fact that the Catholic Church forbids marriages to be solemnised during Lent. In the country the season is better known as the \"Match making season\". Match making means arrangements made for the marriage of certain people,  by their friends or well wishers. In many cases indeed the parties to be married may never have met before. If a girl for instance has a fortune say of £400 somebody would suggest her marrying a man who would have a farm worth that much money. Then word would be sent to some such man and if he agreed to marry, the couple would meet somewhere usually in a solicitors office where they would come to mutual agreement as to paying of\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire, Malla", "metadata": [{"Location:": "Mallow, Co. Cork", "Teacher:": "\nNa Siúracha\n"}, {"Informant": "Mary Ann Callaghan", "Gender": "female", "Address": "Mallow, Co. Cork"}, {"Language": "English"}]}, "5162147/5158697/5198046": {"title": "Féilte na Bliana", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0633, Page 237", "Page 237"], "url": "https://www.duchas.ie/en/cbes/5162147/5158697/5198046", "text": "\n(continued from previous page)\nbeannuighthe agus chuir sé capall ag treabhadh ar Lá Fhéile Mháirtín. Sar i bhfad bhris sé an cuing, cuir sé cuing eile ann agus briseadh arís í. Cuir sé cuing íarainn ann acht do briseadh í freisin. Sa deire bhris a capall a chos agus b'eigin do éirghe as an dtreabhadh. Ar seisean, \"Ní h-aon dóichín é Máirtín\".Fear eile d'éirig tuirseach de'n nós (gan capall d'oibriú ar an lá sin) Bhí sé gan obair a dheanamh go ceann cúpla bhlían acht ar an Lá Fhéile Mháirtín do thosnuig sé ag obair. Do bhris an capall a cos. Oibríghtear na capaill anois agus ní thagann aon tionoisc ortha de bhárr na h-oibre sin. Doirteann gach fear a' tíghe fuil éin tíghe. Leantar de'n nós sin gan teip. Is minic a marbuighthí bó fadó in onóir Mháirtín.Séamus Ó ScannlaínSéamus Ó h-EocaidheDonnchad Ó CoileaínDún Átha (go léír)\n\n\n\nPancakes made in each house. Whoever got ring would be first of children to be married. Children wrote a verse and hung it in a prominent position in the school room where teacher would see it.\"Dear Mr.--- be faithful and kind,Don't let the pancakes out of your mind,When you were young you liked fair play,So Dear Mr.-- give us a half day\".This was a regular custom in Kilkee Boys' School.\n", "school_info": "School: Dún Átha, Carraig an Chabhaltaigh", "metadata": [{"Location:": "Doonaha, Co. Clare", "Teacher:": "\nEd J. Headtromóin\n"}, {"Language": "English"}]}, "5177627/5174065/5199441": {"title": "Shrovetide", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0592, Page 015", "Page 015"], "url": "https://www.duchas.ie/en/cbes/5177627/5174065/5199441", "text": "\nIn Shrove, that period of time from Little Christmas day to Ash Wednesday, most marriages took place in Ireland. Parents during this time made matches for their marriageable sons and daughters. There is usually a lucky old man in every district that is sent with the word of the match.Long ago he used to drink much whiskey before he would start on his journey and he would always carry a black thorn stick with him as a token of luck. Sometimes an old boot was thrown after him for luck also.If the people were pleased they would appoint a day to meet in the nearest town. It is usually in a public house they meet and they discuss the girls fortune and if everything goes on wel when they are departing they appoint a day as is said locally \"to walk the land\" which means\n(continues on next page)\n", "school_info": "School: Cooleenbridge, Scariff", "metadata": [{"Location:": "Poulagower, Co. Clare", "Teacher:": "\nT. Mac Seóín\n"}, {"Collector": "Mary Kate Treacy", "Gender": "female", "Address": "Scarriff, Co. Clare"}, {"Language": "English"}]}, "5162106/5154801/5200661": {"title": "Shrove Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0246, Page 049", "Page 049"], "url": "https://www.duchas.ie/en/cbes/5162106/5154801/5200661", "text": "\nThere are many old customs connected with the season of Shrove which begins on the 7th of January and ends the day before Ash Wednesday. Long ago when people were going to get married they walked to the church. The marriage usually took place in the evening and it used to be dark before they would come home. On coming home they were met with lights as the young boys of the country had sheaves of straw lighted up. When they arrived at the brides fathers house, they knelt down on the (doors) doorstep, and an oaten cake was thrown over the brides head and broken and that was a symbol of plentiness. If this was not done it was feared the bride would be without bread during her married life. Then they went in and feasted and danced. When the wedding feast was on a crowd of young boys disguised\n(continues on next page)\n", "school_info": "School: Baile an Tobair", "metadata": [{"Location:": "Ballintober, Co. Roscommon", "Teacher:": "\nMáiréad, Bean Uí Dhomhnaill\n"}, {"Language": "English"}]}, "5162106/5154803/5200664": {"title": "Christmas Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0246, Page 051", "Page 051"], "url": "https://www.duchas.ie/en/cbes/5162106/5154803/5200664", "text": "\n(continued from previous page)\nContinuedreceived; and they feast and make merry during that night.\n\n\n\nIt is a custom during Shrove season to shake a grain of salt on the heads of the maids and bacholers who are not married during Shrove season on Shrove Tuesday night.There were many marriages held during Shrove and the priest used to go round to the houses long ago to perform the marriage ceremony.One Shrove Tuesday the priest came to a house, and found a great crowd of couples waiting to be married. The priest was very busy that evening. Just as the last ceremony was to be performed, the cock shuck himself on the roost and was just going to crow when the priest told someone to go out and catch the cock by the\n(continues on next page)\n", "school_info": "School: Baile an Tobair", "metadata": [{"Location:": "Ballintober, Co. Roscommon", "Teacher:": "\nMáiréad, Bean Uí Dhomhnaill\n"}, {"Language": "English"}]}, "5177648/5176508/5201343": {"title": "Féilí na Bliana", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0597, Page 459", "Page 459"], "url": "https://www.duchas.ie/en/cbes/5177648/5176508/5201343", "text": "\n(continued from previous page)\nflowers to it and a few strips of coloured ribbon. On top of the flower they tie a dead wren. They go around in batches, three or four in each batch. One of the boys or girls takes the branch and he or she gets the money. Then when they think they have enough collected they divide it between them. They get from sixpence to a shilling in each house. A few days after, they go to town and have a great time spending the money.On St Patrick's Day every person wears a shamrock. Little boys generally wear harps and the girls wear green harps.Anybody who has her friends across the sea sends them a box of shamrocks for St. Patrick's Day, because the shamrock does not grow in any other country but in Ireland.\n\n\n\nShrove is the period when people generally get married. During Shrove more are married than at any other time of the year. It generally lasts about four weeks.\n", "school_info": "School: Meelick (B.)", "metadata": [{"Location:": "Meelick, Co. Clare", "Teacher:": "\nEoghan Ó Néill\n"}, {"Collector": "Patrick O' Sullivan", "Gender": "male", "Address": "Woodcockhill, Co. Clare"}, {"Language": "English"}]}, "5177649/5176754/5202223": {"title": "Féilí na Bliana - Lá Fhéile Pádraig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0598, Page 197", "Page 197"], "url": "https://www.duchas.ie/en/cbes/5177649/5176754/5202223", "text": "\nAll people wear shamrocks. Little boys & girls ribbons & harps. Some wear St. Patrick's crosses, bought, made of green ribbons. Drowning the shamrock - taking intoxicating liquor.Four-leafed shamrock, much sought after, suppsoed to bring luck. Saw my mother & she had only to walk out & she could pick them up. Did it on one occasion for  a Limerick visitor to his very great joy.\n\n\n\nGreatest time for matchmaking. Some say - \"What's bound in spring is loosened in autumn\"\n", "school_info": "School: Meelick (B.)", "metadata": [{"Location:": "Meelick, Co. Clare", "Teacher:": "\nEoghan Ó Néill\n"}, {"Language": "English"}]}, "5177649/5176755/5202225": {"title": "Féilí na Bliana - Máirt na hInide", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0598, Page 198", "Page 198"], "url": "https://www.duchas.ie/en/cbes/5177649/5176755/5202225", "text": "\nPancakes eaten. Ring in pancakes. Finder first to be married,\n\n\n\n[?] but old fasts prescribed by Church. Smoking & c given up.  Some don't drink.\n\n\n\nEligible unmarried bachelors chalked at church door.\n\n\n\nMay Eve - bonfires and people plant mountain ash in  (tilled fields)  gardens as a preservation against wiles of Good People Witchcraft of neigbours.It was supposed that certain people on May Eve had the power\n(continues on next page)\n", "school_info": "School: Meelick (B.)", "metadata": [{"Location:": "Meelick, Co. Clare", "Teacher:": "\nEoghan Ó Néill\n"}, {"Language": "English"}]}, "5162142/5158318/5203088": {"title": "An Gabha agus an Cheárta", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0626, Page 158", "Page 158"], "url": "https://www.duchas.ie/en/cbes/5162142/5158318/5203088", "text": "\nThere are three blacksmiths in this parish. The smith uses a hammer, an anvil, a bellows, a sledge, a tongs, a pincers, and a vice. He puts shoes on horses and asses. There is only one fireplace in the forge. The bellows he has is made or iron and leather.\n\n\n\nMore people get married during Shrove than any other time of the year. People don't do any work the day they get married. Some people don't get married on Monday or Friday. Long ago people used wear long clothes when they used be getting married. Boys and girls go out in the Bacachs the night of the wedding. They don't go for any races coming home.Siobhán Ní Chléirigh,Sliabh na hAbhann\n", "school_info": "School: Sraith, Magh Sheasta", "metadata": [{"Location:": "Sragh, Co. Clare", "Teacher:": "\nTomás Ó Gormáin\n"}, {"Collector": "Siobhán Ní Chléirigh", "Gender": "female", "Address": "Mountrivers, Co. Clare"}, {"Informant": "Cáit Bean Uí Chléirigh", "Gender": "female", "Age": "58", "Address": "Mountrivers, Co. Clare"}, {"Language": "mixed"}]}, "4921760/4904247/5215864": {"title": "Saint Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0357, Page 109", "Page 109"], "url": "https://www.duchas.ie/en/cbes/4921760/4904247/5215864", "text": "\nIt was a great custom in this district to take the Patrick's Pot. Probably, it was to honour our conversion from Paganism. The result was that people imbibed too freely on that day.\n\n\n\nMarriages were celebrated in the home of the bride in the early years of  the last century. The priest got his offerings from the guests and the priest also partook of the dinner\n\n\n\nStraw-boys did not appear until about forty years ago. Some were invited so as not to cause disturbance. As a rule they behaved very well but on some occasions they caused trouble. The good fellows danced and got some drinks and the others showed rowdy conduct and had to be forcibly ejected. A dragthe procession of cars in a wedding was called - saddle horses 1st then all went on horse-back, the bride went to Church riding behind one of HER friends, and returned with one of HIS friends. Bonfires greeted them at cross-roads - Bridegroom threw them money.\n", "school_info": "School: Carrigaline, Ráth Mhór", "metadata": [{"Location:": "Carrigaline, Co. Cork", "Teacher:": "\nEibhlín, Bean Mhic Conchoille\n"}, {"Informant": "J.C. Dineen", "Gender": "male"}, {"Language": "English"}]}, "5009025/4978705/5216043": {"title": "Proverbs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0719, Page 634", "Page 634"], "url": "https://www.duchas.ie/en/cbes/5009025/4978705/5216043", "text": "\n(continued from previous page)\nThe twelve o'clock scholars.Nine o'clock daily, that is the ruleFor little children going to school.Of small account is a fly Until he gets into your eye.There are more Paddy Ree's than one.A man and a woman arguing is a sign of approaching evil.When the Cuckoo sings on the bare thorn sell the cow and buy corn.Peter Bruton.Informant - Mr. James Bruton, Ringtown, Castlepollard.\n\n\n\nShrove Tuesday occurs on the eve of Ash Wednesday.There are a great many customs connected with Shrove Tuesday. The eating of the pan-cakes for supper\n(continues on next page)\n", "school_info": "School: Faughalstown", "metadata": [{"Location:": "Faughalstown, Co. Westmeath", "Teacher:": "\nBean Mhic Gabhann\n"}, {"Collector": "Josephine Flanagan", "Gender": "female"}, {"Informant": "Patrick Flanagan", "Gender": "male", "Address": "Whitehall, Co. Westmeath"}, {"Language": "English"}]}, "5215779/5208181/5220781": {"title": "Seraft", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0090F, Page 09_008", "Page 09_008"], "url": "https://www.duchas.ie/en/cbes/5215779/5208181/5220781", "text": "\nMy Grandfather told me a short story about match-making. They used to do it at night. The man used to come to the brides house and bring all his friends with them. The bride used to be above in the room when they would come. They would go to the chapel and they would go on horse-back. When they would be going home they would be shouting and singing. When they would land home they would get all sorts of drink and they would be as drunk as a stick and falling from one side of the road to the other.\n(continues on next page)\n", "school_info": "School: Ballyburke", "metadata": [{"Location:": "Bellaburke, Co. Mayo", "Teacher:": "\nMicheál Ó Cheallaigh\n"}, {"Collector": "James Ludden", "Gender": "male", "Address": "Bellaburke, Co. Mayo"}, {"Informant": "Maggie Ludden", "Gender": "female", "Address": "Bellaburke, Co. Mayo"}, {"Language": "English"}]}, "4921777/4906294/5221758": {"title": "Matchmaking", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0361, Page 775", "Page 775"], "url": "https://www.duchas.ie/en/cbes/4921777/4906294/5221758", "text": "\n(continued from previous page)\ntroubled the matchmakers, all that mattered was that the parents at both sides were satisfied.\n\n\n\nIn olden days great excitement prevailed on SHrove Tuesday - the last day for marriages - so the Catholic Church forbade them during Lent.On that night a number of \"birght\" boys procured a thick rope and any couple (boy and girl) they met on the streets or roads who were old enough to be married, but were not, they would tie with the rope and drag for some distance to \"Skellig\" A verse of poetry, previously composed used be sung by the \"bright\" boys on the way to \"Skellig\"It was said that when the catholic law forbidding marriages in Lent came into operation, the inhabitants of (the) Skellig was the last to hear of it and as they continued to marry during the forbidden time.On Shrove Tuesday night, commonly called \"Pancake Night,\" pancakes are baked in abundance and there is great sport and merriment in the house. All members of the household eat the pancakes then. Some believe that the pancake got its name because it used be regarded as a \"panacea\" or remedy for the long\n(continues on next page)\n", "school_info": "School: Bán-Tír (C.)", "metadata": [{"Location:": "Banteer, Co. Cork", "Teacher:": "\nSíle, Bean Uí Dheadaigh\n"}, {"Collector": "Elizabeth O' Mahony", "Gender": "female", "Address": "Shronebeha, Co. Cork"}, {"Informant": "Michael O' Mahony", "Gender": "male", "Age": "55", "Address": "Shronebeha, Co. Cork"}, {"Language": "English"}]}, "5215779/5208538/5235723": {"title": "Seraft", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0090F, Page 15_008", "Page 15_008"], "url": "https://www.duchas.ie/en/cbes/5215779/5208538/5235723", "text": "\nMy Grandmother told me about match-making. The man would come to the brides house and he would bring his friends with hin. They used to spend a few hours in the brides house talking. One of the men would stand up & say that there was a young man here that wanted a wife & that the girl of the house would be suitable for him. Then they would begin match-making. The man would ask a hundred pounds for a\n(continues on next page)\n", "school_info": "School: Ballyburke", "metadata": [{"Location:": "Bellaburke, Co. Mayo", "Teacher:": "\nMicheál Ó Cheallaigh\n"}, {"Collector": "Stephen Madden", "Gender": "male", "Address": "Killadeer, Co. Mayo"}, {"Informant": "Mike Larken", "Gender": "male", "Address": "Derrew, Co. Mayo"}, {"Language": "English"}]}, "5215813/5214890/5237479": {"title": "St Stephen's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138D, Page 06_037", "Page 06_037"], "url": "https://www.duchas.ie/en/cbes/5215813/5214890/5237479", "text": "\n(continued from previous page)\nUp with the kettle and down with the panGive us the money to bury the wren\n\n\n\nOn shrove Tuesday the people used eat alot of meat because they wouldn't eat any meat in lent.\n", "school_info": "School: St Bridget's", "metadata": [{"Location:": "Derrymore, Co. Mayo", "Teacher:": "\nMáire Uí hOistín\n"}, {"Collector": "Seán Máirtín Caoigín Ó hOistín", "Gender": "male"}, {"Language": "English"}]}, "5215813/5215015/5237858": {"title": "Shrove", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138D, Page 09_005", "Page 09_005"], "url": "https://www.duchas.ie/en/cbes/5215813/5215015/5237858", "text": "\nThe people get married in Shrove when they are getting married.\n\n\n\nThere is no fast on Shrove Tuesday and the people that are fasting can eat meat with every meal on that day, and they can eat there full meals.\n\n\n\nIf the people are going to churn they will either churn when the sun is set or before it gets up in the morning. Some people do go out and get a rowan / round tree rod and make a gad out of the rod and put it on the churndash over the lid. The people say that if you wash your hands with the few of May morning that your hands would be able to open\n(continues on next page)\n", "school_info": "School: St Bridget's", "metadata": [{"Location:": "Derrymore, Co. Mayo", "Teacher:": "\nMáire Uí hOistín\n"}, {"Collector": "Tomás Ó Tónra", "Gender": "male"}, {"Language": "English"}]}, "5215813/5215015/5237859": {"title": "Shrove", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138D, Page 09_005", "Page 09_005"], "url": "https://www.duchas.ie/en/cbes/5215813/5215015/5237859", "text": "\nThe people get married in Shrove when they are getting married.\n\n\n\nThere is no fast on Shrove Tuesday and the people that are fasting can eat meat with every meal on that day, and they can eat there full meals.\n\n\n\nIf the people are going to churn they will either churn when the sun is set or before it gets up in the morning. Some people do go out and get a rowan / round tree rod and make a gad out of the rod and put it on the churndash over the lid. The people say that if you wash your hands with the few of May morning that your hands would be able to open\n(continues on next page)\n", "school_info": "School: St Bridget's", "metadata": [{"Location:": "Derrymore, Co. Mayo", "Teacher:": "\nMáire Uí hOistín\n"}, {"Collector": "Tomás Ó Tónra", "Gender": "male"}, {"Language": "English"}]}, "5215813/5215466/5240079": {"title": "Shrove Thursday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138D, Page 17_011", "Page 17_011"], "url": "https://www.duchas.ie/en/cbes/5215813/5215466/5240079", "text": "\nShrove Thursday is called pan-cake night because the people make pancakes on that night. and everyone gets enough of pancakes that night. Palm SundayO\n", "school_info": "School: St Bridget's", "metadata": [{"Location:": "Derrymore, Co. Mayo", "Teacher:": "\nMáire Uí hOistín\n"}, {"Collector": "Máire Ní Raghallaigh", "Gender": "female"}, {"Language": "English"}]}, "5009028/4978916/5262618": {"title": "Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0720, Page 203", "Page 203"], "url": "https://www.duchas.ie/en/cbes/5009028/4978916/5262618", "text": "\nShrove Tuesday is often called locally Shraff Tuesday.Going round for their cludog means that a boy or girl will take a can or basket go  out to the country and call at the houses for eggs.They are hardly ever refused. They keep some for house use and sell the remainder.\n", "school_info": "School: Castlepollard (B.)", "metadata": [{"Location:": "Castlepollard, Co. Westmeath", "Teacher:": "\nWilliam Coghlan\n"}, {"Language": "English"}]}, "5260445/5252930/5262868": {"title": "Shrove Long Ago", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0592E, Page 01_006", "Page 01_006"], "url": "https://www.duchas.ie/en/cbes/5260445/5252930/5262868", "text": "\nUnlike nowadays the old people used not get married only in shrove, unless in a very rare occasion. When a man and woman would be going to get married, the man would send somebody to settle with the parents. Then if both parties were satisfied the marriage would take place immediately afterwards.On the following night after the agreement, the man would go with three or four neighbours to the house for the fortune this may be, a field of hay or grass, a sow and bonhams, or a couple of cows or a horse, or often 3 or 4 cattle.On next day the couple would do the the chapel\n(continues on next page)\n", "school_info": "School: Gortaveha", "metadata": [{"Location:": "Gortaveha, Co. Clare", "Teacher:": "\nP. Wiley\n"}, {"Collector": "Brigid Keely", "Gender": "female"}, {"Informant": "John Broderick", "Gender": "male", "Age": "42", "Address": "Slieveanore, Co. Clare"}, {"Language": "English"}]}, "5260470/5256099/5263052": {"title": "St Brigid's Day Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0776C, Page 11_015", "Page 11_015"], "url": "https://www.duchas.ie/en/cbes/5260470/5256099/5263052", "text": "\n(continued from previous page)\nKildare on that night.\n\n\n\nThere is generally pancakes for the tea on Shrove Tuesday. There is a ring put in them and whoever gets it will be married first. When each pancake is cooked in the pan the woman throws it up in the air and out of the pan and catches it again in the pan when it is coming down.\n", "school_info": "School: Twomilehouse", "metadata": [{"Location:": "Twomilehouse, Co. Kildare", "Teacher:": "\nTomás Bineidh\n"}, {"Collector": "Esther Leonard", "Gender": "female", "Address": "Johnstown or Dunshane, Co. Kildare"}, {"Language": "English"}]}, "5260445/5253109/5265921": {"title": "Shrove", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0592E, Page 04_020", "Page 04_020"], "url": "https://www.duchas.ie/en/cbes/5260445/5253109/5265921", "text": "\nLong ago the people used to get married in Shrove and they used not get married any other time of the year .When they would be going to the Chapel to get married all the people would go with them.            On horse back they used to go and the women used to go behind the men on the horses.All the year they used be saving geese for the wedding .They used to boil the meat the couple days before the wedding.Some of the people used to have the hens and\n(continues on next page)\n", "school_info": "School: Gortaveha", "metadata": [{"Location:": "Gortaveha, Co. Clare", "Teacher:": "\nP. Wiley\n"}, {"Collector": "Annie Devaney", "Gender": "female", "Address": "Scalp, Co. Clare"}, {"Informant": "Mrs Fanny Vaughan", "Gender": "female", "Age": "75", "Address": "Scalp, Co. Clare"}, {"Language": "English"}]}, "5260445/5253484/5269191": {"title": "Shrove", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0592E, Page 11_051", "Page 11_051"], "url": "https://www.duchas.ie/en/cbes/5260445/5253484/5269191", "text": "\n51 Shrove                  24-3-38Long ago the people used get no fortunes only bits of land,a few cattle and often a big feathered bed.In olden times they thought it a very unlucky thing for a young person to bring an account of a match to a young person,but it is supposed to be a lucky thing a married man go.                 The match would be drawn up down at a fair or a public meeting.All is agreed to now.The fortune settled .But the trouble is then to see will the young pair agree.So their used be another night settled for them to meet.Then if the young people liked each other the man used take the measure of the ring and settle on a day to go and buy\n(continues on next page)\n", "school_info": "School: Gortaveha", "metadata": [{"Location:": "Gortaveha, Co. Clare", "Teacher:": "\nP. Wiley\n"}, {"Collector": "Michael Ó hAinnín", "Gender": "male", "Address": "Reanahumana, Co. Clare"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "female", "Age": "61", "Address": "Reanahumana, Co. Clare"}, {"Language": "English"}]}, "5260445/5253486/5269194": {"title": "Shrove", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0592E, Page 11_053", "Page 11_053"], "url": "https://www.duchas.ie/en/cbes/5260445/5253486/5269194", "text": "\n53           ShroveThe old people say \"If you are married in white you have chosen the right.Married in black you are sure to go back.Married in green you are ashamed to be seen.Married in brown you will keep far from town.married in yellow you are ashamed of your fellow.Married in blue you are sure to be true.                               May EveThey used burn beams in the fire .If two were going to be married the people of the locality would gather in and put beams in the fire .They would put the two beams inside in the coal.If they were to be married the two of them would burst up together and if they were not they would fly\n(continues on next page)\n", "school_info": "School: Gortaveha", "metadata": [{"Location:": "Gortaveha, Co. Clare", "Teacher:": "\nP. Wiley\n"}, {"Collector": "Michael Ó hAinnín", "Gender": "male", "Address": "Reanahumana, Co. Clare"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "female", "Age": "49", "Address": "Reanahumana, Co. Clare"}, {"Language": "English"}]}, "5274069/5270980/5274181": {"title": "Folklore - Shrove", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0592F, Page 03_015", "Page 03_015"], "url": "https://www.duchas.ie/en/cbes/5274069/5270980/5274181", "text": "\nShrove is the time for contracting marriages. Shrove begins after Christmas and ends on Ash Wednesday. When a few aged men would be sitting around the fire in the Shrove nights. They would draw down a match about some young boy + girl. When they would have all finished up they would have bring the boy to the girls house to settle on the fortune. in olden times cattle used to be given for fortunes. The would kill a few geese and have a big supper and\n(continues on next page)\n", "school_info": "School: Drumandoora N.S.", "metadata": [{"Location:": "Drumandoora, Co. Clare", "Teacher:": "\nLiam Mac Aodhaire, Liam Airley\n"}, {"Collector": "John Mac Mahon", "Gender": "male", "Address": "Acres, Co. Clare"}, {"Informant": "Peter Mac Mahon", "Gender": "male", "Address": "Acres, Co. Clare"}, {"Language": "English"}]}, "5215784/5210663/5279155": {"title": "Shrove Tuesday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0095C, Page 16_032", "Page 16_032"], "url": "https://www.duchas.ie/en/cbes/5215784/5210663/5279155", "text": "\nOn Shrove Tuesday all the old people used to go to town to buy ling and jam for Lent. On Shrove Tuesday night they used to have potatoes and bacon and cabbage for their supper. From that night until Easter they used not eat any meat.\n", "school_info": "School: Gleann an Dúin - Prison", "metadata": [{"Location:": "Prison East, Co. Mayo", "Teacher:": "\nMáire A. Ní Dhocartaigh\n"}, {"Collector": "Annie Kearns", "Gender": "female"}, {"Informant": "Michael Kearns", "Gender": "male", "Age": "50", "Address": "Prison North, Co. Mayo"}, {"Language": "English"}]}, "5215784/5210712/5279202": {"title": "Shrove Tuesday - Feast Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0095C, Page 17_045", "Page 17_045"], "url": "https://www.duchas.ie/en/cbes/5215784/5210712/5279202", "text": "\nOn shrove Tuesday all the old people used to go to town to buy ling and other things for lent. On that evening they used to make pancakes and potato-cakes for the tea. They used to boil potatoes and meat and cabbage for their supper.\n", "school_info": "School: Gleann an Dúin - Prison", "metadata": [{"Location:": "Prison East, Co. Mayo", "Teacher:": "\nMáire A. Ní Dhocartaigh\n"}, {"Collector": "Margaret Kearns", "Gender": "female"}, {"Informant": "Mrs Kearns", "Gender": "female", "Age": "40", "Address": "Manulla, Co. Mayo"}, {"Language": "English"}]}}