{"4922104/4852471/4948627": {"title": "An Old Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0525, Page 102", "Page 102"], "url": "https://www.duchas.ie/en/cbes/4922104/4852471/4948627", "text": "\nOnce upon a time a number of men went out to dig potatoes. Among these men there was a very funny man who said to the next of them. \"The Donn (meaning Donn Fíríne the Fairy King) is a great little man I wonder if he would give us our breakfast\". No sooner said than done. A young lady appeared and spread a white cloth on the grass and everything that was eatable was put on it. Then she called the men to come and eat this breakfast. except the man who asked for it. The lady then asked this man to come and eat his breakfast. She said \"It was you that asked it and it was you that got it and come on and nothing will happen you. But he would not eat a bit of it. Nothing happened to the men who ate it but the man who didn't eat it was dead next day.\n", "school_info": "School: Ballymartin, Croom", "metadata": [{"Location:": "Ballymartin, Co. Limerick", "Teacher:": "\nTeresa Lynch\n"}, {"Informant": "Mrs Mary Kirby", "Gender": "female", "Address": "Croom, Co. Limerick"}, {"Language": "English"}]}, "4922033/4920642/4953899": {"title": "Gaimbín", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0507, Page 105", "Page 105"], "url": "https://www.duchas.ie/en/cbes/4922033/4920642/4953899", "text": "\nGaimbin=  Goumbeen (as pronounced). The waste left when a coil of tobacco is cut into ounce of two ounce \"jots\", a small piece of \"rat tail\" tobacco, a small jot of tobacco. (Cromadh, from Ml. O'Neill, of New Road, Singland, Limerick, originally, and verified from Michael Toomey, 80 years, general grocer and tobacconist, Main St. Croom.  The latter knew the story of the mermaid given on page 89, but his version of it was more in keeping with the Rathlin Island version (As quoted by Mr. Liam Henry on the radio some nights ago), than with the version I have given (89).  Essentially there is no difference between any of the versions.\n\n\n\n\"Thoornacrehe = Tur na Crioche.  A field on the farm of Michael Toomey, Donoman, Croom.  It is a level field of about 4 acres in extent.  I have not been able to find its accompanying story.  From Patrick Lane, Donoman, Croom. 14  1/2 yrs. Dalta Scoile)\n\n\n\nThe Woman who went with the Fairies.\"There was this woman one time, and she had the name of going with the fairies\".  She had a servant boy, and the devil was pickin' him until he found her out.  He watched her one night when she went out, and he saw her shaking a winkers.  If she did, a pony kem to her, and she put the winkers on him, and mounted him, and off an'\n(continues on next page)\n", "school_info": "School: Cromadh (B.)", "metadata": [{"Location:": "Croom, Co. Limerick", "Teacher:": "\nDáithí Ó Ceanntabhail\n"}, {"Informant": "Mr O Neill", "Gender": "male", "Address": "Singland, Co. Limerick"}, {"Language": "English"}]}, "4922033/4920642/4953900": {"title": "Gaimbín", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0507, Page 105", "Page 105"], "url": "https://www.duchas.ie/en/cbes/4922033/4920642/4953900", "text": "\nGaimbin=  Goumbeen (as pronounced). The waste left when a coil of tobacco is cut into ounce of two ounce \"jots\", a small piece of \"rat tail\" tobacco, a small jot of tobacco. (Cromadh, from Ml. O'Neill, of New Road, Singland, Limerick, originally, and verified from Michael Toomey, 80 years, general grocer and tobacconist, Main St. Croom.  The latter knew the story of the mermaid given on page 89, but his version of it was more in keeping with the Rathlin Island version (As quoted by Mr. Liam Henry on the radio some nights ago), than with the version I have given (89).  Essentially there is no difference between any of the versions.\n\n\n\n\"Thoornacrehe = Tur na Crioche.  A field on the farm of Michael Toomey, Donoman, Croom.  It is a level field of about 4 acres in extent.  I have not been able to find its accompanying story.  From Patrick Lane, Donoman, Croom. 14  1/2 yrs. Dalta Scoile)\n\n\n\nThe Woman who went with the Fairies.\"There was this woman one time, and she had the name of going with the fairies\".  She had a servant boy, and the devil was pickin' him until he found her out.  He watched her one night when she went out, and he saw her shaking a winkers.  If she did, a pony kem to her, and she put the winkers on him, and mounted him, and off an'\n(continues on next page)\n", "school_info": "School: Cromadh (B.)", "metadata": [{"Location:": "Croom, Co. Limerick", "Teacher:": "\nDáithí Ó Ceanntabhail\n"}, {"Collector": "Patrick Lane", "Gender": "male", "Age": "14", "Address": "Dunnaman, Co. Limerick"}, {"Language": "English"}]}, "4922033/4920642/4953902": {"title": "Gaimbín", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0507, Page 105", "Page 105"], "url": "https://www.duchas.ie/en/cbes/4922033/4920642/4953902", "text": "\nGaimbin=  Goumbeen (as pronounced). The waste left when a coil of tobacco is cut into ounce of two ounce \"jots\", a small piece of \"rat tail\" tobacco, a small jot of tobacco. (Cromadh, from Ml. O'Neill, of New Road, Singland, Limerick, originally, and verified from Michael Toomey, 80 years, general grocer and tobacconist, Main St. Croom.  The latter knew the story of the mermaid given on page 89, but his version of it was more in keeping with the Rathlin Island version (As quoted by Mr. Liam Henry on the radio some nights ago), than with the version I have given (89).  Essentially there is no difference between any of the versions.\n\n\n\n\"Thoornacrehe = Tur na Crioche.  A field on the farm of Michael Toomey, Donoman, Croom.  It is a level field of about 4 acres in extent.  I have not been able to find its accompanying story.  From Patrick Lane, Donoman, Croom. 14  1/2 yrs. Dalta Scoile)\n\n\n\nThe Woman who went with the Fairies.\"There was this woman one time, and she had the name of going with the fairies\".  She had a servant boy, and the devil was pickin' him until he found her out.  He watched her one night when she went out, and he saw her shaking a winkers.  If she did, a pony kem to her, and she put the winkers on him, and mounted him, and off an'\n(continues on next page)\n", "school_info": "School: Cromadh (B.)", "metadata": [{"Location:": "Croom, Co. Limerick", "Teacher:": "\nDáithí Ó Ceanntabhail\n"}, {"Collector": "Seosamh O Fearghail", "Gender": "male", "Age": "14"}, {"Informant": "(name not given)", "Relation": "grandparent", "Gender": "female", "Age": "85"}, {"Language": "English"}]}, "4922068/4849504/4954342": {"title": "Carraig an Eitig or Cloch na Sprid", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0516, Page 227", "Page 227"], "url": "https://www.duchas.ie/en/cbes/4922068/4849504/4954342", "text": "\nCarraig an Eitig or Cloch na Sprid“Carraig an Eitigh” or the “Rock of the Lie” (probably it should be Rock of the Lies – T.L.) is supposed to be a favourite resort of the “Daoine Maithe” or “Good People”.It is in the shape of a pulpit on the road-side a little east of the Giants Graves ~ or see No. 9.~There is an immense boulder over Carraig An Eitigh on the summit of Killalirigh Hill which Seanchaidhe of the locality relates was thrown from Cnoc-Firinne” – the Hill of Truth – near Croom long ago by Doun (or Donn) Firinne – at the Giants of Lough Gur, so that “Carraig An Eitig” narrowly escaped destruction from that terrible missle which was thrown over twelve miles of country from “The Hill of Truth”.This Carraig is also called Cloc na Sprid as a woman dressed in white has often been seen there.\n", "school_info": "School: Gráinseach, Cill Mocheallóg", "metadata": [{"Location:": "Grange, Co. Limerick", "Teacher:": "\nTomás Ó Loínsigh\n"}, {"Language": "English"}]}, "4922114/4853460/4956128": {"title": "Cnoc na Fírinne", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0528, Page 318", "Page 318"], "url": "https://www.duchas.ie/en/cbes/4922114/4853460/4956128", "text": "\nIn Knockfiorna there is still to be seen a cave in which is to be found a rock, where Mass was celebrated in the days when the priests had to hide from the soldiers of Cromwell. People still go to this rock to get cured from warts by rubbing them with the water found in the crevices or holes, although indeed it is a dismal and lonely cave, and children would be in mortal dread to go in there. The fairy cave, they call it.Well, one day a batch of men were mowing near the cave and, being tired and hungry, they rested and their talk turned on the fairies. \"Wouldn't ye think\" said one of the men \"that one of the 'good folks' would bring us something to eat and drink?\" In a moment a buxom girl appeared with a grand, hot cake swimming in butter and plenty of new, sweet milk. They all - except the man who passed the remark about the fairies - [turned/tucked?] into the food and enjoyed their fill. They fully believed that the girl belonged to one of the surrounding farmers, but the man who joked about the fairies looked closely and felt sure she was no mortal woman. And so he wouldn't touch her food. A few hours after, God between us and all harm, he was found lying across a swath of hay, dead as a door nail.\n", "school_info": "School: Killmallock Convent School", "metadata": [{"Location:": "Kilmallock, Co. Limerick", "Teacher:": "\nAn tSr. Dimpna\n"}, {"Informant": "Patrick Kelly", "Gender": "male", "Age": "78", "Address": "Kilmallock Hill, Co. Limerick"}, {"Language": "English"}]}, "4922114/4853469/4956142": {"title": "Knockfierna", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0528, Page 327", "Page 327"], "url": "https://www.duchas.ie/en/cbes/4922114/4853469/4956142", "text": "\nIn Kilmacow, near Knockfiorna, there lived a man named Tom McKinery, a small farmer.  Tom, at the time of my story was very poor, for all his cows died and every misfortune befell himself and his family.  Tom was great to play the bag-pipes, and he said to himself one day that he'd make his way to the towns and try his luck with his music.  He fixed his pipes and off with him at break of day for fear the neighbours would see him.  Passing by a furze bush whom should he meet but Donn Firinne, the Fairy King.  He asked Tom to play for him but Tom refused saying his fingers were too cold.  And 'twas true for him.  God help us.  But Dun Firinne shook hands with him and from that day on Tom McKinery was a charmed piper!  The Fairy King gave him lots of money and told him to meet him the following evening and bring his pipes with him but, on no account, to tell any one.  Tom gave his wife and family all the money he got and said he was off to meet a friend.  Which was true for him.Tom was at the furze ditch in good time and there were awaiting him about 80 horsemen with the Fairy King.  They welcomed Tom and spoke to him and told him that they were going to Clare Castle to steal a lovely lady, who was there and that they couldn't enter the Castle without a mortal man, but that he wasn't\n(continues on next page)\n", "school_info": "School: Killmallock Convent School", "metadata": [{"Location:": "Kilmallock, Co. Limerick", "Teacher:": "\nAn tSr. Dimpna\n"}, {"Collector": "Helen Mitchell", "Gender": "female"}, {"Informant": "Patrick Kelly", "Gender": "male", "Address": "Kilmallock Hill, Co. Limerick"}, {"Language": "English"}]}, "5044804/5040167/5083318": {"title": "Ben Aughlin", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0969, Page 008", "Page 008"], "url": "https://www.duchas.ie/en/cbes/5044804/5040167/5083318", "text": "\nThis mountain lies about 3 miles north East of Swanlinbar, Co. Cavan.  It is also known by the name of Benaclin or the mountain of the talking steed.  Before the coming of St. Patrick this steed was supposed to talk to people on the night of Samain and the people around brought it presents.  The place is said to be the headquarters of Donn Bingha, DeDanaan chief of the Maguire clan Ben or Bin Eaclinn meaning the stables of Donn Bingha.  He was supposed to ride a white horse and a tradition exists that in a full battle near the foot of the mountain he will ride out to the assistance of his own people and lead them to victory.  Ben Aughlin is said to be the headquarters for the men fairy folk as Slieve na mban is for the women.There is a nice green mound at the foot of the mountain called \"Play-bank\" where the fairies are supposed to hold their revels\n(continues on next page)\n", "school_info": "School: Uragh (C.)", "metadata": [{"Location:": "Uragh, Co. Cavan", "Teacher:": "\nE. Mc Caffrey\n"}, {"Language": "English"}, {"Location": "Swanlinbar"}]}, "5044804/5040169/5083327": {"title": "Ben Aughlin", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0969, Page 010", "Page 010"], "url": "https://www.duchas.ie/en/cbes/5044804/5040169/5083327", "text": "\n(continued from previous page)\nold condition.  Persons who went to the mountain to hunt or shoot and stayed there till late at night say they heard very mournful cries and that they were so frightened they left as soon as possible.  Others claim to have come upon the fairy sluagh holding fairs on the \"Play-bank\" and buying and selling cattle.\n\n\n\n\"About 50 years ago me and a comrade went at 2 o'clock in the night to the Play-Bank at the foot of Bin to snare rabbits.  We weren't 20 minutes there till the nicest music you ever heard in your life and the noise of thousands of people dancing sounded on the Play-bank above us.  We listened awhile then got afeard, pulled our nets and started for Florencecourt Demense about a mile away.  But in truth it was out of the frying pan into the fire with us for we had not our nets\n(continues on next page)\n", "school_info": "School: Uragh (C.)", "metadata": [{"Location:": "Uragh, Co. Cavan", "Teacher:": "\nE. Mc Caffrey\n"}, {"Informant": "Willie Ford", "Gender": "male", "Age": "71", "Address": "Moher, Co. Cavan"}, {"Language": "English"}]}, "5044804/5040170/5083332": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0969, Page 011", "Page 011"], "url": "https://www.duchas.ie/en/cbes/5044804/5040170/5083332", "text": "\n(continued from previous page)\n10 minutes set till the ghost of ould Lord Enniskillen walked up the avenue and into the Castle dressed in the style of a hundred years ago—castor hat, swallow tail coat, knee breeches, pointed shoes and all.  We didn't wait to pull the nets this time but ran home as if the Ould Boy himself was after us and us shaking.  I'd as lief stayed with the fairies on Bin as see the ould lord.\"\n\n\n\nIn my father's early days a travelling woman taking the near cut from Florencecourt to Swanlinbar called at our house near the mountain foot.  As it was late they asked her to stay the night.  She pushed on and said jokingly \"if benighted I will stay with my friends and Donn na binne.\"  When she was crossing the \"Play-bank\" at nightfall she met an ancient warrior and he said, \"You made a promise some time ago and you will have to keep it.\"  He brought her\n(continues on next page)\n", "school_info": "School: Uragh (C.)", "metadata": [{"Location:": "Uragh, Co. Cavan", "Teacher:": "\nE. Mc Caffrey\n"}, {"Informant": "Pat Malanaphy", "Gender": "male", "Age": "70", "Address": "Killesher"}, {"Language": "English"}]}}