{"4427832/4348466/4435310": {"title": "The Fenians", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0095, Page 121", "Page 121"], "url": "https://www.duchas.ie/en/cbes/4427832/4348466/4435310", "text": "\nMuch mention is made by the old people of the Fenians, but tis not easy to get definite information that may be written down about them. There is one however where memory will live in the minds of generations of the people of this and wider districts.Henry Curry.To Mr. John Tuffy, Belcarra, I am indebted for collecting the following facts (s?ee) Most of them he got from Mr. Pat Blowick, Elmhall, who also supplied most of the information concerning the Protestant Colony in Belcarra.Henry Currythe greatest of the Fenians in this part, or in any part of Mayo was born in Belcarra in a hut by the road-side in the year 1824. His father was Michael Curry and his mother's maiden name was Peggy Pierce. They were farmers in the smallest way and were very poor. Henry went to school in Errew Monastery, trudging the four miles > to and from morning and evening barefooted even in winter\n(continues on next page)\n", "school_info": "School: Clochar", "metadata": [{"Location:": "Clogher, Co. Mayo", "Teacher:": "\nM. Ó Gealbháin\n"}, {"Collector": "Micheál Ó Gealbháin", "Gender": "male"}, {"Informant": "John Tuffy", "Gender": "male", "Address": "Ballycarra, Co. Mayo"}, {"Informant": "Pat Blowick", "Gender": "male", "Age": "85", "Address": "Elmhall, Co. Mayo"}, {"Language": "English"}]}, "4427832/4348473/4435318": {"title": "The Tithe War", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0095, Page 128", "Page 128"], "url": "https://www.duchas.ie/en/cbes/4427832/4348473/4435318", "text": "\nThe Tithe WarA man named Hughes was shot dead in the street of Belcarra in the \"Tithe War\" in 1832. Mr. Richard Walshe T.D. however told me that he heard old people say that 6 men were killed.\n\n\n\nLand League Belcarra and district was very active in the Land League times. It had a fife and Drum Band which was in great favour at Lamd League meetings in places like Ballyglass, Balla Carnacon and Coill-a-bhaile. Its trainer was Tommie Naughton the Shoemaker who lives still.The police seemed to have a \"dead set\" on the Belcarra band, and Tommie Naughton used to report by getting his\n(continues on next page)\n", "school_info": "School: Clochar", "metadata": [{"Location:": "Clogher, Co. Mayo", "Teacher:": "\nM. Ó Gealbháin\n"}, {"Collector": "Micheál Ó Gealbháin", "Gender": "male"}, {"Informant": "Mr Richard Walshe", "Gender": "male", "Occupation": "Teachta Dála"}, {"Language": "English"}]}, "4427880/4353930/4444356": {"title": "A Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0106, Page 529", "Page 529"], "url": "https://www.duchas.ie/en/cbes/4427880/4353930/4444356", "text": "\nBefore the Gortjordan school was built the people went to Cross and Kilmaine schools. There was a man named Micky Burke teaching in Islandmore. He came from \"cruac-cosán\" near Cill. He belonged to the Fenian movement and was spied on. He was whipped til the flesh fell off him.He was near dead and to keep him going the people paid sixpence a week to him. The people of Islandmore kept him and fed him a few nights an their turn.\n", "school_info": "School: Gort an tSiúrdáin", "metadata": [{"Location:": "Gortjordan, Co. Mayo", "Teacher:": "\nSeán Ó Módhráin\n"}, {"Collector": "Mary Ryan", "Gender": "female", "Address": "Kilkeeran, Co. Mayo"}, {"Informant": "Edward Ryan", "Relation": "unknown", "Gender": "male", "Address": "Knocknageeha, Co. Mayo"}, {"Language": "English"}]}, "4427917/4357580/4452875": {"title": "Local Place Names", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0114, Page 70", "Page 70"], "url": "https://www.duchas.ie/en/cbes/4427917/4357580/4452875", "text": "\nIn a garden in our land there once lived a man who was called \"Larry the Tricker\". Every night he went through the village playing tricks. In the morning he asked his neighbour if they saw the little man who was gathering the money the night before. The people never found out who it was for a year. When they found out they called him Larry the Tricker. The garden is still called Garrai LarryThis garden is owned by.Written byPeggy Tully, 15Raherolish,Kilmovee,Ballaghaderreen.Michael Tully, 45Raherolosh,KilmoveeBallaghaderreenCo. Mayo.\n\n\n\nOnce upon a time when the Fenians were in Ireland they wanted to enroll new members to (members) their tribe. One day they met three men with their wives. They asked the men to join them.\n(continues on next page)\n", "school_info": "School: Cill Moibhí (C.)", "metadata": [{"Location:": "Kilmovee, Co. Mayo", "Teacher:": "\nÁine, Bean Uí Dhubhthaigh\n"}, {"Collector": "Peggy Tully", "Gender": "female", "Age": "15", "Address": "Raherolus, Co. Mayo"}, {"Language": "English"}]}, "4427853/4350802/4453415": {"title": "The Fenians", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0099, Page 105", "Page 105"], "url": "https://www.duchas.ie/en/cbes/4427853/4350802/4453415", "text": "\nI joined the Fenian brotherhood in the year 1879.  He took the oath from John O’Keane that lived in that house where P. Connacton lives now.  He was not long joined in them when he was summoned to attend a meeting in O’Keane’s house and also to make some arrangements to frighten the landlords, as they were evicting and persecuting the tenants.A man named Brennan from Dublin addressed the meeting also Gerald Nally and another man from Ballina.  There was a list of landlords names taken. Namely, Nolan, Farrel, Michael Treston, Cloontooa, Burke, Curley, Sir Robert Lynch Blosse Balla, and a gentleman named Bodkin who lived above Milltown.  It was arranged to is it Bodkin first.  It was also arranged to bring a coffin in a mule and cart to Milltown. The Tuesday night after that himself\n(continues on next page)\n", "school_info": "School: Koilmore", "metadata": [{"Location:": "Cuilmore, Co. Mayo", "Teacher:": "\nSéamus Ó Murchadha\n"}, {"Informant": "Michael Mc Grath", "Gender": "male", "Address": "Cuilmore, Co. Mayo"}, {"Language": "English"}]}, "4428216/4386763/4456880": {"title": "Local Stories", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0794, Page 479", "Page 479"], "url": "https://www.duchas.ie/en/cbes/4428216/4386763/4456880", "text": "\nThis is a story which happened in the time of the Fenians.The Fenians had it appointed between themselves to meet at Tara Hill but some of them came to Tallaghthill instead.When the English soldiers were coming after them, they were hiding the ammunition everywhere they could.One day a man was going to Dublin with a load of oats on a car and one of the soldier's put a rifle in between the sacks unknown to the man.When he came to Jobstown he was stopped and searched. When the rifle was found he was hanged from the shafts of the car.About fifty years ago a pilgrim came to Mountseskin and no one knew him or where he came from.He slept for a year in a heap of straw in a place called, The Hairy Man's Nest. No one ever knew where he to.In 1918 the Black and Tans placed a bomb on the road near Mountseskin and to the present day you can see the mark.\n", "school_info": "School: Brittas", "metadata": [{"Location:": "Brittas, Co. Dublin", "Teacher:": "\nB. Ní Mhaoldhomhnaigh\n"}, {"Collector": "Brendan Ó Sionnach", "Gender": "male", "Address": "Brittas, Co. Dublin"}, {"Language": "English"}]}, "4427855/4350995/4457108": {"title": "Patrick Nally", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0099, Page 298", "Page 298"], "url": "https://www.duchas.ie/en/cbes/4427855/4350995/4457108", "text": "\nPatrick Nally was a great Irish man. He was born and reared near the town of Balla. He was also a great athlete. He was mixed up in the Fenian movement. He was spied upon in the Barracks of Claremorris and was arrested. They wrote up to Dublin Castle about him and he was sentenced to jail for ten years. They sent him of to Cork jail then. \"Just on the eve of coming out by death was called away\". It is thought that is was poison killed him.\n\n\n\nConor O' Kelly was an M.P. He was a great talker and he thought nothing could put him down. He was born in the Square of Claremorris. He got his education in the National school. He was styled in the house of commons as a man with a Silver Tongue. He spoke at every meeting. He always liked the poor people and the uneducated people. He was an M.P. in the North Mayo. He won every election. At last him-self and the\n(continues on next page)\n", "school_info": "School: Lochán na mBan", "metadata": [{"Location:": "Loughaunnaman, Co. Mayo", "Teacher:": "\nTomás Ó Conghaile\n"}, {"Collector": "Peg Merrick", "Gender": "female", "Address": "Loughaunnaman, Co. Mayo"}, {"Language": "English"}]}, "4428136/4381163/4459747": {"title": "Special Articles", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0647, Page 333", "Page 333"], "url": "https://www.duchas.ie/en/cbes/4428136/4381163/4459747", "text": "\n(continued from previous page)\nit. It is got in France by those who visit that country. Lourdes water is brought to sick people and if they drink it, it is supposed to cure them.\n\n\n\nThe following is a story I got from Thomas Hanrahan about a Fenian. About seventy years ago a certain Mr. Patrick Walsh joined the Fenians and consequently he was compelled to run from the English. He decided to go to America. At first he went to Dungarvan on the evening that a cargo vessel was to leave for some port in England. For fear he would be seen getting into the boat on the quay a man by the name of Mc Namara rowed him to the Cunnigar.\n(continues on next page)\n", "school_info": "School: Tuar an Fhíona, Cluain Meala", "metadata": [{"Location:": "Tooraneena, Co. Waterford", "Teacher:": "\nGearóid Ó Coindealbháin\n"}, {"Collector": "Tomás Ó Dúnaighe", "Gender": "male", "Address": "Ballynamult, Co. Waterford"}, {"Informant": "Jim Hanrahan", "Relation": "unknown", "Gender": "male", "Address": "Ballynamult, Co. Waterford"}, {"Language": "English"}]}, "4428136/4381164/4459748": {"title": "A Fenian", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0647, Page 334", "Page 334"], "url": "https://www.duchas.ie/en/cbes/4428136/4381164/4459748", "text": "\n(continued from previous page)\nWhen the other boat came on they stopped and Patrick Walsh went on board. It was pre arranged that he should work his way across which he did willingly. When he arrived in England he had to wait until the ship was ready for America.Early that morning the ship set off for America. He didn't pay his passage as before but he worked his way. However he go to American safely.\n\n\n\nLong ago there were many stories told about the Fenians.Once upon a time there were three of those Fenians put into jail. They were there for about nine or ten days before they could find out any of stealing away.\n(continues on next page)\n", "school_info": "School: Tuar an Fhíona, Cluain Meala", "metadata": [{"Location:": "Tooraneena, Co. Waterford", "Teacher:": "\nGearóid Ó Coindealbháin\n"}, {"Collector": "Tomás Ó Dúnaighe", "Gender": "male", "Address": "Ballynamult, Co. Waterford"}, {"Informant": "Tom Walsh", "Relation": "unknown", "Gender": "male"}, {"Informant": "Jim Walsh", "Gender": "male"}, {"Language": "English"}]}, "4428136/4381165/4459751": {"title": "A Fenian", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0647, Page 335", "Page 335"], "url": "https://www.duchas.ie/en/cbes/4428136/4381165/4459751", "text": "\n(continued from previous page)\nAfter a while they began digging into the ground with forks and spoons. They kept on digging for about three or four days until they had a big hole dug out under the ground. It was out in thus hole the three Fenians escaped.Tomás Ó DúnaigheTom Walsh got this from Jim WalshSkeheensWaterford.\n\n\n\nLong ago there were a great number of stories told about the Fenians. One day a man named Kiely coming home from a fair with cattle. Just as he was coming near Colligan a car stopped and two men came out of it. These men had two guns and they said he should give them the cattle or\n(continues on next page)\n", "school_info": "School: Tuar an Fhíona, Cluain Meala", "metadata": [{"Location:": "Tooraneena, Co. Waterford", "Teacher:": "\nGearóid Ó Coindealbháin\n"}, {"Collector": "Tomás Ó Dúnaighe", "Gender": "male", "Address": "Ballynamult, Co. Waterford"}, {"Informant": "Paddy Moloney", "Relation": "unknown", "Gender": "male"}, {"Informant": "John Moloney", "Gender": "male", "Address": "Garrycloyne, Co. Waterford"}, {"Language": "English"}]}, "4428114/4379454/4465349": {"title": "Iasc", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0642, Page 233", "Page 233"], "url": "https://www.duchas.ie/en/cbes/4428114/4379454/4465349", "text": "\n(continued from previous page)\ntamaill do bhlianta d'imthig sé as an tobar.\n\n\n\nD'airigh mé sgéal an oidhche fé dheire mar gheall ar na finíní. Tháineadar isteach in-aice Cé Baile na Gall in bád beag. I mbád Pádraig Uí Ionáin a tháineadar isteach go dtí mBaile na Gall. Nuair a shroiseadar Baile na Gall bhaileugheadar gach rud a bhí acu agus shuibhaileadar go dtí Eochaill. Shíleadar go raibh Éire a lorg cabhair chun dul a throid acht ní raibh. Nuair a d'airigh na gárdaí é chuireadar isteach i bpríosún iad agus cuireadh Cúirt ortha agus chaith Pádraig Uí Ionáin as gaodhluinn agus na daoine eile agus ní bhfuigheadh an breitheamh iad a thuisgint. Ní fheadar aoinne cad a bhain do's na finíní as san amach.\n\n\n\nDo bhí bean sa tSean Phobuil uair agu do bhí sí an bhoith. Maidean Domhnaig bhí sí ag dul go dtí an Aifreann agus chonnaic sí an Mhaighdean Mhuire ag seasamh ar chloch. Nuair a chuaidh sí abhaile do bhí breacfast deas ar an mbórd agus nuair a bhí a dhóithin ithe aici d'imthig an chuid eile de'n mbídh de'n mbórd. Nuair a chuaidh sí amach sa tigín abí aici agus\n(continues on next page)\n", "school_info": "School: Maol an Chóirne, An Rinn", "metadata": [{"Location:": "Mweelahorna, Co. Waterford", "Teacher:": "\nPilib Ó Foghlú\n"}, {"Collector": "Máire Ní Churraoin", "Gender": "male", "Age": "13", "Address": "Ballynacourty South, Co. Waterford"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "male", "Address": "Ballynacourty South, Co. Waterford"}, {"Language": "Irish"}]}, "4428114/4379464/4466259": {"title": "Na Fíníní", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0642, Page 242", "Page 242"], "url": "https://www.duchas.ie/en/cbes/4428114/4379464/4466259", "text": "\nTháinnigheadar isteach i mbaile na nGall. Bád le Pádraig Ó Lonáin a thug isteach iad. Sé an ainm a bhí ar an mbád na Erins Hope. Bhí sí síos i mBaile na nGall le fada acht tá sí briste anois le tamall.Thugadh go dttí an chúirt na daoine a thug isteach iad. Labhair siad as Ghaedhilg leis an mbreitheamh agus ní bhfuigheadh sé iad a thuigsint agus leighéad saor iad.Nuair a tháinig na fuiníní isteach go dtí an baile. Bhailigheadar an méid a bhí acu agus shiubhaladar go dtí h-Eochaill.Shileadar go aibh cabhair ó mhuinntir na h-Éireann an lá san agus ní raibh.\n\n\n\nTuiteann feil Brígde ar an 1adh lá de Feabhra. Cuireann muinntir na Rinne brat amach an oidhche sin. Dá mbeadh tinneas cinn agat leighiseadh an bhrat tú. Ní ceart an bhrat a nighe tar-éis é a bheanughad mar ní leighiseadh sé aon tinneas annsan.Brat Brígde a thugann na sean daoine air. Bhí fear ann aon uair amháin agus bhí\n(continues on next page)\n", "school_info": "School: Maol an Chóirne, An Rinn", "metadata": [{"Location:": "Mweelahorna, Co. Waterford", "Teacher:": "\nPilib Ó Foghlú\n"}, {"Collector": "Seán Ó Cionáith", "Gender": "male", "Address": "Mweelahorna, Co. Waterford"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "male", "Age": "40", "Address": "Mweelahorna, Co. Waterford"}, {"Language": "Irish"}]}, "4428059/4373561/4476803": {"title": "The Mayo Conspiracy", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0148, Page 223", "Page 223"], "url": "https://www.duchas.ie/en/cbes/4428059/4373561/4476803", "text": "\n(continued from previous page)\n(6)Cheer up you hearts my gallant boys,For the time is nigh at hand,For the British Constitution,We can no longer stand,We will call upon our Fenian boys,And those who are lying low,And we’ll cheer for Crossmolina,A town in sweet Mayo.I got this ballad from Edward Cassidy (50)Derreen, Ballina, Co. Mayo.\n\n\n\nA Fenian Song5-4-38Eileen King(1)In Crossmolina we were brought up,Six heroes of great fame,True sons of Granuaile,Who did adore the name,Who joined the Fenian brotherhood,Bad landlords to destroy\n(continues on next page)\n", "school_info": "School: Árd-achadh", "metadata": [{"Location:": "Ardagh, Co. Mayo", "Teacher:": "\nLiam Ó Coinne\n"}, {"Collector": "Eileen King", "Gender": "female"}, {"Language": "English"}]}, "4428061/4373801/4478198": {"title": "Local Heroes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0148, Page 439", "Page 439"], "url": "https://www.duchas.ie/en/cbes/4428061/4373801/4478198", "text": "\nMatthew Melvin lived in Ballybrooney, Cooneal, Ballina. He joined the Fenian Brotherhood about the year 1880 A.D. The Fenians were betrayed by their leader whose name was Coleman.Some of them fled from the country because they knew their names were in his books. Matthew was arrested and tried and was sentenced to five years imprisonment. At the end of that time he was released. He then returned home and stayed there for about twenty years. Some years after he became a J.P. Some time after he resigned. Some of the men who were in jail with him are John Daly Gort Sceide, Munelly. do. John Rooney from Rath Ball, James King from Ardagh. Thomas McCawley from Castlegoore.\n\n\n\nJohney Cavanagh lived in Knockanillo, Ballina. He was a very strong man. One day he was challenged by Pat Gilligan's father to carry seven curts of oats. Johnny took hold of the bag\n(continues on next page)\n", "school_info": "School: Cnoc an Éalóidh", "metadata": [{"Location:": "Knockanelo, Co. Mayo", "Teacher:": "\nMáirtín Ó Neachtain\n"}, {"Collector": "Mícheál Mac Lochlainn", "Gender": "male", "Age": "14"}, {"Language": "English"}]}, "4427830/4348234/4511387": {"title": "A Local Fenian Leader Henry Curry", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0094, Page 374", "Page 374"], "url": "https://www.duchas.ie/en/cbes/4427830/4348234/4511387", "text": "\nA local Fenian Leader Henry Curry.Henry Curry lived in New Dublin.  His house was situated on the road to Castlebar, about a half mile from Belcarra.  It was knocked down by the Congested Board, when striping the land, and the stones were used to build a wall along by the road.  The form they fence of the garden owned by the present Richard Connor.  He was one of the leading Fenians in the county, and a man of great strength and endurance.  It was said that he thought nothing of walking to places as far as Swinford and inspecting Fenians and come back again to his own home in the morning.  He was a school teacher profession and later he taught in a room in his own house in New Dublin.  His father had a small farm of land in the townland of New Dublin.  The scholars used to help in the farmwork for the instruction they got.  He was considered a rather severe teacher by his pupils.  He died quite a young man being about 41 years.  The people say he had a \"knot in his guts,\n(continues on next page)\n", "school_info": "School: Belcarra (Buachaillí)", "metadata": [{"Location:": "Ballycarra, Co. Mayo", "Teacher:": "\nSeosamh Ó Heireamhóin\n"}, {"Informant": "Michael Moran", "Gender": "male", "Address": "Roslahan Upper, Co. Mayo"}, {"Language": "English"}]}, "4566067/4564107/4572511": {"title": "A Story of a Landlord", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0027, Page 0259", "Page 0259"], "url": "https://www.duchas.ie/en/cbes/4566067/4564107/4572511", "text": "\nIf the people were caught in the land of a gentleman they would be brought into the cow stable and tied to a pole and whipped. The landlord would put (their) them out of their houses and knock them down and sometimes burnt them as well. A landlord was fired at by the Fenions when he was coming home from town just as he reached the gate the Fenions were hiding each side of the gate. He was badly wounded and then he died. \"Pusin\" Blake was his name. He died of lunacy contracted by a blow of a stone from an evicted tenant.\n", "school_info": "School: Scoil na mBráthar, Tuaim", "metadata": [{"Location:": "Tuam, Co. Galway", "Teacher:": "\nAn Br. Ó Duinn\n"}, {"Collector": "Seán Ó Dálaigh", "Gender": "male", "Address": "Tuam, Co. Galway"}, {"Language": "English"}]}, "4566067/4564134/4572595": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0027, Page 0286", "Page 0286"], "url": "https://www.duchas.ie/en/cbes/4566067/4564134/4572595", "text": "\nFenians were the trained soldiers of Ireland who lived noble lives. Their motto was truth on your lips purity in your hearts and strenth in your arms. King Connor with the long red hand waw defeated near Athenry and lies buried at Abbey Knocmoy. There was a chief named OKelly who ruled the barony of UÍ Máire near Tuam in ancaent\n", "school_info": "School: Scoil na mBráthar, Tuaim", "metadata": [{"Location:": "Tuam, Co. Galway", "Teacher:": "\nAn Br. Ó Duinn\n"}, {"Collector": "Gaibril de Bairéad", "Gender": "female", "Address": "Tuam, Co. Galway"}, {"Language": "English"}]}, "4569055/4567318/4574625": {"title": "Burke of Iscer Clerans - The Hanging of Anthony Daly", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0036, Page 0041", "Page 0041"], "url": "https://www.duchas.ie/en/cbes/4569055/4567318/4574625", "text": "\nBurke of Iscer Clerans26-5-1938The hanging of Anthony DalyThe hill of Seefin is a historic hill. It is situated twelve miles from Galway city. It is two thousand feet above the sea level. If you stood on the hill you could see the surrounding country for miles. Many tourists came to see the hill. On that hill there is an old cave. There are marks of two poles on that hill too, where there was a man hanged named Anthony Daly. He was taken up for attempting to shoot a landlord by the name of Burke in the eighteenth century. Burke was a bad landlord who resided at Iscer Clerans. Anthony Daly was tried in\n(continues on next page)\n", "school_info": "School: Baile Meadhonach", "metadata": [{"Location:": "Ballymanagh, Co. Galway", "Teacher:": "\nMicheal Ó Raghallaigh\n"}, {"Collector": "Eileen Dolan", "Gender": "female", "Address": "Carnanthomas, Co. Galway"}, {"Informant": "Stephen Donohoe", "Gender": "male", "Address": "Carnanthomas, Co. Galway"}, {"Language": "English"}]}, "4569054/4567263/4575133": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0035, Page 0349", "Page 0349"], "url": "https://www.duchas.ie/en/cbes/4569054/4567263/4575133", "text": "\n(continued from previous page)\n[-]\n\n\n\nIn the time of the Fianna there was a bishop named Dr. Madden who lived in Clunoo. He was arrested by the English forces under command Power, and he was taken to Galway. As he was going in the gate Power asked him for hire, the hire at that time was twelve shillings a week. The Dr. said that he was late and all I will give you is the hangman's hire which is thirteen pence. He said go now and you will have a new story before you, and when he went home his wife met him at the gate. She said come in\n(continues on next page)\n", "school_info": "School: Cill Críosta", "metadata": [{"Location:": "Kilchreest, Co. Galway", "Teacher:": "\nSeán Ó Cléirigh\n"}, {"Collector": "Maureen Forde", "Gender": "female", "Address": "Raheen Oughter, Co. Galway"}, {"Informant": "Michael Forde", "Gender": "male", "Address": "Raheen Oughter, Co. Galway"}, {"Language": "English"}]}, "4569054/4567264/4575139": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0035, Page 0350", "Page 0350"], "url": "https://www.duchas.ie/en/cbes/4569054/4567264/4575139", "text": "\n(continued from previous page)\nuntil I Show you Dr. Madden. What! Is it the man I Have left in Galway. She brought him into the room, and her only son was dead and that was the end of the Powers in booiheen.Michael Jorde,Raheen.There was a blacksmith in Kilchreest lond ago whose name was Bonnors, and he used to be always talking about the Tianna. Bajtain Perfse who lived in Roxborro (he) used to have forty men working for him. The blacksmith used to say  that the French were  to come to Killala.When the men told that to the   Bajtain , he, He came raging back to the forge. He shouted in to the blacksmith , and asked him ws he inside. The blacksmith asked him what did he want.The Bajtain said\n\n\n\nThere was a blacksmith in Kilchreest long ago who'se name was Connors, and he used to be always talking about the Fianna. Captain Perfse who lived in Roxboro (he) used to have forty men working for him. The blacksmith used to say that the French were to come to Killala.When the men told that to the Captain, He came raging back to the forge. He shouted in to the blacksmith, and asked him was he inside. The blacksmith asked him what did he want. The Captain said\n(continues on next page)\n", "school_info": "School: Cill Críosta", "metadata": [{"Location:": "Kilchreest, Co. Galway", "Teacher:": "\nSeán Ó Cléirigh\n"}, {"Collector": "Maureen Forde", "Gender": "female", "Address": "Raheen Oughter, Co. Galway"}, {"Informant": "Michael Forde", "Gender": "male", "Address": "Raheen Oughter, Co. Galway"}, {"Language": "English"}]}, "4583301/4577755/4586792": {"title": "Scéal", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0048, Page 0128", "Page 0128"], "url": "https://www.duchas.ie/en/cbes/4583301/4577755/4586792", "text": "\nRiocáird de Búrca80bl d'aoisCeathar Mór Conn Meara a d'innisSgéalta faoi na FinníníBhí 'barack' thiar i gCondae an Cláir n ndáil leis an Spá. Tháinig na Finníní ann fhad is a bhí na daoine ag an Aifreann agus mharbhuigh siad na 'píleirs' ceathar aca. Annsin chuaidh ná 'píleirs' timcheall ar áit agus chuir siad alán buachaille a bhí timcheall an áit sa bpriosúin, bhí fear ins an Spá thiar agus dhún sé spiadóireacht orra agus dhein sé spiodóireacht ar fhear bacath a bhí ann agus cuireadh isteach go h-Innis 'jail' é. Nuair a bhí sé ag dul isteach go dtí an chúirt dúbhairt a driotháir leis \"a mhic na caillighe rugadh de phaiste thu agus fáigh bás id'fhear\". Croth an spiadóir buachaill nach raibh ann chór ar bih na scáméirí. B'éigin don conaire an spiodór imteacht as an tír agus chuaidh sé go 'Sydney'. I gceann ceithre bliadhna ina dhiaidh sin chuaidh a driothair do'n buachaill a crocadh nach raibh san 'gang' chor ar bith go Sydney agus cé'n áit a chuirfeadh an mó-ádh isteach é ach san áit a bhí an connairreach ag obair. Tháinig Conaire i ndáil agus cruith sé lámh leis agus bhí sé ag iarriadh cuile scealta nua ó Éirinn agus ó Condae an Chláir. \"Na corruigh as sin anois\" a dúbhairt Conaire \"go dtagaidh mise amach. Gheobhaidh mé obair dhuit. Tá me ag dul isteach ag mo dhinnéir.\" \"Fannaidh mé annseo\"arsan mbuachaill \"go dtagaidh tú.\" Nuair a tháinigh sé amach chuaidh sé ag obair. Ag déanamh 'yard' mór a bhí siad. Nuair a fuai an buachaill cromtha síos é ag cur síos an mbricks san\n(continues on next page)\n", "school_info": "School: Northampton", "metadata": [{"Location:": "Northampton, Co. Galway", "Teacher:": "\nTomás Ó Domhnalláin\n"}, {"Collector": "(name not given)", "Gender": "unknown"}, {"Informant": "Riocáird de Búrca", "Gender": "male", "Age": "80", "Address": "Cahermore, Co. Galway"}, {"Language": "Irish"}]}, "4583339/4581015/4591303": {"title": "The Fenians", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0057, Page 0182", "Page 0182"], "url": "https://www.duchas.ie/en/cbes/4583339/4581015/4591303", "text": "\nThe FeniansBelow Loughrea the time of the Fenians was a very hot place.  Many Police men were shot and not a person was there found guilty.Now a this period the English Government were taking all kind's of ??? with trades into the police force.  So they sent an old man down to Kilreacle and he was walking around he had his trade of a smith.  At last, he got work with an old smith.  Every month this old police man used to get a cheque from the force, and he used to make out that he was a smith going around working from the different places.  He used also say he had a sister in America and that she used to give him the money.Now he was given this money to gather a crowd of men to drink and to try and find out the men that were at the head of this gang, because he was a secret service man.After having worked for two years with this old smith and after him worked all the time to find out those\n(continues on next page)\n", "school_info": "School: Port Omna (B)", "metadata": [{"Location:": "Portumna, Co. Galway", "Teacher:": "\nSeán Ó Broin\n"}, {"Collector": "Aulban V. Couser", "Gender": "male", "Address": "Portumna, Co. Galway"}, {"Informant": "Mr M. Mitchell", "Gender": "male", "Age": "52", "Address": "Portumna, Co. Galway"}, {"Language": "English"}]}, "4583322/4579745/4650300": {"title": "Local Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0053, Page 0195", "Page 0195"], "url": "https://www.duchas.ie/en/cbes/4583322/4579745/4650300", "text": "\nAbout sixty years ago there was a secret society called Fenians. There was a man who informed on themOne night they came to his house and beat him with wattles untill they thought he was dead.Then they went off a bit and one of them came back to see that he was really dead.He got a red coal and put it to the informer's jaw and he was such a brave and gallant man that he never stirred. When the Fenians were gone the informer followed them and informed the police. Then they were arrested and tried and transported for life.\n", "school_info": "School: Cillín (Portomna)", "metadata": [{"Location:": "Killeen South, Co. Galway", "Teacher:": "\nSeosamh Ó Dúnadhaighe\n"}, {"Collector": "John Nevin", "Gender": "male"}, {"Informant": "Mrs Nevin", "Gender": "female", "Address": "Loughaunroe East, Co. Galway"}, {"Language": "English"}]}, "4649693/4647821/4659705": {"title": "A Local Hero", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0211, Page 386", "Page 386"], "url": "https://www.duchas.ie/en/cbes/4649693/4647821/4659705", "text": "\nSliab an Iarainn in County Leitrim was a great line of defence in many of the wars of Ireland. Here O Rourke prince of Brefney used to organise his forces and withdraw to it when sorely pressed by the enemy. In the \"Black and Tan\" days it was regarded as a sort of haven after the terrors and excitement of the raids and ambushes and many an republican soldier who was wounded severely was brought back to health in the lonely glens of this mountain.At the time of the Fenians a great local hero named Darcy had a small army on this mountain to join in the Fenian rebellion. About half of them had guns and the rest had pikes. No one was more disappointed at the failure of the Fenian Rising than he and at his death the people of the whole country side mourned his loss. He is buried in Oughterach near Ballinamore and his funeral was very large; a couple hundred pike men marched in procession.\n\n\n\nI have heard the following ballad or song sung a few times but never saw it in print. It  was written by a man named Mc Govern, and was known only around the locality in which he lived.Our Country lost a heroAnd the poor man lost a friendOppression's chain he loosenedAnd he'd make a tyrant bend\n(continues on next page)\n", "school_info": "School: Rosaí", "metadata": [{"Location:": "Rossy, Co. Leitrim", "Teacher:": "\nPádhraic Ó Baoighill\n"}, {"Informant": "John Ward", "Gender": "male", "Age": "78", "Address": "Drumhubbrid, Co. Leitrim"}, {"Language": "English"}]}, "4672097/4670047/4672736": {"title": "A Fenian Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0167, Page 062", "Page 062"], "url": "https://www.duchas.ie/en/cbes/4672097/4670047/4672736", "text": "", "school_info": "School: Druim Mór", "metadata": [{"Location:": "Dromore, Co. Sligo", "Teacher:": "\nSeosamh Ó Catháin\n"}, {"Informant": "John Fox", "Gender": "male"}, {"Language": "English"}]}, "4713251/4711525/4715276": {"title": "Na Fíníní", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0455, Page 273", "Page 273"], "url": "https://www.duchas.ie/en/cbes/4713251/4711525/4715276", "text": "\nAn old Fenian who went to America wrote to a friend of his in Glencar. He told his friend of his war experiences in Ireland. When the Fenian rebellion started in Cahirciveen they came through Glencar and there they were told to hide their guns. In a triangular field between two mountains where a stream was they hid the guns at the top of the triangle. He asked his friend to search for the guns in that field so his friend did so with two other men but they could not get them.\n\n\n\nMoriarty of Cahirciveen came with orders to the Fenians in Killarney\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire", "metadata": [{"Location:": "Killarney, Co. Kerry", "Teacher:": "\nAn tSr. Aodán\n"}, {"Language": "English"}]}, "4713251/4711525/4715277": {"title": "Na Fíníní", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0455, Page 273", "Page 273"], "url": "https://www.duchas.ie/en/cbes/4713251/4711525/4715277", "text": "\nAn old Fenian who went to America wrote to a friend of his in Glencar. He told his friend of his war experiences in Ireland. When the Fenian rebellion started in Cahirciveen they came through Glencar and there they were told to hide their guns. In a triangular field between two mountains where a stream was they hid the guns at the top of the triangle. He asked his friend to search for the guns in that field so his friend did so with two other men but they could not get them.\n\n\n\nMoriarty of Cahirciveen came with orders to the Fenians in Killarney\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire", "metadata": [{"Location:": "Killarney, Co. Kerry", "Teacher:": "\nAn tSr. Aodán\n"}, {"Language": "English"}]}, "4713251/4711526/4715278": {"title": "The Fenians", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0455, Page 274", "Page 274"], "url": "https://www.duchas.ie/en/cbes/4713251/4711526/4715278", "text": "\n(continued from previous page)\nThe police arrested him and got the letter. A police man was riding with the (letter) information to Caherciveen. The Fenians saw him and shot him at Mountain Stage.\n\n\n\nThe police arrested him and got the letter. A police man was riding with the (letter) information to Caherciveen. The Fenians saw him and shot him at Mountain Stage.Tom Garde and Joe Noonan two Fenians of Killarney for Queenstown hidden in two barrels. Only three knew of the plan but next day the Military had all information but the two had already escaped. The authorities ordered the Signal Man to be dismissed as he had not given      information of the plot but he gained his case for he proved that it was not his duty to report such things.\n", "school_info": "School: Clochar na Trócaire", "metadata": [{"Location:": "Killarney, Co. Kerry", "Teacher:": "\nAn tSr. Aodán\n"}, {"Language": "English"}]}, "4701673/4691701/4727251": {"title": "Erin Hope", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0158, Page 216", "Page 216"], "url": "https://www.duchas.ie/en/cbes/4701673/4691701/4727251", "text": "\nWhen the \"Erin Hope\" came to Ireland with guns for the Fenians they were going to land ar Rosses Point. Three men went out from the Point and told them not to land because the place was full of English soldiers, but was not an English soldier for miles around. The boat sailed away and was caught. After an hour the Fenians from around came to meet the \"Erin Hope\" and found that she was gone. The Fenians of Rosses Point were.Gilland, Kivelehans, Feeneys, Fiblins, Gillerlanes.\n\n\n\nThe Fenians of Rosses Point were Gillans, Kivelehans, Feeneys, Giblins, Gillerlanes.\n", "school_info": "School: Rosses's Point", "metadata": [{"Location:": "Rosses Point, Co. Sligo", "Teacher:": "\nSeosamh Ó Raighne\n"}, {"Collector": "Paddy Bruen", "Gender": "male", "Address": "Rosses Point, Co. Sligo"}, {"Informant": "P. Gillan"}, {"Language": "English"}]}, "4701673/4691701/4727252": {"title": "Erin Hope", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0158, Page 216", "Page 216"], "url": "https://www.duchas.ie/en/cbes/4701673/4691701/4727252", "text": "\nWhen the \"Erin Hope\" came to Ireland with guns for the Fenians they were going to land ar Rosses Point. Three men went out from the Point and told them not to land because the place was full of English soldiers, but was not an English soldier for miles around. The boat sailed away and was caught. After an hour the Fenians from around came to meet the \"Erin Hope\" and found that she was gone. The Fenians of Rosses Point were.Gilland, Kivelehans, Feeneys, Fiblins, Gillerlanes.\n\n\n\nThe Fenians of Rosses Point were Gillans, Kivelehans, Feeneys, Giblins, Gillerlanes.\n", "school_info": "School: Rosses's Point", "metadata": [{"Location:": "Rosses Point, Co. Sligo", "Teacher:": "\nSeosamh Ó Raighne\n"}, {"Language": "English"}]}, "4701673/4691704/4727258": {"title": "A Chase", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0158, Page 219", "Page 219"], "url": "https://www.duchas.ie/en/cbes/4701673/4691704/4727258", "text": "\nOne time the English soldiers were after a fenian named Giblin who was a big strong man. He was hidden in a barn and the English sent bloodhounds after him. He killed one dog with his hands and the other two with his shovel.\n\n\n\nThere is an island in the mouth of Sligo Bay called Coney Island. All the inhabitants were pagans and when St Patrick came to that island to preach the True Faith he was received very coldly. He went to people called Mulcloioghy and he thought that they were very kind but he changed his mind when he saw what they did.One day he was making a road for them to go to Mass. He caught a rabbit and brought it home for his dinner. When he sat down to his dinner he lifted the lid of\n(continues on next page)\n", "school_info": "School: Rosses's Point", "metadata": [{"Location:": "Rosses Point, Co. Sligo", "Teacher:": "\nSeosamh Ó Raighne\n"}, {"Collector": "P. Bruen", "Address": "Rosses Point, Co. Sligo"}, {"Informant": "P. Gillan"}, {"Language": "English"}]}, "4742131/4738742/4786662": {"title": "Na Fíníní", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0476, Page 159", "Page 159"], "url": "https://www.duchas.ie/en/cbes/4742131/4738742/4786662", "text": "\nBhi alan eirighe amac in Eirinn fado, agus ta baint ag mo mhuinntir le cuid aca. eadhon na Finnini, na Sinn fein agus luct an Poblacht sa mblian 1921. San mblian 1867 a thosnuig na Finnini. Bhi gasra beag diobh i gcatair Saidhbhin agus duine darb ainm Muircheartaig a bhi i gceannas ortha. Do chuadar o Cathair Saidhbhin go Gleann Carrthaig tre an fhaillmhoir a chuadar agus go glisc mar a buaileadar le pilear a bhi ag obair ar shon Sasana. Do thugadar buille maith do. Do cuadar as san go gleann Carraig an ait a scaipeadar agus bhi deire leo. Is o gleann carrthaig a thainig creabh Mhuicheartaig agus do rugadh me ann. Do marbhuigheadh o Mhuicheartaig toisg spiaireacht. Bhi mo athair ins na Sinn Feiners agus is mo troid do throid se i gCathair Saidhbhin. Bhi se ins an eirighe amac eile 1921 agus bhi mo uncail ann leis. Sa bhlian 1916 a thosnuig eirighe amac Sinn Fein agus d'aontuigheadar le ceile agus do throideadar go dian le buadh is le toil i gconnibh na Black-and-Tans ach do bhriseadar an t-aontu aris.Bhi nios mo troda i gCiarraidhe na aon conntae eile. Do fuair na Gaedhil a saoirseacht sa deire, ac ni deireann san na bhfuil crucai Sasana innti fos. \"Is fearr an troid na an t-uaigneas\".\n", "school_info": "School: Na Cealla (Kells)", "metadata": [{"Location:": "Kells, Co. Kerry", "Teacher:": "\nPádraig Ó Fiannachta\n"}, {"Collector": "Tomás Ó Muircheartaigh", "Gender": "male", "Address": "Kells, Co. Kerry"}, {"Informant": "Mícheal Ó Módhrán", "Gender": "male", "Age": "73", "Address": "Roads, Co. Kerry"}, {"Language": "Irish"}]}, "4742131/4738744/4786675": {"title": "Na Fínníní", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0476, Page 161", "Page 161"], "url": "https://www.duchas.ie/en/cbes/4742131/4738744/4786675", "text": "\nNa Fínníní.Bhí cumann na bhfínníní ar siubhal in Éireann agus in a merica sa bhlian 1867 agus is mó amhrán a dheineadh na thaobh bhí na fínníní ar siubhal mór thémcheall na h-aíte seo leis, i bfaill mór, agus sara i bhfad bhí an cumann beag ag méadúghadh agus sar ag dul ar aghaidh go tapaidh. Acht do dhein inghean do gárda cósca na cealla spíaract ortha uair amháin agus cun an scéal a dhéanamh níos measa do scríobh sí go Cill Aírne go dtí na príomh oifigí cun fhios a cuir ortha mar geall ar an cumann a bhí annso agus an scrios a dheineadar.Dob é sin deire le cumann na bfínníní na h-áite seo, mar bhí spíaraithe rómpa ins gac áit.Do díbhrigeadh cuid aca go dtí an Astráil agus go dtí tíortha eile char lear. Cheann doíbh cuireadh go dtí an Astráil a b'eadh Ó góilín ós na Cealla agus nuair bhí sé aosta bhí sé ag iarraidh teact ar n-ais arís ach níor tugadh an cead do, agus cúpla blíain na dhiaidh sin nuair a bhí an fear bocht ag fághail bháis do cuir sé úaireadán agus crios breágh a bhí aige san airm trí phoist go dtí a mhuinntir agus dob' é sin an leitir deirneach a fúaireadar ón díbeartach boct úb mar caillleadh é go luath na dhiaidh sin \"go ndéanfaidh Dia trócaire air\".\n", "school_info": "School: Na Cealla (Kells)", "metadata": [{"Location:": "Kells, Co. Kerry", "Teacher:": "\nPádraig Ó Fiannachta\n"}, {"Collector": "Úna Ní Loingsigh", "Gender": "female", "Address": "Kells, Co. Kerry"}, {"Informant": "Díarmuid Ó Loingsigh", "Gender": "male", "Age": "58", "Address": "Kells, Co. Kerry"}, {"Language": "Irish"}]}, "4742132/4738921/4813223": {"title": "The Fenians", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0476, Page 336", "Page 336"], "url": "https://www.duchas.ie/en/cbes/4742132/4738921/4813223", "text": "\nThe FeniansThe blood-thirsty Fenians were seenSwarming over the country of CahirciveenComing down from the mountain and from the wavesFast unearthing their rifles from ditches and racksTheir leaders some wild-looking men from New YorkBut all their labours were spend in rainFor friends and neighbours through hill and plainGave the sheltering hand and heart of truthTo the mad brave land of Iveragh's youthWho struck at nought but the alien lawsAnd whose hearts were hot in their country's causeHurrah for the peasants of Caherciveen!No bolder or braver in Ireland are seen,No Soldiers more true to the banner of green,Than the free-hearted peasants of Caherciveen!Oh, who could like slaves, looking out on that scene,On those valleys decked bright in their emerald sheen,On the heaven-kissing mountains that stand up between,And the wave-beaten headlands of Caherciveen!Then joy be the lot of that race bold and keen,\n(continues on next page)\n", "school_info": "School: An Clochar, Cathair Saidhbhín", "metadata": [{"Location:": "Cahersiveen, Co. Kerry", "Teacher:": "\nAn tSr. M. de Lourdes Stac\n"}, {"Language": "English"}]}, "4742158/4740872/4814282": {"title": "The Battle of Bunker's Hill", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0773, Page 201", "Page 201"], "url": "https://www.duchas.ie/en/cbes/4742158/4740872/4814282", "text": "\nThe Battle of Bunkers HillOn the right hand side of Newbridge Co Kildare there is a hill which is called Bunkers hill where there was once a battle fought.This battle was during the rising of the Fenians. Many lives were lost.It is said that when the new road going through Castletown Demense was being made that there was carl loads of humane bones found, which were afterwards taken and buried in Donacomphey, Celbridge In one of Mr Ronald fields there is still to be seen five graves.Told by Maureen Malones father John Malone, Celbridge Road Leixlip\n", "school_info": "School: Leixlip (C.)", "metadata": [{"Location:": "Leixlip, Co. Kildare", "Teacher:": "\nMrs. Harty\n"}, {"Collector": "Maureen Malone", "Gender": "female"}, {"Informant": "John Malone", "Relation": "parent", "Gender": "male", "Address": "Leixlip, Co. Kildare"}, {"Language": "English"}]}, "4723827/4716832/4814315": {"title": "Historical Happenings", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0937, Page 171", "Page 171"], "url": "https://www.duchas.ie/en/cbes/4723827/4716832/4814315", "text": "\nThe Tonagh Riot was a fight between the \"Home Rulers\" and \"The Fenians\" about sixty years ago, and one of the Fenians named the \"Jailer Clarke\" was killed. This caused great disturbance in the country and consequently the police were sent to find out who shot him and the final was that men were imprisoned who were not guilty. The most terrific storm that has ever been was the storm of 1898. All the people were so frightened that they were praying by the roadsides. So heavy was the rain and so high were the floods that they thought it was the end of the world.\n", "school_info": "School: Lios na gCraobh", "metadata": [{"Location:": "Lisnagreeve, Co. Monaghan", "Teacher:": "\nT. Ó Mórdha\n"}, {"Collector": "Terrence Kerr", "Gender": "male"}, {"Language": "English"}]}, "4723827/4716859/4814378": {"title": "Local Hero", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0937, Page 198", "Page 198"], "url": "https://www.duchas.ie/en/cbes/4723827/4716859/4814378", "text": "\nAlmost one hundred years ago there was born at Drumgallon Castleblayney County Monaghan a man who became famous not only at home in Ireland but also in America, as both a great leader of the Fenians there, and a great Catholic. When he was about fourteen years of age, he went over to America to his other brothers. He joined the Fenian movement there and later became their chief general. It was he general John O'Neill that led the attack on Canada. He was also a great Catholic because he would not allow any of his soldiers to speak or do anything disrespectful regarding the Catholic religion.The remains of the house where he lived are still to be seen in Drumgallon and there is an old lane going past the house and the people call it Bett's lane because his mother’s name was Betty.\n", "school_info": "School: Lios na gCraobh", "metadata": [{"Location:": "Lisnagreeve, Co. Monaghan", "Teacher:": "\nT. Ó Mórdha\n"}, {"Collector": "Mary Kettle", "Gender": "female"}, {"Language": "English"}]}, "4742110/4736867/4816866": {"title": "A Story about the Fenians", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0471, Page 329", "Page 329"], "url": "https://www.duchas.ie/en/cbes/4742110/4736867/4816866", "text": "\nWhen the heads of the Fenians were arrested some of them hid in Tomies mountain. One night three or four of them came to our house and my grandfather's father drove them back to Glais a' Caoraig near Glencar. They were never heard of since.\n", "school_info": "School: Kilgobnet", "metadata": [{"Location:": "Kilgobnet, Co. Kerry", "Teacher:": "\nSéamus Ó Cinneide; Ellen Foley\n"}, {"Informant": "John Sullivan", "Relation": "grandparent", "Gender": "male", "Address": "Kilgobnet, Co. Kerry"}, {"Language": "English"}]}, "4742101/4736028/4824170": {"title": "The Fenians", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0469, Page 092", "Page 092"], "url": "https://www.duchas.ie/en/cbes/4742101/4736028/4824170", "text": "\nSome of the Caherciveen Fenians passed through here on the way to Killarney. They did not know the rising was not to take place. An old man (Tagney) from  Gerahmeen who was taking fish to Killorglin (salmon) met them at Beaufort Bridge where they were awaiting instructions. The Captain asked him to take a message for him to Killorglin but on second thoughts they decided not as the man might be shot. They saw a messenger coming. He happened to be carrying dispatches from the opposite side. They shot his horse; got the information they wanted, & scattered. Some of them made for the sea where the procured boats and left Ireland.\n", "school_info": "School: Gráig na Gréine", "metadata": [{"Location:": "Graignagreana, Co. Kerry", "Teacher:": "\nAnna Ní Shiocfhradha\n"}, {"Collector": "Anna Ní Shiocfradha", "Gender": "female", "Occupation": "múinteoir"}, {"Informant": "Micheál Ua Laochdha", "Gender": "male", "Address": "Clash, Co. Kerry"}, {"Language": "English"}]}, "4798657/4787622/4923145": {"title": "A Fenian Song", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0234, Page 066", "Page 066"], "url": "https://www.duchas.ie/en/cbes/4798657/4787622/4923145", "text": "\nICheer up, my boys, with heart and hand,And think of New Year's Day.As we raise our flag of freedom with Our banners light and gay.As we marched the green we wore the green,We cheered on every brae,To bring freedom to old Ireland,And a happy New Year's day.And the harp of Ireland's freedomWas sounded on New Year's Day.IIThe bands they came [\"home\" crossed out] to meet us andThey marched in ranks so gay.To bring freedom to old Ireland,And a happy New Year's Day.they assembled in their thousands allFrom Easkey and DromoreWith their ship out on the ocean asThey row their boats to shore.They assembled in their thousands all,From Sligo and Knocknarea,And the pride of all Tir Éire wasThe Fenian men that day.\n(continues on next page)\n", "school_info": "School: Clews' Memorial", "metadata": [{"Location:": "Boyle, Co. Roscommon", "Teacher:": "\nMáire Ní Néill\n"}, {"Collector": "Bridget Carty", "Gender": "female", "Address": "Sheegorey, Co. Roscommon"}, {"Informant": "Tim Carty", "Relation": "relative (other than parent or grandparent)", "Gender": "male", "Age": "22", "Address": "Sheegorey, Co. Roscommon"}, {"Language": "English"}]}, "4742088/4734748/4928519": {"title": "Cistí Óir i bhFolach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0466, Page 008a", "Page 008a"], "url": "https://www.duchas.ie/en/cbes/4742088/4734748/4928519", "text": "\nThere is a big stone standing on a man's farm named John Sullivan of Ardmore, and it is said that there is gold hidden under it. It is said the Danes put it there, there is also a cave five or six yards from it and it is supposed that they used to stay in the cave for safety from their enemies. Some time long ago there was a man going to dig up the soil around the stone, but the people said he was foolish because he might never reach to the bottom of it. There were Danes running from some enemies in ships, and they landed at White Strand. Many people believe that they buried a crock of gold there but, they also believe that it is not right to go searching for hidden treasures.\n", "school_info": "School: Gleann Locha", "metadata": [{"Location:": "Glanlough Upper, Co. Kerry", "Teacher:": "\nPádraig Palmer\n"}, {"Informant": "D. Connor", "Gender": "unknown", "Address": "Ardmore, Co. Kerry"}, {"Language": "English"}]}, "4921935/4911328/4932606": {"title": "The Fenian Times - A Funny Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0480, Page 345", "Page 345"], "url": "https://www.duchas.ie/en/cbes/4921935/4911328/4932606", "text": "\nIn the Fenian times in Glin, there lived a famous joker. The Glin people were used to him, and only laughed at all his tricks.Spies, Englishmen, were sent out to watch the movements of the young men of the district.These spies went amongst the people and were seemingly very gracious. The people were cautious.One day, a spy happened to meet our friend. They conversed together for some time in low tones. Thinking that the Glin man was one of his own, the Englishman remarked that he heard drilling was going on every night.The joker agreed and not only that but promised that if he came that very night he would show him the leader and his little band.The time and hour were appointed. It was near a lone house in a glen and the time was twelve o'clock.Near the house was a drake with twelve ducks. Disturbed at this unearthly hour the drake rose quickly and was followed in a straight line by the ducks. The spy turned on his heel. The Glin man's laugh re echoed through the glen.\n", "school_info": "School: Glin (C.)", "metadata": [{"Location:": "Glin, Co. Limerick", "Teacher:": "\nBean Mhic Cárthaigh\n"}, {"Language": "English"}]}, "4742114/4737111/4936247": {"title": "Na Fíníní", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0472, Page 212", "Page 212"], "url": "https://www.duchas.ie/en/cbes/4742114/4737111/4936247", "text": "", "school_info": "School: Curraichín (C.)", "metadata": [{"Location:": "Curraheen, Co. Kerry", "Teacher:": "\nEibhlín Ní Chonchobhair\n"}, {"Collector": "Nora Ní Laighin", "Gender": "female"}, {"Informant": "Diarmuid Ó Laighin", "Relation": "parent", "Gender": "male", "Age": "60", "Address": "Curraheen, Co. Kerry"}, {"Language": "Irish"}]}, "4742114/4737123/4936379": {"title": "Na Fíníní", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0472, Page 224", "Page 224"], "url": "https://www.duchas.ie/en/cbes/4742114/4737123/4936379", "text": "", "school_info": "School: Curraichín (C.)", "metadata": [{"Location:": "Curraheen, Co. Kerry", "Teacher:": "\nEibhlín Ní Chonchobhair\n"}, {"Language": "Irish"}]}, "4723821/4716270/4936423": {"title": "Mass Rock in Drumbo", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0936, Page 008", "Page 008"], "url": "https://www.duchas.ie/en/cbes/4723821/4716270/4936423", "text": "\n(continued from previous page)\nThere is a field in Shanmullagh (pron. Shamla) called Glenfonta. Also a hill called Shillin hill where corn was shilled in olden times to remove seed.Cams were pots in which resin was boiled to make candles. Man-o-war hill near Keady so called because a battle was fought there. Mudwall  row also near Keady so called because there was a row of mudwall houses there about 100 years ago.The \"Bar\" is in Shanmullagh. It is a kind of cross roads where Fenian meetings were held.\n\n\n\nBoxty bread was made in the time of the Famine. The potatoes were black so the people grated and squeezed the starch out of them and mixed it with flour.When the Boxty mill began to stillThey thought it was the divil oThey lifted it up in handfulsand they threw it on the griddle oSowens are made still here.\n", "school_info": "School: Moys", "metadata": [{"Location:": "Moy Otra, Co. Monaghan", "Teacher:": "\nP. Dawson, C. Mac an Ghirr\n"}, {"Language": "English"}]}, "4742115/4737346/4937174": {"title": "Scéal", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0472, Page 495", "Page 495"], "url": "https://www.duchas.ie/en/cbes/4742115/4737346/4937174", "text": "", "school_info": "School: Curraichín (B.)", "metadata": [{"Location:": "Curraheen, Co. Kerry", "Teacher:": "\nSeán Ó Scothlaoich\n"}, {"Collector": "Donncadh Ó hEaluighthe", "Gender": "male", "Address": "Curraheen, Co. Kerry"}, {"Informant": "Máire Ní Siocradha", "Relation": "parent", "Gender": "female", "Address": "Curraheen, Co. Kerry"}, {"Language": "Irish"}]}, "4742115/4737347/4937177": {"title": "Duine de na Fíníní", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0472, Page 496", "Page 496"], "url": "https://www.duchas.ie/en/cbes/4742115/4737347/4937177", "text": "", "school_info": "School: Curraichín (B.)", "metadata": [{"Location:": "Curraheen, Co. Kerry", "Teacher:": "\nSeán Ó Scothlaoich\n"}, {"Collector": "Donncadh Ó Seaghdha", "Gender": "male"}, {"Informant": "Micheál Mach Cionnaith", "Gender": "male", "Age": "75", "Address": "Callahaniska, Co. Kerry"}, {"Language": "Irish"}]}, "4921985/4915481/4943643": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0494, Page 181", "Page 181"], "url": "https://www.duchas.ie/en/cbes/4921985/4915481/4943643", "text": "\nOn the Kerry-Cork line near the bounds of the three counties, can be seen the remains of a house. Local traditions say that in this house the hunted Earl of Desmond, his wife and the Papal Nuncio hid, while the Protestant Earl of Ormond hunted the country for them. It is said that they fled to the river Feale and hid up to their necks in water while the soldiers searched the house for them. Its late owner organised and trained the Fenians there before the Rising of '67.Cáit Ní Loineacháin\n", "school_info": "School: Mín na Cille, Mainistir na Féile", "metadata": [{"Location:": "Meenkilly, Co. Limerick", "Teacher:": "\nAindrias Ó Dúnadhuighe\n"}, {"Collector": "Cáit Ní Loineacháin", "Gender": "female"}, {"Language": "English"}]}, "4921976/4914743/4945152": {"title": "The Sandhills of Kilmore", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0492, Page 069", "Page 069"], "url": "https://www.duchas.ie/en/cbes/4921976/4914743/4945152", "text": "\nLast night as we assembled by Kilmores old mantle glens,Assembled for to drill our boys, we had but nine or ten,But as the moon shone bright and clear we mustered forty-four,We were drilled by Captain Nolan on the Sandhills of Kilmore.Our Captain is a neat young man though his age is scarce eighteen, he being young his heart is true and he dearly loves the green.He drills his men each evening at the hour of half past four, we'll be drilled from this night forward on the Sandhills of Kilmore.We have some men from\n(continues on next page)\n", "school_info": "School: Templeglantine (B.)", "metadata": [{"Location:": "Templeglentan, Co. Limerick", "Teacher:": "\nMaitiú Ó Duilleáin\n"}, {"Collector": "Dáthaí Ó Cáthail", "Gender": "male", "Address": "Inchabaun, Co. Limerick"}, {"Informant": "(name not given)", "Relation": "grandparent", "Gender": "male"}, {"Language": "English"}]}, "4922093/4851731/4945532": {"title": "Fairy Forts", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0523, Page 139", "Page 139"], "url": "https://www.duchas.ie/en/cbes/4922093/4851731/4945532", "text": "\n(continued from previous page)\nburial place for upbaptised babies.Fennessys Fort:A Fenian soldier was shot near here and his ghost is seen in the fort.\n\n\n\nOf the many forts all are of circular shape, surrounded by a fence of clay. It is said that a family whose name is still common in the district interfered once with a fort and suffered for years afterwards with sickness and misfortune.\n", "school_info": "School: Caisleán Ó gConaing (C.)", "metadata": [{"Location:": "Castleconnell, Co. Limerick", "Teacher:": "\nBean Uí Uallacháin\n"}, {"Informant": "Eileen Mc Cabe", "Gender": "female", "Address": "Castleconnell, Co. Limerick"}, {"Language": "English"}]}, "4921996/4916608/4948185": {"title": "Irish Chief", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0497, Page 322", "Page 322"], "url": "https://www.duchas.ie/en/cbes/4921996/4916608/4948185", "text": "\n(continued from previous page)\nwere given to one of Cromwell's officers Conyers and has been in their possession since\n\n\n\nThe Whiteboys used to go around the district disguised with white shirts and sometimes blackened faces. When travelling through strange districts they used to be very careful about calling for food. Calling at a house between here and Ballingarry they were told to call next evening. When one of them put his hand for the food the hand was held and the whiteboy shot through the window. He was brought to Castletown Barrack but could not or would not be identified.\n\n\n\nAfter the attack on Kilmallock Barrack one of the Fenians who took part in it took refuge in the chapel here at Ballygran.About the same time a party of soldiers were\n(continues on next page)\n", "school_info": "School: Béal Átha Grean", "metadata": [{"Location:": "Ballyagran, Co. Limerick", "Teacher:": "\nDónall Ó Cuill\n"}, {"Language": "English"}]}, "4921996/4916608/4948212": {"title": "Irish Chief", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0497, Page 322", "Page 322"], "url": "https://www.duchas.ie/en/cbes/4921996/4916608/4948212", "text": "\n(continued from previous page)\nwere given to one of Cromwell's officers Conyers and has been in their possession since\n\n\n\nThe Whiteboys used to go around the district disguised with white shirts and sometimes blackened faces. When travelling through strange districts they used to be very careful about calling for food. Calling at a house between here and Ballingarry they were told to call next evening. When one of them put his hand for the food the hand was held and the whiteboy shot through the window. He was brought to Castletown Barrack but could not or would not be identified.\n\n\n\nAfter the attack on Kilmallock Barrack one of the Fenians who took part in it took refuge in the chapel here at Ballygran.About the same time a party of soldiers were\n(continues on next page)\n", "school_info": "School: Béal Átha Grean", "metadata": [{"Location:": "Ballyagran, Co. Limerick", "Teacher:": "\nDónall Ó Cuill\n"}, {"Collector": "Hannah Green", "Gender": "female", "Address": "Ballyagran, Co. Limerick"}, {"Informant": "Hannah Green", "Gender": "female", "Age": "70"}, {"Language": "English"}]}, "4921996/4916609/4948214": {"title": "Fenians", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0497, Page 323", "Page 323"], "url": "https://www.duchas.ie/en/cbes/4921996/4916609/4948214", "text": "\nDuring the famine period this district had its share of horrors. Men of whom I remember saw strong men dead of hunger. The nearest poorhouse was at Ballingarry a place infamous for its soup kitchens.\n", "school_info": "School: Béal Átha Grean", "metadata": [{"Location:": "Ballyagran, Co. Limerick", "Teacher:": "\nDónall Ó Cuill\n"}, {"Language": "English"}]}, "4922001/4916982/4949601": {"title": "A Fenian's Escape", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0498, Page 240", "Page 240"], "url": "https://www.duchas.ie/en/cbes/4922001/4916982/4949601", "text": "\nAfter the Fenian rising a man named Rourke was arrested wounded in his own bed in Clogher. A policeman was send to mind him. Now Rourke had a very pretty sister who began to show great attention to the policeman \"mar dead\". One night she managed to coax him out of her brothers room and this was no sooner done than out hopped O'Rourke putting some packing in his place. He went out through the window and escaped in a barrel which was put in the middle of a load of hay. It was then that the policeman paid for his laxity.\n", "school_info": "School: Brúgh Ríogh (B.)", "metadata": [{"Location:": "Bruree, Co. Limerick", "Teacher:": "\nDonncha Ó Haragáin\n"}, {"Informant": "Michael O' Rourke", "Gender": "male", "Age": "83", "Address": "Clogher East, Co. Limerick"}, {"Language": "English"}]}, "4742123/4738056/4950311": {"title": "Seanchas Stairiúil", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0474, Page 218", "Page 218"], "url": "https://www.duchas.ie/en/cbes/4742123/4738056/4950311", "text": "\nSeanchas StaireamhailDomhnall Ua Cúrnáin Málainn 48 bl.Na FiníníCaptaen Ó Conchubhair ó Americeá.  Bhí sé ag cur fé i dtigh Sheáin Dáith i gCathair Saidhbhín.  D’éirigheadh sé amach ar fuaid na sráide agus culaith mná air agus ní raibh aon amhras ages na ‘Peelers’ annsan air.  Bhí mo athair ‘na gharsún óg agus an cuimhne ba shia shiar na cheann ná go dtáinig trí fichead Pílear agus gunnaí aca aon lá amháin anfar de dhruim Chnuic Chill Mhic Ciarainn ar thóir na bhfiníní agus chuardaigheadar na h-aon rúinne de Mhálainn acht níor bhuail aon ní leó.Na Deachmhaidhte:    Thugadh na daoine an deachmhadh cuid le gach nídh a bhíodh aca do’n Mhuinstéir.  Bhíodh fear á bhailiú ins gach ceanntair.  Bhí prócadóir na h-áite seo ‘na chomhnuidhe i gCill mhic Ciarainn mar atá Mhícheál de Faoite anois.  Bhí a bhean ‘na dhiaidh ann ‘Cailleach an Phrócadóra’ a thugtí uirthí.  Bhí gáirdín deas cistin ann agus is iongantach é go bhfuilid na blátha anois ann ‘na h-aon Samhradh sa pháirc taobh thiar do’n tigh.Gorta:    Fuair  Bean Uí Shíodhthacháin  Dromaireach bás.  Bhí sí féin agus a fear breóidhte i n-éinfeacht.  Cailleadh a bhean agus bhí an fear ró lag chun í a bheir go Teampall na Dromada.  Dubhairt an fear le na dhearbhráthair í thógaint do’n Teampall agus go bhféadfadh sé an chaora a bfearr a thógaint mar thuarasdal.  Ré bhuachaill a beadh an duine sin.  Thóg sé an chaoira agus chuir sé an bhean bhocht i gcúinne na h-iothlainne cois an tighe.\n", "school_info": "School: Cill Mac Ciarainn", "metadata": [{"Location:": "Kilmackerrin East, Co. Kerry", "Teacher:": "\nSeán Ó Cathasaigh\n"}, {"Informant": "Domhnall Ua Cúrnáin", "Gender": "male", "Age": "48", "Address": "Maulin, Co. Kerry"}, {"Language": "Irish"}]}, "4742123/4738061/4950322": {"title": "Na Fíníní", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0474, Page 223", "Page 223"], "url": "https://www.duchas.ie/en/cbes/4742123/4738061/4950322", "text": "\nNa FiníníI am a young fellow from CaherciveenThat lately took my gun to fight for the greenThrough valleys and mountains I do run along I’ll leave them alone and commence with my songThe night of the Rising it was a great sightTo see our brave heroes prepare for a fightWith their pikes, their rifles, their swords and their gunsIt was glorious to see old Erin’s sonsWe marched to Kells station which lies on the strandThe sea with great foam beats up on the landsIt was there you may say we had courage ‘go leor’When Kells station was taken by the boys of FilemoreIt was off on the road to Dronghill we did go.We soon met a police man on horseback he rodeWe cried out ‘Surrender’ but he cried ‘No, No’So this ball from my Conway left this bobbie lie lowIt was off on the road to Glenbeigh we did goWe soon met Father Meggin and to him we bowed lowHe gave us his blessing saying ‘Christ be your friend’In the battle of freedom which you are all bent.\n", "school_info": "School: Cill Mac Ciarainn", "metadata": [{"Location:": "Kilmackerrin East, Co. Kerry", "Teacher:": "\nSeán Ó Cathasaigh\n"}, {"Language": "English"}]}, "4922001/4917072/4950605": {"title": "The Fenians", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0498, Page 330", "Page 330"], "url": "https://www.duchas.ie/en/cbes/4922001/4917072/4950605", "text": "\nThe Fenians were fairly active in this locality before the '67 rising. They dressed their pikes and made handles for them at Johnnie Walshe's workshop in Tankardstown. However they were forced to shift to houses back Berehaven boreen - but all these houses he long ceased to exist. The cause of their removal was a spy called \"Jack from Nenagh\". On one occasion when he was telling that they were dressed at Joyces he forgot the name but said it was a house back a boreen. Johnnie Walsh was sentenced to six months imprisionment and Willie Wall was sentenced to transportation for life in the Rocky mountains and ended his life in Penal servitude. The pikes were a spear pattern and were put on in the same manner as a modern hay fork. Boxes of pike heads were hidden in the ditches and were well used in the Kilmallock barrack attack. Then Fenians drilled in Gortnshane[?] field in Clogher and\n(continues on next page)\n", "school_info": "School: Brúgh Ríogh (B.)", "metadata": [{"Location:": "Bruree, Co. Limerick", "Teacher:": "\nDonncha Ó Haragáin\n"}, {"Collector": "J.M. Joyce", "Gender": "unknown", "Address": "Tankardstown, Co. Limerick"}, {"Language": "English"}]}, "4742125/4738187/4950748": {"title": "Oileán Buí", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0474, Page 349", "Page 349"], "url": "https://www.duchas.ie/en/cbes/4742125/4738187/4950748", "text": "\n(continued from previous page)\nIs aoibhinn dán draoithe is daimhSgaoilfear cách atá fe’n amadhChíofar Clár Uí Chaoimh gan spleadhchasFé lá le Sheághain tá’n báire casta.\n\n\n\nNa FinghíníBhí Tadhg Ua Sheaghda agus a dhriotháir Seán go treán ar thaobh na bhFinghíní  agus bhíodar páirteach san cath a buaileadh ag na Cealla le h-ais Cathair-Saidhbhín áit ar bhuaidh na Finghíní.   Ag tagairt do’n bhuadh so agus ag moladh Thaidhg do sgríobh file – Diarmuid Ruadh na Bolgaí – a bhí ina chómhnaidhe sa gCaol i bParóiste na Dromad le linn an ama seo.  Seo mar adubhairt:-1.Ar an gCaol nó i gaolmhar Íne Tá an shéimh fhear breágh mín-tais gan cáimRamh chailce do  mhaitheas na tíreamhIs tá fuinneamh in-a croidhe is is in a cnámhIs craobh cosanta pobal da bhuidhean é.Is ní ghéillfeadh sé coidhche dá namhaidIs dá léighfinn-se le h-éifeacht  leabhar diadhachtaNí fheudfainn cur síos ar a cháil.11.\n(continues on next page)\n", "school_info": "School: Cathair Samháin", "metadata": [{"Location:": "Cahersavane, Co. Kerry", "Teacher:": "\nMáire E. Bean Uí Sheaghdha\n"}, {"Informant": "Muiris Ua Conaill", "Gender": "male", "Occupation": "feirmeoir", "Address": "Killeenleagh, Co. Kerry"}, {"Language": "Irish"}]}, "4922042/4921449/4953661": {"title": "The Fenian Rising of 1867", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0509, Page 516", "Page 516"], "url": "https://www.duchas.ie/en/cbes/4922042/4921449/4953661", "text": "\nReferred to locally as \"the rising\". A stone cross in Kilmallock town bears the names of the natives who died for Ireland in '64. Among those names is one \"Clery\" a young doctor who died was identified. This is important for his relatives afterwards wanted to say he was \"The Unkown Fenian\" whose body rests in a grave in the old churchyard of Killmallock and to whom people of Kilmallock have erected a handsome monument over his tomb. It bears the inscription The Unknown Fenian.\n\n\n\n\"At the Fenian raid in Kilmallock, March 1864, there was a young man whose name and person were unknown to his companions, although he exposed himself courageously to the fire flying thickly from the barracks. Next day his dead body was found some distance from the place of action(i.e. on the bridge which\n(continues on next page)\n", "school_info": "School: Bulgaden (C.), Kilmallock", "metadata": [{"Location:": "Bulgaden, Co. Limerick", "Teacher:": "\nIsibéal, Bean Uí Bhriain\n"}, {"Language": "English"}]}, "4922042/4921449/4953662": {"title": "The Fenian Rising of 1867", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0509, Page 516", "Page 516"], "url": "https://www.duchas.ie/en/cbes/4922042/4921449/4953662", "text": "\nReferred to locally as \"the rising\". A stone cross in Kilmallock town bears the names of the natives who died for Ireland in '64. Among those names is one \"Clery\" a young doctor who died was identified. This is important for his relatives afterwards wanted to say he was \"The Unkown Fenian\" whose body rests in a grave in the old churchyard of Killmallock and to whom people of Kilmallock have erected a handsome monument over his tomb. It bears the inscription The Unknown Fenian.\n\n\n\n\"At the Fenian raid in Kilmallock, March 1864, there was a young man whose name and person were unknown to his companions, although he exposed himself courageously to the fire flying thickly from the barracks. Next day his dead body was found some distance from the place of action(i.e. on the bridge which\n(continues on next page)\n", "school_info": "School: Bulgaden (C.), Kilmallock", "metadata": [{"Location:": "Bulgaden, Co. Limerick", "Teacher:": "\nIsibéal, Bean Uí Bhriain\n"}, {"Language": "English"}]}, "4922042/4921451/4953663": {"title": "The Unknown Fenian", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0509, Page 518", "Page 518"], "url": "https://www.duchas.ie/en/cbes/4922042/4921451/4953663", "text": "\n(continued from previous page)\nnative of Sráid-na-cathrach - Miltown Malbay in the west, say that a man - a farmer's son left the townland of Kilcorcoran(birthplace of the poet Comyn) to go in the direction of Limerick from whence he never after returned; and that we had here in Kilmallock town a Clare man for \"the unkown Fenian. \"History repeats itself\". A young man from the same town was in later years supposed to be present at the taking of Kilmallock barracks.\n\n\n\nThe following ballad was composed by Michael Hogan(the bard of Thomond) and can be recited by old persons yet in the period. \"The Nameless Patriot\"Who was he at Kilmallock, that brave-hearted strangerThat daringly breasted the fire of the foe?Like a veteran inured to the battles grim dangerHe fought till the red hail of death laid him lowNameless he fell on the frozen sword dyingNo kind hand to soothe him or bear him awayThe dreary March wind his sad litany sighingHis death-couch and pillow the blood-moistened clay\n(continues on next page)\n", "school_info": "School: Bulgaden (C.), Kilmallock", "metadata": [{"Location:": "Bulgaden, Co. Limerick", "Teacher:": "\nIsibéal, Bean Uí Bhriain\n"}, {"Language": "English"}]}, "4922114/4853504/4956312": {"title": "The Fenians of '67 in Kilmallock", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0528, Page 362", "Page 362"], "url": "https://www.duchas.ie/en/cbes/4922114/4853504/4956312", "text": "", "school_info": "School: Killmallock Convent School", "metadata": [{"Location:": "Kilmallock, Co. Limerick", "Teacher:": "\nAn tSr. Dimpna\n"}, {"Collector": "Maureen Sheedy", "Gender": "female"}, {"Informant": "Daniel Fitzpatrick", "Gender": "male", "Address": "Kilmallock, Co. Limerick"}]}, "4922059/4848507/5009867": {"title": "William Condon", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0513, Page 254", "Page 254"], "url": "https://www.duchas.ie/en/cbes/4922059/4848507/5009867", "text": "\n\"I remember Clifford Lloyd,Says the grand old manWith his troops by his sideSays the grand old manFearless Condon him defiedTo the right his men deployedVictoriously he cried\"Galtee men, lead on\". My fathers name God rest his sould and all the poor souls was William Condon but he was known to his friends and all through the counties Limerick, Cork and Tipperary as \"Willie\" Condon. He was a\n(continues on next page)\n", "school_info": "School: Anglesboro (B.), Baile Mhistéala", "metadata": [{"Location:": "Anglesborough, Co. Limerick", "Teacher:": "\nPádraig Ó Cadhla\n"}, {"Informant": "Mrs H. Cleary", "Gender": "female", "Age": "67", "Occupation": "dress-maker", "Address": "Anglesborough, Co. Limerick"}, {"Language": "mixed"}]}, "4769993/4764791/5013661": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0825, Page 127", "Page 127"], "url": "https://www.duchas.ie/en/cbes/4769993/4764791/5013661", "text": "\nIn the time of Fenians in 1867 there were some Fenians living in Mountmellick, Co, Leix the most important of those were Con Bacon, the brothers Walsh, and a painter name Dillon. There were warrants issued for the arrest of the two latter. One day Dillon walked up the main street, and halted opposite the polices barrack. He had an unloaded revolver in one hand and a crucifix in the other. The police put their rifle through the barred window and fired at Dillon. One of the bullets hit the crucifix in his hand and ricocheting killed a man named Bradley, who was watching the proceedings from a gateway about thirty yards away. Bradley's family were afterwards compensated by the English Government. Seeing they aren't shout Dillon, the police emerged and seizing him carried him into the barrack. Con Bacon and himself were charged with high Treason at a court held in Kilmainham, Mountmellick. But during the trial Fr, Steally the P.P rode up to the courthouse and told the magistrate to find those guilty, at their own risk and if they interfered with the men he would stick them to the bench upon which they sat, The men were allowed to go free. Dillon afterward escaped to America.The Story was related by the late Mrs E. Dowling, Mountmellick  (an eyewitness to the shooting) to her son A.Dowling\n", "school_info": "School: Paddock, Mountrath", "metadata": [{"Location:": "Paddock, Co. Laois", "Teacher:": "\nA. Ó Dubhlainn\n"}, {"Collector": "A. Dowling", "Gender": "male"}, {"Informant": "Mrs E. Dowling", "Relation": "parent", "Gender": "female"}, {"Language": "English"}]}, "4922208/4860810/5015832": {"title": "The Fenians", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0553, Page 159", "Page 159"], "url": "https://www.duchas.ie/en/cbes/4922208/4860810/5015832", "text": "\nThe FeniansThurles Fenians were led by a Colonel Nolan, once of Brittas - who had returned from America to lead. They met at Dwyer's of the Commons, marched out to Holycross, took an empty barracks then went on to the Ragg (Buaile Dubh) and Drom where they met the Templemore military + fled for their lives.General Gleeson of Rathmoy came from America to lead the Annefield, Inch, and Borris six. The fpikes were carried to Gortkelly in a cart owned by a Mr Bouke of Kylecross. In Gortkelly they went to the house of Andrew Ryan, who was an antiquarian in the hop that old guns and swords might be had. They got one old gun, which they said \"wouldn't kill a fly\" From there they went to Barnane Mountain - the meeting place - filled it with powder + blew it up as the soldiers in red coats marched up to intercept them. It made a noise and a blaze but that was all. Thurles college under Father Ned Ryan was searched soon after by soldiers looking for General Gleason. The Annifield Fenians took Rosheen barracks but the 'peelers' were gone.\n", "school_info": "School: Rahelty, Dúrlas Éile", "metadata": [{"Location:": "Rahelty, Co. Tipperary", "Teacher:": "\nTadhg Mac Domhnaill\n"}, {"Language": "English"}]}, "4922209/4860858/5015878": {"title": "Chapel Lane", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0553, Page 204", "Page 204"], "url": "https://www.duchas.ie/en/cbes/4922209/4860858/5015878", "text": "\nChapel LaneThis was the passage into the Palace + here two men named Cahil, natives of the town - started a school, from which later developed the Chris. Bro's.\n\n\n\nThurles Fenians were led by a Col. Nolan once of Brittas who had returned from America to lead. They met at Dwyers COmmons, marched out to Holy Cross, took in empty barracks, then marched on to the Ragg + Drom where they met the Templeman Military. General Gleeson came from America to lead the Annfield, Inch + Borris Men. The pikes were carried to Gortkelly in a cart owned by Mr Burke of Kyle Crew. They went off to Barrane Mt, the meeting place filled it with powder + blew it up as the soldiers in red coats marched up to intercept them. It made a noise + blaze. Thurles College was searched soon after by soldiers looking for Gen. Gleason.\n", "school_info": "School: Leamhach (Leigh)", "metadata": [{"Location:": "Leigh, Co. Tipperary", "Teacher:": "\nMáighread Ní Mhuireagáin\n"}, {"Language": "English"}]}, "4922209/4860858/5015879": {"title": "Chapel Lane", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0553, Page 204", "Page 204"], "url": "https://www.duchas.ie/en/cbes/4922209/4860858/5015879", "text": "\nChapel LaneThis was the passage into the Palace + here two men named Cahil, natives of the town - started a school, from which later developed the Chris. Bro's.\n\n\n\nThurles Fenians were led by a Col. Nolan once of Brittas who had returned from America to lead. They met at Dwyers COmmons, marched out to Holy Cross, took in empty barracks, then marched on to the Ragg + Drom where they met the Templeman Military. General Gleeson came from America to lead the Annfield, Inch + Borris Men. The pikes were carried to Gortkelly in a cart owned by Mr Burke of Kyle Crew. They went off to Barrane Mt, the meeting place filled it with powder + blew it up as the soldiers in red coats marched up to intercept them. It made a noise + blaze. Thurles College was searched soon after by soldiers looking for Gen. Gleason.\n", "school_info": "School: Leamhach (Leigh)", "metadata": [{"Location:": "Leigh, Co. Tipperary", "Teacher:": "\nMáighread Ní Mhuireagáin\n"}, {"Language": "English"}]}, "4922111/4853136/5016427": {"title": "The Rock of the Candle", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0527, Page 412", "Page 412"], "url": "https://www.duchas.ie/en/cbes/4922111/4853136/5016427", "text": "\nThe following legend is told of the Castle. Long ago a witch lived in the castle. Every night she lit a candle and placed it in the tower. Every traveller who looked at this candle blasted and died. One of the fenians named Regan resolved to quench it.  He placed a magic cap on his head which rendered him invisible and one night he climbed the rocky slopes and having reached the top of the tower seized the candle and threw it into the Shannon. But in doing so the magic cap fell from his head and he was seen by the witch. He immediately fled westward but the witch in her fury seized a crag and hurled it after him. Regan escaped and the tock fell in Corcamore  where it remains to the present day. It is called Cloughregan and the print of the witch's fire fingers are supposed to be on the stone. Another rock (also having the print of fingers) is to be seen in Newtown, supposed to have been hurled by the witch in the [?] of the Shannon in order to injure soldiers who occupied on of the islands of the Shannon. Some legends mention a giant instead of a witch and St. Patrick instead of Regan.\n", "school_info": "School: Tervoe (C.)", "metadata": [{"Location:": "Tervoe, Co. Limerick", "Teacher:": "\nMáire Ní Stiopháin\n"}, {"Language": "English"}]}, "4922278/4866731/5021628": {"title": "A Fenian", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0576, Page 032", "Page 032"], "url": "https://www.duchas.ie/en/cbes/4922278/4866731/5021628", "text": "\nA FenianAbout 77 years ago, my grand-uncle, Richard Kearney joined the Fenians, at the age of 30.  They were an oath bound secret Society, and the Catholic Clergy were opposed to them.  Kilmoyler, Cappa, Ballycarron and Ballydavid formed a Fenian Company.  A few of my uncle's companions were: Lawerence O'Dwyer of Toureen and Jeremiah Body of Cappa.  One wet night, my grand uncle got into Ballycarron House by a sewerage pipe and carried out a gun.  The Fenians were not allowed to buy guns, and therefore they did everything possible to get them.  Another evening, Jeremiah Bodry got into Ballydavid R.I..C. Barracks by means of a ladder.  Just as he was inside his heels hit against the window and it slapped down.  he had only time to get away, when the Police came up, and he was at the\n(continues on next page)\n", "school_info": "School: Baile Droichid, Cathair Dún Iascaigh", "metadata": [{"Location:": "Ballydrehid, Co. Tipperary", "Teacher:": "\nDonnchadh Mac Craith\n"}, {"Collector": "Kitty Kearney", "Gender": "female"}, {"Informant": "Mr R. Kearney", "Gender": "male", "Age": "56", "Address": "Ballydrehid, Co. Tipperary"}, {"Language": "English"}]}, "4922278/4866733/5021630": {"title": "Saint Patrick's Stone", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0576, Page 034", "Page 034"], "url": "https://www.duchas.ie/en/cbes/4922278/4866733/5021630", "text": "\n(continued from previous page)\nis full of water, and it cures headaches, cuts, and all sorts of sores when washed in it. This stone is now in a field owned by Mr William Sheehy of Ballydrehid.Told by:Mrs J Kearney (38), Ballydrehid,Cahir, Co. TipperaryWritten by:Kitty Kearney, Ballydrehid N.S., Cahir,Co. Tipperary.\n\n\n\nA Fenian StoryMy grandfather was dead some years before I was born but he used tell my father odd little stories about the '67 Rising. He lived with a sister of his in Kilfeacle for some years before '67.On the day of the rising they were to meet at the Ballyhurst Fort which is about two miles from Tipperary. there were several\n(continues on next page)\n", "school_info": "School: Baile Droichid, Cathair Dún Iascaigh", "metadata": [{"Location:": "Ballydrehid, Co. Tipperary", "Teacher:": "\nDonnchadh Mac Craith\n"}, {"Collector": "Margaret Nugent", "Gender": "female"}, {"Informant": "Mr P. Nugent", "Gender": "male", "Age": "50", "Address": "Ballydrehid, Co. Tipperary"}, {"Language": "English"}]}, "4922283/4867218/5022638": {"title": "Signs of the Weather", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0577, Page 052", "Page 052"], "url": "https://www.duchas.ie/en/cbes/4922283/4867218/5022638", "text": "\n(continued from previous page)\nIf the sun sets red in the West it is the sign of fine weather.\n\n\n\nThe Fenian Brotherhood was founded in New York in 1858 by John O Mahoney. This Brotherhood was established by James Stephens. This was a secret society and was condemned by the Church.My grandfather R.I.P. was a member of this society and had many narrow escapes from being arrested. One day he was being pursued and at\n(continues on next page)\n", "school_info": "School: Baile Thomáis, Gabhailín", "metadata": [{"Location:": "Thomastown Demesne, Co. Tipperary", "Teacher:": "\nÉamonn Ó Dubhláine\n"}, {"Collector": "Eddie Fogarty", "Gender": "male", "Address": "Cahervillahowe, Co. Tipperary"}, {"Informant": "Matthew Fogarty", "Gender": "male", "Age": "54", "Address": "Cahervillahowe, Co. Tipperary"}, {"Language": "English"}]}, "4922283/4867219/5022639": {"title": "The Fenians", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0577, Page 053", "Page 053"], "url": "https://www.duchas.ie/en/cbes/4922283/4867219/5022639", "text": "\n(continued from previous page)\nBallyhurst in the parish of Tipperary when he was worn out from running he thought of a plan. There was a flock of sheep in a field and taking off his coat he began driving the sheep. When the soldiers came up to him they asked, \"Have you seen any man running this way.\" and he answered, \"He has just passed by.\n\n\n\nThe Fenian rising broke out in Ireland in March 1867. Tipperary was well organised and the fort at Ballyhurst was selected as a meeting place for the rising\n(continues on next page)\n", "school_info": "School: Baile Thomáis, Gabhailín", "metadata": [{"Location:": "Thomastown Demesne, Co. Tipperary", "Teacher:": "\nÉamonn Ó Dubhláine\n"}, {"Collector": "Eddie Fogarty", "Gender": "male", "Address": "Cahervillahowe, Co. Tipperary"}, {"Informant": "Matthew Fogarty", "Relation": "parent", "Gender": "male", "Age": "54", "Address": "Cahervillahowe, Co. Tipperary"}, {"Language": "English"}]}, "4922240/4863501/5053815": {"title": "The Fenians", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0562, Page 192", "Page 192"], "url": "https://www.duchas.ie/en/cbes/4922240/4863501/5053815", "text": "", "school_info": "School: Lios na mBroc", "metadata": [{"Location:": "Lisnamrock, Co. Tipperary", "Teacher:": "\nSéamus Ó Cinnéide\n"}, {"Language": "English"}]}, "4922275/4866497/5053969": {"title": "A Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0575, Page 193", "Page 193"], "url": "https://www.duchas.ie/en/cbes/4922275/4866497/5053969", "text": "\nLong long ago there lied a clever old man in Bansha named John Cleary. He was a war loving and cross old man. He fought in Drumnline with the Fenians. For many a night he slept in the graveyard hiding himself from the English soldiers. At that time the nettles and weeds were as high as the man himself.\n", "school_info": "School: Bansha (B.)", "metadata": [{"Location:": "Bansha, Co. Tipperary", "Teacher:": "\nPeter Horgan\n"}, {"Collector": "Anthony Gallagher", "Gender": "male", "Address": "Cloonfinglass, Co. Tipperary"}, {"Language": "English"}]}, "4922303/4868536/5053990": {"title": "1867 Attack on Local Police Barracks", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0581, Page 138", "Page 138"], "url": "https://www.duchas.ie/en/cbes/4922303/4868536/5053990", "text": "\nOn the fifth of March 1867 there was an attack made on the local Police Barracks which were then situated in Gortavoher where Grogan's public house now is. The attacking party consisted of about a hundred men and were under the command of Jerry Finnan better known as \"Myles the Slasher\". There were about ten policemen there and the Sergeant's name was Scally. The attack started at 11 o'clock at night.The Fenians from Aherlow were John O'Neill from Dromarka, Richard Bourke, Michael Fogarty and Ed O'Brien Gurtavoher and Michael Kennedy a famous black boy was also with them he had only just arrived when the attack was starting. Thomas Crowe (afterwards hanged in Cork) Patrick Kiely (grandfather of the late Commandant Paddy Dalton IRA. Killed in action in 1922) James Green, Tom Dwyer and John Finnan as well as number of other from across the hill.The attackers had only about a dozen shot guns between them and about three or four revolvers some of which were\n(continues on next page)\n", "school_info": "School: Eatharlach (Aherlow)", "metadata": [{"Location:": "Aherlow, Co. Tipperary", "Teacher:": "\nÉnrí Mac Eochaidh\n"}, {"Collector": "Enrí Mac Eochaidh", "Gender": "male", "Occupation": "múinteoir"}, {"Informant": "Tom Ricky", "Gender": "male", "Address": "Gortavoher West, Co. Tipperary"}, {"Informant": "Ken Walshe", "Gender": "male", "Address": "Rossbog, Co. Tipperary"}, {"Language": "English"}]}, "4922303/4868538/5053992": {"title": "Tom Crowe", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0581, Page 140", "Page 140"], "url": "https://www.duchas.ie/en/cbes/4922303/4868538/5053992", "text": "\nTom Crowe was a native of Srough in the parish of Lattin. He and Myles Finnan were the leaders of the Fenians in the Aherlow district during the 67 rising. He was in charge of the Fenians when the Landlord Scully was evicting the people around Ballycohey. In one of those houses they made preparations to resist the evictions. The house was owned by a man named Dwyer and Scully was expected there this morning. They built a loft opposite the door and when the eviction party arrived the peelers rushed in. One of the peelers was shot at the door and one of Scully men named O'Gorman was shot on the floor. The peelers rushed out then but Scully remained at the door. Tome Crowe seeing this rushed down from the loft and levelled on Scully and fired twice and thinking he was shot made his escape. But Scully had a coat of mail and when one of the party shouted to fire at his head he made good his escape. Tom Crowe was afterwards arrested tried and charged in Cork Gaol for\n(continues on next page)\n", "school_info": "School: Eatharlach (Aherlow)", "metadata": [{"Location:": "Aherlow, Co. Tipperary", "Teacher:": "\nÉnrí Mac Eochaidh\n"}, {"Collector": "Ken Walshe", "Gender": "male", "Address": "Rossbog, Co. Tipperary"}, {"Informant": "Dan Walshe", "Relation": "parent", "Gender": "male", "Address": "Rossbog, Co. Tipperary"}, {"Language": "English"}]}, "4922304/4868671/5054462": {"title": "The Fenians", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0581, Page 272", "Page 272"], "url": "https://www.duchas.ie/en/cbes/4922304/4868671/5054462", "text": "", "school_info": "School: Cullen, Tiobraid Árann", "metadata": [{"Location:": "Cullen, Co. Tipperary", "Teacher:": "\nSeosamh Mainséal\n"}, {"Informant": "Edward Griffin", "Gender": "female", "Age": "50", "Occupation": "shoemaker", "Address": "Cullen, Co. Tipperary"}, {"Language": "English"}]}, "4922304/4868671/5054464": {"title": "The Fenians", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0581, Page 272", "Page 272"], "url": "https://www.duchas.ie/en/cbes/4922304/4868671/5054464", "text": "", "school_info": "School: Cullen, Tiobraid Árann", "metadata": [{"Location:": "Cullen, Co. Tipperary", "Teacher:": "\nSeosamh Mainséal\n"}, {"Informant": "Mrs O' Grady", "Gender": "female", "Age": "90", "Address": "Cullen, Co. Tipperary"}, {"Language": "English"}]}, "4922296/4867867/5056028": {"title": "The Desmond Wars in Munster", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0579, Page 169", "Page 169"], "url": "https://www.duchas.ie/en/cbes/4922296/4867867/5056028", "text": "\nAbout two hundred yards from the school is a group of forts. It is said that the Fenians gathered there in 1867 and Francis Bourke their leader was captured as he was mounting his horse. His leg got caught in the stirrup. There was an old pond near the fort and it is said that the Fenians threw their bayonets into it. There were two rusty bayonets found in the thatch of an old house belonging to Daltons.\n", "school_info": "School: Ballyhurst, Tipperary", "metadata": [{"Location:": "Ballyhusty, Co. Tipperary", "Teacher:": "\nStás, Bean Uí Fhloinn\n"}, {"Collector": "Mary Ryan", "Gender": "female", "Address": "Kilfeakle, Co. Tipperary"}, {"Language": "English"}]}, "4922315/4869315/5071344": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0583, Page 248", "Page 248"], "url": "https://www.duchas.ie/en/cbes/4922315/4869315/5071344", "text": "\n(continued from previous page)\nprices at weight-throwing competions. He was also a great runner. He was a tall thin man.\n\n\n\nLong ago in Lent people were great to fast. They had to drink black tea on Ash-Wednesday. On Ash-Wednesday, Spy-Wednesday and on Good Friday no butter or milk were allowed. Most of the people used to eat porridge for their breakfast. They had potatoes and salt for their dinner. The fast now-a-days is quite different to the fast of long ago. The people eat eggs and butter for their breakfast, and also butter for the evening meal\n\n\n\nThe year 1867 at the rising of the Fenian's there was a house in Knockavilla owned by an old lady who had thousands of pounds.She didn't know what she would do with it. So she thought it better to hide it. She hid it in a field on her farm and when she had it hidden she put a flag upon it and\n(continues on next page)\n", "school_info": "School: Gleannach (Glenough)", "metadata": [{"Location:": "Glenough Lower, Co. Tipperary", "Teacher:": "\nBean Uí Bhreasail\n"}, {"Language": "English"}]}, "4922315/4869338/5071544": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0583, Page 271", "Page 271"], "url": "https://www.duchas.ie/en/cbes/4922315/4869338/5071544", "text": "\n(continued from previous page)\nfrightened and quenched the light and went to bed as quickly as he could.\n\n\n\nThere was a man in Foilnamon named Quinlan. He could throw a half hundred weight eight yards. He won many prises at sports for his strength. He was the best weight thrower in Tipperary. He was able to throw any weight six or seven inches more than any weight thrower in the County. He was six feet tall and fairly stout.\n\n\n\nThe Fenians were called after the Fianna of long ago. Any man who joined the Fenians took an oath to obey all orders and to keep the plans secret. They were divided into groups known as \"Centre\" and \"Head Centre\" many of them took part in the american Civil war. o'Leary, Donovan, Kickman, Luby, and others were arrested. a month later Stephens was arrested but after a few days he escaped from jail.The others were\n(continues on next page)\n", "school_info": "School: Gleannach (Glenough)", "metadata": [{"Location:": "Glenough Lower, Co. Tipperary", "Teacher:": "\nBean Uí Bhreasail\n"}, {"Language": "English"}]}, "5074437/4878348/5074493": {"title": "An Crois", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0627, Page 216", "Page 216"], "url": "https://www.duchas.ie/en/cbes/5074437/4878348/5074493", "text": "\nIn aimsear na Finini bi crois mór curtha suas i sraid baile na Croise ag an namad chun na finini do crocadh ann agus ins an aimsear ceadhna bhi fear laidir in a chomhnuidhe i gCill Beatha darbh ainm Riobeard an Rí. Maidean amháin tugadh trúir de na fininí ó Carraig an Chabhaltaig go Crois chun iad do chrocadh ann. Rith duine go Riobard chun insint do agus thainig se go tapaidh chun a gcabhair. Nuair a bhi se ag teacht isteach ins an Sraid Bhaile connaic sé iad suas ar an gcrois agus ceap se na bheadh sé in am chun iad do shabhált. Crom sé síos agus thóg sé suas cloch mór agus caith sé é agus bhuail  sé an crois in aice a bhun agus briseadh é agus shabhail se na finini. Rug sé ar na piosai agus doigh sé iad. Tá an cloch mór le feiscint ann fós agus sin é an fáth go dtugtar Crois ar an sraid ó shoin.\n", "school_info": "School: Cill Chaoi", "metadata": [{"Location:": "Kilkee, Co. Clare", "Teacher:": "\nAnraoi Ó Cathaláin\n"}, {"Collector": "Patrick Mc Guire", "Gender": "male", "Address": "Kilkee, Co. Clare"}, {"Informant": "Arthur Mc Guire", "Gender": "male", "Address": "Tullig, Co. Clare"}, {"Language": "Irish"}]}, "5044803/5040062/5083312": {"title": "A Fenian Fight", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0968, Page 363", "Page 363"], "url": "https://www.duchas.ie/en/cbes/5044803/5040062/5083312", "text": "\nPeter McGovern had a mehal of squitchers at his house in Newtown just beside Tiercahan school, and as always happened in these time he had a dance that night- a molly dance too: no other one would he have.John McManus, a neighbour of his and a fenian went away to a fenian dance in Drummersee and brought the whole crowd with him back to Drummersee, to scatter the nest, as he said for daring to have a party dance up at his very nose.(Pat McGovern says) When we were coming along, we broke branches off the trees, and brought them with us for weapons. We came through a crop field of a man named Drumm in Drummersee and when he saw our tracks next day, didnt he think it was the Good People were there having a dance, and that he was after cropping a gentle pass that is a fairy pass. Any one interferes with such a pass either to build on it, or crop it, or build a ditch on it, will never have an ounce of luck. Drumm nearly died till he heard the right way a few days after.Any way before we arrived at McGovern's didnt the crowd come out to meet us with sticks\n(continues on next page)\n", "school_info": "School: Tiercahan", "metadata": [{"Location:": "Tircahan, Co. Cavan", "Teacher:": "\nP. Ó Riain\n"}, {"Informant": "Pat Mc Govern", "Gender": "male", "Age": "81", "Address": "Drumbar, Co. Cavan"}, {"Language": "English"}]}, "5044803/5040152/5083557": {"title": "A Party Fight", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0968, Page 453", "Page 453"], "url": "https://www.duchas.ie/en/cbes/5044803/5040152/5083557", "text": "", "school_info": "School: Tiercahan", "metadata": [{"Location:": "Tircahan, Co. Cavan", "Teacher:": "\nP. Ó Riain\n"}]}, "5070855/5070491/5099639": {"title": "The Fenians", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1025, Page 044", "Page 044"], "url": "https://www.duchas.ie/en/cbes/5070855/5070491/5099639", "text": "\nThe only members of above organisation remembered locally were Mr. Owen McCabe, Drumalee, father of Mr. John McCabe and grandfather of Kathleen and Its McCabe. He died lately but the children were not able to get any information from him as he was in second childhood for some time before his death.Mr. Tom McMahon, late of Dalkey, Belturbet, beside Drumalee Chapel was also a member. He seems to have been treasurer and secretary of the local branch as he kept the Books - accounts etc.\n", "school_info": "School: Drumlaney", "metadata": [{"Location:": "Castlesaunderson Demesne, Co. Cavan", "Teacher:": "\nMrs Fahey\n"}, {"Language": "English"}]}, "5009139/4990569/5100114": {"title": "Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0751, Page 068", "Page 068"], "url": "https://www.duchas.ie/en/cbes/5009139/4990569/5100114", "text": "\nLeo Casey was a great Irish poet. He lived in Ballymahon. His father was a schoolteacher in Gurteen. Leo was an assistent teacher in Kenagh school for a short time. He wrote poems every where he visited. He joined the Fenians.When he was getting off a tram in Dublin he got a fall from which he died. Every where he went he gave his name for John Kegan Casey.\n", "school_info": "School: Kenagh, Longford", "metadata": [{"Location:": "Keenagh, Co. Longford", "Teacher:": "\nT. Ó Murchadha\n"}, {"Collector": "Margaret Mc Gann", "Gender": "female", "Age": "13", "Address": "Foygh, Co. Longford"}, {"Informant": "Mrs Rooney", "Gender": "female"}, {"Language": "English"}]}, "5008915/4966420/5106829": {"title": "An Old Fenian Tale", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0687, Page 292", "Page 292"], "url": "https://www.duchas.ie/en/cbes/5008915/4966420/5106829", "text": "\nAn old Fenian tale                          20.5.38There was a man living in Drogheda named Cassidy.  He was a Fenian. His brother was arrested one morning and he was afraid he would be arrested too, so he ran away and got into Kilbrue, a lonely demesne near Curragha.  He went into a big deep ditch to hide in a very lonely part.  The ditch was between Corbreys bottoms and Kilbrue.  He died in the ditch and was found the next morning by a man named Walls.I got this information from Mrs Corcoran\n", "school_info": "School: Dunshaughlin", "metadata": [{"Location:": "Dunshaughlin, Co. Meath", "Teacher:": "\nEibhlis Cogan\n"}, {"Informant": "Mrs Corcoran", "Gender": "female"}, {"Language": "English"}]}, "5009033/4979217/5115198": {"title": "Hidden Treasure", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0722, Page 003", "Page 003"], "url": "https://www.duchas.ie/en/cbes/5009033/4979217/5115198", "text": "\nThe district to the north of Glenidan cross-roads was called by the old people Clonhest. There is a blessed well in one of the fields there in the townland of Keenaghan. Near by are the ruins of an old church & monastery that were built by the monks, Keenaghan belonged formerly to the monks of Fores to this day the district is called Ballifore. At the time of the Reformation, Protestants were planted there & their descendants are there still. Around the old ruins, people say there is treasure belonging to the monks hidden. Beside the ruins is a lake called Lough an Sagart & it is said that one of the monks was drowned there.\n\n\n\nBetween the boundary of Meath & Westmeath at a place called Keenaghan, about two miles north of Glenidan, there is a cave where treasure is believed to be hidden. It was put there in the reign of the Fenians & a woman dressed in white is supposed to guard it every night.\n\n\n\nIn Ballinavine , two miles n. west of Glenidan, a river flows through the fields & during the great war a coffin containing war materials was buried in the river, some people searched for it a few years ago but they were unable to find it.\n\n\n\nBordering Lough Bawn, two miles n.w. from Glenidan, there is a wilderness called the Dargle. People say there is gold buried there & a light is seen there at\n(continues on next page)\n", "school_info": "School: Glenidan", "metadata": [{"Location:": "Glenidan, Co. Westmeath", "Teacher:": "\nBean Uí Mhaoldhia\n"}, {"Informant": "Chris Nolan", "Gender": "male", "Age": "52", "Address": "Glenidan, Co. Westmeath"}, {"Language": "English"}, {"Location": "Glenidan"}]}, "5009033/4979217/5115199": {"title": "Hidden Treasure", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0722, Page 003", "Page 003"], "url": "https://www.duchas.ie/en/cbes/5009033/4979217/5115199", "text": "\nThe district to the north of Glenidan cross-roads was called by the old people Clonhest. There is a blessed well in one of the fields there in the townland of Keenaghan. Near by are the ruins of an old church & monastery that were built by the monks, Keenaghan belonged formerly to the monks of Fores to this day the district is called Ballifore. At the time of the Reformation, Protestants were planted there & their descendants are there still. Around the old ruins, people say there is treasure belonging to the monks hidden. Beside the ruins is a lake called Lough an Sagart & it is said that one of the monks was drowned there.\n\n\n\nBetween the boundary of Meath & Westmeath at a place called Keenaghan, about two miles north of Glenidan, there is a cave where treasure is believed to be hidden. It was put there in the reign of the Fenians & a woman dressed in white is supposed to guard it every night.\n\n\n\nIn Ballinavine , two miles n. west of Glenidan, a river flows through the fields & during the great war a coffin containing war materials was buried in the river, some people searched for it a few years ago but they were unable to find it.\n\n\n\nBordering Lough Bawn, two miles n.w. from Glenidan, there is a wilderness called the Dargle. People say there is gold buried there & a light is seen there at\n(continues on next page)\n", "school_info": "School: Glenidan", "metadata": [{"Location:": "Glenidan, Co. Westmeath", "Teacher:": "\nBean Uí Mhaoldhia\n"}, {"Language": "English"}, {"Location": "Keenaghan"}]}, "5009033/4979217/5115204": {"title": "Hidden Treasure", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0722, Page 003", "Page 003"], "url": "https://www.duchas.ie/en/cbes/5009033/4979217/5115204", "text": "\nThe district to the north of Glenidan cross-roads was called by the old people Clonhest. There is a blessed well in one of the fields there in the townland of Keenaghan. Near by are the ruins of an old church & monastery that were built by the monks, Keenaghan belonged formerly to the monks of Fores to this day the district is called Ballifore. At the time of the Reformation, Protestants were planted there & their descendants are there still. Around the old ruins, people say there is treasure belonging to the monks hidden. Beside the ruins is a lake called Lough an Sagart & it is said that one of the monks was drowned there.\n\n\n\nBetween the boundary of Meath & Westmeath at a place called Keenaghan, about two miles north of Glenidan, there is a cave where treasure is believed to be hidden. It was put there in the reign of the Fenians & a woman dressed in white is supposed to guard it every night.\n\n\n\nIn Ballinavine , two miles n. west of Glenidan, a river flows through the fields & during the great war a coffin containing war materials was buried in the river, some people searched for it a few years ago but they were unable to find it.\n\n\n\nBordering Lough Bawn, two miles n.w. from Glenidan, there is a wilderness called the Dargle. People say there is gold buried there & a light is seen there at\n(continues on next page)\n", "school_info": "School: Glenidan", "metadata": [{"Location:": "Glenidan, Co. Westmeath", "Teacher:": "\nBean Uí Mhaoldhia\n"}, {"Informant": "H. Nugent", "Gender": "unknown", "Age": "50", "Address": "Balnavine, Co. Westmeath"}, {"Language": "English"}]}, "4922170/4858148/5130495": {"title": "The Fenians", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0543, Page 173", "Page 173"], "url": "https://www.duchas.ie/en/cbes/4922170/4858148/5130495", "text": "\nIn years gone by there lived in Atshanboy a woman named Nancy Sheehy with her son Micheal who was captain of the Fenion Brotherhood and after the rising of '67 he was wscaping in disguise in a ship to America when he was kidnapped , tried in court and sentenced to transportation for life. Charles Bourke of Kylecrue was a member of the Fenians and after the rinsing of '67 he escaped in disguise as a bishop to America.He got the clothes from Fr. Bourke a friend of his and he also gave him instructions to remain reading on his way over and only for that he would perhaps be kidnapped. During the year of the rising out Paddy Treacy a brother of Mrs Riordan's of Roskeen was shot.This man was in one of the overhead rooms of his sisters house which is now occupied by Richard Ryan.The stain of the blood is to be seen on the wall of the room and if the room was papered the stain would come out through the paper.\n(continues on next page)\n", "school_info": "School: Baile Nua", "metadata": [{"Location:": "Newtown, Co. Tipperary", "Teacher:": "\nSéan Wixteed\n"}, {"Collector": "Lizzie Purcell", "Gender": "female", "Address": "Cappaclogh, Co. Tipperary"}, {"Language": "English"}]}, "4922170/4858150/5130498": {"title": "The Fenians", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0543, Page 175", "Page 175"], "url": "https://www.duchas.ie/en/cbes/4922170/4858150/5130498", "text": "\nThe FeniansDuring the Fenians a  woman by the name of Nancy Sheehy, and her son Michael, who lived in Atshanboy in a field which is now called Long's bog, which is now owned by James Long, same place. There was another Tom Sheehy in Atshanboy who was also out in Fenians. His job was enlisting the boys. It is not known whether he was a brother to Michael.Charles Bourke of Kylecrew was the captain of the Fenians in the neighbourhood. he was a grand uncle of the Bourke brothers who live at Kylecrew at present.When the peelers heard of the day appointed for the rebellion they left the country barracks and went into the towns. The peelers of Roskeen barrack went to the P barrak in thurles. Roskeen barrack was burned by Fenians around the night after peelers leaving it.The peelers went around arresting people because the Fenians scattered all over the country after the rebellion. Charles Bourke escaped to U. S. A.\n(continues on next page)\n", "school_info": "School: Baile Nua", "metadata": [{"Location:": "Newtown, Co. Tipperary", "Teacher:": "\nSéan Wixteed\n"}, {"Collector": "Phil Shanahan", "Gender": "male", "Address": "Shanballyduff, Co. Tipperary"}, {"Language": "English"}]}, "5009309/5006221/5134247": {"title": "The Corrig Garveyard", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0893, Page 216", "Page 216"], "url": "https://www.duchas.ie/en/cbes/5009309/5006221/5134247", "text": "\n216The Corrig GraveyardThe Corrig Graveyard is a notable spot in Enniscorthy.  The road leading to this graveyard is known as St. John's Road.  Children who have not been baptised are buried in the darkest corner of the graveyard.The greatest man that is laid to rest in it is Henry Hatton.  On the tombstone is the following inscription \"Here lieth the body of Henry Hatton who was basely murdered by the rebels in 1798 on Vinegar Hill merchant of Enniscorthy\".Another is the remains of the Fenian O'Farrell over which there is a broken pillar.  It is a mixed burial ground.  The last person to be buried was Mr Carney of John St. Enniscorthy.  On the Fenians tombstone is the following inscription \"Erected to the nemory of Charles T. O'Farrell Fenian who died January 21st 1914, as a tribute to his unselfish work for Ireland's Liberty\".The oldest tombstone is there since 1606.Written by :  Felix MurphyAddress  :  12 St. Johns VillasReceived from : Mrs MurphyAddress : 12 St. Johns VillasOccupation : housekeeperAge  :  45 years\n", "school_info": "School: Scoil na mBráthar", "metadata": [{"Location:": "Enniscorthy, Co. Wexford", "Teacher:": "\nAn Br. M.N. Mac Oireachtaigh\n"}, {"Collector": "Felix Murphy", "Gender": "male", "Address": "Enniscorthy, Co. Wexford"}, {"Informant": "Mrs Murphy", "Gender": "female", "Age": "45", "Occupation": "domestic worker", "Address": "Enniscorthy, Co. Wexford"}, {"Language": "English"}]}, "4921599/4883416/5149251": {"title": "Local Old Schools", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0289, Page 220", "Page 220"], "url": "https://www.duchas.ie/en/cbes/4921599/4883416/5149251", "text": "\nThere is a field in \"Spike\" now a part of Dreenlomane, which is called \"Páirc an leabhair\" and some of the old people associate it with the time of the \"hedge schools\". Others say mass used to be celebrated in the field during the penal times. There is only one farmer living in \"Spike\". Mr C. Donovan and he owns the field, which is only a few yards from his house.\n\n\n\nMy grand uncle was drilled as a \"Fenian\" in the vicinity of Skibereen by Peadar O Súilleabhain. He was only eighteen years, and his name was Tadg Ó Donnabhaáin. The English soliders soon found out of him, and they pursued him. He was told of their coming and he walked from Skibereen to Cobh, took passage in a ship, which was four weeks on the water and finally arrived in New York. The English solider followed him to Cork, but there lost sight of him. He died soon afterwards in America, and a headstone was erected over his grave and on it was inscribed \"An Irish Fenian\".\n", "school_info": "School: Dún Bhéacháin (Dunbeacon)", "metadata": [{"Location:": "Dunbeacon, Co. Cork", "Teacher:": "\nTomás Ó Foghlú\n"}, {"Collector": "Teresa Coughlan", "Gender": "female", "Address": "Derreennalomane, Co. Cork"}, {"Informant": "Mr T. Burke", "Gender": "male", "Age": "70", "Address": "Derreennalomane, Co. Cork"}, {"Language": "English"}]}, "4921599/4883416/5149255": {"title": "Local Old Schools", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0289, Page 220", "Page 220"], "url": "https://www.duchas.ie/en/cbes/4921599/4883416/5149255", "text": "\nThere is a field in \"Spike\" now a part of Dreenlomane, which is called \"Páirc an leabhair\" and some of the old people associate it with the time of the \"hedge schools\". Others say mass used to be celebrated in the field during the penal times. There is only one farmer living in \"Spike\". Mr C. Donovan and he owns the field, which is only a few yards from his house.\n\n\n\nMy grand uncle was drilled as a \"Fenian\" in the vicinity of Skibereen by Peadar O Súilleabhain. He was only eighteen years, and his name was Tadg Ó Donnabhaáin. The English soliders soon found out of him, and they pursued him. He was told of their coming and he walked from Skibereen to Cobh, took passage in a ship, which was four weeks on the water and finally arrived in New York. The English solider followed him to Cork, but there lost sight of him. He died soon afterwards in America, and a headstone was erected over his grave and on it was inscribed \"An Irish Fenian\".\n", "school_info": "School: Dún Bhéacháin (Dunbeacon)", "metadata": [{"Location:": "Dunbeacon, Co. Cork", "Teacher:": "\nTomás Ó Foghlú\n"}, {"Collector": "Teresa Coughlan", "Gender": "female", "Address": "Derreennalomane, Co. Cork"}, {"Informant": "Mrs J. Coughlan", "Gender": "female", "Age": "65", "Address": "Derreennalomane, Co. Cork"}, {"Language": "English"}]}, "4798759/4795972/5150043": {"title": "The Fenians", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0297, Page 137", "Page 137"], "url": "https://www.duchas.ie/en/cbes/4798759/4795972/5150043", "text": "\nFenians were a party of men who were trying to free Ireland by the force fo arms.Many of the heads of the Fenians were sent into exile and more of them were caught and put into prison.O'Donovan Rosa was the chief leader of the Fenians in Skibbereen. He was living where Mr. Wolfe has his garage now.The Fenians were very strong around this district.\n(continues on next page)\n", "school_info": "School: An Sciobairín", "metadata": [{"Location:": "Skibbereen, Co. Cork", "Teacher:": "\nMicheál Ó Cuileanáin\n"}, {"Collector": "John Mc Carthy", "Gender": "male"}, {"Language": "English"}]}, "4798759/4795974/5150044": {"title": "The Fenians", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0297, Page 139", "Page 139"], "url": "https://www.duchas.ie/en/cbes/4798759/4795974/5150044", "text": "\nAbout sixty years ago there was a secret society in Ireland called Fenians. It originated in Skibbereen and O'Donovan Rosa was their leader. Their object was to free Ireland from England. They rose in rebellion in which they failed and after that the Fenian army fled to America. Others of them were captured and cast into prison.It is said that O\n(continues on next page)\n", "school_info": "School: An Sciobairín", "metadata": [{"Location:": "Skibbereen, Co. Cork", "Teacher:": "\nMicheál Ó Cuileanáin\n"}, {"Language": "English"}]}, "4798768/4796809/5150091": {"title": "History Connected with this Ballad", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0300, Page 143", "Page 143"], "url": "https://www.duchas.ie/en/cbes/4798768/4796809/5150091", "text": "", "school_info": "School: Doire Clathach (Derryclough), Drom Dhá Liag", "metadata": [{"Location:": "Derryclogh Lower, Co. Cork", "Teacher:": "\nÉamonn Mac Firbisigh\n"}, {"Collector": "Eamonn Mac Firbisig", "Gender": "male", "Occupation": "múinteoir", "Address": "Drimoleague, Co. Cork"}, {"Language": "English"}]}, "5162177/5161128/5162380": {"title": "McKenna's Dream", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0960, Page 139", "Page 139"], "url": "https://www.duchas.ie/en/cbes/5162177/5161128/5162380", "text": "\n(continued from previous page)\nBut yet not forced to yieldThe Wexford boysWere never slackWith TipperaryAt their back And Longford joined.to win a crack Soon drove themOff the field.They gave three cheersFor libertyThe enemy all broke and flee.I looked around But could not seeA foeman on the plain Except the menThat wounded layWhen I awoke t'was break of daySo ends McKenna's Dream.\n\n\n\nCome all ye brave United Men.Who'd right your country's wrong;I'll sing to you a verse or two\n(continues on next page)\n", "school_info": "School: An t-Éadan Mór", "metadata": [{"Location:": "Edenmore, Co. Monaghan", "Teacher:": "\nS. Mac Philib\n"}, {"Collector": "Bridie Mc Kenna", "Gender": "female"}, {"Informant": "Mr James Mc Kenna", "Gender": "male", "Age": "50", "Address": "Tamlat, Co. Monaghan"}, {"Language": "English"}]}, "5162177/5161152/5162415": {"title": "The Maid of Anketell Grove", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0960, Page 163", "Page 163"], "url": "https://www.duchas.ie/en/cbes/5162177/5161152/5162415", "text": "\n(continued from previous page)\n163To view the spreading shade.Said I my pretty fair maidYour beauty does me startWhile Cupid like a daring flameAt me be shot a dart.And if you would remain a whileTo I'd my mind discloseI'v hopes you'd come along with meFrom the shades of Ankel groveThe evening is drawing nighAnd my parents are watching meAnd homewards I must hie.But on some other eveningWhen I'll have more timeWe'll take a walk and we will talk of love along by the New Line.The evening close were gathering And the winds began to moan.We both shook hands and partedAnd I returned home.\n\n\n\nIn 1870 the Protestants they did congregate, their partytunes to beat.  they played \"Kick the Pope\" and \"broos the Boyne\" and likewise the Protestant boys.  when Thrugh brave boys, the heard the heard the noise, to think that they'd be trampled down by Moutray's orange clan, they assembled in large.\n(continues on next page)\n", "school_info": "School: An t-Éadan Mór", "metadata": [{"Location:": "Edenmore, Co. Monaghan", "Teacher:": "\nS. Mac Philib\n"}, {"Collector": "Frank Kelly", "Gender": "male", "Address": "Davagh Etra, Co. Monaghan"}, {"Informant": "Mrs Mary Skinnader", "Gender": "female", "Age": "79", "Address": "Davagh Etra, Co. Monaghan"}, {"Language": "English"}]}, "5162159/5160100/5164032": {"title": "Traditions of Historic Personages", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0939, Page 150", "Page 150"], "url": "https://www.duchas.ie/en/cbes/5162159/5160100/5164032", "text": "\n16.  Traditions of Historic personages:-  1. Rowan Hamilton ('98) spent some time \"on the run\" around Laragh in house of James Johnston near Loughegish shore. He was arrested there and neighbours suspected that Johnston informed the authorities as to his whereabouts.  2. Wolfe Tone is supposed to have been brought to Rat Island, Loughegish by British, on his way to Dublin under arrest after the battle of Lough Swilly. He was detained overnight for safety in the secluded and safe place.        __              ___            ____Tradition has it that in the days of the Fenians a number of the rebels were on one occasion drilling on the hill near Loughegish shore. Being surprised by the English they made for the Lake and made their escape in boats. Tis said they threw their pikes into the water, where they still lie.\n\n\n\n16. Traditions of Historic personages:-1. Rowan Hamilton ('98) spent some time \"on the run\" around Laragh in house of James Johnston near Loughegish shore. He was arrested there and neighbours suspected that Johnston informed the authorities as to his whereabouts.2. Wolfe Tone is supposed to have been brought to Rat Island, Loughegish by British, on his way to Dublin under arrest after the battle of Lough Swilly. He was detained overnight for safety in the secluded and safe place.__ ___ ____Tradition has it that in the days of the Fenians a number of the rebels were on one occasion drilling on the hill near Loughegish shore. Being surprised by the English they made for the Lake and made their escape in boats. Tis said they threw their pikes into the water, where they still lie.\n", "school_info": "School: Láithreach", "metadata": [{"Location:": "Laragh, Co. Monaghan", "Teacher:": "\nMrs Duffy\n"}, {"Language": "English"}]}, "5162159/5160100/5164034": {"title": "Traditions of Historic Personages", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0939, Page 150", "Page 150"], "url": "https://www.duchas.ie/en/cbes/5162159/5160100/5164034", "text": "\n16.  Traditions of Historic personages:-  1. Rowan Hamilton ('98) spent some time \"on the run\" around Laragh in house of James Johnston near Loughegish shore. He was arrested there and neighbours suspected that Johnston informed the authorities as to his whereabouts.  2. Wolfe Tone is supposed to have been brought to Rat Island, Loughegish by British, on his way to Dublin under arrest after the battle of Lough Swilly. He was detained overnight for safety in the secluded and safe place.        __              ___            ____Tradition has it that in the days of the Fenians a number of the rebels were on one occasion drilling on the hill near Loughegish shore. Being surprised by the English they made for the Lake and made their escape in boats. Tis said they threw their pikes into the water, where they still lie.\n\n\n\n16. Traditions of Historic personages:-1. Rowan Hamilton ('98) spent some time \"on the run\" around Laragh in house of James Johnston near Loughegish shore. He was arrested there and neighbours suspected that Johnston informed the authorities as to his whereabouts.2. Wolfe Tone is supposed to have been brought to Rat Island, Loughegish by British, on his way to Dublin under arrest after the battle of Lough Swilly. He was detained overnight for safety in the secluded and safe place.__ ___ ____Tradition has it that in the days of the Fenians a number of the rebels were on one occasion drilling on the hill near Loughegish shore. Being surprised by the English they made for the Lake and made their escape in boats. Tis said they threw their pikes into the water, where they still lie.\n", "school_info": "School: Láithreach", "metadata": [{"Location:": "Laragh, Co. Monaghan", "Teacher:": "\nMrs Duffy\n"}, {"Language": "English"}]}, "5162170/5160605/5164725": {"title": "More Traditions and Customs - Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0947, Page 041", "Page 041"], "url": "https://www.duchas.ie/en/cbes/5162170/5160605/5164725", "text": "\n(continued from previous page)\nof Redhills. Andy Mc Cabe of Cavony, Scotshouse, was a great supporter of Klen's.\n\n\n\nOne time a man was going home from his ceílidh. It would be between 11 and 12 o clock in the night. He was going by a fort and he suddenly heard lovely music, it was the music of a fiddle. He stopped and immediately the music stopped. He moved on and the music started again. Then he heard the fairies laughing.\n\n\n\nThe Fenians used to drill in Walsh's meadow. Guards were placed on Agharagh fort and on Knights meadow.\n", "school_info": "School: Killyfargy", "metadata": [{"Location:": "Killyfargy, Co. Monaghan", "Teacher:": "\nB. Ó Mórdha\n"}, {"Collector": "Michael Moore", "Gender": "male"}, {"Informant": "Tom Monahan", "Gender": "male"}, {"Language": "English"}]}, "5162170/5160605/5164728": {"title": "More Traditions and Customs - Faction Fights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0947, Page 041", "Page 041"], "url": "https://www.duchas.ie/en/cbes/5162170/5160605/5164728", "text": "\n(continued from previous page)\nof Redhills. Andy Mc Cabe of Cavony, Scotshouse, was a great supporter of Klen's.\n\n\n\nOne time a man was going home from his ceílidh. It would be between 11 and 12 o clock in the night. He was going by a fort and he suddenly heard lovely music, it was the music of a fiddle. He stopped and immediately the music stopped. He moved on and the music started again. Then he heard the fairies laughing.\n\n\n\nThe Fenians used to drill in Walsh's meadow. Guards were placed on Agharagh fort and on Knights meadow.\n", "school_info": "School: Killyfargy", "metadata": [{"Location:": "Killyfargy, Co. Monaghan", "Teacher:": "\nB. Ó Mórdha\n"}, {"Informant": "J. Mc Cabe", "Gender": "male", "Address": "Dunsrim, Co. Monaghan"}, {"Language": "English"}]}, "5162170/5160658/5165071": {"title": "Battle of Clones", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0947, Page 094", "Page 094"], "url": "https://www.duchas.ie/en/cbes/5162170/5160658/5165071", "text": "", "school_info": "School: Killyfargy", "metadata": [{"Location:": "Killyfargy, Co. Monaghan", "Teacher:": "\nB. Ó Mórdha\n"}, {"Collector": "Michael Moore", "Gender": "male"}, {"Informant": "Peter Mac Mahon", "Gender": "male", "Age": "circa 100", "Occupation": "police officer", "Address": "Cloncumber, Co. Monaghan"}, {"Language": "English"}]}, "5162170/5160658/5165072": {"title": "Battle of Clones", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0947, Page 094", "Page 094"], "url": "https://www.duchas.ie/en/cbes/5162170/5160658/5165072", "text": "", "school_info": "School: Killyfargy", "metadata": [{"Location:": "Killyfargy, Co. Monaghan", "Teacher:": "\nB. Ó Mórdha\n"}, {"Collector": "Michael Moore", "Gender": "male"}, {"Informant": "Peter Mac Mahon", "Gender": "male", "Age": "circa 100", "Occupation": "police officer", "Address": "Cloncumber, Co. Monaghan"}, {"Language": "English"}]}, "4921916/4910797/5165406": {"title": "Fenians '67", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0395, Page 111", "Page 111"], "url": "https://www.duchas.ie/en/cbes/4921916/4910797/5165406", "text": "", "school_info": "School: Cill Mathúna", "metadata": [{"Location:": "Shanagarry, Co. Cork", "Teacher:": "\nC. Ó Muirighthe\n"}, {"Language": "English"}]}, "4921630/4886413/5168176": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0310, Page 238", "Page 238"], "url": "https://www.duchas.ie/en/cbes/4921630/4886413/5168176", "text": "", "school_info": "School: Béal Átha Fhinghín (B.)", "metadata": [{"Location:": "Ballineen, Co. Cork", "Teacher:": "\nBeircheart Seártan\n"}, {"Informant": "Mr John Connolly", "Gender": "male", "Age": "40", "Address": "Ballineen, Co. Cork"}, {"Language": "mixed"}]}, "4921630/4886413/5168177": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0310, Page 238", "Page 238"], "url": "https://www.duchas.ie/en/cbes/4921630/4886413/5168177", "text": "", "school_info": "School: Béal Átha Fhinghín (B.)", "metadata": [{"Location:": "Ballineen, Co. Cork", "Teacher:": "\nBeircheart Seártan\n"}, {"Informant": "Mr Jeremiah Coughlan", "Gender": "male", "Age": "70", "Occupation": "feirmeoir", "Address": "Teenah, Co. Cork"}, {"Language": "mixed"}]}, "4921630/4886414/5168178": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0310, Page 239", "Page 239"], "url": "https://www.duchas.ie/en/cbes/4921630/4886414/5168178", "text": "\n\"The Lord's Cross\" - where the Kenneigh road joins the Manch - Bantry Line road is the next junction bur one N. of the Idle Bridge. In the house near the Blackwater Br. north of the Manch road lived Lord Norberry.\n", "school_info": "School: Béal Átha Fhinghín (B.)", "metadata": [{"Location:": "Ballineen, Co. Cork", "Teacher:": "\nBeircheart Seártan\n"}, {"Informant": "Mr William Shorten", "Gender": "male"}, {"Language": "mixed"}]}, "4921630/4886414/5168179": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0310, Page 239", "Page 239"], "url": "https://www.duchas.ie/en/cbes/4921630/4886414/5168179", "text": "\n\"The Lord's Cross\" - where the Kenneigh road joins the Manch - Bantry Line road is the next junction bur one N. of the Idle Bridge. In the house near the Blackwater Br. north of the Manch road lived Lord Norberry.\n", "school_info": "School: Béal Átha Fhinghín (B.)", "metadata": [{"Location:": "Ballineen, Co. Cork", "Teacher:": "\nBeircheart Seártan\n"}, {"Language": "English"}]}, "5162170/5160728/5168635": {"title": "Hedge-Schools", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0947, Page 164", "Page 164"], "url": "https://www.duchas.ie/en/cbes/5162170/5160728/5168635", "text": "\n(continued from previous page)\nHe was a native of Carrickmacross  He was a small man.  He was considered to be a great teacher.  He died in this parish but where he was buried is not known.When Fr. Donnelly was here as P.P. he had a c.c. from Limerick named Fr Mc Carthy.\n", "school_info": "School: Killyfargy", "metadata": [{"Location:": "Killyfargy, Co. Monaghan", "Teacher:": "\nB. Ó Mórdha\n"}, {"Language": "English"}]}, "4811628/4803985/5178768": {"title": "The Fenians", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0283, Page 475", "Page 475"], "url": "https://www.duchas.ie/en/cbes/4811628/4803985/5178768", "text": "", "school_info": "School: Macha na gClaidhe", "metadata": [{"Location:": "Maughanaclea, Co. Cork", "Teacher:": "\nCathal Ó Macháin\n"}, {"Informant": "M.D. O Leary", "Gender": "male", "Age": "58", "Address": "Cousane, Co. Cork"}, {"Language": "English"}]}, "4811628/4803985/5178779": {"title": "The Fenians", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0283, Page 475", "Page 475"], "url": "https://www.duchas.ie/en/cbes/4811628/4803985/5178779", "text": "", "school_info": "School: Macha na gClaidhe", "metadata": [{"Location:": "Maughanaclea, Co. Cork", "Teacher:": "\nCathal Ó Macháin\n"}, {"Informant": "M.D. O Leary", "Gender": "unknown", "Age": "58", "Address": "Cousane, Co. Cork"}, {"Language": "English"}]}, "4811628/4803987/5178781": {"title": "New Year's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0283, Page 477", "Page 477"], "url": "https://www.duchas.ie/en/cbes/4811628/4803987/5178781", "text": "\nPeople used to bake a large cake that night in olden times and then cut it in pieces and fire it hard against the door. The doing of this was supposed to keep away the famine for the year. It was supposed that it was the plan adopted after the Gorta.\n", "school_info": "School: Macha na gClaidhe", "metadata": [{"Location:": "Maughanaclea, Co. Cork", "Teacher:": "\nCathal Ó Macháin\n"}, {"Informant": "J. Barry", "Gender": "male", "Age": "60", "Address": "Cousane, Co. Cork"}, {"Language": "English"}]}, "4811628/4803987/5178783": {"title": "New Year's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0283, Page 477", "Page 477"], "url": "https://www.duchas.ie/en/cbes/4811628/4803987/5178783", "text": "\nPeople used to bake a large cake that night in olden times and then cut it in pieces and fire it hard against the door. The doing of this was supposed to keep away the famine for the year. It was supposed that it was the plan adopted after the Gorta.\n", "school_info": "School: Macha na gClaidhe", "metadata": [{"Location:": "Maughanaclea, Co. Cork", "Teacher:": "\nCathal Ó Macháin\n"}, {"Informant": "J. Barry", "Gender": "male", "Age": "60", "Address": "Cousane, Co. Cork"}, {"Language": "English"}]}, "4811628/4803988/5178788": {"title": "Seanchas Stairiúil", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0283, Page 478", "Page 478"], "url": "https://www.duchas.ie/en/cbes/4811628/4803988/5178788", "text": "", "school_info": "School: Macha na gClaidhe", "metadata": [{"Location:": "Maughanaclea, Co. Cork", "Teacher:": "\nCathal Ó Macháin\n"}, {"Language": "mixed"}]}, "4921892/4899073/5181462": {"title": "The Passage Market", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0390, Page 036", "Page 036"], "url": "https://www.duchas.ie/en/cbes/4921892/4899073/5181462", "text": "\nThe place where the Town Hall at Passage West stands was formerly a market place of some description. It had been called the \"Market\" before the Town Hall was built. It was a common place.  The Devil's WellIn a field in the neighbourhood of Glenbrook there is a well which is called the \"Devil's Well\", and, it is said that the devil and his companions used to meet there. It is also said that the Devil was seen there.It the time of the Fenians it is said that a ship sailed up to Passage. The Fenians thought it had a cargo of guns. And after taking the ship over night they discovered that it was only toy guns they had on board.\n", "school_info": "School: An Pasáiste, Corcaigh", "metadata": [{"Location:": "Passage West, Co. Cork", "Teacher:": "\nWilliam Meiklejohn\n"}, {"Collector": "Francis Ahern", "Gender": "male"}, {"Informant": "Miss Ahern", "Gender": "female", "Address": "Dock Cottages, Co. Cork"}, {"Language": "English"}]}, "4921892/4899076/5181464": {"title": "Rathanker", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0390, Page 039", "Page 039"], "url": "https://www.duchas.ie/en/cbes/4921892/4899076/5181464", "text": "\nRathanker gets its name from a rath in its vicinity. It is situated in a field forty feet in from the old Monkstown road. It is about eight feet high and thirty feet square its top is flat and its sides are sloped down to the ground. There is a hugh stone eight feet long and three feet wide and four inches thick marking the entrance. Tradition says that priests hid there during the penal times. One day it happened that a Fenian and a certain man made an appointment with six other men to open it. The Fenian opened it with the certain man and the six other men, that was forty years ago. Two of the men went down and took some old fashioned brass candle sticks out of it. It is forbidden nowadays to go down into it because one of the men died shortly after.\n", "school_info": "School: An Pasáiste, Corcaigh", "metadata": [{"Location:": "Passage West, Co. Cork", "Teacher:": "\nWilliam Meiklejohn\n"}, {"Collector": "C. O' Connell"}, {"Informant": "N. Lester", "Address": "Passage West, Co. Cork"}, {"Language": "English"}]}, "4921813/4894910/5181529": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0371, Page 174", "Page 174"], "url": "https://www.duchas.ie/en/cbes/4921813/4894910/5181529", "text": "\n(continued from previous page)\nPutting his hand on the child's head, he said to the mother, \"That is the future Bishop of Cork, mam.\" The prophecy became true. This old story is a tradition in the O'Callaghan family.\n\n\n\nMy Uncles John Lenihan, and Cornelius Lenihan, Castletownroche were both in the Fenian movement in 1867, and had to flee to Americ to escape Government vengeance.\n", "school_info": "School: Baile Caisleáin an Róistigh (B.)", "metadata": [{"Location:": "Castletownroche, Co. Cork", "Teacher:": "\nPádraig Ó Luineacháin\n"}, {"Language": "English"}]}, "4921892/4899132/5182011": {"title": "The Ship Juno", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0390, Page 095", "Page 095"], "url": "https://www.duchas.ie/en/cbes/4921892/4899132/5182011", "text": "\nAt the time of the Fenians a ship hove to, at Passage West. A rumour spread that this ship carried 2,000 guns. Officials from Cork came to inspect the ship. When they came they found that the ship only contained toy guns. The Fenians raided the ship not knowing it carried only toy guns. A band of Fenians boarded the ship, but when they did, they saw that a squad of R.I.C. were waiting on the quay. Just then another land of Fenians came on to the quay. The R.I.C. did not know which band to attack. While they were debating, the Fenians on the ship rushed over the gangway and escaped. Because of this Head-Constable Dunn of the R.I.C. was reduced to the ranks.\n", "school_info": "School: An Pasáiste, Corcaigh", "metadata": [{"Location:": "Passage West, Co. Cork", "Teacher:": "\nWilliam Meiklejohn\n"}, {"Collector": "Eoghan de Leastar", "Gender": "male"}, {"Informant": "Muiris Ó Loingsigh", "Gender": "male", "Address": "Chapel Square, Co. Cork"}, {"Language": "English"}]}, "4921832/4895392/5183484": {"title": "Folklore - The Word Carved on the Monument Erected to Peter O Neill Crowley in Kilclooney", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0376, Page 046", "Page 046"], "url": "https://www.duchas.ie/en/cbes/4921832/4895392/5183484", "text": "\nErected A.D. 1898. To the memory of Peter ONeill Crowley patroit fenian and martyr, by the Nationalists of Mitchelstown, as a token of their undyingregard for his personal bravery inattempting to free Ireland by the forceof arms, in which struggle he lost hislife, in Kilclooney wood. March 31st 1867.R. I. P.God save Ireland.Libertyis the inheritanceof a nation.One true man dead and for libertyis worth a thousand men.\n", "school_info": "School: Glenahulla, Mitchelstown", "metadata": [{"Location:": "Glennahulla, Co. Cork", "Teacher:": "\nMáiréad Bean Uí Réagáin\n"}, {"Language": "English"}]}, "4921834/4895490/5183681": {"title": "The Galtee Boy", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0376, Page 142", "Page 142"], "url": "https://www.duchas.ie/en/cbes/4921834/4895490/5183681", "text": "", "school_info": "School: Ballygibbon, Baile Mhistéala", "metadata": [{"Location:": "Ballygiblin, Co. Cork", "Teacher:": "\nDomhnall Ó Riagain\n"}, {"Language": "English"}]}, "4921831/4910134/5183731": {"title": "Historical Event - Peter O'Neill Crowley", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0375, Page 399", "Page 399"], "url": "https://www.duchas.ie/en/cbes/4921831/4910134/5183731", "text": "\nPeter O’Neill Crowley was a native of Ballymacoda, Co. Cork. He was a member of the Fenian Organisation and was one of its most daring and active workers. He was a farmer by occupation but he often left the plough to take part in operations against the British posts in Ireland.On one of these occasions, on the 5th March 1867, Peter O’Neill Crowley, helped in the capture of Knockadoon Coastguard Station, Co. Cork.. Immediately word of the capture was sent out parties of soldiers went to comb the district and capture the raiders.Crowley thought it safer  to leave that place and seek a secure retreat. With that intent, he, with a companion John McClure, decided to come to Kilclooney Wood, Knockanevin, Co. Cork. They reached the wood safely and found shelter there during the day and at night they slept in a farmer’s house close to the wood.The secret of their hiding place was well kept and the two men were in the locality some weeks before information reached the military in Mitchelstown, Co. Cork. It is thought that someone in the district informed as to their whereabouts. Early one morning, Crowley and his companion\n(continues on next page)\n", "school_info": "School: Knockanevin", "metadata": [{"Location:": "Knockanevin, Co. Cork", "Teacher:": "\nSeán Ó Crosáin\n"}, {"Collector": "J. Crosbie", "Address": "Knockanevin, Co. Cork"}, {"Informant": "John Ronan", "Gender": "male", "Age": "83", "Occupation": "farmer", "Address": "Knockanevin, Co. Cork"}, {"Language": "English"}]}, "4921886/4898947/5190151": {"title": "Donaghmore Catholic Church", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0389, Page 330", "Page 330"], "url": "https://www.duchas.ie/en/cbes/4921886/4898947/5190151", "text": "\n(continued from previous page)\nA tombstone close to the gate commemorates a Father O'Mahoney died 1732.A man was hanged on the gate of this graveyard after 1791 for maltreating a Land agent.Another culprit was hung at Aughadillane and a third at Rushill at Mr Clarke's gate.\n\n\n\nAccording to Mr Michael P. Healy, Gurrane, Donoughmore Fenianism flourished in Donoughmore.The celebrated Captain Makay founded a division in the parish.Makay, formerly an officer in the American army performed many daring exploits.He captured Ballyknockane barrack and [Fota?] and disarmed the garrison at the latter place. He seized guns and  revolver ammunition in Murray's Gunshop and Allports Gunshop in Cork.; the former establishment still exists, but the latter has disappeared.Later in an affray he shot a policeman and being captured was transported to Australia.\n(continues on next page)\n", "school_info": "School: Árd na Giuíse (Firmount), Donaghmore", "metadata": [{"Location:": "Firmount, Co. Cork", "Teacher:": "\nSeán Ó Heádhra\n"}, {"Informant": "Mr Michael P. Healy", "Gender": "male", "Address": "Garraun South, Co. Cork"}, {"Language": "English"}]}, "4921886/4898948/5190155": {"title": "Fenianism", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0389, Page 331", "Page 331"], "url": "https://www.duchas.ie/en/cbes/4921886/4898948/5190155", "text": "\n(continued from previous page)\nLater he returned to America. After the  seizure and burning in 67 of Ballyknockane barracks many of the Fenians were forced to flee to America.\n\n\n\nThe teacher in Stuake School. Murphy's, Firmount. (now occupied by Madden's) Michael P David Healy, Gurrane. O'Sullivan, Courtbrack, Foxe's Bridge. Sheehan (Timothy Barret's uncle, Pluckanes) In those days the local R.I.C Sergeant was Fixy Scanlon, a noted opponent of Fenianism. He frequently raided Healys and David Healy, who was a drunkard, was obliged to emigrate. Later he joined the American Army and fought in the American Civil War.\n\n\n\nLocal tradition says that some of their guns were hidden somewhere about half a mile from Firmount school, being buried secretly.\n", "school_info": "School: Árd na Giuíse (Firmount), Donaghmore", "metadata": [{"Location:": "Firmount, Co. Cork", "Teacher:": "\nSeán Ó Heádhra\n"}, {"Language": "English"}]}, "4921886/4898948/5190156": {"title": "Fenianism", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0389, Page 331", "Page 331"], "url": "https://www.duchas.ie/en/cbes/4921886/4898948/5190156", "text": "\n(continued from previous page)\nLater he returned to America. After the  seizure and burning in 67 of Ballyknockane barracks many of the Fenians were forced to flee to America.\n\n\n\nThe teacher in Stuake School. Murphy's, Firmount. (now occupied by Madden's) Michael P David Healy, Gurrane. O'Sullivan, Courtbrack, Foxe's Bridge. Sheehan (Timothy Barret's uncle, Pluckanes) In those days the local R.I.C Sergeant was Fixy Scanlon, a noted opponent of Fenianism. He frequently raided Healys and David Healy, who was a drunkard, was obliged to emigrate. Later he joined the American Army and fought in the American Civil War.\n\n\n\nLocal tradition says that some of their guns were hidden somewhere about half a mile from Firmount school, being buried secretly.\n", "school_info": "School: Árd na Giuíse (Firmount), Donaghmore", "metadata": [{"Location:": "Firmount, Co. Cork", "Teacher:": "\nSeán Ó Heádhra\n"}, {"Language": "English"}]}, "4921859/4896856/5193307": {"title": "Arms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0382, Page 439", "Page 439"], "url": "https://www.duchas.ie/en/cbes/4921859/4896856/5193307", "text": "\nbhfuil aon sgeál agat?Nín. ( adeirtear i ndúthaigh Déise, agus i Cae Rosa Chomáin)\n", "school_info": "School: Áth Dúna, Gleann an Phréacháin, Mainistir Fhearmuighe", "metadata": [{"Location:": "Chimneyfield, Co. Cork", "Teacher:": "\nSeán Ó Duinnshléibhe\n"}, {"Informant": "Seán Ó Duinnshleibhe", "Gender": "male"}, {"Language": "mixed"}]}, "4921859/4896856/5193308": {"title": "Arms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0382, Page 439", "Page 439"], "url": "https://www.duchas.ie/en/cbes/4921859/4896856/5193308", "text": "\nbhfuil aon sgeál agat?Nín. ( adeirtear i ndúthaigh Déise, agus i Cae Rosa Chomáin)\n", "school_info": "School: Áth Dúna, Gleann an Phréacháin, Mainistir Fhearmuighe", "metadata": [{"Location:": "Chimneyfield, Co. Cork", "Teacher:": "\nSeán Ó Duinnshléibhe\n"}, {"Language": "Irish"}]}, "4921862/4896995/5193475": {"title": "Donnchadh Ó Dálaigh", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0382, Page 578", "Page 578"], "url": "https://www.duchas.ie/en/cbes/4921862/4896995/5193475", "text": "", "school_info": "School: Glashaboy", "metadata": [{"Location:": "Glashaboy North, Co. Cork", "Teacher:": "\nLiam Ó Leighin\n"}, {"Language": "Irish"}]}, "4921877/4898036/5193676": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0387, Page 078", "Page 078"], "url": "https://www.duchas.ie/en/cbes/4921877/4898036/5193676", "text": "\n(continued from previous page)\nthree years ago, but it is not held now atall. There was also a quarterly fair held in Lisgoold the fair field being in Mr Riordans land. There is a monthly fair held in Cloyne also now. The farmers here get up at three oclock to be in the time for the fair. The November fair is usually called 'Aonach a dip'\n\n\n\nSome years ago when Mr Ahern's Grandfather was working in the forge his son was working with him.  A man brought a barrel of a gun to the forge to make a set of shoes for his horse.  They put it in the fire, after a while there was a great explosion and the gun jumped out of the fire.  The shot hit the wall near the horse but did no harm to him.  It was an old Fenian gun which the man found in a field.\n\n\n\nThere is a fair held in Midleton, Fermoy, Watergrass Hill and Bartlemy.  The nearest fair to our house is Midleton.  People take cattle, pigs, and sheep to that fair.  It is held on the second Monday of every month.  The people take their animals to the fair the night before that day.  The people\n(continues on next page)\n", "school_info": "School: Lios Gúl, Mainistir na Corann", "metadata": [{"Location:": "Lisgoold North, Co. Cork", "Teacher:": "\nPádraig Ó Cathasaigh\n"}, {"Collector": "Martin Ryan", "Gender": "male"}, {"Informant": "Mr Martin Ryan", "Gender": "male", "Address": "Lisgoold North, Co. Cork"}, {"Language": "English"}]}, "4921878/4898064/5195084": {"title": "Fenians", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0387, Page 106", "Page 106"], "url": "https://www.duchas.ie/en/cbes/4921878/4898064/5195084", "text": "\nJohn Noonan of Monaneig died a few years ago and was about 80 yrs of age.  He had been the local Captain of the Fenians and had been visited by Stephens.  He led 50 men to Middleton but many broke away on the journey.  It is said he had only 5 men when he reached Tomáisín's Bridge.They had suspicion of one of the men James Egan and threw him over the Bridge at Dundullerick.  This Jamie Egan got a job in Middleton afterwards driving a jennet and finally spent the remainder of his days begging around Leamlara.  He went with the river till he caught a bunch of Ruses and saved himself.Being scarce of men Noonan had to return home.Related by David Cotter\n", "school_info": "School: Léim Lárach, Carraig Thuathail", "metadata": [{"Location:": "Leamlara, Co. Cork", "Teacher:": "\nSeán Ó Nia (Meville?)\n"}, {"Collector": "J.C. Neville", "Gender": "male", "Occupation": "teacher"}, {"Informant": "David Cutler", "Gender": "male", "Age": "36", "Address": "Ballynaglogh West, Co. Cork"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "male", "Age": "70"}, {"Language": "English"}]}, "4921872/4897690/5196567": {"title": "A Historic Note", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0385, Page 414", "Page 414"], "url": "https://www.duchas.ie/en/cbes/4921872/4897690/5196567", "text": "\nA Historic NoteThere is an old man living out on the Tea road. That man was a Fenian. This piece of verse was made about that man. IThirty thousand men on horse-backSurrounded a cottage on the hillAnd shouted come out Moscow Milerick or we'll blow your cottage in. IIHe was a gallant fighterAnd surrender he would notThey then tried to capture himBut a burst of firing was all the gotBecause Moscow had a family and guns they had also got. John O'Donovan18 Midleton StreeCobhCo. Cork\n", "school_info": "School: Presentation Brothers' School, Cóbh", "metadata": [{"Location:": "Cóbh, Co. Cork", "Teacher:": "\nAn Bráthair Ó Doghair\n"}, {"Collector": "John O' Donovan", "Gender": "male", "Address": "Cóbh, Co. Cork"}, {"Language": "English"}]}, "4921872/4897698/5196584": {"title": "Fenians", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0385, Page 422", "Page 422"], "url": "https://www.duchas.ie/en/cbes/4921872/4897698/5196584", "text": "\nThe Fenian rising in this district was mainly organized by Cap O J. Condon of the Confederate Army in the American Civil War. Condon was brother in law to McClure who was arrested when O'Neill Crawley was shot at Kilclooney Wood near Mitchelstown. Condon was arrested at Midleton a few days befor the Rising ans so there was no attempt made at Rebellion in this area. An old man named Millerick who lives on the Tea Road was an active member of the Fenians. Tradition in the town says that a blacksmith named O'Brien was scourged to death by British Soldiers who arrested him and charged him to reveal the names of the other memvers of the organization.\n", "school_info": "School: Presentation Brothers' School, Cóbh", "metadata": [{"Location:": "Cóbh, Co. Cork", "Teacher:": "\nAn Bráthair Ó Doghair\n"}, {"Informant": "Mr Kelleher", "Gender": "male", "Address": "Cóbh, Co. Cork"}, {"Language": "English"}]}, "5162128/5156468/5197703": {"title": "Place Names", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0569, Page 355", "Page 355"], "url": "https://www.duchas.ie/en/cbes/5162128/5156468/5197703", "text": "", "school_info": "School: Ceathair Dhúin Iascaigh, Clochar na Trócaire", "metadata": [{"Location:": "Caher, Co. Tipperary", "Teacher:": "\nAn tSr. M. Tréisín\n"}, {"Collector": "Kitty O' Neill", "Gender": "female", "Address": "Clonmore South, Co. Tipperary"}, {"Informant": "Mr J. Costello", "Gender": "male", "Address": "Clonmore South, Co. Tipperary"}, {"Language": "English"}, {"Location": "Clonmore South"}]}, "5162147/5158735/5198109": {"title": "Na Fíníní 1886-67", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0633, Page 274", "Page 274"], "url": "https://www.duchas.ie/en/cbes/5162147/5158735/5198109", "text": "\nBhiodh \"Ciorcail\" des na Finniní i nDún Átha agus i gCarraig a' Chabhaltaigh. Ba hé Thomas Fennell an Captaen a bhí ortha i gCarraig a' Chabhaltaigh. Bhiodh cruinnighthe agus drill aca ist'oidhche agus is minic a ghoididís capaill na gcomharsan nuair a bhiodh an cruinniú i bhfad ó bhaile. Thugaidís ar ais arís iad an chead oidhche eile. Is beag arm teine a bhí aca-gunna ag fó-dhuine.Duine des na Finníní ab'eadh uncal Sheáin Maguidir. Dúnátha ghoideadh a chapall féin oidhche amháin agus d'éirigh sé féin as na  Finníní ar fad ansan.\n\n\n\nGhoid siad capall oidhche amháin ó mo shean-athair (Crawford) bhailigh se na comarsana agus chuir sé an tóir ortha. Tháinig sé suas ortha in aice le hAbhainn Dúin Átha agus bhagair na Finníní iad acht nuair chonnacadar go raibh fonn troda ar na comharsana chúca, theicheadar agus d'fhágadar an capall 'na ndiaidh.\n\n\n\nOidhche amháin bhí uncal mo mháthair in a luighe  nuair do chuala sé doras an stábla dhá oscailt. D'féach sé amach agus chonnaic sé duine des na Finníní ag goid an chapaill. Lean sé é agus tháinig se suas leis an bhFinnin lámh le Dún Átha.Thóg an Finnín piostal as a phóca agus bhagruigh sé mo uncal mór acht níor chuir sé aon eagla air. Nuair chonnaic an Finnín é sin thúirling sé den chapall agus theit sé.\n", "school_info": "School: Dún Átha, Carraig an Chabhaltaigh", "metadata": [{"Location:": "Doonaha, Co. Clare", "Teacher:": "\nEd J. Headtromóin\n"}, {"Language": "Irish"}]}, "5162147/5158735/5198110": {"title": "Na Fíníní 1886-67", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0633, Page 274", "Page 274"], "url": "https://www.duchas.ie/en/cbes/5162147/5158735/5198110", "text": "\nBhiodh \"Ciorcail\" des na Finniní i nDún Átha agus i gCarraig a' Chabhaltaigh. Ba hé Thomas Fennell an Captaen a bhí ortha i gCarraig a' Chabhaltaigh. Bhiodh cruinnighthe agus drill aca ist'oidhche agus is minic a ghoididís capaill na gcomharsan nuair a bhiodh an cruinniú i bhfad ó bhaile. Thugaidís ar ais arís iad an chead oidhche eile. Is beag arm teine a bhí aca-gunna ag fó-dhuine.Duine des na Finníní ab'eadh uncal Sheáin Maguidir. Dúnátha ghoideadh a chapall féin oidhche amháin agus d'éirigh sé féin as na  Finníní ar fad ansan.\n\n\n\nGhoid siad capall oidhche amháin ó mo shean-athair (Crawford) bhailigh se na comarsana agus chuir sé an tóir ortha. Tháinig sé suas ortha in aice le hAbhainn Dúin Átha agus bhagair na Finníní iad acht nuair chonnacadar go raibh fonn troda ar na comharsana chúca, theicheadar agus d'fhágadar an capall 'na ndiaidh.\n\n\n\nOidhche amháin bhí uncal mo mháthair in a luighe  nuair do chuala sé doras an stábla dhá oscailt. D'féach sé amach agus chonnaic sé duine des na Finníní ag goid an chapaill. Lean sé é agus tháinig se suas leis an bhFinnin lámh le Dún Átha.Thóg an Finnín piostal as a phóca agus bhagruigh sé mo uncal mór acht níor chuir sé aon eagla air. Nuair chonnaic an Finnín é sin thúirling sé den chapall agus theit sé.\n", "school_info": "School: Dún Átha, Carraig an Chabhaltaigh", "metadata": [{"Location:": "Doonaha, Co. Clare", "Teacher:": "\nEd J. Headtromóin\n"}, {"Collector": "Séamus de Paor", "Gender": "male", "Address": "Doonaha, Co. Clare"}, {"Language": "Irish"}]}, "5162147/5158735/5198112": {"title": "Na Fíníní 1886-67", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0633, Page 274", "Page 274"], "url": "https://www.duchas.ie/en/cbes/5162147/5158735/5198112", "text": "\nBhiodh \"Ciorcail\" des na Finniní i nDún Átha agus i gCarraig a' Chabhaltaigh. Ba hé Thomas Fennell an Captaen a bhí ortha i gCarraig a' Chabhaltaigh. Bhiodh cruinnighthe agus drill aca ist'oidhche agus is minic a ghoididís capaill na gcomharsan nuair a bhiodh an cruinniú i bhfad ó bhaile. Thugaidís ar ais arís iad an chead oidhche eile. Is beag arm teine a bhí aca-gunna ag fó-dhuine.Duine des na Finníní ab'eadh uncal Sheáin Maguidir. Dúnátha ghoideadh a chapall féin oidhche amháin agus d'éirigh sé féin as na  Finníní ar fad ansan.\n\n\n\nGhoid siad capall oidhche amháin ó mo shean-athair (Crawford) bhailigh se na comarsana agus chuir sé an tóir ortha. Tháinig sé suas ortha in aice le hAbhainn Dúin Átha agus bhagair na Finníní iad acht nuair chonnacadar go raibh fonn troda ar na comharsana chúca, theicheadar agus d'fhágadar an capall 'na ndiaidh.\n\n\n\nOidhche amháin bhí uncal mo mháthair in a luighe  nuair do chuala sé doras an stábla dhá oscailt. D'féach sé amach agus chonnaic sé duine des na Finníní ag goid an chapaill. Lean sé é agus tháinig se suas leis an bhFinnin lámh le Dún Átha.Thóg an Finnín piostal as a phóca agus bhagruigh sé mo uncal mór acht níor chuir sé aon eagla air. Nuair chonnaic an Finnín é sin thúirling sé den chapall agus theit sé.\n", "school_info": "School: Dún Átha, Carraig an Chabhaltaigh", "metadata": [{"Location:": "Doonaha, Co. Clare", "Teacher:": "\nEd J. Headtromóin\n"}, {"Collector": "Donnchadh Ó Coileáin", "Gender": "male"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "female"}, {"Language": "Irish"}]}, "5162147/5158736/5198113": {"title": "Na Fíníní 1886-67", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0633, Page 275", "Page 275"], "url": "https://www.duchas.ie/en/cbes/5162147/5158736/5198113", "text": "\n(4)Nuair bhiodh Captaen dá thóghadh aca théighdís  in áit uaigneach ist' oidhche. Oidhche amháin bhí cruinniu aca i gcorcac le Seán Mac Fhlannchadha, Cuibhreann. Tóghadh úncal m'athar Líam O Ó hEochaidhe in a chaptaen agus nuair a bhíodar  ag teacht  abhaile bhuail an tAthair De Faoite ortha agus thosnuigh sé ag seanchas leo. (Bhiodh droc-mheas ag an sagart sin ortha agus chúm sé amhrán 'gá gcáineadh)Nuair bhí sé ag seanchas leó an oidhce sin chualadar na póilíní  at teacht. Bhí siad chun theiceadh acht dubhairt an sagart leo gan teicheadh - nár bhaoghal  dóibh. Chuadar thar na póilíní  a bhí ar an mbóthar agus ní facthas in aon chor íad.(Seámus Ó hEochaidhe ó m'athair)\n\n\n\n(5)Ba hé Thomas Fennell ó Charraig a'Chabhaltaigh an Captaen ortha agus tráthnóna amháin le tuitim na h-oidhche chuaidh sé féin agus cúigear duíne déag go Cill-Bheathaidh (Kilbaha, Co. Clare) chun na nGárdaí-Cósta d'ionnsnighe. Chuala na póilíní i gCarraig a' Chabhaltaigh tráith air agus sgaoileadar gunnaí san aer mar cómhartha do ghárdaí na gCóstaí. Nuair do srois na Finníní Stáisiún na nGárdaí bhíodar ullamh rómpa. Thosnuigh an troid acht ní raibh acht aon ghunna amháin ag na Finníní - Goineadh Fennell le piléar sa chois, theith na Finníní agus cuireadh an fear gorta i bfolach i dtig le Seán Ó Cathain, Cill Bhaile EoghainThagadh an dochtúír gach oidhche ag freastal air. Lean na póilíní é, oidhche amháin agus ghabhadar Fennell.\n(continues on next page)\n", "school_info": "School: Dún Átha, Carraig an Chabhaltaigh", "metadata": [{"Location:": "Doonaha, Co. Clare", "Teacher:": "\nEd J. Headtromóin\n"}, {"Collector": "Séamus Ó hEochaidhe", "Gender": "male"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "male"}, {"Language": "Irish"}]}, "5162147/5158736/5198114": {"title": "Na Fíníní 1886-67", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0633, Page 275", "Page 275"], "url": "https://www.duchas.ie/en/cbes/5162147/5158736/5198114", "text": "\n(4)Nuair bhiodh Captaen dá thóghadh aca théighdís  in áit uaigneach ist' oidhche. Oidhche amháin bhí cruinniu aca i gcorcac le Seán Mac Fhlannchadha, Cuibhreann. Tóghadh úncal m'athar Líam O Ó hEochaidhe in a chaptaen agus nuair a bhíodar  ag teacht  abhaile bhuail an tAthair De Faoite ortha agus thosnuigh sé ag seanchas leo. (Bhiodh droc-mheas ag an sagart sin ortha agus chúm sé amhrán 'gá gcáineadh)Nuair bhí sé ag seanchas leó an oidhce sin chualadar na póilíní  at teacht. Bhí siad chun theiceadh acht dubhairt an sagart leo gan teicheadh - nár bhaoghal  dóibh. Chuadar thar na póilíní  a bhí ar an mbóthar agus ní facthas in aon chor íad.(Seámus Ó hEochaidhe ó m'athair)\n\n\n\n(5)Ba hé Thomas Fennell ó Charraig a'Chabhaltaigh an Captaen ortha agus tráthnóna amháin le tuitim na h-oidhche chuaidh sé féin agus cúigear duíne déag go Cill-Bheathaidh (Kilbaha, Co. Clare) chun na nGárdaí-Cósta d'ionnsnighe. Chuala na póilíní i gCarraig a' Chabhaltaigh tráith air agus sgaoileadar gunnaí san aer mar cómhartha do ghárdaí na gCóstaí. Nuair do srois na Finníní Stáisiún na nGárdaí bhíodar ullamh rómpa. Thosnuigh an troid acht ní raibh acht aon ghunna amháin ag na Finníní - Goineadh Fennell le piléar sa chois, theith na Finníní agus cuireadh an fear gorta i bfolach i dtig le Seán Ó Cathain, Cill Bhaile EoghainThagadh an dochtúír gach oidhche ag freastal air. Lean na póilíní é, oidhche amháin agus ghabhadar Fennell.\n(continues on next page)\n", "school_info": "School: Dún Átha, Carraig an Chabhaltaigh", "metadata": [{"Location:": "Doonaha, Co. Clare", "Teacher:": "\nEd J. Headtromóin\n"}, {"Collector": "Séamus Ó hEochaidhe", "Gender": "male"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "male"}, {"Language": "Irish"}]}, "4921760/4904230/5215707": {"title": "The Rising of '67", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0357, Page 093", "Page 093"], "url": "https://www.duchas.ie/en/cbes/4921760/4904230/5215707", "text": "\nJohny Willis of Killarney was one of a party who raided the Barrack in Caherciveen for arms.  They were let in by the two sons of the Head Constable who were Fenians. They captured arms and made off for the mountains.A policeman was sent on horseback to report to Tralee. They caught him about mountain stage and shot him in the thigh, and then sent for the priest for him. The priest who came was Father Mc Ginn. As soon as he arrived he said to those present \"Boys Boys turn your backs I dont want to know who you are.\"Another time Johny lay on top of the Convent wall watching the police searching his house in Killarney for him. He next spent 2 mts[?] in the cellar of a house in New Street in hiding. He managed to get to Farrenfore then, and was next sent to Cork in a fish box as fish. He escaped from there to London and changed his name to John Brown. One day when he came back to his digs the Landlady said \"Mr Brown, I want to know nothing about you, but 2 Scotland Yard men called here to day\" \"Than you maam\" said he. He reported at once to the Fenian Head Quarters, and they got him away to America. In later years when he returned to Killarney he would say to English tourists, pointing to his head.\"Do you see that head\" Yes of course \"Well \"Mary Collins thought that head worth £500 once.\n", "school_info": "School: Carrigaline, Ráth Mhór", "metadata": [{"Location:": "Carrigaline, Co. Cork", "Teacher:": "\nEibhlín, Bean Mhic Conchoille\n"}, {"Collector": "(name not given)", "Occupation": "teacher"}, {"Informant": "J. O' Connor", "Gender": "male", "Address": "Killarney, Co. Kerry"}, {"Language": "English"}]}, "5260463/5255081/5276008": {"title": "Bréagáin agus Caitheamh Aimsire", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0616B, Page 19_054", "Page 19_054"], "url": "https://www.duchas.ie/en/cbes/5260463/5255081/5276008", "text": "\n(continued from previous page)\nthe kite will fall to the ground again.\n\n\n\nOisin was the son of Finn Mach Cuill. One day as himself and Finn were walking in the woods. They met a beautiful lady. She had come from Tír Na N-óigh. Her name was Niamh of the golden hair. She had a beautiful white steed. She asked Oisin would he come to Tír na Nóigh. Oisin said he would. He went up riding in the white steed. They immediately set out for Tír Na Nóigh. Oision stayed in Tír Na N-óigh for a long time. The told Niamh of the golden hair he would like to come home and see all his own people again.\n(continues on next page)\n", "school_info": "School: Carron / Carthan", "metadata": [{"Location:": "Carran, Co. Clare", "Teacher:": "\nMicheál Ó Muirthille\n"}, {"Collector": "Brighid Ní hEidinn", "Gender": "female", "Address": "Crughwill, Co. Clare"}, {"Informant": "Séamus Ó hEidinn", "Relation": "relative (other than parent or grandparent)", "Gender": "male"}, {"Language": "mixed"}]}}