{"4428062/4374023/4463686": {"title": "An Ambush", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0149, Page 095", "Page 095"], "url": "https://www.duchas.ie/en/cbes/4428062/4374023/4463686", "text": "\nDuring the years 1921 and 1922 there was a great war between the Free-State and the Republic.   There was a man from Carrowkeel fighting in that war.   His name was Ed.Ward Hegarty.   The Free State captured him at Pruglish.    The same day there were two other men killed in the same place.   They were two English men.They were all taken into Newport.   Edward Hegarty's parients went to Newport, and brought him down to Lahardane church.   He was buried in Kilmuragh.At the ambush where Edward\n(continues on next page)\n", "school_info": "School: Ráth Bhán", "metadata": [{"Location:": "Rathbaun, Co. Mayo", "Teacher:": "\nSs Ó Donnchadha\n"}, {"Collector": "Sarah Cawley", "Gender": "female", "Address": "Derryfadda, Co. Mayo"}, {"Language": "English"}, {"Location": "Prughlish"}]}, "4713239/4710420/4781844": {"title": "A Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0452, Page 262", "Page 262"], "url": "https://www.duchas.ie/en/cbes/4713239/4710420/4781844", "text": "\nA Story.During the Anglo-Irish war a little cripple-boy lived with his mother. He felt very bad, as he could not go to fight for his country. Then one evening some of the I.R.A. men came into the house from the black-and-tans. When the little cripple boy saw the black-and-tans surrounding the house, he slipped out and walked along by the hedge, and when the Black-and-tans saw him, they thought he was an I.R.A. man, and they followed him and they followed through the hedge and killed him; and while they were following the cripple-boy the I.R.A. men escaped.\n", "school_info": "School: Tuairín Chathail (B.)", "metadata": [{"Location:": "Tooreencahill, Co. Kerry", "Teacher:": "\nDiarmuid Ó Cróinín\n"}, {"Collector": "Tom Fleming", "Gender": "male", "Address": "Tooreencahill, Co. Kerry"}, {"Informant": "Michael Fleming", "Gender": "male", "Age": "62", "Address": "Tooreencahill, Co. Kerry"}, {"Language": "English"}]}, "4713239/4710466/4781877": {"title": "Tureengarrive Ambush", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0452, Page 307", "Page 307"], "url": "https://www.duchas.ie/en/cbes/4713239/4710466/4781877", "text": "\nIn nineteen-twenty, when the black-and-tans were doing great damage all over Ireland, the soldiers of the Irish Republican Army planned an ambush on Turrengarrive (Ballydermonel, Bantry, Co. Cork) about a mile and a half from here.  The IRA men knew that General Holmes, who was in charge of the black-and-tans in Munster, would be returning from Tralee to Cork with 4 military lorries in anoned by his best soldiers with guns and ammunition.  At the time the IRA men were hard up for ammunition, and they thought hat this was a good chance to get some as well as to pull general Holmes and his men out of action.  The place where the ambush took place is called the \"cumors\", where\n(continues on next page)\n", "school_info": "School: Tuairín Chathail (B.)", "metadata": [{"Location:": "Tooreencahill, Co. Kerry", "Teacher:": "\nDiarmuid Ó Cróinín\n"}, {"Collector": "Tom Fleming", "Gender": "male", "Address": "Tooreencahill, Co. Kerry"}, {"Informant": "Michael Fleming", "Gender": "male", "Age": "62", "Address": "Tooreencahill, Co. Kerry"}, {"Language": "English"}]}, "4713239/4710468/4781878": {"title": "Rathmore Ambush", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0452, Page 309", "Page 309"], "url": "https://www.duchas.ie/en/cbes/4713239/4710468/4781878", "text": "\nLong ago there was an ambush at Rathmore (Co. Kerry).There was a traveling-man commonly known as \"Tom the Spy.\" There were also two soldiers, who strayed from the army, and they told the I.R.A. that there was a traveling-man going around, who used to sing songs for the police inside the barrack. They also said that he had a burned patch on the side of this face. The I.R.A. men went and found him, and they brought him near the barrack, and they shot him there. They then sent a messenger to the barrack, telling the policy that there was a man dead on the side of the road. The police went examining the body and while they were looking at\n(continues on next page)\n", "school_info": "School: Tuairín Chathail (B.)", "metadata": [{"Location:": "Tooreencahill, Co. Kerry", "Teacher:": "\nDiarmuid Ó Cróinín\n"}, {"Collector": "Edward Cremin", "Gender": "male", "Address": "Lackanastooka, Co. Cork"}, {"Informant": "Daniel Twomey", "Gender": "male", "Age": "77", "Address": "Lackanastooka, Co. Cork"}, {"Language": "English"}]}, "4713239/4710470/4781879": {"title": "Rathmore Ambush", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0452, Page 311", "Page 311"], "url": "https://www.duchas.ie/en/cbes/4713239/4710470/4781879", "text": "\nThis Story is about Rathmore Ambush.The I.R.A information was that a certain man of the travelling class was telling the police and black and tans about the activities of the I.R.A. So they tried him and found him guilty, and sentenced him to death. Then ,They carried him back to a place called the Bogroad which is bounding Rathmore and Rathbeg(Kerry) and shot him there.en they sent a message to the police that a man was shot,and the police came out, and inspected the place around, and when they were going home the I.R.A shot them from behind the hedges.\n", "school_info": "School: Tuairín Chathail (B.)", "metadata": [{"Location:": "Tooreencahill, Co. Kerry", "Teacher:": "\nDiarmuid Ó Cróinín\n"}, {"Collector": "Batt Cronin", "Gender": "male", "Address": "Tooreencahill, Co. Kerry"}, {"Informant": "Michael Buckley", "Gender": "male", "Address": "Knocknageeha, Co. Kerry"}, {"Language": "English"}]}, "4713239/4710471/4781880": {"title": "Rathmore Barrack Attack", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0452, Page 312", "Page 312"], "url": "https://www.duchas.ie/en/cbes/4713239/4710471/4781880", "text": "\nDuring the Anglo-Irish war it was decided to call on all the R.I.C to resign. Some of them did, but a great many of them held on to the English pay and the only way to stop them was to attack the barracks.The boys of the district under commandants Galvin and O'Leary attacked the Rathmore Barracks. They took positions along the railway wagons, and were all fixed in their places when one of their guns exploded, and wakened up all of the men in the barracks. Of course as the men in the barracks were better equipped, and had the advantage of a better position, there was nothing left for the attackers\n(continues on next page)\n", "school_info": "School: Tuairín Chathail (B.)", "metadata": [{"Location:": "Tooreencahill, Co. Kerry", "Teacher:": "\nDiarmuid Ó Cróinín\n"}, {"Collector": "Tom Fleming", "Gender": "male", "Address": "Tooreencahill, Co. Kerry"}, {"Informant": "Michael Fleming", "Gender": "male", "Age": "62", "Address": "Tooreencahill, Co. Kerry"}, {"Language": "English"}]}, "4713239/4710473/4781881": {"title": "Headford Ambush", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0452, Page 314", "Page 314"], "url": "https://www.duchas.ie/en/cbes/4713239/4710473/4781881", "text": "\nHeadford Ambush  This is about Headford (Co. Kerry) Ambush. In the year 1921 an ambush took place at Headford (Kerry) which caused great excitement in the neighbourhood.A large number of the I.R.A. gathered together from difference places armed with guns and ammunition to meet their enemies, who were coming by train from Kenmere, and when the train was nearing Headford, the alarm was given and the leaders of the I.R.A. who told him men to prepare. Shots rang out in every directions and two of the soldiers were killed instantly. The commander of the I.R.A. met his death (Dan Allman (Listroy, Kerry) and one of his men called Benty. The others made their escape through the mountain until they landed at Dannaduff (Headford, Co. Kerry). Blood was flowing along the road at Headford (contd)\n(continues on next page)\n", "school_info": "School: Tuairín Chathail (B.)", "metadata": [{"Location:": "Tooreencahill, Co. Kerry", "Teacher:": "\nDiarmuid Ó Cróinín\n"}, {"Collector": "Patrick Cronin", "Gender": "male", "Address": "Reaboy, Co. Kerry"}, {"Informant": "Mrs Michael Cronin", "Gender": "female", "Age": "67", "Address": "Reaboy, Co. Kerry"}, {"Language": "English"}]}, "4713233/4709822/4928873": {"title": "The Bog Road Ambush near Ráth Mhór, 4th May 1921", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0451, Page 092", "Page 092"], "url": "https://www.duchas.ie/en/cbes/4713233/4709822/4928873", "text": "\nIn compliance with instructions from G.H.Q  all suspicious looking persons were held up, searched and questioned. Amongst those was a man named Thomas Sullivan, a ballad singer. He was arrested in Cnoc na Groidhe in April 1921 After a Battalion mobilisation at the \"City\" (Cathair Crobh Dearg).  On May 1st at which about 500 men drilled in the open Tom Sullivan was courtmarshalled and sentence of death was passed on him.On the same occasion two British Soldiers who were captured some few days previous were also tried and a like sentence  was passed on them. An appeal for a stay of execution in the soldiers' case was successful but alas! it was a short respite and those two paid the penalty about the end of June.Tom was destined to play a big part in the ambush at the Bog Road on the 4th May.On that morning at about 4 a.m, Sullivan went before his Creator with whom he had made his peace at 11 p.m. on the previous night. His body was placed on the Bog Road at about 100 yards south of where the old Coach road joins it. The volunteers who were marshalled not far from the place, were ordered into positions\n(continues on next page)\n", "school_info": "School: Ráth Mhór (B.)", "metadata": [{"Location:": "Rathmore, Co. Kerry", "Teacher:": "\nDiarmuid Ó Cróinín\n"}, {"Language": "English"}]}, "4921632/4886595/5164530": {"title": "Flyer Nyhan Laid to Rest", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0311, Page 179", "Page 179"], "url": "https://www.duchas.ie/en/cbes/4921632/4886595/5164530", "text": "\n“Flyer” Nyhan Laid To RestLast Sad Journey To BallymoneyGraveside Scenes And IncidentsFinal Salute of Rifle VolleysOration By Mr. T. BarryThe death took place at the Bon Secours Home, Cork, on Sunday of John “Flyer” Nyhan, late of Clonakilty. Deceased was a well-known figure in the I.R.A. movement, and was prominently identified with the famous 3rd West Cork Brigade, I.R.A.In his early years, the late Mr. Nyhan was employed in the local electric light station, Clonakilty and also in Deasy and Co.’s Brewary.Joining the I.R.A. movement he fought in the pre-truce struggle against the British Forces in Ireland, and was on several occasions interned, being at one time for 20 days on hunger strike in\n(continues on next page)\n", "school_info": "School: Clanna Caoilte (B.)", "metadata": [{"Location:": "Clonakilty, Co. Cork", "Teacher:": "\nSs. Ó Síthe\n"}, {"Language": "mixed"}]}}