{"4706346/4704668/4779870": {"title": "Old Cures - The Leech", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0444, Page 445", "Page 445"], "url": "https://www.duchas.ie/en/cbes/4706346/4704668/4779870", "text": "\nIn olden days doctors were known as \"leeches\" and their knowledge of herbs and cures was collected, handed down and to by successive members of the same family. Every big chieftain had his physician or leech who was provided for by the chieftain. The name \"leech\" is also applied to a very small animal of the lizard family. This animal gave the old doctor his name, as it was the custom for old doctors to use the leech - generally in blood-letting cases. The leech sucked up the bad blood until he was so swollen that he dropped out. Then he was put up on table-salt where he disgorged. This was a method employed by old doctors to get rid of bad blood and cure diseases which are now known as cases of sceptic poisoning. A person was bled in other diseases also. Besides the cures effected by leeches, there were domestic cures, carried out by local people. We would think at the present time that some of these cures favour of \"superstition\".\n\n\n\nCertain people had cures for pharsey in horses. My Father, says Aine Lynch, remembers seeing at home in his young days a horse which was affected with this disease. A man from a neighbouring village of Ballyquinn came every morning of 9 mornings fasting\n(continues on next page)\n", "school_info": "School: O'Brennan, Baile Mhic Ealgóid, Tráighlí", "metadata": [{"Location:": "Tonreagh Lower, Co. Kerry", "Teacher:": "\nPádraig Ó Loingsigh\n"}, {"Collector": "Aine Lynch", "Gender": "female"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "male"}, {"Language": "English"}]}, "4742149/4740507/4781987": {"title": "Local Cures", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0771, Page 139", "Page 139"], "url": "https://www.duchas.ie/en/cbes/4742149/4740507/4781987", "text": "\nA local blacksmith has a cure for the farcy in horses. He is James Cully and has a cured horses many times. A local resident known as Jack Quinn (living up to recently) had a cure for toothache and warts. Another resident has a cure for rheumatism.\n", "school_info": "School: Carbury", "metadata": [{"Location:": "Carbury, Co. Kildare", "Teacher:": "\nC. Nic Uilis\n"}, {"Language": "English"}]}, "4922033/4920562/4953534": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0507, Page 025", "Page 025"], "url": "https://www.duchas.ie/en/cbes/4922033/4920562/4953534", "text": "\n(continued from previous page)\nMiscellaneous.the younger growths.  The latter were then placed in a large - 4 stone pot over the fire and boiled slowly.  When the boiling was very well done, the brew would be strained into a \"cool\" - keeler in Co. Limerick. - containing skim milk and while hot the cold \"ropy\" flax-seed brew would be added.  This used to be fed to the calves in the evening.  I do not think the practice of making \"heath water\" for the calves has been in existence in my native place for upwards of thirty years past.  (Tiobrad 'Arann).\n\n\n\nThe man who cured the farcy in horses used take previt tops of one-year's growth and place them in a pot of spring water all the tops in the same direction (apparently the twigs must have been bound together) and boil them very slowly.  The juice or brew resulting used be given to the horse as a dose.  I believe there was a prayer said when the privit was being put into the pot of water, but I do not know what it was.  I cannot recall that I ever heard it.(P.J. Costelloe, 40Mainster, Croom)\n\n\n\n\"---- Long nights and bloody blankets, the cars will run without horses and the cuckoo will sing on a bare bush-tree\".  (A fragment of Colmcille's prophecy - As I remember it - which used be quoted at our fireside in Tiob. 'Arann)\n\n\n\n\"When the cars will run without horses on that(Continued on middle of page 29)\n(continues on next page)\n", "school_info": "School: Cromadh (B.)", "metadata": [{"Location:": "Croom, Co. Limerick", "Teacher:": "\nDáithí Ó Ceanntabhail\n"}, {"Informant": "P.J. Costello", "Gender": "male", "Age": "40", "Address": "Monaster, Co. Limerick"}, {"Language": "English"}]}, "4922033/4920641/4953898": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0507, Page 104", "Page 104"], "url": "https://www.duchas.ie/en/cbes/4922033/4920641/4953898", "text": "\n(continued from previous page)\nhis chance away with him to Croom.  There were two steps leading up to Johanna Day's half-door, and when the donkey arrived in Croom, he found out somehow that his former owner was inside with Johanna.  Accordingly he mounted the two steps - as to his fore part anyhow- put his head in over the half-door and announced himself in a joyous tone to the two poor old women, who crouched over the hearth. As soon as Liza recovered  from the shock caused by his sudden braying in the doorway, she recognised him and addressing him as if he were, \"An intelligent Christian\", told him to be off back to Rathkeale with himself, that she was no longer his owner, and that she'd have no more to do with him.The donkey turned out, and evidently out of chagrin, and disappointment and pain at his cold reception, and colder dismissal reversed his posterior, kicked the half-door in smithereens in about the house, and then sullenly betook himself to Rathkeale and the tinkers, who according to Liza had 'taught him the bad manners\". ( I have strong reason for thinking that this is a local modernised version of a longer story. D.O.C.)\n\n\n\nThe \"Farcy\" in horses can be cured by bottling - that is dosing - the affected animal, with water got from wells in three parishes adjoining one another.  The water from each well of the three is mixed in equal parts and given to the sick animal.  It is proved a cure (----  ----, Manister)\n", "school_info": "School: Cromadh (B.)", "metadata": [{"Location:": "Croom, Co. Limerick", "Teacher:": "\nDáithí Ó Ceanntabhail\n"}, {"Language": "English"}]}, "4922210/4860891/5016024": {"title": "Cures for Animals - Farcy in Horses", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0553, Page 237", "Page 237"], "url": "https://www.duchas.ie/en/cbes/4922210/4860891/5016024", "text": "\nFarcy in HorsesThe symptoms of this disease are 1. A large swelling usually appearing on the underside of the animals body or in a leg and (2) if the finger be pressed on this swelling a small dent or hollow will remain for some time after the pressure has been removed. Thomas Casey, Ballydavid, Littleton[?] Thurlas, cures this disease by prayer and holy water.\n\n\n\nMeningitis in Cattle1. A bruised onion put in each ear of the bear and secured there2. Put the beast lying on her side. With a strong cord make five loops three times over the beasts head\n\n\n\nSwelling in a beastOne man catches a dog by the hind legs, while another seized him by the fore legs. They see-saw the dog across the beasts back\n", "school_info": "School: Moycarkey, Thurles", "metadata": [{"Location:": "Moycarky, Co. Tipperary", "Teacher:": "\nMichael Myers\n"}, {"Language": "English"}]}, "4922229/4862707/5021345": {"title": "Old Cures", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0559, Page 137", "Page 137"], "url": "https://www.duchas.ie/en/cbes/4922229/4862707/5021345", "text": "\nThe farsi usually effects horses ponies and asses. The old people had a cure for it. They used to get a wild plant called Woodbine and then they to cut a hole in the forehead of the animal and cross the woodbine in the cut and then used to stitch it with woolen thread and say some words while stitching it.\n\n\n\nMáirim ac mo gour máirim as Began máirim.+St. Columbcille as golas ar gach gorra so gibh ar ach sén shuir ibg So \"vornes paste\" moch nibh ar acht sén go sú criost ar nibh\n(continues on next page)\n", "school_info": "School: Knockgraffon", "metadata": [{"Location:": "Knockgraffon, Co. Tipperary", "Teacher:": "\nMary B. Cleary\n"}, {"Collector": "M. B. Cleary", "Gender": "female", "Occupation": "teacher"}, {"Informant": "Gerald Carew", "Gender": "male", "Address": "Knockgraffon, Co. Tipperary"}, {"Language": "mixed"}]}, "4922236/4863119/5022278": {"title": "Cure for Farcy", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0560, Page 338", "Page 338"], "url": "https://www.duchas.ie/en/cbes/4922236/4863119/5022278", "text": "\nPatrick looney of Grangemockler cures farsey in horses. He uses dog roots which he prepares by peeling. He makes a small cut in the horse's breast and places the dog roots inside the skin. He then draws the skin together with a common pin and leaves it like this for two days. The pin is then removed and the horse is worked so that the medicine will go through the system.\n", "school_info": "School: Mullinahone (C.)", "metadata": [{"Location:": "Mullinahone, Co. Tipperary", "Teacher:": "\nMáire Ní Shéaghdha\n"}, {"Collector": "Nora Doran", "Gender": "female", "Address": "Mullinahone, Co. Tipperary"}, {"Informant": "John Doran", "Gender": "male", "Age": "58", "Occupation": "shopkeeper", "Address": "Mullinahone, Co. Tipperary"}, {"Language": "English"}]}, "5070783/5062903/5094710": {"title": "The Cure of the Farcy", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0998, Page 154", "Page 154"], "url": "https://www.duchas.ie/en/cbes/5070783/5062903/5094710", "text": "\nHorses often suffer from a disease called the \"farchee\" which is a swelling in the stomach. It occurs usually in the Spring time and renders the horses unfit to workThree families around the district had the cure of it. The peculiar thing about this is that Protestants and Catholics believe in this cure. In fact a Protestant family in this neighbourhood had the cure of it. The actual form of the cure was a secret. But the horse affected would be brought into a darkened stable and the man possessing the cure would go in along with him and shut the door and he would say some words into the horse's ear and it is said that these words would cure the horse.So widespread was the belief in this cure that people would come for miles all over the country to have their horses cured and it was a common thing to meet a stranger on the road enquiring the way to the home of the man who possessed the cure.\n", "school_info": "School: Knocktemple (B.)", "metadata": [{"Location:": "Knockatemple, Co. Cavan", "Teacher:": "\nW. Tuite\n"}, {"Language": "English"}]}, "5070808/5066220/5097327": {"title": "The Cure of the Feirsey In Horses", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1007, Page 039", "Page 039"], "url": "https://www.duchas.ie/en/cbes/5070808/5066220/5097327", "text": "\nIn this parish of Moybollogue there is a man living named Robert Reilly known as in his district as Roby who can cure a disease in horses known as the Feirses horses gets swollen in the body and sometimes in the legs and joints ant it is told that Roby when making the cure puts the animal in a house and fasts him and goes around him three times and whispers something in his ears.   He comes three times and after the third visit the horse gets better and the people say that his cure was never known to fail and the horse would be as strong as ever Roby never told anyone but it is believed he got the cure from his grandfather years ago Roby would never take any money or go into the house of the owner at all at the time of making the cure.\n", "school_info": "School: Ballinamona", "metadata": [{"Location:": "Ballynamona, Co. Cavan", "Teacher:": "\nMichael Mc Keon\n"}, {"Collector": "Patrick J. Clarke", "Gender": "male", "Address": "Ballynamona, Co. Cavan"}, {"Language": "English"}]}, "5009310/5006312/5133730": {"title": "Local Cures - Farcy in Horses", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0894, Page 041", "Page 041"], "url": "https://www.duchas.ie/en/cbes/5009310/5006312/5133730", "text": "\n41\"Pharisee\" in HorsesThe late Canon Meehan once possessed a valuable hunter which contracted this disease and when the treatment of the Veterinary Surgeon proved of no avail he decided (much against his better senses) to call in the local quack.  When he had treated the hunter he called in to see the Canon before his departure.In the course of the conversation the Canon asked him to recite the prayer by which he cured the disease.When the quack had recited the prayer the Canon burst out laughing.Well said he I have a good knowledge of three languages and\n(continues on next page)\n", "school_info": "School: Enniscorthy (Pres. Convent)", "metadata": [{"Location:": "Enniscorthy, Co. Wexford", "Teacher:": "\nSr. Aingeal\n"}, {"Language": "English"}]}, "5044686/5032038/5146873": {"title": "Local Cures and Doctors - Farcy", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0909, Page 204", "Page 204"], "url": "https://www.duchas.ie/en/cbes/5044686/5032038/5146873", "text": "\n\"About thirty years ago there was an old man in Knockatomcoyle who could cure Farcy in either man or beast; He cured the man by prayer and the beast  by what he called \"Stroking.\" He would rub his hand over the affected part and he always succeeded in bringing about a cure.A friend of mine had a very bad attack of Farcy on his face and had tried several remedies without success. He went to him one evening. \"Now\" says the old man, \"when I begin this cure I cant speak to you until I am finished so you will have to watch the movements of my hands, which will direct you. You will have to walk to the sun and from the sun to the wind and from the wind. Do this & your face\n(continues on next page)\n", "school_info": "School: Cluain Mór (1), Baile an Droichid", "metadata": [{"Location:": "Clonmore, Co. Carlow", "Teacher:": "\nSéamus Ó Laochdha\n"}, {"Informant": "Thomas Donnelly", "Gender": "male", "Age": "64", "Occupation": "farmer", "Address": "Knockatomcoyle, Co. Wicklow"}, {"Language": "English"}]}, "5162124/5156071/5199178": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0567, Page 303", "Page 303"], "url": "https://www.duchas.ie/en/cbes/5162124/5156071/5199178", "text": "\n(continued from previous page)\nwind, to put a fasting spit on it would cure it.Red irons would cure \"lampers\".Three meals of nettles would cure sickness in the month of May.To rub cream on a sore lip would cure it.\n\n\n\nThe dock root will cure farsey in horses. Garlac cures hoose in calves. Sheep's droppings boiled in milk and strained and given to anyone with measles will make them alright quickly. Oaten meal steeped over night in spring water is good for a cough.The mullen plant will cure haemorrhage. A snail rubbed to a wort will cure it. A poultice of water cress or chicken-wood will cure any sore. Cold black tea is good for eyes. Honey is good for sore throat.To cure pains dig a dock root, cut off the stalk wash the root, chop it up, put it into a cup put milk on it and leave it for a night. Then strain the milk and drink it.\n", "school_info": "School: Killurney, Cluain Meala", "metadata": [{"Location:": "Killurney, Co. Tipperary", "Teacher:": "\nMáire de Brún\n"}, {"Language": "English"}]}}