{"4427866/4351970/4435428": {"title": "An Nogadóir - Scéal", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0102, Page 190", "Page 190"], "url": "https://www.duchas.ie/en/cbes/4427866/4351970/4435428", "text": "\n(continued from previous page)\nTighearna talmhan leis an gcíos d'íoc. Do bhuail sé ar an doras, agus nuair a chonnaic an Tighearna talmhan é, dubhairt sé gan a theacht níos giorra dó, agus d'iarr sé air, céard a bhí ag teastáil uaidh. Dubhairt sé gur leis on gcíos d'íoc. Dubhairt sé leis imeacht agus go dtuibhradh sé 'receipt' dó gan airgead ar bith. Do thug sé buidheachas dó, agus chuaidh sé ar a bhealach, agus áthas an domhain air. Chuaidh sé go dtí na siopaí chun and fiacha d'íoc agus do thárla and rud céadhna leis. Chuaidh sé abhaile annsin, agus d'innis sé a sgéal dá bhean. Bhí áthas mór uirthi, agus do mhair síad go sonasach ina dhiaidh sin.\n\n\n\nIn my mother's native village of Castlecreeveen, there are the ruins of a very old castle. This castle was owned by the Burkes, and the heir of it was Creeveen Burke. This was why they called it Castlecreeveen. There were two sisters, Helen, and Creeveen, and they always quarrelled, so Helen took her departure to some other country. Creeveen got married to a man from Castlebar, named George Barry. He lived very happy with Creeveen for a few years, but she\n(continues on next page)\n", "school_info": "School: Sruthar (C.)", "metadata": [{"Location:": "Shrule, Co. Mayo", "Teacher:": "\nBríd, Bean Uí Éanacháin\n"}, {"Collector": "Máire de Búrca", "Gender": "female", "Address": "Tonacooleen, Co. Galway"}, {"Informant": "Mrs Burke", "Relation": "parent", "Gender": "female", "Age": "40", "Address": "Tonacooleen, Co. Galway"}, {"Language": "English"}]}, "4427869/4352252/4436012": {"title": "The Fóidín Marbh", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0103, Page 053", "Page 053"], "url": "https://www.duchas.ie/en/cbes/4427869/4352252/4436012", "text": "\n(continued from previous page)\n65.In the townland of Bunnadubber it is believed that in a cave in this district a water-horse exists, and that an underground channel runs from the pool into Lough Corrib.\n\n\n\n67.It is a remarkable fact that very many of the limestone strata, which are as plentiful in the district, are on edge, the cleavage running north and south.\n", "school_info": "School: The Neale (B.)", "metadata": [{"Location:": "Neale, Co. Mayo", "Teacher:": "\nTomás Mac an Bháird\n"}, {"Language": "English"}]}, "4428271/4390441/4441544": {"title": "Water Horse", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1032, Page 150", "Page 150"], "url": "https://www.duchas.ie/en/cbes/4428271/4390441/4441544", "text": "\nIt was on a Saturday evening about seven years ago when daddy was coming from his work in Ballyshannon he saw a water horse in the Bridgetown river. When the horse noticed daddy looking over the bridge at him he disappeared down under the water. It stayed down under the water for about twenty minutes and then it rose up up again. Daddy was still watching it and he said it was like an ordinary horse but it had very long thin legs and it had a very short mane. He crouched behind the wall and watched the horse rolling over and lying on its back in the river. The horse was a hazel brown and it had very long ears. When the sun was going down and night was beginning to\n(continues on next page)\n", "school_info": "School: Lathaigh (Laghey)", "metadata": [{"Location:": "Laghy, Co. Donegal", "Teacher:": "\nProinsias Mac Pháidín\n"}, {"Collector": "Lena Connolly", "Gender": "female", "Address": "Mullanasole, Co. Donegal"}, {"Informant": "Hugh Connolly", "Gender": "male", "Age": "50", "Address": "Mullanasole, Co. Donegal"}, {"Language": "English"}]}, "4428081/4376289/4448044": {"title": "Ainmhithe Neamhshaolta", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0154, Page 167", "Page 167"], "url": "https://www.duchas.ie/en/cbes/4428081/4376289/4448044", "text": "\nOnce upon a time there was a water horse seen in Cashel lake. At a certain time he came out before the people got up in the morning to eat a feed of grass. Then he disappeared. This was caused owing to a make, a colt, & a foal being in a field near a lake. The owner took the mare to the town and when he returned he put the mare in the field and struck her own bridal [bridle]. Then the three ran straight into the lake were never seen again.\n", "school_info": "School: Toomore", "metadata": [{"Location:": "Toomore, Co. Mayo", "Teacher:": "\nTomás Breathnach\n"}, {"Language": "English"}]}, "4428153/4382228/4450893": {"title": "Strange Animals", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0652, Page 149", "Page 149"], "url": "https://www.duchas.ie/en/cbes/4428153/4382228/4450893", "text": "\nThere is a story about a serpent or other strange animal which lives in a certain cave or lake in the district. About sixty years ago a white sea-horse came in to Brownstown and grazed in the field. Attempts were made to capture it but he disappeared into the tide and they never saw him again.The other strange animals are the Goramooguks cow and horse.Goramooguk is an enchanted gentleman that lives on the burrow. He has a fairy horse and a cow with an unspendable shilling in her ear.The more general belief is that the Guramooguck lives under the sea, and that with the exception of his visits by night to the Burrow, he never comes nearer than the third wave to the land in any other place. Before a storm he rests on the third wave out to the land: saire! saire! - their translation of the sound of the waves.\n", "school_info": "School: Summerville", "metadata": [{"Location:": "Summerville, Co. Waterford", "Teacher:": "\nJohn Burke\n"}, {"Collector": "Kathleen Gear", "Gender": "female", "Address": "Ballymacaw, Co. Waterford"}, {"Informant": "Mr Patrick Gear", "Relation": "parent", "Gender": "male", "Age": "60", "Address": "Ballymacaw, Co. Waterford"}, {"Language": "English"}]}, "4427851/4350685/4451480": {"title": "Strange Animals", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0098, Page 497", "Page 497"], "url": "https://www.duchas.ie/en/cbes/4427851/4350685/4451480", "text": "\nThere was a water-horse once in Ballinsmalla. There is a story told about it. It is -  One day a man named Prendergast was letting out his horse in the field. There was a big pond in the field. when he was letting the horse go, he hit it with his stick. Then the horse ran and ran around the field and at last it ran straight into the pond and disappeared. Every day after that he came to the field and ate the grass. If anybody tried to catch him, he ran into the pond.\n", "school_info": "School: Cnocán Mhichil Naofa (Clochar)", "metadata": [{"Location:": "Claremorris, Co. Mayo", "Teacher:": "\nan tSiúr Síle\n"}, {"Collector": "Edna Killeen", "Gender": "female", "Address": "Claremorris, Co. Mayo"}, {"Informant": "Michael Killeen", "Relation": "parent", "Gender": "male", "Address": "Claremorris, Co. Mayo"}, {"Language": "English"}]}, "4427851/4350692/4451514": {"title": "Strange Animals", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0098, Page 504", "Page 504"], "url": "https://www.duchas.ie/en/cbes/4427851/4350692/4451514", "text": "\nOnce upon a time a man owned a brown horse. Every night he used to go visiting and when he would be returning home, he would go down to a field near a lake and bring home his horse. This night however, he stayed very late in the house. He went down towards the river to get his horse. But when he jumped up on the horses back the horse made for the lake. But before he jumped into the river he knocked him off his back. The river is near Mayo Abbey. The people say that there are as many animals in the water as on the land. The Guards said the horse must have been a water horse.\n", "school_info": "School: Cnocán Mhichil Naofa (Clochar)", "metadata": [{"Location:": "Claremorris, Co. Mayo", "Teacher:": "\nan tSiúr Síle\n"}, {"Collector": "Peggie Charles", "Gender": "female", "Address": "Eskerlevally, Co. Mayo"}, {"Informant": "Lucy Healy", "Gender": "female"}, {"Language": "English"}]}, "4428146/4381703/4457560": {"title": "Ballyscanlon Lake", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0650, Page 112", "Page 112"], "url": "https://www.duchas.ie/en/cbes/4428146/4381703/4457560", "text": "\nThis beautiful lake is situated about three miles due east from Kill.There is a very interesting story concerning it.    Long ago, it is said, a man was travelling before sunrise, on horseback along the road which runs close to the lake. He saw, as he thought, before him, a beautiful castle with a gate lodge in front of it.    He dismounted from his horse, and went in to see the beautiful building, but he forgot to ring the bell. He was met by a gentleman who said to him.“If you had rung the bell or blown the horn.“You’d be the happiest man who was ever born”.     The man looked round for his horse, but what a sight met his eyes? The castle in all its glory had disappeared and so had his horse.It is believed that the horse lived in the lake. A poor man once resided close by. He was the owner of a little plot of ground. He had no animal with which to plough the ground.     This horse is said to have come to him one day. After that she came at seven o’clock every morning worked with him for the day, but departed at six o’clock every evening. She also presented him with a foal every year.     One day, he kept her working very late. She broke from the harness, neighed three times, ad all her offspring gathered round her. She and they disappeared in the depths of the lake and have never since been seen.\n", "school_info": "School: An Chill, Dúngarbhán", "metadata": [{"Location:": "Kill, Co. Waterford", "Teacher:": "\nTomás Breathnach\n"}, {"Collector": "Caítlín Ní Flainn", "Gender": "female"}, {"Language": "English"}]}, "4428328/4395757/4461303": {"title": "Each Uisce", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1047, Page 24", "Page 24"], "url": "https://www.duchas.ie/en/cbes/4428328/4395757/4461303", "text": "\nBhí fear ‘na chómhnuidhe i Málainn-mhóir nuair a bhí “Hamilton” na Thíghearna-tálaimh ar an ait seo. Aon bhliadhain amhain ní rabh an cíos aige san ám a bhí an tíghearna ar an Charraic a chruinniughadh.Nuair a fuair sé an t-airgead cruinnighthe d’imtigh sé, fear nach rabh an cíos aige, ar a capall go Cora Críche áit-cómhnaidhe “Hamilton” lé na dhíol.Díol sé a chíos agus pill ar an bhaile. An oidhche bhí sé ag teacht abhaile bhí sé án-mhall ag gabhail isteach do ag loc Abha. Oichche dheas ghealaigh agus é ag sioc a bhí ann.San ám seo thart ag cladach na locha bhí’in bealach-mór ag gabhail.Bhí an marcach ag bogadh leis ar a shuaimhneas. Leis sin rinne an each-uisge seitreach istigh sa loch agus comh luath is chualaidh an capall an seitreach léim sé amách sa loch. Chongbuigh an éireóg suas é agus leim an fear anuas dé druim. Isteach leis an capall go dteachaidh sé síos i lár an locha san ait ar bhris an each-uisge an éireóg.Ón lá sin go dtí’n lá induí ní fhachthas an capall.\n", "school_info": "School: Sliabh Liag", "metadata": [{"Location:": "Meenavean, Co. Donegal", "Teacher:": "\nCaitlín Nic An tSaoir\n"}, {"Collector": "Mícheal Uí Ceinnide", "Gender": "male", "Address": "Creenveen, Co. Donegal"}, {"Informant": "Ióseph Uí Ceinnide", "Relation": "parent", "Gender": "male", "Age": "65", "Address": "Creenveen, Co. Donegal"}, {"Language": "Irish"}]}, "4428065/4374729/4461713": {"title": "A Story about a Sea-Horse that Was Seen in Lough Conn", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0150, Page 95", "Page 95"], "url": "https://www.duchas.ie/en/cbes/4428065/4374729/4461713", "text": "\nAbout ten years ago my grandmother was doing a station in the Addergoole Abbey, with other women. Before they had the station finished they heard a great noise in the lake, and looking around, they saw a big horse with a long mane swimming towards them. He was a lot bigger than any other horse. The three women didn't wait to finish their station but ran home as fast as they could. It was dark when they were doing the station. It was seen often afterwards.\n\n\n\nAbout a half a year ag[o] Mr. Moore N. T. in Rathkell, N. S. and Tommie Queenaun Leharrow Lahardance were hunting near Lough Conn in Mr. Walksh's land Castlehill. They were not long there when the[y] saw a big horse swimming in the lake. It had a long mane and was roaring very loud. They were very much afraid, they did not wait till it went out again in the lake.\n", "school_info": "School: Leath-árdán", "metadata": [{"Location:": "Lahardaun, Co. Mayo", "Teacher:": "\nMáirtín Ó Ceallaigh\n"}, {"Language": "English"}]}, "4428065/4374729/4461714": {"title": "A Story about a Sea-Horse that Was Seen in Lough Conn", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0150, Page 95", "Page 95"], "url": "https://www.duchas.ie/en/cbes/4428065/4374729/4461714", "text": "\nAbout ten years ago my grandmother was doing a station in the Addergoole Abbey, with other women. Before they had the station finished they heard a great noise in the lake, and looking around, they saw a big horse with a long mane swimming towards them. He was a lot bigger than any other horse. The three women didn't wait to finish their station but ran home as fast as they could. It was dark when they were doing the station. It was seen often afterwards.\n\n\n\nAbout a half a year ag[o] Mr. Moore N. T. in Rathkell, N. S. and Tommie Queenaun Leharrow Lahardance were hunting near Lough Conn in Mr. Walksh's land Castlehill. They were not long there when the[y] saw a big horse swimming in the lake. It had a long mane and was roaring very loud. They were very much afraid, they did not wait till it went out again in the lake.\n", "school_info": "School: Leath-árdán", "metadata": [{"Location:": "Lahardaun, Co. Mayo", "Teacher:": "\nMáirtín Ó Ceallaigh\n"}, {"Language": "English"}]}, "4427953/4360777/4464782": {"title": "The Water-Horse", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0122, Page 336", "Page 336"], "url": "https://www.duchas.ie/en/cbes/4427953/4360777/4464782", "text": "\nThe old people say they often saw the water horse out grazing on Paddy Devines land in Ballinacurra. They used to see his tracks in the morning. It is also said that the water horse is able to draw you in to the water with his breath. He is like a small pony.\n\n\n\nIn James Philbin's fort in Cloonfinish is a gap between two ash trees that is called \"Geata na h-Altora\" Between those trees when the priest the priest- hunters were, there used to be an Altar. That is the reason for calling the gap the name it has.\n", "school_info": "School: Béal Átha na Muice", "metadata": [{"Location:": "Swinford, Co. Mayo", "Teacher:": "\nDominick Caron\n"}, {"Language": "English"}]}, "4427953/4360777/4464784": {"title": "The Water-Horse", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0122, Page 336", "Page 336"], "url": "https://www.duchas.ie/en/cbes/4427953/4360777/4464784", "text": "\nThe old people say they often saw the water horse out grazing on Paddy Devines land in Ballinacurra. They used to see his tracks in the morning. It is also said that the water horse is able to draw you in to the water with his breath. He is like a small pony.\n\n\n\nIn James Philbin's fort in Cloonfinish is a gap between two ash trees that is called \"Geata na h-Altora\" Between those trees when the priest the priest- hunters were, there used to be an Altar. That is the reason for calling the gap the name it has.\n", "school_info": "School: Béal Átha na Muice", "metadata": [{"Location:": "Swinford, Co. Mayo", "Teacher:": "\nDominick Caron\n"}, {"Language": "English"}]}, "4465741/4361096/4465798": {"title": "Ainmhithe Fiáine a bhFuil Cónaí orthu i Loch", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0123, Page 316", "Page 316"], "url": "https://www.duchas.ie/en/cbes/4465741/4361096/4465798", "text": "\nTá loch in aice le mo áit chónaidhthe. Loch na Ceathramhan Móire a thugtar air. Loch an-bheag é amach is amach mar níl d’achar ann ach cúig is fiche acra béidir.Sa Samhradh bíonn buachaillí óga an cheanntair thart timcheall ag folcadh is a snámh ann ach mar sin féin ní maith le duine ar bith dul isteach ann agus é in a aonar. Adeir na sean daoine gur iomda rud aisteach a chonnachthas ann.Tá sé i gceist san áit go bhfuil capall bán in a chomhnaidhe thíos fá’n loch is go dtagann sé suas go barr a locha anois is arís is é gleasta go deas le srian soillseach diallaid a bhfuil dath an óir air, ar a dhruim is cruidhthe airgid faoi.Comhartha ádha é do dhuine ar bith an capall a fheiceáil is bhí sé ráidhte i measc na seandaoine go mbeadh na cruaca óir le fáil ag an té a bearfadh greim air.Seo scéal beag eile faoi.Bhí fear ag dul abhaile ar thaobh an locha oidhche amháin is chonnaic sé chuige an capall ar bhárr an uisce. Chrom mo dhuine síos ar fhaitchios go bhfeicfí é is ghléas sé é\n(continues on next page)\n", "school_info": "School: Cnoc Sacsan", "metadata": [{"Location:": "Knocksaxon, Co. Mayo", "Teacher:": "\nP. Ó Faoláin\n"}, {"Collector": "Proinnsias Ó Murchadha", "Gender": "male"}, {"Informant": "Tadhg Ó Murchadha", "Relation": "parent", "Gender": "male", "Age": "71"}, {"Language": "Irish"}]}, "4428021/4368750/4474369": {"title": "A Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138, Page 492", "Page 492"], "url": "https://www.duchas.ie/en/cbes/4428021/4368750/4474369", "text": "\nLong ago there were no trees around Brackloon.  The people sowed more corn than they do now.  When the corn was ripe in harvest, a good deal of it was often eaten at night and trampled on.  For a long time no one knew what was the caúse of it.  One night a man named Tadhg Rúadh remained up to watch.  It was a moonlight night and he sat on top of Midgefield Hill, where he could have a good view.  After midnight he saw six white horses come out of Loch Gréine and go through all the cornfields.  When he told this story, an old man told him to catch one of the horses and keep him in a stable for a year and a day and he could work him then.  Tadhg succeeded in catching one and he did as the old man told him.  After this he took him out but the horse was still enchanted.  He brought the horse to a river to drink and rode on him.  The horse ran off with Tadhg on his back until he came to loch Gréine.  He disappeared under the water with Tadhg on his back.  They were never heard of since.\n", "school_info": "School: Breac-Cluain", "metadata": [{"Location:": "Brackloon, Co. Mayo", "Teacher:": "\nSeosamh Ó Meachair\n"}, {"Collector": "P. Morley", "Gender": "male", "Address": "Brackloon, Co. Mayo"}, {"Informant": "Michael Heraty", "Gender": "male", "Age": "50", "Address": "Brackloon, Co. Mayo"}, {"Language": "English"}]}, "4427992/4365324/4477396": {"title": "Bó Sí", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0131, Page 493", "Page 493"], "url": "https://www.duchas.ie/en/cbes/4427992/4365324/4477396", "text": "\nNíor dhíol sé é agus b'eigean do é a thabhairt abhaile.Nuair a bhí sé ag teacht abhaile, bhí an oidhche ann agus nuair a bhí sé ag teacht gar do dhroichead chuala sé bó ag teacht an bóthar ag géimneadh.  Sheas sé ag an droichead go leigeadh sé an bhó amach roimhe.ach nuair a tháinig an bhó suas leis, chuaigh sí ag an ngamhain agus ligh sí é.  Annsin bhí a fhios aige gurbh í a bhó féin a bhí ann agus gurbh é a raibh sí tugtha as.  Eibhlin Nig Craith Port an Chlumhaigh a scríobh.  A máthair Áine (née Nic Aindriais a d'innis (46 bl).Each UisceBhí fear ann fadó agus sé an t-ainm a bhí air Seán Ó Dochartaigh.  Lá amháin chuaigh sé amach le searrach agus d'fhág sé é in aice le loch uisce i measc go leor searrach eile.  Seachtain ina dhiaidh sin chuaigh sé amach faoi dhéin an tsearraigh agus chonaic sé an searrach ar bhord an phuill agus shíl sé gurbh é a cheann féin é.  D'imigh sé abhaile agus an searrach leis.  Chuaigh sé ar ais....\n(continues on next page)\n", "school_info": "School: Ceathrú Thaidhg", "metadata": [{"Location:": "Carrowteige, Co. Mayo", "Teacher:": "\nPádraig Mag Shamhráin\n"}, {"Collector": "Pádraic Ó Deaganaigh", "Gender": "male", "Address": "Carrowteige, Co. Mayo"}, {"Language": "Irish"}]}, "4566078/4565196/4571798": {"title": "Ceansú Capall", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0031, Page 0012", "Page 0012"], "url": "https://www.duchas.ie/en/cbes/4566078/4565196/4571798", "text": "\n(continued from previous page)\nsé féar nó le n-ithe ar feadh na hoíche. Sa Samhradh fágann sé amuigh sa pháirc é agus bíonn súil le Dia aige go mairfeadh sé go buan chun cuidiú leis féin agus a chlainn.\n\n\n\nAinmhithe na feirmeScéal Fadó bhíodh caiple draoidheachta á síolrughadh i loch a' phlúirín i bParáiste ‘na Cuain. Bhí fear saidhbhir san áit agus bhíodh sé i gcomhnaidhe ag iarraidh breith ar cheann de na caiple sin.Lá amháin rug sé ar ceann acu agus thug sé abhaile é. Chuir sé sa stábla é agus cheanngal sé é leis an t-adhastair. Dubhradh leis sa bhfágfadh sé annsin é ar feadh seacht mbliadhna go n-imtheochadh an draoibheacht de agus go mbeadh ceann de na caiple a b'fheárr sa domhan aige.Bhí go maith. D’fhan an fear go mí-fhaighideach. Bhí sé ag chomhaireamh na bliadhanta go brí go tháinig an lá roimh an seachtmadh bliadhna a bheirt cairce. Leis an mí-foighid a bhí air tharraing sé amach an capall. Shíl sé nach dhéanfadh lá amháin aon deifridearc. Chuaidh sé ná dhéin “Cnoc Thuadh” agus é ag marcabheacht go huaibhreac ar a chapall bréagh.\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire (Newtownsmith)", "metadata": [{"Location:": "Newtownsmith, Co. Galway", "Teacher:": "\nSr M. Colmán\n"}, {"Informant": "Stiophán Ó Briain", "Gender": "male", "Age": "62", "Address": "Carrowbrowne, Co. Galway"}, {"Language": "Irish"}]}, "4569051/4566976/4574113": {"title": "A Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0034, Page 0474", "Page 0474"], "url": "https://www.duchas.ie/en/cbes/4569051/4566976/4574113", "text": "\nIn olden times there lived a farmer quite convenient to the town of Loughrea. One harvest he had a fine field of corn, and every night it used to be tramped and eaten, and he could not know what was happening to it so he stayed up one night, and watched, and he found that it was a lot of horses.He caught one of the horses and brought him home. He could find no owner for him. So he trained him for the races of Knockbarren, and every year he used to win a race for him but one day as he was coming home the horse took fright at the lake of Loughrea, and sprang into the lake, and every place he sprang a spring sprung up.People say that it is there the old town of Loughrea was, and that the chimneys of the houses can be seen on a fine day.\n", "school_info": "School: Cill Tulaigh", "metadata": [{"Location:": "Kiltullagh, Co. Galway", "Teacher:": "\nSeán Ó Seasnáin\n"}, {"Collector": "Ettie Dempsey", "Gender": "female", "Address": "Knockatogher, Co. Galway"}, {"Informant": "Bernard Dempsey", "Gender": "male", "Age": "60", "Address": "Knockatogher, Co. Galway"}, {"Language": "English"}]}, "4566059/4563483/4574716": {"title": "Seanscéal", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0025, Page 0294", "Page 0294"], "url": "https://www.duchas.ie/en/cbes/4566059/4563483/4574716", "text": "\nBhí capall sidhe i Gcaisleáin Craobigh fadó. Each a chugadh air. Deirtear gurbh as locha-phúar a tháinig sé. Gach oidhche d'ithfhadh sé na barraí ó muinntir Caisleáin Craobighe. Dfhan siad ina shuidhe an oidhche seo agus ar a h-aon a chlog chonnaic síad an each ag teacht. Chuireadar púchóg air, agus ar deire chuir síad isteach i stábla é. Annsin chuireadar fios ar fear dárbh ainm \"Seóirse De Barra\" lén a marcuidheacht air. Thug sé amach ar an mbóthar é. Bhí sé ag dul go h-éascaidh go raibh sé inaice le locht Seóirse. Annsin cheap sé nach mbeadh aoin dochar ann dá mbaineadh sé an púchóg dé Léim an each annsin agus leag sé an fear. Tugadh Leach Seoirse ar an áit sin anois. D'imthigh an each ar ais go locha phuar, agus ní fhaca duine air bith aríamh é.\n(continues on next page)\n", "school_info": "School: An Mhainistir, Carrabeg", "metadata": [{"Location:": "Carrowbeg, Co. Galway", "Teacher:": "\nAn Br. Coinleith Ó Mainnín\n"}, {"Collector": "Seáin Ó Feodhabhra", "Gender": "male", "Address": "Bunatober, Co. Galway"}, {"Informant": "Tomás Ó Feodhabra", "Relation": "parent", "Gender": "male", "Address": "Bunatober, Co. Galway"}, {"Language": "Irish"}]}, "4566059/4563485/4574717": {"title": "Seanscéal", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0025, Page 0296", "Page 0296"], "url": "https://www.duchas.ie/en/cbes/4566059/4563485/4574717", "text": "", "school_info": "School: An Mhainistir, Carrabeg", "metadata": [{"Location:": "Carrowbeg, Co. Galway", "Teacher:": "\nAn Br. Coinleith Ó Mainnín\n"}, {"Collector": "Séamus Ó Scolaighe", "Gender": "male", "Address": "Coteenty, Co. Galway"}, {"Informant": "Máirtín Ó Scolaighe", "Relation": "parent", "Gender": "male", "Address": "Coteenty, Co. Galway"}, {"Language": "Irish"}]}, "4583273/4575537/4591281": {"title": "Story - Cláirín Lake", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0040, Page 0218", "Page 0218"], "url": "https://www.duchas.ie/en/cbes/4583273/4575537/4591281", "text": "\nIt is said that long ago there were many strange things seen in Clairin Lake.A man named John Keane from this village was one day fishing in that lake. He saw come out of the lake a fish as big as a horse and much like a horse also. He started to eat grass on the banks of the lake and when he had enough eaten he went back again to the water.John Keane never fished in that lake again.Story told by Pat Dunne\n", "school_info": "School: Fearth Mór (Brooklawn)", "metadata": [{"Location:": "Fartamore, Co. Galway", "Teacher:": "\nTreasa, Bean Mhic Aonghusa\n"}, {"Collector": "Máire Ní Dhuinn", "Gender": "female"}, {"Informant": "Pat Dunne", "Gender": "male"}, {"Language": "English"}]}, "4591080/4588585/4593167": {"title": "Ainmhí Sí", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0010, Page 137", "Page 137"], "url": "https://www.duchas.ie/en/cbes/4591080/4588585/4593167", "text": "\n(continued from previous page)\nse ag rithe thart ar an bhfear. Ní raibh fhios ag an fear céard a dheanfadh sé. D’fhág se síos an móin agus d’imigh an coinín ar ais sa gcruaic.In aice na h-aite seo fadó bí poll agus deirtear go raibh croca óir ann . Aon duine a deanfaidh iarracht an croca a thabhairt leis thiocfaidh eascí mhór suas go barr an phuill agus deanfadh sí lúb di féin. D’innis daoine don sagart fuithi agus tháinic seisean agus thosiagh sé ag guidhe. D’imigh an eascú agus agus níor tháinic sí I ndhiadh sin.\n\n\n\nAinmhí SíMáire Seóige Sruth SháileCaiseal, Co. na Gaillimhe, Ó Sorcha Seóige, Sruth Saile, Caiseal, Co. na Gaillimh (4.5).Ainmmise Sise,Níl aon ainmmise sibh thar timpeall na háite seo anois, ach de réir na sean daoine bhíodh go leor aca ann fadó, bhí go leor aca annseo.Bhí bean darab ainm Peig Uí Laoinseach in a corhnnuidhe thart annseo leath-chéad blian o shoin. Bhí sí ag teacht ó Clocán lá. Dhearc sí amach an loch. Chonnaic sí go leor beicíseach amuigh ar an loch. Bhíodar a buiriugh agus a géimneach agus ag rith thart ar an uisce. Annsin bheirigh fear suas ón uisce agus thosaigh ag cur smacht ar na beirigh . Thréis tamall dimigh said agus ní fhaca sí níos mó iad. D’innis sí go fear puca agus dubhairc sé gur minic a bhfaca sé féin iad. Tá scéal eile faoi bean a bhí ‘ na comhnuidhe i Ros Ruadh. Ní raibh aon bó ná báinne acu. Lá amháin bhí duine dá clann tinn, agus bhí báinne ag teastail go géar uatha. Táimid bó deas riabach chuig an doras agus bligh an bean í. Líon sí gac soireach sa tecah leis an báinne. Lagadh an bó mar sin gac lá agus tar éis tamall chuala ceann se na comhsumaibh fuichi agus tháinic ead air. Bligh sé an bó. Níor tháinic sí i ndiadh sin.Tá ceann eile faoi fhear a bhí ag goid móna bí se mall san oibre . Nuair a shíl an fear fód a chuir ‘na mála léim coinín beag bán amach as an gcruaic agus thosaigh se ag rithe thart ar an bhfear. Ní raibh fhios ag an fear céard a dheanfadh sé. D’fhág se síos an móin agus d’imigh an coinín ar ais sa gcruaic.In aice na h-aite seo fadó bí poll agus deirtear go raibh croca óir ann . Aon duine a deanfaidh iarracht an croca a thabhairt leis thiocfaidh eascí mhór suas go barr an phuill agus deanfadh sí lúb di féin. D’innis daoine don sagart fuithi agus tháinic seisean agus thosiagh sé ag guidhe. D’imigh an eascú agus agus níor tháinic sí I ndhiadh sin.Caitlín Seóige.Sruth – Saile , Caiseal,Co na Gaillimhe. Bí fear ag dul thar loch agus chonnaic sé capall ag léim anseo aníos ag dul i measc na gcapall eile a bhí in aice loch. Bhí iontas mór air nuair a chonnaic sé an sort capaill a bhí ionntu. Bhí muinéal mhór fhada uirthi aguss an bach ba deise dá bhfaca sé a riamh. Dhearc sé go maith uirthi naoi nó deich moimeasaí agus léim sí síos sa loch arís. Tháinic an fhaitíos ar an bhfear mar gur chuala sé na sean-daoine a raibh roimhe sin go raibh capall sa loch agus dá bhfeicfeadh sí tú sul a bhfeicfeadh tú é go mbeifeá caillte roimh blian ; ach nífios agam ar chailleadh é nó ar cailleadh.Ó Maíre Seóige,Sruth-Sáile, Caiseal, Co na Gaillimhe.\n", "school_info": "School: Cashel", "metadata": [{"Location:": "Cashel, Co. Galway", "Teacher:": "\nP. Ó Lochlainn\n"}, {"Collector": "Caitlín Seóige", "Gender": "female", "Address": "Scrahallia, Co. Galway"}, {"Informant": "Máire Seóige", "Gender": "female", "Age": "55", "Address": "Scrahallia, Co. Galway"}, {"Language": "Irish"}]}, "4583360/4583165/4606856": {"title": "Eachanna Uisce", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0062, Page 0238", "Page 0238"], "url": "https://www.duchas.ie/en/cbes/4583360/4583165/4606856", "text": "\nEachanna UisceDeireann an sean dream go bhfuil roinnt eachanna uisce timpeall ar an áit seo. Tá sé ráite go bhfuil ceann acu i loch Ghlionnáin. Uaireannta se'chaoi mbíonn sí le feiceál in a heach agus í ag snámh ar bharr an uisce agus uaireanta eile sé'n chaoi a mbíonn sí le feiceál ina broc. Tá loch eile thuas ar a sliabh ar an dtugar loch an Dobhráin agus deirtear go mbíonn each uisce le feiceál ann amannta.Bhí searrach thiar, i Rós a mhíl a bhí ag each uisce agus bhí sé an-deas agus sé an dath a bhi air ná dath uaithne agus nuair a chonaic na blachaigh chomh deas agus a bhí sé cheannaigh siad é agus mharaigh siad é. Ansin d'fean (do bhain) siad an craiceann dhó agus rinne siad casóga dhó agus bhíodh siad ortha.Bhí each uisce ag fear ar an mBánráin agus bhí sé aige scaitheamh mór. Thug sé chuig an gceardhcain é agus chuir sé ieithre chrudh air agus raibh sé i bhfad aige na dhiaidh sin gur imigh se uaidh.  le hÁine Ní fhathartaEach - Abair an 't-ach' t-leathan i gcomhnuidhe. 'Is deas a' t-each í an t-each-ín bán' t-leathan, ch leathan\n", "school_info": "School: An Tulach", "metadata": [{"Location:": "Tully, Co. Galway", "Teacher:": "\nTadhg Ó Séaghdha, Máire, Bean Uí Dhuigneáin\n"}, {"Collector": "Áine Ní Fhatharta", "Gender": "female"}, {"Informant": "Tomás Ó Fatharta", "Gender": "male", "Age": "20", "Address": "Ballynahown, Co. Galway"}, {"Language": "Irish"}]}, "4602676/4594573/4615086": {"title": "The Water-Horse", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0004, Page 082", "Page 082"], "url": "https://www.duchas.ie/en/cbes/4602676/4594573/4615086", "text": "\nThere is a lake five or six miles east of Clifden town. One day there was a man going around the place looking for his horse. Suddenly he saw a horse jumping from the lake, the man ran to the horse because he thought it was his own.When he reached the horse he looked at it, but it was not his own horse and it did not belong to any person in the district for miles around. He took it home and had it working every day for a long time. One day he was leaving the horse in the field. When he let her loose it ran to the lake and jumped into it. After that the people said that it was a Water-horse\n", "school_info": "School: An Clochán (B)", "metadata": [{"Location:": "Clifden, Co. Galway", "Teacher:": "\nAn Br. Angelo Mac Shámhais\n"}, {"Collector": "Connie Mc Grath", "Gender": "female"}, {"Informant": "Mr Jack Gibbons", "Gender": "male", "Age": "58", "Address": "Clifden, Co. Galway"}, {"Language": "English"}]}, "4602677/4594682/4615263": {"title": "The Wild Sea-Horse", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0004, Page 222", "Page 222"], "url": "https://www.duchas.ie/en/cbes/4602677/4594682/4615263", "text": "\nA long time ago a man was fishing on a lake in the mountains of Connemara. As he was fishing he saw something coming (coming)towards him from the lake. After a while he ran away. After a lovely sea horse came up out of the lake. the man went down to the brink of the lake and he caught the horse. He kept him for a long time working him under a cart every day. One night about twelve a clock the horse ran away. The next day another man saw the same horsein the lake.\n", "school_info": "School: An Clochán (B)", "metadata": [{"Location:": "Clifden, Co. Galway", "Teacher:": "\nAn Br. Angelo Mac Shámhais\n"}, {"Collector": "Joseph Gibbons", "Gender": "male"}, {"Informant": "Michael Conroy", "Gender": "male", "Age": "83"}, {"Language": "English"}]}, "4613686/4608514/4623716": {"title": "Leacht George", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0019, Page 308", "Page 308"], "url": "https://www.duchas.ie/en/cbes/4613686/4608514/4623716", "text": "\nIt is supposed that under a great heap of stones there is a man buried by the name of George Barry. This place is about a mile from here. A few miles from where this [is] George lived. It is supposed that water horses used to come up and feed on his green field near the lake by night. This man, a particularly good horseman, would train the wildest and wickedest of horses.He said to himself one day, I must watch and see if it is true that these horses come out of the lake. So this night he lay wait. At about twelve o'clock he saw one of the greatest surprises he ever saw. First of all came a shaggy old mare and when she found that all was quiet she let a  [whinney?] calling the remainder on. One by one they followed on until about thirteen had come out. The job was now to capture\n(continues on next page)\n", "school_info": "School: Leacaigh (Leacach)", "metadata": [{"Location:": "Lackagh Beg, Co. Galway", "Teacher:": "\nSeosamh Ó hÁinlíghe\n"}, {"Collector": "Chrissie Callanan", "Gender": "unknown", "Address": "Turloughmore, Co. Galway"}, {"Informant": "Thomas Callanan", "Gender": "male", "Age": "45", "Address": "Turloughmore, Co. Galway"}, {"Language": "English"}, {"Location": "Turloughmore"}]}, "4602689/4595355/4626078": {"title": "A Lake Horse", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0006, Page 144", "Page 144"], "url": "https://www.duchas.ie/en/cbes/4602689/4595355/4626078", "text": "\nThere was a woman rowing a boat on Cartharn lake. There was a man standing on the bank. He saw the head of a horse appearing over the water. The monster looked at the man, and he shouted at the woman to row quickly out of the lake. She looked back and saw the monster but he had seen her first, and followed her. She landed on the shore and the lake horse disappeared again below the water. The woman died before a year had passed.\n", "school_info": "School: Maigh Ard", "metadata": [{"Location:": "Moyard, Co. Galway", "Teacher:": "\nMáirtín Ó Dubhshlain\n"}, {"Language": "English"}]}, "4613705/4610704/4626315": {"title": "Ainmhithe Neamhshaolta", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0067, Page 459", "Page 459"], "url": "https://www.duchas.ie/en/cbes/4613705/4610704/4626315", "text": "\nDeirtear go bhfeicfidhe each uisge gach seacht mbliain thíos í loch na Rosa.Aon uair amháín chonnaic fear é go h-an mhac ar maidein agus é ar bhruach an locha, dath bán do bhí uirthí. D'fhéach an fear tríd an gclaidhe mar deirtear dá bhfeifeadh an each-uisghe thú í dtosach go gcaillfidhe thú sul dá mbéadh seacht mbliain eile caithte.Tráthamhail go leor chonnaic an fear seo í dtosach í agus b'éigin dí fannacht 'san ait céadhna go mbéarfadh an fear uirthi le rud iarann. Cuaidh an fear abhaile agus séard a thug sé leis ach an tlú; chuir sé\n(continues on next page)\n", "school_info": "School: Cill Ainbhthin (cailíní)", "metadata": [{"Location:": "Killannin, Co. Galway", "Teacher:": "\nAoife Bean Mhic Dhonnchadha\n"}, {"Collector": "Máire Ní Uigínn", "Gender": "female", "Address": "Doon, Co. Galway"}, {"Informant": "Peadar Ó hUigínn", "Gender": "male", "Age": "61", "Address": "Doon, Co. Galway"}, {"Language": "Irish"}]}, "4613705/4610706/4626316": {"title": "Ainmhithe Neamhshaolta", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0067, Page 461", "Page 461"], "url": "https://www.duchas.ie/en/cbes/4613705/4610706/4626316", "text": "\n(continued from previous page)\ndo loch mór uisge nuair a bhain an fear an srian iarann dí agus chuir srian óir uirthí. Annsin do léim an capall isteach innsan loch agus an fear ag marcaigheacht uirthi. Do báthadh an péire aca; sin é an méad a chualtar ó shion in a dtaobh.\n\n\n\ndeirtear nach bhfuil rud ar bith ar thalamh nach bhfuil a mhac samhail san uisge; mar an capall ar thalamh agus an cachuisge san uisge; agus tá tarb ar an talamh agus tarbh san uisge; agus tá maughdean\n(continues on next page)\n", "school_info": "School: Cill Ainbhthin (cailíní)", "metadata": [{"Location:": "Killannin, Co. Galway", "Teacher:": "\nAoife Bean Mhic Dhonnchadha\n"}, {"Collector": "Nápla Bhreathnach", "Gender": "female", "Address": "Gortnagroagh, Co. Galway"}, {"Informant": "Séamus Ó Chonchubhair", "Gender": "male", "Age": "72", "Address": "Porridgetown West, Co. Galway"}, {"Informant": "Máirtín Ó Duibhinn", "Gender": "male", "Age": "71", "Address": "Gortnagroagh, Co. Galway"}, {"Language": "Irish"}]}, "4622963/4617350/4627257": {"title": "Each Uisce", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0069, Page 329", "Page 329"], "url": "https://www.duchas.ie/en/cbes/4622963/4617350/4627257", "text": "\nEach UisgeTá each uisge i gcnoc san (gceanntair)[sic] gceanntar seo. Sé'n tainm a tugtar air Cnoc an Daimh. Na maortha a bhíonns ag siubhal Cnuic an Daimh go moch ar maidin feiceann siad é agus bíonn faitchíos mór ortha roimhe.Tá sean-fhear san mbaile seo agus dubhairt sé liom go bhfaca sé fhéin é agus dubhairt sé nach n-aithneochthá thar chapall ar bith é agus gur capall deas riabhach a bhí ann. Dubhairt sé go raibh sé ag ithe fhéir i n-aice le loch a Daimh mar bheadh capall ar bith. Dubhairt sé go raibh an spóirt aige ar ag ithe féir acht nuair a chonnaic an t-each uisge an fear léim sé isteach san uisge mar bheadh marda[sic] uisge.An capall atá i gCnoc an Daimh tá sí an droch-mhúinte. Tugann sí léithe beithidhigh agus caiple.  D'eirigh sí ag\n(continues on next page)\n", "school_info": "School: Ros Muc", "metadata": [{"Location:": "Rosmuck, Co. Galway", "Teacher:": "\nStiofán Ó hOisín\n"}, {"Collector": "Áine Ní Conaire", "Gender": "female", "Address": "Roskeeda, Co. Galway"}, {"Informant": "Pádhraig Ó Conaire", "Gender": "female", "Age": "65", "Address": "Roskeeda, Co. Galway"}, {"Language": "Irish"}]}, "4622963/4617368/4627288": {"title": "Each Uisce", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0069, Page 347", "Page 347"], "url": "https://www.duchas.ie/en/cbes/4622963/4617368/4627288", "text": "", "school_info": "School: Ros Muc", "metadata": [{"Location:": "Rosmuck, Co. Galway", "Teacher:": "\nStiofán Ó hOisín\n"}, {"Collector": "Máire Treasa Ní Máille", "Gender": "female"}, {"Informant": "Colm Ó Máille", "Gender": "male", "Age": "44"}, {"Language": "Irish"}]}, "4622963/4617371/4627300": {"title": "Each Uisce", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0069, Page 350", "Page 350"], "url": "https://www.duchas.ie/en/cbes/4622963/4617371/4627300", "text": "", "school_info": "School: Ros Muc", "metadata": [{"Location:": "Rosmuck, Co. Galway", "Teacher:": "\nStiofán Ó hOisín\n"}, {"Collector": "Máire Uí Thighearnaigh", "Gender": "female", "Address": "Rosmuck, Co. Galway"}, {"Informant": "Seán Ó Cadhla", "Gender": "male", "Age": "65", "Address": "Rosmuck, Co. Galway"}, {"Language": "Irish"}]}, "4622978/4619873/4629399": {"title": "Each Uisce", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0074, Page 284", "Page 284"], "url": "https://www.duchas.ie/en/cbes/4622978/4619873/4629399", "text": "\nBhí beirt fear ann fadó . Bhíodar ag iascaireacht lá i loch agus chonnaic duine aca each uisge. Rhógadar abhaile é agus bhí sé ag obair- ag cur amach aoiligh agus ag tabhairt móna abhaile. Lá amháin bhí sé ag marcaidheacht air in aice leis an loch. Chonnaic an each uisge, each eile. Léim sé isteach agus mhárbhuigh an fear. Deirtear go bhfuil cnámha an fhir le feiscint ina an loch ó shoin.Deirtear má fheiceann each uisge duine sul má fheiceann duine é tagann mí-ádh éicint ar an duine sin acht má fheiceann duine an t-each uisge ar dtús ní thagann aon díoghbháil ar bith air.\n", "school_info": "School: Coill Maolacáin", "metadata": [{"Location:": "Kilmeelickin, Co. Galway", "Teacher:": "\nAnna M. Ní Loingsigh\n"}, {"Collector": "Máire Ní Stancháird", "Gender": "female", "Address": "Kilmeelickin, Co. Galway"}, {"Informant": "Eilís Ní Mháille", "Relation": "grandparent", "Gender": "female", "Address": "Kilmeelickin, Co. Galway"}, {"Language": "Irish"}]}, "4622969/4618446/4630374": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0071, Page 273", "Page 273"], "url": "https://www.duchas.ie/en/cbes/4622969/4618446/4630374", "text": "", "school_info": "School: Leitirmealláin", "metadata": [{"Location:": "Lettermullan Island, Co. Galway", "Teacher:": "\nÉamonn Ó Gógáin\n"}, {"Collector": "Maighréad Nic Donnchadha", "Gender": "female", "Address": "Lettermullan Island, Co. Galway"}, {"Language": "Irish"}]}, "4622969/4618446/4630375": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0071, Page 273", "Page 273"], "url": "https://www.duchas.ie/en/cbes/4622969/4618446/4630375", "text": "", "school_info": "School: Leitirmealláin", "metadata": [{"Location:": "Lettermullan Island, Co. Galway", "Teacher:": "\nÉamonn Ó Gógáin\n"}, {"Collector": "Maighréad Nic Donnchadha", "Gender": "female", "Address": "Lettermullan Island, Co. Galway"}, {"Language": "Irish"}]}, "4623003/4622699/4630819": {"title": "Scéal", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0080, Page 109", "Page 109"], "url": "https://www.duchas.ie/en/cbes/4623003/4622699/4630819", "text": "\nThere was a field of oats sown near Derrinlough lake. Each night the corn used to be eaten and the people did not know what was doing the damage. One night two boys remained up to watch. They saw four horses coming out of the lake eating the corn. They waited to see if any more would come out. Next came out two girls to bring in the horses. The boys made an attmept to catch the horses but failed. One boy caught one of the girls. She promised that if he would let her free that she would give him the best and luckiest horse he ever had and it bred seven mare foals. The girl told him not to ever allow the horse to drink water out of the lake.One day as they were ploughing near the lake a little boy came to call them to dinner. They put the little boy\n(continues on next page)\n", "school_info": "School: Cill Chiaráin", "metadata": [{"Location:": "Kilkerrin, Co. Galway", "Teacher:": "\nCaitlín, Bean Uí Chuimín\n"}, {"Collector": "Mary Ellen Disken", "Gender": "female", "Address": "Derrinlough, Co. Galway"}, {"Informant": "Thomas Disken", "Relation": "parent", "Gender": "male", "Address": "Derrinlough, Co. Galway"}, {"Language": "English"}]}, "4622986/4621085/4632321": {"title": "Ainmhithe Neamhshaolta", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0076, Page 381", "Page 381"], "url": "https://www.duchas.ie/en/cbes/4622986/4621085/4632321", "text": "", "school_info": "School: An Fháirche (Buachaillí)", "metadata": [{"Location:": "Clonbur, Co. Galway", "Teacher:": "\nÉnrí Ó Máille\n"}, {"Informant": "Eibhlín Ó Maolruaidh", "Gender": "female", "Age": "29", "Address": "Carrowkeel, Co. Galway"}, {"Language": "Irish"}]}, "4622986/4621085/4632342": {"title": "Ainmhithe Neamhshaolta", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0076, Page 381", "Page 381"], "url": "https://www.duchas.ie/en/cbes/4622986/4621085/4632342", "text": "", "school_info": "School: An Fháirche (Buachaillí)", "metadata": [{"Location:": "Clonbur, Co. Galway", "Teacher:": "\nÉnrí Ó Máille\n"}, {"Collector": "Seán Ó Cadhain", "Gender": "male"}, {"Informant": "Pádraig Ó Cadhain", "Gender": "male", "Age": "50"}, {"Language": "Irish"}]}, "4622986/4621086/4632352": {"title": "Ainmhithe Neamhshaolta", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0076, Page 382", "Page 382"], "url": "https://www.duchas.ie/en/cbes/4622986/4621086/4632352", "text": "", "school_info": "School: An Fháirche (Buachaillí)", "metadata": [{"Location:": "Clonbur, Co. Galway", "Teacher:": "\nÉnrí Ó Máille\n"}, {"Informant": "Eibhlín Ní Mhaolruaidh", "Gender": "female", "Age": "29", "Address": "Carrowkeel, Co. Galway"}, {"Language": "Irish"}]}, "4605955/4605632/4644012": {"title": "Each Uisce agus Tarbh Uisce", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0208, Page 225", "Page 225"], "url": "https://www.duchas.ie/en/cbes/4605955/4605632/4644012", "text": "\nThe Water horse is seen on the Derrinligroe shore of Lough Allen on Pat McManus's land.Mrs Frances Carroll saw him one day. He came out of water ran on strand for a few minutes and into the water again.Thomas McGurll RIP saw a water horse on the lime kiln bank of Lough Allen at Blackrock. He was going to Drumshanbo when he saw the strange animal. When he spoke the horse raised his head from the grass and the main stood up like the fins on a fish. Anger flashed in his eyes and he sprang from the rock out into the deep part of the lake below the kiln and disappeared.There is a lake up near Drumsna called Backwood or Blackwood Lough. It is near a historic castle up there called Ballycloran. St Kiallan's bell was thrown into this lake and that night the bell came back to Kiallan at Fenagh and rang as it flew through the air. There's a bull in that lake and he\n(continues on next page)\n", "school_info": "School: Corderay", "metadata": [{"Location:": "Shancurry, Co. Leitrim", "Teacher:": "\nSeán Ó Céilleachair\n"}, {"Collector": "Seán Ó Céilleachair", "Gender": "male", "Occupation": "múinteoir"}, {"Language": "English"}]}, "4605938/4603953/4644465": {"title": "Ciotrainn a Tharla i Loch Aillionn", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0204, Page 244", "Page 244"], "url": "https://www.duchas.ie/en/cbes/4605938/4603953/4644465", "text": "\n(continued from previous page)\ngach creatár bocht síos go toin an locha agus bathadh gach duine acha. Níor thainich duine saor ó'n mbáis an lá sin acht an bheirt a d'fhag i na ndiaidh i nDruimseanbhó.Tessie McLoughlinKilladiskertSupplied by Maggie McLoughlin\n\n\n\nOn the bed of the lake about twenty  yards on this side of Innishmagrath Island was found a large oak boat 40 ft long and 9ft wide. It was kept together by wooden pegs which were used instead of nails.\n\n\n\nIn Lake Allen are water horses. Once a farmer had oats   and the oats was eaten and he did not know what was eating it. He stayed up one night to see, and at about four o'clock in the morning he went out, and in the middle of the oats was a big horse and two foals. He went down to see what they were like and away the went into the Lough and the next minute he saw them out near Drummons Island in Lough Allen.\n", "school_info": "School: Kilmore", "metadata": [{"Location:": "Kilmore, Co. Leitrim", "Teacher:": "\nEilís, Bean Uí Cheallaigh\n"}, {"Collector": "B.T. Corristine", "Address": "Killadiskert, Co. Leitrim"}, {"Informant": "Pat Corristine", "Gender": "male", "Address": "Killadiskert, Co. Leitrim"}, {"Language": "English"}]}, "4649689/4647496/4651171": {"title": "A Water-Horse", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0211, Page 062", "Page 062"], "url": "https://www.duchas.ie/en/cbes/4649689/4647496/4651171", "text": "\nA Water Horse     Long ago there was a little horse seen on the shores of Cornagon Lough. One night a man named Doonan was coming from his ceilidh and he saw the horse. He caught him and brought him home with him. The horse lived with him for a long time and worked well for him. One day when the man was going to a fair and was crossing a big river the horse jumped across the bridge and never was seen again.       Story told by Mrs McHugh Cornagon          James Leddy.     18 - 3 - 1938               Drumaragh\n\n\n\nA StoryOne time there was a landlord called Peyton living in Laheen.  Some time before his death;  he was sick in Dublin hospital. This time when he was very bad he appeared in Laheen.  When two of the women of the long-byre after milking and Peyton appeared to them.  One of them asked him did he want a drink but she\n(continues on next page)\n", "school_info": "School: Ceis Carraigín", "metadata": [{"Location:": "Keshcarrigan, Co. Leitrim", "Teacher:": "\nTomás Mag Fhionnáin\n"}, {"Collector": "James Leddy", "Gender": "male", "Address": "Drumaragh, Co. Leitrim"}, {"Informant": "Mrs Mc Hugh", "Gender": "female", "Address": "Cornagon, Co. Leitrim"}, {"Language": "English"}]}, "4649676/4645788/4659054": {"title": "Each Uisce i Loch Riabhach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0030, Page 422", "Page 422"], "url": "https://www.duchas.ie/en/cbes/4649676/4645788/4659054", "text": "\nEach uisge i Loch Riabhach.Bhí fear saidhbhir in-a chomhnaidhe ar bhruach Locha Riabgach tráth. Tighearna Talamhan a b’eadh é agus bhí talamh Baile Loc’ Riabhach ar fad fé chíos aige, ach bhí tionóntaí aige ar chuid de agus d’íocadh na tionóntaí seo cíos leis. Ruaidhrí Ó Mórdha a b’ainm dó. Aon bhliadhain amháin chur sé píosa mór de’n talamh fá arbhar, San bhFoghmhar nuair a bhí an t-arbhar aibidh, chuaidh an tighearna amach ag breathnú ar an arbhar chonnaic sé go raibh a lán díoghbhála déanta do’n arbhar. D’fhág sé gárda saighdiúirí ag tabhairt aire dó an oidhche sin. I lár na hoidhche tháinigh ionghnadh mór ar na saighdiúirí nuair chonnaiceadar sgata de eachanna uisge ag teacht amach as an loch agus isteach san bpáirc leo. Thosuigheadar ag ithe an arbhair comh tréan agus d’féadadar agus nuair a bhí a sháith ithte aca d’imthigheadar leo. Lá’r na bháireach d’innis na saighdiúirí do’n tighearna fá’n rud a thárla agus d’orduigh an tighearna dhóibh breith ar cheann aca. Nuair thuit dorchadas na h-oidhche chuadar amach ag faire ar na h-eachanna. Thárla an rud céadhna do thárla an oidhche roimh réidh. Nuair tháinig na h-eachanna isteach san bpáirc rith na saighdiúirí i na ndiaidh agus rugadar ar cheann aca. Thugadar abhaile chuig an tighearna é. Chuir an tighearna isteach i sgiobóil é agus d’fhág sé annsoin é go raibh sé roinnt reamhair. Nuair a bhí sé roinnt reamhar bhí sé in a each chomh breágh is bhí i n-Éirinn. Annsoin chuir sé amach san rása é agus ní raibh capall ar bith\n(continues on next page)\n", "school_info": "School: Páirc na Sceach", "metadata": [{"Location:": "Bushypark, Co. Galway", "Teacher:": "\nSeán Mac Suibhne\n"}, {"Collector": "Máire Ní Cheara", "Gender": "female", "Address": "Barnacranny, Co. Galway"}, {"Informant": "Míchéal Ó Flannacha", "Relation": "relative (other than parent or grandparent)", "Gender": "male", "Age": "72", "Occupation": "feirmeoir", "Address": "Barnacranny, Co. Galway"}, {"Language": "Irish"}]}, "4649692/4647763/4659319": {"title": "Loch Caoch", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0211, Page 328", "Page 328"], "url": "https://www.duchas.ie/en/cbes/4649692/4647763/4659319", "text": "\nOne fine spring's morning a man went to harrow a field of oats. As he did so he saw a fine horse standing by the side of the lough. He had no horse so he decided to take this one. He harnessed the horse and harrowed the field. When the field was finished he said he would take the horse home, and so saying he jumped up on his back. The horse sped away but instead of going to the man's home he plunged into lough and they both sank beneath the water, and neither of them was seen again.From that time there is a cure in the lough and people go there to get cured of swelling. It is said that if they look back before they get out of sight of the lake, the white horse will come out of the water and bring them back.\n", "school_info": "School: Crummy", "metadata": [{"Location:": "Crummy, Co. Leitrim", "Teacher:": "\nPádhraic Ó Rodacháin\n"}, {"Collector": "Lizzie Mulvey", "Gender": "female"}, {"Language": "English"}]}, "4658428/4654502/4660524": {"title": "Strange Animals", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0220, Page 280", "Page 280"], "url": "https://www.duchas.ie/en/cbes/4658428/4654502/4660524", "text": "\nLong ago there were horses in Cornagaha Lake Cor na Gaoi[?]e - In the parish of Gortletteragh near the road from Murhill to Ballinamuck. Everybody used to be trying to catch them but they were not able. One night a man named Gannon caught one of them and when he was bringing him home, he met a little man. The little man told him that if he got the horse shod before 24 hourse the horse would work for him. He also told him that if the horse lost a shoe and went by the lake he would go into the lake. In about two years after the horse got in and was drowned and in about a week after the horse was found dead near the brink of the lake and his mane was 7 yds long and it would take a man's two hands to go round every hair. This horse when alive would pull 3 ton up any hill.\n", "school_info": "School: Druimín", "metadata": [{"Location:": "Drummeen, Co. Leitrim", "Teacher:": "\nTomás Ó Ceallaigh\n"}, {"Collector": "J. H. Mc Nulty", "Address": "Gortinure, Co. Leitrim"}, {"Language": "English"}]}, "4672098/4669859/4679071": {"title": "Mike Egan and the Princess", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0167, Page 0449", "Page 0449"], "url": "https://www.duchas.ie/en/cbes/4672098/4669859/4679071", "text": "\nMike Egan was an only son and as happens in such cases he was petted and pampered. When Mike grew up he took interest in his father's farm and very seldom worked on the farm. One day his father told him to keep the cattle out of the oats. Mike as usual forgot to obey his father's order. The cattle went into the oats and trampled down most of it. When Mike came home his father told him he would pack up and take the road the next morning. Mike packed up and set off next morning. When [night] came he lay down in a flower-garden and fell asleep there. During the night he heard the flowers talking to one another. they spoke of their good points and also of their bad points. Mike heard all this and remembered it never dreaming it would be of use to him again. In the morning he set off again and came to a big city. Outside a big mansion he saw several men standing in a queue. He asked one of them what they were waiting for. He was told that a certain Princess lived in the mansion and she would marry no one but the man who could please her. Mike was in no hurry out of the city and said he would join in the competition. The Princess interviewed each man separately. So far no one had succeeded. While Mike was waiting for his turn to please the Princess he asked one of the many competitors what was the Princess's  hobby. 'Flowers and games' said the other competitor. Mike now was more confident as he was good at games and only the night before had heard what the flowers said. When his turn had come he saw lying on the steps of the mansion a rose that had been trampled on. Mike picked it up, dusted it and put it in the\n(continues on next page)\n", "school_info": "School: Druim Mór", "metadata": [{"Location:": "Dromore, Co. Sligo", "Teacher:": "\nSeosamh Ó Catháin\n"}, {"Collector": "Seosamh Ó Catháin", "Gender": "male", "Occupation": "múinteoir", "Address": "Dromore West, Co. Sligo"}, {"Informant": "Martin Ferguson", "Gender": "male", "Address": "Rathgoonaun, Co. Sligo"}, {"Language": "English"}]}, "4672101/4670178/4683269": {"title": "Strange Animals", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0167, Page 0739", "Page 0739"], "url": "https://www.duchas.ie/en/cbes/4672101/4670178/4683269", "text": "\nOne time long ago a man named Pat Mc Guire of Dunflin Skeen Co Sligo was going to his work one morning. As he was passing along the lake of Loch A Croide, he saw a pony feeding by the side of the lake. He fancied the pony and caught him and brought him home. He had him in his possession for a long time till one evening he went out riding on him intending to leave him where he got him. When he was near the lake the man tried to get off the horse but the horse ran into the middle of the lake. The man on the horse never was seen again, but the heart and livers of the man were seen floating on the lake. That is how the lake got its name Loch A Croide. This lake is situated along the ox mountains in the parish of Skreen Co Sligo.\n", "school_info": "School: Dún Béicín", "metadata": [{"Location:": "Doonbeakin, Co. Sligo", "Teacher:": "\nMáire Nic Giolla Geanainn\n"}, {"Collector": "Hugh Golden", "Gender": "male", "Address": "Dunowla, Co. Sligo"}, {"Informant": "Tom Golden", "Gender": "male", "Address": "Dunowla, Co. Sligo"}, {"Language": "English"}]}, "4701719/4695549/4701811": {"title": "My Home District", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0177, Page 015", "Page 015"], "url": "https://www.duchas.ie/en/cbes/4701719/4695549/4701811", "text": "\nThe name of my home district is Lackagh in the parish of Kilmorgan and barony of Corran.In the district there are ten families and the approximate number of people is about thirty.The name most common is Mulligan. the houses are mostly thatched.There is a lake in the district called Cronan lake and it is prophesied that three lives will be lost in it as it is supposed to be enchanted.One day as a man was ploughing near this lake his horses would not work for him but began to run towards the lake. When they reached the lake the horses pulled the man and plough into the lake so he was never seen again.In former times, in this townland, the houses were far more numerous but their ruins are still to be seen in many places.In recent years many people emigrated to America, England and Scotland. The land is good and there is not much bog. There is no wood in the townland.The only river connected with Lackagh is the Corran and there is no story connected with it.\n", "school_info": "School: An Clochar, Cúil Mhaoile", "metadata": [{"Location:": "Collooney, Co. Sligo", "Teacher:": "\nAn tSr. Teresita\n"}, {"Collector": "Nancy Flynn", "Gender": "female", "Address": "Lackagh, Co. Sligo"}, {"Informant": "Owen Flynn", "Relation": "parent", "Gender": "male", "Age": "60", "Address": "Lackagh, Co. Sligo"}, {"Language": "English"}]}, "4701666/4691209/4708961": {"title": "A Story about a Water-Horse", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0157, Page 198", "Page 198"], "url": "https://www.duchas.ie/en/cbes/4701666/4691209/4708961", "text": "\nOne day a man was ploughing in his field near the lake. A water horse came out of the lake and started to eat the grass. The man saw him and went down and brought him up, and ploughed him all day. In the evening when the man was bringing the horse to a drink, he got up on his back, and rode him down to the lake.When they came near the lake the water horse sprang into the water with the man on his back.\n", "school_info": "School: Log na nGall", "metadata": [{"Location:": "Lugnagall, Co. Sligo", "Teacher:": "\nTomás Ó Hodhráin, Bean Uí Hodhráin\n"}, {"Collector": "Nora Harte", "Gender": "female", "Address": "Collinsford, Co. Sligo"}, {"Informant": "Mrs Hennegan", "Gender": "female", "Age": "73", "Address": "Collinsford, Co. Sligo"}, {"Language": "English"}]}, "4701666/4691213/4713320": {"title": "Story about a Water-Horse", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0157, Page 202", "Page 202"], "url": "https://www.duchas.ie/en/cbes/4701666/4691213/4713320", "text": "\nIt is said that long ago there lived a water horse in Glencar Lake. He often used to come up and graze on the shote. This evening when the sun was going down, the horse came up to eat the grass on the shore. A man was coming with his horse to the lake for a drink. The man saw the horse and knew he was a water horse. He have his own horse a drink, then linking the two horses by the leads he led them away with him. This strange horse stayed with the man for a long time. The one evening the man brought the two horses to the lake for a drink. But when the water horse saw the lake , he made a plunge. The man held the reins tight, but the horse jumped on top of the man and killed him dead. The horse was never seen after.\n", "school_info": "School: Log na nGall", "metadata": [{"Location:": "Lugnagall, Co. Sligo", "Teacher:": "\nTomás Ó Hodhráin, Bean Uí Hodhráin\n"}, {"Collector": "Mairín Branley", "Gender": "female", "Address": "Tormore, Co. Sligo"}, {"Informant": "Mrs Sarah Branley", "Gender": "female", "Age": "81", "Address": "Tormore, Co. Sligo"}, {"Language": "English"}]}, "4701666/4691214/4713329": {"title": "Story about a Water-Horse", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0157, Page 203", "Page 203"], "url": "https://www.duchas.ie/en/cbes/4701666/4691214/4713329", "text": "\nOne day when a man was down in his field working at his cattle he saw a water horse grazing in the field near the lake. He went down and caught him, and brought him up to the house. Then he worked him and used to put him in at night to a house. One evening he went down to the lake with the man on his back to get a drink. The man was riding on the horse and the horse ploughed into the lake with the man on his back. The man was unable to get off the horse's back and it was said that there was magic attached to the horse.\n", "school_info": "School: Log na nGall", "metadata": [{"Location:": "Lugnagall, Co. Sligo", "Teacher:": "\nTomás Ó Hodhráin, Bean Uí Hodhráin\n"}, {"Collector": "Maire Devins", "Gender": "female", "Address": "Lugnagall, Co. Sligo"}, {"Informant": "Mr James Keegan", "Gender": "male", "Age": "60", "Address": "Lugnagall, Co. Sligo"}, {"Language": "English"}]}, "4701666/4691216/4713331": {"title": "A Water-Horse in Glencar Lake", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0157, Page 205", "Page 205"], "url": "https://www.duchas.ie/en/cbes/4701666/4691216/4713331", "text": "\nLong ago there was a water horse in Glencar Lake. It is said that a man lived in a house not far from the lake. One morning, the man went to a field beside the lake to look after cattle, when he saw the horse feeding on the grass. He caught the horse and brought him to his own house and put him in a stable. He used to work the horse in the cart. The horse, it is said, used to work as quiet as any other horse in the cart.It happened one day that the man got riding on the horse's back and rode him to the lake to a drink. As soon as the horse got to the shore he galloped in, and the man could not get off his back. It is said that the horse had magic. The man was never seen after that nor the horse.\n", "school_info": "School: Log na nGall", "metadata": [{"Location:": "Lugnagall, Co. Sligo", "Teacher:": "\nTomás Ó Hodhráin, Bean Uí Hodhráin\n"}, {"Collector": "John J. Branley", "Gender": "male"}, {"Informant": "Mr Thady Branley", "Gender": "male", "Age": "50", "Address": "Glen Lower, Co. Sligo"}, {"Language": "English"}]}, "4701666/4691217/4713333": {"title": "Story about Water-Horse", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0157, Page 206", "Page 206"], "url": "https://www.duchas.ie/en/cbes/4701666/4691217/4713333", "text": "\nOne time a man was feeding his cattle on the side of Glenan Lake. He saw a nice horse feeding in the field. He lifted the rope that he had tying a load of hay for his cattle. He went as far as the horse and caught him.He brought him home to his own house and worked him.The horse was very nice and a great worker.This day he brought the horse to the lake for a drink of water.When the horse reached the lake he gave a leap and caught the man and ate him, and he leaped into the lake.\n", "school_info": "School: Log na nGall", "metadata": [{"Location:": "Lugnagall, Co. Sligo", "Teacher:": "\nTomás Ó Hodhráin, Bean Uí Hodhráin\n"}, {"Collector": "Frank O' Connor", "Gender": "male", "Address": "Tormore, Co. Sligo"}, {"Informant": "John O' Connor", "Gender": "male", "Age": "65", "Address": "Tormore, Co. Sligo"}, {"Language": "English"}]}, "4701666/4691218/4713334": {"title": "A Water Horse", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0157, Page 207", "Page 207"], "url": "https://www.duchas.ie/en/cbes/4701666/4691218/4713334", "text": "\nOne time long ago two men were out on Glencar Lake on a float made of logs of wood tied together. They were out in the middle of the lake when a water horse appeared on top of the water and dragged the float and the men under the water.Their fishing rods and the float were found on the shore of the lake, but it was supposed that it was a water horse that killed them. This water horse was doing great damage to the people.One day he was followed out in the lake and the water horse appeared again over the water. He was immediately shot and his body was washed in on the shore.It is said that there are nine people to be drowned in Glencar Lake.\n", "school_info": "School: Log na nGall", "metadata": [{"Location:": "Lugnagall, Co. Sligo", "Teacher:": "\nTomás Ó Hodhráin, Bean Uí Hodhráin\n"}, {"Collector": "Michael Commins", "Gender": "male", "Address": "Tormore, Co. Sligo"}, {"Informant": "Pat Harte", "Gender": "male", "Age": "70", "Address": "Tormore, Co. Sligo"}, {"Language": "English"}]}, "4701669/4691556/4714135": {"title": "Water-Horses", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0158, Page 071", "Page 071"], "url": "https://www.duchas.ie/en/cbes/4701669/4691556/4714135", "text": "\nOnce upon a time a man in Glencar saw a horse come out of Glencare Lake, and jump into his own field. He was surprised to see how big and strong he was, and he said to himself he would work the horse tomorrow as he had some ploughing to do.When the next day came the man put the horse into a plough, and he worked well for two days, but at the end of that time the man brought him down to the lake to give him a drink, and before the man had time the horse jumped into the lake, and brought the poor man with him, and none of them were seen ever after.\n", "school_info": "School: Rathcormac", "metadata": [{"Location:": "Rathcormack, Co. Sligo", "Teacher:": "\nM. Bean Uí Fhéinneadha\n"}, {"Collector": "Gerty Currid", "Gender": "female"}, {"Language": "English"}]}, "4701755/4699663/4714385": {"title": "Where the Local Stream Rises", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0185, Page 0175", "Page 0175"], "url": "https://www.duchas.ie/en/cbes/4701755/4699663/4714385", "text": "\nBun-an-Fheabáin means the mouth or end of the stream. This stream concerned rises in Pulincha.Pulincha is a round hole said to be bottomless. I heard once that a diver from France went down in the hole. He kept going down for a day and a night, but on failing to find the bottom he came up again. It was then said that Pulincha was bottomless. From this hole a little river rises. It flows down by the creamery and by the mill at Bunninadden. Widening and narrowing it makes its way to Cloonacleigha lake. Many stories are connected with Pulincha. The following is one of them. A man named Thady Hynns was ploughing in a field near Pulincha. He had only one horse. He was not long at work until he saw a big horse feeding on the headland. Thady caught the horse, and traced him with his own horse. He worked very quiet for a while. As the strange horse was coming near the hole he frightened and ran off. The other horse ran too. When they reached the hole they plunged in, taking with them the plough and Thady. All went down. They were never heard of again. No one ever went near the hole since. This hole lies about half a mile from Bunninadden at the foot of a hill in Pat Gildea's meadowlands.\n", "school_info": "School: Bunninadden", "metadata": [{"Location:": "Bunnanaddan, Co. Sligo", "Teacher:": "\nJohn J. Rochford\n"}, {"Collector": "John J. Kerins", "Gender": "male", "Address": "Ballynaraw North, Co. Sligo"}, {"Informant": "Mr John Healy", "Gender": "male", "Address": "Lecarrow, Co. Sligo"}, {"Language": "English"}]}, "4701736/4697448/4714893": {"title": "A Story of a Water-Horse", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0181, Page 216", "Page 216"], "url": "https://www.duchas.ie/en/cbes/4701736/4697448/4714893", "text": "\nIn a meadow beside Lough Shean now known as Wynn's meadow in that part of the Co. Roscommon adjoining the Co. Sligo, water-horses came up from the lake and made that portion of the meadow a favourite resort for grazing on. Though now farther back than the memory of any living person, a reliable story is told by people who lived a hundred years ago of a water-horse that was captured in this meadow. He was of a small size, jet black and close silky hair on him. The men who captured him put a bridle on him, and traced him to a harrow and worked with him until he had all his oats sown. He brought him back to the same place, and took the bridle off him. The animal seemed tired and unwilling to walk, the man struck him with the bridle to urge him but the horse turned round and caught a firm grip of the man with his teeth, dragging him into the lake, and then killed him.\n", "school_info": "School: Geevagh", "metadata": [{"Location:": "Geevagh, Co. Sligo", "Teacher:": "\nSeán Ó Gallchobhair\n"}, {"Collector": "Augustine Mac Auley", "Gender": "male"}, {"Informant": "Martin Mac Donagh", "Gender": "male", "Address": "Geevagh, Co. Sligo"}, {"Language": "English"}]}, "4701763/4700701/4715293": {"title": "Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0187, Page 028", "Page 028"], "url": "https://www.duchas.ie/en/cbes/4701763/4700701/4715293", "text": "\n(continued from previous page)\nlively until eight p. m. When the bank was finished twenty horse carts of good turf was turned out on the spread ground. The boys were tired and they went to get a drink to the public house. Then James took with him a pint of whiskey and got ready for the dance. Then he went to Paddy's house to take the daughter to the dance. When he got there the old man greeted him with a smile. Well my boy you are a good turf cutter I am proud of you. James said nothing only he put his hand in his pocket and gave the old man the bottle of whiskey and then the both had a glass of the whiskey. Then James asked Paddy if he could take his daughter for his life's partener and the answer he got was \"Yes\". So that was the end of it all.\n\n\n\nYears ago situated near the South Eastern shore of Gara there lived a noble family, named O'Moore.Their mansion was large and spacious with\n(continues on next page)\n", "school_info": "School: Mullach Ruadh", "metadata": [{"Location:": "Mullaghroe, Co. Sligo", "Teacher:": "\nBean Uí Nia\n"}, {"Collector": "Mary Mc Gowan", "Gender": "female", "Address": "Moygara, Co. Sligo"}, {"Informant": "Mrs Mc Gowan", "Gender": "female", "Address": "Moygara, Co. Sligo"}, {"Language": "English"}]}, "4701691/4693067/4744103": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0163, Page 275", "Page 275"], "url": "https://www.duchas.ie/en/cbes/4701691/4693067/4744103", "text": "\nIn the parish of Easkey there lived a man who found a mare in his field one morning. He could find no owner for the animal so he kept her for several years. Each year for seven years she reared a foal for him.When she had her work finished one evening, after putting up wrack from the sea to the shore, her master was turning her into the field and he accidentally hit her with her bridle. The mare let a neigh for each foal she reared and they all gathered together and went into the sea and were never seen again. Since that day the place is called Beann an Searragh[?].\n", "school_info": "School: Stuacán", "metadata": [{"Location:": "Muingwore, Co. Sligo", "Teacher:": "\nBríd Ní Mhiadhaigh\n"}, {"Collector": "Margaret Carden", "Gender": "female", "Age": "14", "Address": "Tawnalaghta, Co. Sligo"}, {"Informant": "Mrs M. Carden", "Gender": "female", "Address": "Tawnalaghta, Co. Sligo"}, {"Language": "English"}]}, "4701717/4695446/4744780": {"title": "A Story I Have Heard Locally", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0176, Page 127", "Page 127"], "url": "https://www.duchas.ie/en/cbes/4701717/4695446/4744780", "text": "\nOnce upon a time a farmer had a big crop of oats growing near a lake. At night some animals ate the crop. This annoyed the man very much. At night he went out to see whose and what animals were destroying the oats.This particular night he and some other boys armed with guns climbed a tree near the field about midnight. A number of ponies came out of the lake and started eating the oats. The farmer was so frightened that he went home.The next night he went out with more courage and succeeded in catching one of them. He brought it home and fed it. Next day he brought the pony to the bog. On his way home he was obliged to pass the lake. As he was\n(continues on next page)\n", "school_info": "School: Ballysadare (C.)", "metadata": [{"Location:": "Ballysadare, Co. Sligo", "Teacher:": "\n-\n"}, {"Collector": "Kathleen O' Reilly", "Gender": "female"}, {"Informant": "John Battle", "Gender": "male", "Address": "Larkhill, Co. Sligo"}, {"Language": "English"}]}, "4723853/4719243/4744855": {"title": "Strange Animals", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0944, Page 380", "Page 380"], "url": "https://www.duchas.ie/en/cbes/4723853/4719243/4744855", "text": "\nThere are very few strange animals in this district. There are deers in Dartrey demense. They used to be kept in a deer-park there but since the proprietors of Dartrey has left there the deer are seen going wild over this district. There are only about five of them.A water horse is supposed to have been seen in a lake near Newbliss. It is shaped like a small horse and is heard making terrific splashes in the water of the lake.There is no local tradition of fairy horses or cows having come into farmer's possession and remained with them.\n", "school_info": "School: Edraguil", "metadata": [{"Location:": "Edergole, Co. Monaghan", "Teacher:": "\nC. Nic Philip\n"}, {"Collector": "Brigid Durnan", "Gender": "female", "Address": "Edergole, Co. Monaghan"}, {"Language": "English"}]}, "4723815/4715952/4758693": {"title": "Loch Diarmada", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0934, Page 276", "Page 276"], "url": "https://www.duchas.ie/en/cbes/4723815/4715952/4758693", "text": "\nLoch DiarmadaThis story was told by Norah Cooney, Corcreagh NS by Bridie Lynch, Lisnadara, Parish of Aughnamullan, Co. Monaghan.This is about a lake on Bridie Lynch's farm. Loch Diarmada was once an enchanted lake. Long ago there was an old man living in a little cave in the spelic (a large stone near the lake. This cave is still to be seen. The man was a shoemaker and after his death the lake appeared.Every seven years there used to come wild horses out of the lake and feed on the grass and then go back again. Once her grandfather let two horses out to drink at a pond near the lake. In about half-an-hour, he went to take them home, but when he was approaching them, he heard something like the sound of neighing in the lake and then he saw the two horses running towards it. He ran after them but they jumped into the lake and were gone.He came back again feeling that his horses were gone, but when he came back to the pond his two horses were feeding alongside of it. He went up to them and brought them home. It was the wild horses he was following.\n", "school_info": "School: Cor Críochach", "metadata": [{"Location:": "Corcreeghagh, Co. Monaghan", "Teacher:": "\nSs. Ó Muireadhaigh\n"}, {"Collector": "Norah Cooney", "Gender": "female"}, {"Informant": "Bridie Lynch", "Gender": "female", "Address": "Lisnadarragh, Co. Monaghan"}, {"Language": "English"}]}, "4701704/4694366/4759822": {"title": "Tobar Rí-Mháile", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0170, Page 0381", "Page 0381"], "url": "https://www.duchas.ie/en/cbes/4701704/4694366/4759822", "text": "\nA man was ploughing on brink of the well (Tobar Rí-Mháile). He looked around him when one horse was failing, and saw another horse grazing in a field near by. \"I'll put this one in for a while of the day.\" He ploughed until dinner-time. He took his own horse home and fed him. He turned the other horse away. After dinner he began working again. They were working close to the spring well, the horse dashed into the well and dragged man, horse, plough etc into the well, never were seen since.\n", "school_info": "School: Cluaineach (C.)", "metadata": [{"Location:": "Coolrawer, Co. Sligo", "Teacher:": "\nBean Uí Chlaimhín\n"}, {"Collector": "Evelyn Mary Mc Nulty", "Gender": "female", "Address": "Cully, Co. Sligo"}, {"Informant": "Mr Luke Weever", "Gender": "male", "Age": "71", "Address": "Cully, Co. Sligo"}, {"Language": "English"}]}, "4701706/4694471/4761460": {"title": "Scéal", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0170, Page 0526", "Page 0526"], "url": "https://www.duchas.ie/en/cbes/4701706/4694471/4761460", "text": "\nBhí fear 'n- a chómhnuidhe i gCo. Shlighigh uair amhán. Bhí dhá bhó is mórán caorach aige. Bhí slataire ar bhuachaill do dhriotháir in éinfeacht leis. Maidin amháin d'éirigh sé amach, bhí ceó trom ar na cnuic, chonnaic sé na caora ag rith, agus dob ait leis é. Ceard a bhí ag cur sa t-siúl mar ní raibh an madra amuigh ná aon rud chun iad a cur sa t-siúl mar sin. Is gairid no gur bhuail an capall anoir chuige agus marcach in áirde air, agus caipin dearg an an marcach.Do chuir sin an iongantas air, ní nach ionghnadh. Is gairid no go dtáinig sé níos giorra dó, is cuaidh sé go dtí an tobar agus d'ól sé deoch uisge as, ansin bhailigh sé leis isteach san bhfairrge agus ní fhaca an fear aon radharc as sin amach air. Naoí seachtmhaine in a dhiaidh sin cailleadh an slataire dhriothár.\n", "school_info": "School: Curry (C.)", "metadata": [{"Location:": "Curry, Co. Sligo", "Teacher:": "\nBean Uí Chaomháin\n"}, {"Collector": "Máire S. Níc Dhuarcáin", "Gender": "female"}, {"Informant": "local name Mike Biddy ", "Gender": "male"}, {"Language": "Irish"}]}, "4723877/4721430/4780239": {"title": "A Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0961, Page 183", "Page 183"], "url": "https://www.duchas.ie/en/cbes/4723877/4721430/4780239", "text": "\nOnce upon a time there was a man who was a good player of a tin-flute. He would go out through the country and play at dances. When one night he was coming home very late a few fields from where he was he heard the sound of sweeet music. He went on his way and when he came to this field and it was full of fairies. Then the fairies ran up to him and each in turn asked him to dance. When one fairy would let him go the other would catch him. He would not refuse the fairies because he thought they would do something on him. They kept him dancing to morning. And as soon as daylight came they all disappeared. He was so tired he could hardly get home. And when he got home\n(continues on next page)\n", "school_info": "School: Cluain Cátha", "metadata": [{"Location:": "Cloncaw, Co. Monaghan", "Teacher:": "\nP. Ó Hanluain\n"}, {"Collector": "Anthony O' Brien", "Gender": "male"}, {"Informant": "Patrick O' Brien", "Relation": "unknown", "Gender": "male", "Address": "Emy, Co. Monaghan"}, {"Language": "English"}]}, "4798685/4790113/4927932": {"title": "Each Uisce or Water Horse", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0242, Page 228", "Page 228"], "url": "https://www.duchas.ie/en/cbes/4798685/4790113/4927932", "text": "\nThe old men of his young days used tell of a water horse in Lough [?] which is a quarter of a mile from this school. Many people asserted that they saw it. They also told the story of a man who captured the water horse by some means. He kept the animal for years. One day he brought him out to pasture on the shores of the lough. He took off the bridle and struck a blow at the animal. The horse reared and plunged and finally disappered into the middle of the lake never to come back.\n\n\n\nThe Ban Shee. Bean-sidhe. People in this district definitely believe in the bean sidhe. The Flanagan family of Carrowbehy and the Lowry family of the same townland are warned by her wailing.Lights are also to be seen in the bogs directly opposite the schoolhouse by other families for some time before the death of a relative. I have heard that the Harte family of Gorthagawny are warned in this manner.\n", "school_info": "School: Gort an Ghainimh", "metadata": [{"Location:": "Gortaganny, Co. Roscommon", "Teacher:": "\nM. Ó Cobhthaigh\n"}, {"Informant": "John Regan", "Gender": "male", "Address": "Errit, Co. Roscommon"}, {"Language": "English"}]}, "4928789/4800333/4928813": {"title": "Folk Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0268, Page 241", "Page 241"], "url": "https://www.duchas.ie/en/cbes/4928789/4800333/4928813", "text": "\nThere is a small lake in the village next to mine, called Lough William. Long ago a fairy horses lived in that lake, and every he came out to graze on its shores. One day a man named William \"Caught him, and kept him as his own. One day he brought him to a hunt, and on his return home he mounted a small hill which overlooked the lake.   The horse sniffed the air, and then he galloped towards the lake and plunged into its depths, and rider and horse disappeared for ever. But still people say that on bright moonlight nights the head of the fairy horse can be seen on the shining of the lake.   Told by Jim Leonard of Purts?, locally known as \"Big Jim\" to distinguish him from other man of the same name.Purts - A small village on the western bank of the river shannon about 4 miles S.W. of the town of Athlone\n", "school_info": "School: Féith Mhór", "metadata": [{"Location:": "Feamore, Co. Roscommon", "Teacher:": "\nNóra Bean Uí Shúilleabháin\n"}, {"Informant": "Jim Leonard", "Gender": "male", "Address": "Ports, Co. Roscommon"}, {"Language": "English"}]}, "4769997/4765184/4931273": {"title": "A Mill", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0826, Page 110", "Page 110"], "url": "https://www.duchas.ie/en/cbes/4769997/4765184/4931273", "text": "\nThere was a stream brought out of Bardtown river. It flows through Knocknagad and in to Northgrove. It worked a mill there. The shape of the mill stone to be seen 10 or 15 perches from this mill.Mr Fintan Lalor, North Grove,Mountrath sent this account of Mill\n\n\n\nOnce upon a time there was a man ploughing in Clonaslee. He had but one horse under his plough. There was a lake near by. A strange horse came out of this lake. The man yoked him with his own horse under the plough, and did the Spring's work. Then he went away and the man never heard tell of him afterwards. A TowerThere are the remains of a tower to be seen in a field of Major Hamilton's Roundwood. There is a cave to be seen in his lawn also.\n", "school_info": "School: Killanure, Mountrath", "metadata": [{"Location:": "Killinure, Co. Laois", "Teacher:": "\nC. Ní Dhubhlainn\n"}, {"Informant": "Mr Fintan Lalor", "Gender": "male", "Address": "Northgrove, Co. Laois"}, {"Language": "English"}]}, "4769997/4765184/4931274": {"title": "A Mill", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0826, Page 110", "Page 110"], "url": "https://www.duchas.ie/en/cbes/4769997/4765184/4931274", "text": "\nThere was a stream brought out of Bardtown river. It flows through Knocknagad and in to Northgrove. It worked a mill there. The shape of the mill stone to be seen 10 or 15 perches from this mill.Mr Fintan Lalor, North Grove,Mountrath sent this account of Mill\n\n\n\nOnce upon a time there was a man ploughing in Clonaslee. He had but one horse under his plough. There was a lake near by. A strange horse came out of this lake. The man yoked him with his own horse under the plough, and did the Spring's work. Then he went away and the man never heard tell of him afterwards. A TowerThere are the remains of a tower to be seen in a field of Major Hamilton's Roundwood. There is a cave to be seen in his lawn also.\n", "school_info": "School: Killanure, Mountrath", "metadata": [{"Location:": "Killinure, Co. Laois", "Teacher:": "\nC. Ní Dhubhlainn\n"}, {"Language": "English"}]}, "4758522/4751330/4956700": {"title": "The Water-Horse", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0851, Page 171", "Page 171"], "url": "https://www.duchas.ie/en/cbes/4758522/4751330/4956700", "text": "\nLong years ago there was a certain man in this locality who had a lot of cattle and one horse. Every evening he used to go to the river to water the horse and every evening that he went he saw a water-horse. One particular evening he went and when he was coming home the water-horse followed him. The man took the strange horse home and fed and reared him. About a year after he went to the river with the horse bringing the water-horse with him. When he reached the river the water horse jumped in and vanished.\n", "school_info": "School: Windgap (C.), Thomastown", "metadata": [{"Location:": "Windgap, Co. Kilkenny", "Teacher:": "\nBean Mhic Eóin\n"}, {"Collector": "Kathleen O' Neill", "Gender": "female"}, {"Informant": "Mrs O Shea", "Gender": "female"}, {"Language": "English"}]}, "4742068/4732328/5009673": {"title": "Strange Animals", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0959, Page 382", "Page 382"], "url": "https://www.duchas.ie/en/cbes/4742068/4732328/5009673", "text": "\nThere are not many stories connected with strange animals in this district. There is a story told of an eel in Cornacrieve lake it had 14 eyes this happened about 60 years ago.There are stories told of water horses in loughs and when they would see any one they would disappear. There is a story told of an animal like a man having a cloven foot like a beast and roared like a bull.On one occasion two men were going to the fair by Lough Doney one man took a rod out of the hedge & peeled it, he then went into the bull - rushes by the lake & he was able to drive two asses out of them and sell them in the fair.At Cloughnart a big black dog the size of a donkey rattling like a dog the first sight of these animals was a blaze.\n(continues on next page)\n", "school_info": "School: Corlatallon", "metadata": [{"Location:": "Corlattallan, Co. Monaghan", "Teacher:": "\nMrs Atkinson\n"}, {"Collector": "Agnes Wilkinson", "Gender": "female", "Address": "Emyvale, Co. Monaghan"}, {"Informant": "Miss C. Armour", "Gender": "female", "Age": "72", "Address": "Cloghnart, Co. Monaghan"}, {"Language": "English"}]}, "4811622/4803116/5019386": {"title": "Amhrán", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0280, Page 070", "Page 070"], "url": "https://www.duchas.ie/en/cbes/4811622/4803116/5019386", "text": "", "school_info": "School: Doire an Chairn", "metadata": [{"Location:": "Derreenacarrin, Co. Cork", "Teacher:": "\nNóra, Bean Uí Shéaghdha\n"}, {"Collector": "Síghle Ní Cruadhlaoich", "Gender": "female", "Address": "Leahill, Co. Cork"}, {"Informant": "Caitlín Bean Uí Cruadhlaoich", "Gender": "female", "Age": "41", "Address": "Leahill, Co. Cork"}, {"Language": "Irish"}]}, "4811622/4803117/5019394": {"title": "Amhrán", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0280, Page 071", "Page 071"], "url": "https://www.duchas.ie/en/cbes/4811622/4803117/5019394", "text": "\nDá mbeadh buachaillín deas ag SíghleNí phósfadh sí me mar fhearDo marbhóchfainn an breach sa dtuinnIs an coinin sa dúbhán cómh maithNí iarrfinn le capall nó caoireAirgead buidhe nó geal ach bfearr liom agam í mar mnaoí na inghean an rí mar bhean IINí bhfaigheadh aon lucht orm SíghleMuna mbhead an rapaire críona mam\n(continues on next page)\n", "school_info": "School: Doire an Chairn", "metadata": [{"Location:": "Derreenacarrin, Co. Cork", "Teacher:": "\nNóra, Bean Uí Shéaghdha\n"}, {"Collector": "Siobhán Ní Úardail", "Gender": "female", "Address": "Tooreennagrena, Co. Cork"}, {"Informant": "Míceál Ua Úardail", "Gender": "male", "Age": "53", "Address": "Tooreennagrena, Co. Cork"}, {"Language": "English"}]}, "4811622/4803119/5019396": {"title": "Amhrán", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0280, Page 073", "Page 073"], "url": "https://www.duchas.ie/en/cbes/4811622/4803119/5019396", "text": "", "school_info": "School: Doire an Chairn", "metadata": [{"Location:": "Derreenacarrin, Co. Cork", "Teacher:": "\nNóra, Bean Uí Shéaghdha\n"}, {"Collector": "Siobhán Ní Úardail", "Gender": "female", "Address": "Tooreennagrena, Co. Cork"}, {"Informant": "Siobhán Ní Úardail", "Relation": "parent", "Gender": "female", "Age": "45", "Address": "Tooreennagrena, Co. Cork"}, {"Language": "Irish"}]}, "4811622/4803174/5019598": {"title": "Seanscéal", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0280, Page 128", "Page 128"], "url": "https://www.duchas.ie/en/cbes/4811622/4803174/5019598", "text": "", "school_info": "School: Doire an Chairn", "metadata": [{"Location:": "Derreenacarrin, Co. Cork", "Teacher:": "\nNóra, Bean Uí Shéaghdha\n"}, {"Collector": "Máire Ní Cruadhlaoich", "Gender": "female", "Address": "Leahill, Co. Cork"}, {"Informant": "Míceál Ua Cruadhlaoich", "Relation": "parent", "Gender": "male", "Age": "46", "Address": "Leahill, Co. Cork"}, {"Language": "Irish"}]}, "4922327/4870461/5052121": {"title": "A Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0604, Page 018", "Page 018"], "url": "https://www.duchas.ie/en/cbes/4922327/4870461/5052121", "text": "\nOnce upon a time there lived a man near Gorloss Lake, in the parish of Kildysart. He was a farmer but was very poor and he had no horse to do his farm work. One day while he was digging in his garden he heard a great noise and on looking around he beheld a beautiful grey horse grazing in the headland. At first he was amazed but after a while he caught the horse. He put the horse to work and she proved to be very satisfactory. She reared a good many foals which the farmer sold at the local fairs. The foals fetched a very good price.One day while he was plouging with the horse, he was nearing the headland and the horse went out too far. The farmer cursed her. She stood up, shook herself and the tackling immediately fell off her. She made a plunge and she ran to the lake. She stood at the brink and neighed several times. The foals which were now in different parts of the country came to her and she disappeared into the lake with them. The poor man was again left without a horse at all because he would not control his tongue and stop cursing the fine horse which was so useful to him.\n", "school_info": "School: Ballynacally, Inis", "metadata": [{"Location:": "Ballynacally, Co. Clare", "Teacher:": "\nTomás Ó Cuinneagáin\n"}, {"Collector": "Frank Tuohy", "Gender": "male", "Address": "Inishmore or Deer Island, Co. Clare"}, {"Informant": "John Mc Carthy", "Gender": "male", "Address": "Cloonfurrihis, Co. Clare"}, {"Language": "English"}]}, "4922240/4863633/5054409": {"title": "Famous Horse - The Grey Gallant", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0562, Page 324", "Page 324"], "url": "https://www.duchas.ie/en/cbes/4922240/4863633/5054409", "text": "\nAbout two hundred years ago there lived in Lisnamrock Castle, Parish of Ballingarry Barony of Slievardagh, County Tipperary, a member of the Langley family nicknamed Cormac Ruadh. He was a direct descendant of Colonel Langley who got grants of lands in the Cromwellian Settlement of 1653.Cormac was a fearless horseman, kept a pack of deerhounds, and was noted for the splendid type of horse which he bred. There existed at this time in the County Waterford a deer that had baffled all pursuers. Packs outside the county pursued the deer with the same result.Hearing of this, Cormac Ruadh got ready and rode to Waterford, taking his pack with him.Arrived there he went in search of the deer.The chase started and held for hours. In the evening the deer headed for the Suir.On reaching the river it swam across.Langley dismounted, swam across with his horse\n(continues on next page)\n", "school_info": "School: Lios na mBroc", "metadata": [{"Location:": "Lisnamrock, Co. Tipperary", "Teacher:": "\nSéamus Ó Cinnéide\n"}, {"Collector": "(name not given)", "Occupation": "teacher"}, {"Informant": "John Connors", "Gender": "male", "Address": "Clashduff, Co. Tipperary"}, {"Language": "English"}]}, "4922331/4870920/5055647": {"title": "Rudaí go bhfuil Meas Orthu", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0605, Page 154", "Page 154"], "url": "https://www.duchas.ie/en/cbes/4922331/4870920/5055647", "text": "\nThe people had great love for the crosses of Saint Brigid. These are made a few days before the day. They are put on the rafters then, they are still to be seen in some houses. The people has great love for the old piggins and sythes. They are kept in a corner of the houses. When the people visit a holy well they bring home a bottle of water. Sick people drink it.\n\n\n\nAbout sixty years ago a man had his farm on the shore of Dairvgean Lake. His name was\n(continues on next page)\n", "school_info": "School: Island View, Cill an Dísirt", "metadata": [{"Location:": "Tonlegee, Co. Clare", "Teacher:": "\nMicheál Ó Cochláin\n"}, {"Language": "English"}]}, "4922344/4872147/5078541": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0608, Page 299", "Page 299"], "url": "https://www.duchas.ie/en/cbes/4922344/4872147/5078541", "text": "\nAR AN LEATHANACH SEO(gan teideal)“Cúl an Each (Cullinagh nó Cullinach) a part of the townland...”ScaipTvuítTá an mhír seo ar fáil le tras-scríobh ag duine ar bith atá sásta an obair a dhéanamh. Tras-scríobh féin é »TEANGABéarlaSUÍOMHCoill an tSonnaighTeachersScaipTvuít299 65Cúl an Each (Cullinagh no Cuillineach) a part of the townland of Kyletunna a lake between Kyletunna and Cuillinach (not there now only a marsh)horse seen occasionally in that lake in the evenings .According to John Mc Mahon of Kyletunna (an old man very good at Irish and Folk lore )Mr Kinnane's grandfather saw that horse as also Matty Hehir's mother .According to mary Cleary another old woman the horse had no head.\"Capall gan ceann\"\n\n\n\n299                   65Cúl an Each (Cullinagh no Cuillineach) a part of the townland of Kyletunna a lake between Kyletunna and Cuillinach (not there now only a marsh)horse seen occasionally in that lake in the evenings .According to John Mc Mahon of Kyletunna (an old man very good at Irish and Folk lore )Mr Kinnane's grandfather saw that horse as also Matty Hehir's mother .According to mary Cleary another old woman the horse had no head.\"Capall gan ceann\"                 42 Teachers  Pat CroweJames CroweMarty HayesJ O'Donoghue and M. MurphyMichael Clune                  41Father Lynch a native of Kilmaley built the present chapel over 1000 years ago.His curate was Fr.Frawley\n\n\n\n42  TeachersPat Crowe.James Crowe.Marty Hayes.J O'Donoghue and M Murphy.Michael Clune.            41Father Lynch a native of Kilmaley,built the present chapel over100 years ago.His curate was Fr Frawley\n(continues on next page)\n", "school_info": "School: Cill Mháille (C.), Inis", "metadata": [{"Location:": "Kilmaley, Co. Clare", "Teacher:": "\nNóra Ní Asaoid\n"}, {"Language": "English"}, {"Location": "Kyleatunna"}]}, "4922344/4872147/5078542": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0608, Page 299", "Page 299"], "url": "https://www.duchas.ie/en/cbes/4922344/4872147/5078542", "text": "\nAR AN LEATHANACH SEO(gan teideal)“Cúl an Each (Cullinagh nó Cullinach) a part of the townland...”ScaipTvuítTá an mhír seo ar fáil le tras-scríobh ag duine ar bith atá sásta an obair a dhéanamh. Tras-scríobh féin é »TEANGABéarlaSUÍOMHCoill an tSonnaighTeachersScaipTvuít299 65Cúl an Each (Cullinagh no Cuillineach) a part of the townland of Kyletunna a lake between Kyletunna and Cuillinach (not there now only a marsh)horse seen occasionally in that lake in the evenings .According to John Mc Mahon of Kyletunna (an old man very good at Irish and Folk lore )Mr Kinnane's grandfather saw that horse as also Matty Hehir's mother .According to mary Cleary another old woman the horse had no head.\"Capall gan ceann\"\n\n\n\n299                   65Cúl an Each (Cullinagh no Cuillineach) a part of the townland of Kyletunna a lake between Kyletunna and Cuillinach (not there now only a marsh)horse seen occasionally in that lake in the evenings .According to John Mc Mahon of Kyletunna (an old man very good at Irish and Folk lore )Mr Kinnane's grandfather saw that horse as also Matty Hehir's mother .According to mary Cleary another old woman the horse had no head.\"Capall gan ceann\"                 42 Teachers  Pat CroweJames CroweMarty HayesJ O'Donoghue and M. MurphyMichael Clune                  41Father Lynch a native of Kilmaley built the present chapel over 1000 years ago.His curate was Fr.Frawley\n\n\n\n42  TeachersPat Crowe.James Crowe.Marty Hayes.J O'Donoghue and M Murphy.Michael Clune.            41Father Lynch a native of Kilmaley,built the present chapel over100 years ago.His curate was Fr Frawley\n(continues on next page)\n", "school_info": "School: Cill Mháille (C.), Inis", "metadata": [{"Location:": "Kilmaley, Co. Clare", "Teacher:": "\nNóra Ní Asaoid\n"}, {"Language": "English"}]}, "5079720/4878780/5079773": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0629, Page 015", "Page 015"], "url": "https://www.duchas.ie/en/cbes/5079720/4878780/5079773", "text": "\nThere is an old story attached to Knockerra Lake. It occurred this way. A man who was living in Knockerra by the name of Mahoney had a garden of corn near the lake and every morning when he got up he found the corn eaten and trampled on.Mahoney watched the garden one night and he saw seven horses come up out of the lake and they started galloping around the corn. He took a lump of earth and struck one of the horses and immediately it stood but the other six horses disappeared into the lake. He caught the horse that stood and bred her and she had seven foals which Mahoney sold and made a great deal of money of them. He worked the horse also and one day when he was ploughing the horse was not going right and he cursed it and immediately it shook off the harness and galloped towards the lake and when it reached its brink it neighed seven times and the seven foals came back and they all disappeared into the lake and were never seen again.\n", "school_info": "School: Knockerra (B.) Killimer", "metadata": [{"Location:": "Knockerra, Co. Clare", "Teacher:": "\nMícheál Ó Cuinneagáin\n"}, {"Collector": "Martin Walsh", "Gender": "male"}, {"Language": "English"}]}, "5044795/5039094/5082809": {"title": "An Old Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0966, Page 136", "Page 136"], "url": "https://www.duchas.ie/en/cbes/5044795/5039094/5082809", "text": "\nAn old story.In Glangevlin there was once a poor man whose only horse died.  He was in very poor circumstances and needed a horse very badly.  There was a small lake adjoining his land and for two or three mornings he noticed a young horse grazing close to the shore of the lake.  He did not interfere with the horse for several days as he thought that perhaps he belonged to some of the neighbours.After some time when no one claimed the animal he decided to use him for his own work.  The horse was quite tame and proved a great worker. Each day he worked hard and in the evening the man let him out to graze along the lake.One evening when the man\n(continues on next page)\n", "school_info": "School: Alt an Chuilinn", "metadata": [{"Location:": "Altachullion, Co. Cavan", "Teacher:": "\nBrigid Martin\n"}, {"Language": "English"}, {"Location": "Glangevlin"}]}, "4922386/4876503/5082815": {"title": "Fairy Horse", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0622, Page 211", "Page 211"], "url": "https://www.duchas.ie/en/cbes/4922386/4876503/5082815", "text": "\nThere was a man here long ago. He lived in Kilmaley and his house and land were near a lake. Each night before going to a neighbour's house, he went to the field for his horse to stable it.One night he forgot to do so. On his return from his visit, he went to where the horse usually grazed. It was rather dark and coming to a horse, he caught it and mounted. Thinking the horse was his, he directed it to his own house. He failed to do so. The horse galloped towards the lake and were it not for the agility of the rider in alighting in time, he would have been carried under the water where the horse plunged.When he reach his home, he found that his own horse was in the stable, having been brought there by another member of the household. The enchanted horse was often seen by others in the same field.\n", "school_info": "School: Dunsallagh, Sráid na Cathrach", "metadata": [{"Location:": "Doonsallagh, Co. Clare", "Teacher:": "\nPatrick Walsh\n"}, {"Collector": "Anthony Kennelly", "Gender": "male", "Address": "Doonsallagh West, Co. Clare"}, {"Informant": "John Kennelly", "Gender": "male", "Address": "Doonsallagh West, Co. Clare"}, {"Language": "English"}]}, "5044792/5038650/5084173": {"title": "Strange Animals", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0965, Page 095", "Page 095"], "url": "https://www.duchas.ie/en/cbes/5044792/5038650/5084173", "text": "\nThere is a lake situated at the foot of Derrynananta rock. Some time ago there were a number of sheep drowned in it and a number of men went to drain it. When they started to drain it a wild horse jumped out of the lake out on the bank. The men ran away with fear of him and they did not look back to see what sort he was they were that much afraid of him but he did not follow them. It is supposed that he is guarding a treasure in the lake. There is a story told of a fairy cow met by a woman at night on the mountain. The woman was crossing the mountain at night and she went astray. She had a child with her and the child began to cry with hunger and she had no milk to give it. This cow appeared in front of her and the cow had a great deal of milk. She milked the cow and she gave the milk to the child and the cow disappeared at once.\n", "school_info": "School: Derrynananta", "metadata": [{"Location:": "Derrynananta Lower, Co. Cavan", "Teacher:": "\nMrs O' Regan\n"}, {"Collector": "Susan Dolan", "Gender": "female", "Address": "Corracleigh, Co. Cavan"}, {"Informant": "Bernard Mc Grath", "Gender": "male", "Age": "60", "Address": "Derrynananta Lower, Co. Cavan"}, {"Language": "English"}]}, "5044794/5038946/5085454": {"title": "Scéal", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0965, Page 390", "Page 390"], "url": "https://www.duchas.ie/en/cbes/5044794/5038946/5085454", "text": "\nThere is a water horse in Carrick lake. A man living in that district once got a foal off him. When this foal grew big the man went a long journey on this horse. When he came back he took off the saddle and brought the horse by the bridle out into a field. He then took off the bridle and hit the horse with it to drive over to the long grass. As soon as he hit him the animal disappeared into the lake and was never seen again. Old people say that he is guarding a pot of gold that is in the lake and they also say it is not right to a hit a horse with a bridle.\n", "school_info": "School: Corrabha (Curravagh)", "metadata": [{"Location:": "Curraghvah, Co. Cavan", "Teacher:": "\nname not given\n"}, {"Collector": "Brighid Ní Shiordan", "Gender": "female", "Address": "Carrick West, Co. Cavan"}, {"Informant": "Mr James Flynn", "Gender": "male", "Address": "Moneenterriff, Co. Cavan"}, {"Language": "English"}]}, "5044794/5038947/5085464": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0965, Page 391", "Page 391"], "url": "https://www.duchas.ie/en/cbes/5044794/5038947/5085464", "text": "\nTá capall i bpoll an t-Sionnaigh agus connacthas go minic é. Bhí rian a chos le feiceál san sneachta nuair nach raibh sé féin le feicsint - cosa beaga ar nos searraigh. Tá an capall seo a' chosaint pota óir freisin agus ní bhíonn sé le feiceál ach go hanamh. Deirtear gurab iad na Lochlannaigh a d'fhág an tór in a ndiaidh in Éirinn nuair a bhí siad a' teicheadh o' na h-Éireannaigh. Deirtear freisin go bhfuil pota óir in gach loch in Éirinn.Fuaireas an méid sin ó - Padraig Mac Samhráin,An Charraig,Gleann - Gaibhleann,Co. An Chabháin.\n\n\n\nThere is supposed to be three stands of gold on the banks of the Shannon at a place called \"Poll Cam\". Once upon a time an old man named Hughie McGovern dreamt of it three nights in succession and in the dream he was told the same time when to go and the people he was to take with him. He was to take with him. He was to get the gold on condition that neither he nor any of his comrades would take God's name\n(continues on next page)\n", "school_info": "School: Corrabha (Curravagh)", "metadata": [{"Location:": "Curraghvah, Co. Cavan", "Teacher:": "\nname not given\n"}, {"Collector": "Brighid Ní Shiordan", "Gender": "female", "Address": "Carrick West, Co. Cavan"}, {"Informant": "Padraig Mac Samhráin", "Gender": "male", "Address": "Carrick West, Co. Cavan"}, {"Language": "Irish"}]}, "5044794/5038947/5085480": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0965, Page 391", "Page 391"], "url": "https://www.duchas.ie/en/cbes/5044794/5038947/5085480", "text": "\nTá capall i bpoll an t-Sionnaigh agus connacthas go minic é. Bhí rian a chos le feiceál san sneachta nuair nach raibh sé féin le feicsint - cosa beaga ar nos searraigh. Tá an capall seo a' chosaint pota óir freisin agus ní bhíonn sé le feiceál ach go hanamh. Deirtear gurab iad na Lochlannaigh a d'fhág an tór in a ndiaidh in Éirinn nuair a bhí siad a' teicheadh o' na h-Éireannaigh. Deirtear freisin go bhfuil pota óir in gach loch in Éirinn.Fuaireas an méid sin ó - Padraig Mac Samhráin,An Charraig,Gleann - Gaibhleann,Co. An Chabháin.\n\n\n\nThere is supposed to be three stands of gold on the banks of the Shannon at a place called \"Poll Cam\". Once upon a time an old man named Hughie McGovern dreamt of it three nights in succession and in the dream he was told the same time when to go and the people he was to take with him. He was to take with him. He was to get the gold on condition that neither he nor any of his comrades would take God's name\n(continues on next page)\n", "school_info": "School: Corrabha (Curravagh)", "metadata": [{"Location:": "Curraghvah, Co. Cavan", "Teacher:": "\nname not given\n"}, {"Collector": "Brighid Ní Shiordan", "Gender": "female", "Address": "Carrick West, Co. Cavan"}, {"Informant": "Myles Kerrigan", "Gender": "male", "Address": "Corleckagh Upper, Co. Cavan"}, {"Language": "English"}]}, "5044848/5043981/5086844": {"title": "Old Stories", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0981, Page 044", "Page 044"], "url": "https://www.duchas.ie/en/cbes/5044848/5043981/5086844", "text": "\n(continued from previous page)\nLoc a Corra.Another day James Smith went down to some field beside Loc a Corra .  He found a nice pony feeding on the field.  He caught hold of her and brought her up to the barn.  He put her and gave hay.  After some time he went back to the barn to look at her.  And he found she had turned into a beautiful girl.  When he opened the door the girl sprang out and she ran down and into Loc a Corra.\n\n\n\nThis story was told to me by John Cooney Termon. Tom Traynor was his great father. He and his wife were coming home from the town, riding on two horses, they were passing Curraha lake when they were passing the heard a horse neghing then the saw a white horse coming out of the lake and then he came out on the road and tried to bring Tom Traynor's horse into the lake.\n(continues on next page)\n", "school_info": "School: Derryham", "metadata": [{"Location:": "Derryhum, Co. Cavan", "Teacher:": "\nA. Ó Máirtín\n"}, {"Informant": "John Cooney", "Gender": "male", "Address": "Termon, Co. Cavan"}, {"Language": "English"}]}, "5044848/5043982/5086860": {"title": "Old Stories", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0981, Page 045", "Page 045"], "url": "https://www.duchas.ie/en/cbes/5044848/5043982/5086860", "text": "\n(continued from previous page)\nand when he would not go he knocked his wife and ran back into lake\n\n\n\nThis story was told by Terrence McCabe Waterloo. One Moon Light Night in the harvest time a man saw a white horse in the harvest field that came up out of the late and this man had no horse and he brought home the horse with him and he kept the horse for a long time with him until one day he went in riding the horse to Bailieborough and they past the lake that the horse came up out of and when they were passing the lake the horse jumped into the lake and only the man got jumping off the horse he would have brought him into the late on his back. The horse never came up out of the lake since. The name of the lake is Loch a Curra.\n", "school_info": "School: Derryham", "metadata": [{"Location:": "Derryhum, Co. Cavan", "Teacher:": "\nA. Ó Máirtín\n"}, {"Informant": "Terence Mc Cabe", "Gender": "male", "Address": "Waterloo, Co. Cavan"}, {"Language": "English"}]}, "5044848/5043983/5086869": {"title": "Old Stories", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0981, Page 046", "Page 046"], "url": "https://www.duchas.ie/en/cbes/5044848/5043983/5086869", "text": "\nA man lived in the townland of Moylett named Pat Brady. He was going to the shop one Sunday morning for something. He was barefooted. And he saw two lovely cows feeding on Watson's field. When he was coming back the cows were gone. Afeter that they were seen by James Smith, going into the lake. James Smith also saw a lovely young girl going down into the lake with a pale in her hand. She was after milking the cows.\n\n\n\nThere was a lovely horse seen by Eoghan Reilly he lived in the townland of Moilett and in the parish of Killinkere. He was a chestnut horse. Eoghan watched the horse and he began to run from one end of the lake to the other. Then a man came along with a dog. The dog began to run after the horse. The horse jumped into the lake and the dog\n(continues on next page)\n", "school_info": "School: Derryham", "metadata": [{"Location:": "Derryhum, Co. Cavan", "Teacher:": "\nA. Ó Máirtín\n"}, {"Informant": "Thomas Lynch", "Gender": "male", "Address": "Moylett, Co. Cavan"}, {"Language": "English"}]}, "5044848/5043983/5086883": {"title": "Old Stories", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0981, Page 046", "Page 046"], "url": "https://www.duchas.ie/en/cbes/5044848/5043983/5086883", "text": "\nA man lived in the townland of Moylett named Pat Brady. He was going to the shop one Sunday morning for something. He was barefooted. And he saw two lovely cows feeding on Watson's field. When he was coming back the cows were gone. Afeter that they were seen by James Smith, going into the lake. James Smith also saw a lovely young girl going down into the lake with a pale in her hand. She was after milking the cows.\n\n\n\nThere was a lovely horse seen by Eoghan Reilly he lived in the townland of Moilett and in the parish of Killinkere. He was a chestnut horse. Eoghan watched the horse and he began to run from one end of the lake to the other. Then a man came along with a dog. The dog began to run after the horse. The horse jumped into the lake and the dog\n(continues on next page)\n", "school_info": "School: Derryham", "metadata": [{"Location:": "Derryhum, Co. Cavan", "Teacher:": "\nA. Ó Máirtín\n"}, {"Informant": "Thomas Lynch", "Gender": "male", "Address": "Moylett, Co. Cavan"}, {"Language": "English"}]}, "5044848/5043984/5086888": {"title": "Old Stories", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0981, Page 047", "Page 047"], "url": "https://www.duchas.ie/en/cbes/5044848/5043984/5086888", "text": "\n(continued from previous page)\nafter him. When the horse was going down into the lake he turned into a man. He caught the dog and brought him down into the lake with him. It was said that man was a man that drowned himself at that place.\n\n\n\nThere lived an old man beside Quilca lake in the Parish of Mullagh. He had a big farm of land. And all his stock died on him. One morning when he arose he went out and found a wet calf on the street.He advertised the calf and could get no owner. He kept it on and made a little house for it. It became a beautiful cow. She reared seven cows for him. He called the mother cow Grannie. After her doing him all this good. He thought it better to sell\n(continues on next page)\n", "school_info": "School: Derryham", "metadata": [{"Location:": "Derryhum, Co. Cavan", "Teacher:": "\nA. Ó Máirtín\n"}, {"Informant": "Peter Halton", "Gender": "male", "Address": "Coolnacola, Co. Cavan"}, {"Language": "English"}]}, "5044848/5043986/5086917": {"title": "Old Stories", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0981, Page 049", "Page 049"], "url": "https://www.duchas.ie/en/cbes/5044848/5043986/5086917", "text": "\n(continued from previous page)\ncoming out of cornitanure lake. He then set traps for them and caught five of. Otters are big wild dogs that come on the land to steal ducks and bring them into the lake to eat.\n\n\n\nThis story was told by Bartle Mallon Aughnahee.There was a man named Brady that lived beside Gallon Corra. One morning he went out and there was a mare and a foal feeding on a field. He brought home the foal and reared it. When it was full-grown he trained. He worked it for some years. One day he was giving it a drink and it went into the lake and neither the man or the horse were ever saw again\n\n\n\nThis story was told to me by Paddy Flood. he told me that one time he was digging potatoes in a field beside Jackie's lake And there was an inch of ice on the lake and a black\n(continues on next page)\n", "school_info": "School: Derryham", "metadata": [{"Location:": "Derryhum, Co. Cavan", "Teacher:": "\nA. Ó Máirtín\n"}, {"Informant": "Bartle Mallon", "Gender": "male", "Address": "Aghakee, Co. Cavan"}, {"Language": "English"}]}, "5044848/5043986/5086923": {"title": "Old Stories", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0981, Page 049", "Page 049"], "url": "https://www.duchas.ie/en/cbes/5044848/5043986/5086923", "text": "\n(continued from previous page)\ncoming out of cornitanure lake. He then set traps for them and caught five of. Otters are big wild dogs that come on the land to steal ducks and bring them into the lake to eat.\n\n\n\nThis story was told by Bartle Mallon Aughnahee.There was a man named Brady that lived beside Gallon Corra. One morning he went out and there was a mare and a foal feeding on a field. He brought home the foal and reared it. When it was full-grown he trained. He worked it for some years. One day he was giving it a drink and it went into the lake and neither the man or the horse were ever saw again\n\n\n\nThis story was told to me by Paddy Flood. he told me that one time he was digging potatoes in a field beside Jackie's lake And there was an inch of ice on the lake and a black\n(continues on next page)\n", "school_info": "School: Derryham", "metadata": [{"Location:": "Derryhum, Co. Cavan", "Teacher:": "\nA. Ó Máirtín\n"}, {"Informant": "Paddy Flood", "Gender": "male"}, {"Language": "English"}]}, "5044848/5043987/5086926": {"title": "Old Stories", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0981, Page 050", "Page 050"], "url": "https://www.duchas.ie/en/cbes/5044848/5043987/5086926", "text": "\n(continued from previous page)\ndog with a white neck came up from the bottom of lake and broke the ice and came out and went back in again. He could see him running under the ice for half an hour or more.\n\n\n\nOwn Reilly late of Moylet used to be fishing every fishing season.  One evening he set pike lines and Owney went to the lake the next morning and he tried to pull in and he could not and he thought that it was a block that was caught in it and he took off his clothes and he went into the lake and he tried to pull and he was gaining and after a while he saw a horse's head and he got a fright and from that day untill he died he never went back to the lake again.\n\n\n\nOnce upon a time there was a horse feeding at the\n(continues on next page)\n", "school_info": "School: Derryham", "metadata": [{"Location:": "Derryhum, Co. Cavan", "Teacher:": "\nA. Ó Máirtín\n"}, {"Informant": "Tom Clarke", "Gender": "male", "Address": "Derryhum, Co. Cavan"}, {"Language": "English"}]}, "5044848/5043987/5086949": {"title": "Old Stories", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0981, Page 050", "Page 050"], "url": "https://www.duchas.ie/en/cbes/5044848/5043987/5086949", "text": "\n(continued from previous page)\ndog with a white neck came up from the bottom of lake and broke the ice and came out and went back in again. He could see him running under the ice for half an hour or more.\n\n\n\nOwn Reilly late of Moylet used to be fishing every fishing season.  One evening he set pike lines and Owney went to the lake the next morning and he tried to pull in and he could not and he thought that it was a block that was caught in it and he took off his clothes and he went into the lake and he tried to pull and he was gaining and after a while he saw a horse's head and he got a fright and from that day untill he died he never went back to the lake again.\n\n\n\nOnce upon a time there was a horse feeding at the\n(continues on next page)\n", "school_info": "School: Derryham", "metadata": [{"Location:": "Derryhum, Co. Cavan", "Teacher:": "\nA. Ó Máirtín\n"}, {"Informant": "Edward Mc Cabe", "Gender": "male", "Address": "Derryhum, Co. Cavan"}, {"Language": "English"}]}, "5044848/5043988/5086952": {"title": "Old Stories", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0981, Page 051", "Page 051"], "url": "https://www.duchas.ie/en/cbes/5044848/5043988/5086952", "text": "\n(continued from previous page)\nside of Lacken lake. And he saw two other horses coming up out of the lake. and he jumped in to the lake. And the owner was looking at his own horse swimming down into Lacken lake.\n\n\n\nThis story was told to me by Patrick Carroll Moylett. One night Jimmie Plunket was going put for the pony. And he could not find her. But as he was looking for her he taught that he heard her feeding. And he called her. And a big white animal came up to him and Jimmie caught him and taught that it was the pony. And the animal broke away and went down and into the lake. And he went into the house to tell them. And Tom came out and began to look for the pony and they got her feeding beside the lake. And Jimmie never went out late for a long time after.\n", "school_info": "School: Derryham", "metadata": [{"Location:": "Derryhum, Co. Cavan", "Teacher:": "\nA. Ó Máirtín\n"}, {"Informant": "Patrick Carroll", "Gender": "male", "Address": "Moylett, Co. Cavan"}, {"Language": "English"}]}, "5044848/5043989/5086958": {"title": "Old Stories", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0981, Page 052", "Page 052"], "url": "https://www.duchas.ie/en/cbes/5044848/5043989/5086958", "text": "\nLong ago there was a woman and she was herding cows in a field near a lake called Lough Sturragh. A horse came up out of the lake and was feeding with the cows. The woman thought that it was one of the neighbours horses and when she was bringing home the cows the horse made a snap at her coat and brought a piece of it in his mouth and ran down and went into the lake again. He was seen often out after feeding on the grass.\n\n\n\n52This story was told to me by Patrick Cooney of Carrickacromin. Long ago there was a woman and she was herding cows in a field near a lake called Lough Sturragh. A horse came up out of the lake and was feeding with the cows. The woman thought that it was one of the neighbours horses and when she was bringing home the cows the horse made a snap at her coat and brought a piece of it in his mouth and ran down and went into the lake again. He was seen often out after feeding on the grass.This story was told to me by Patrick Cooney of Carrickacromin also. Some time ago there was a house beside a lake and the woman of the house went out one evening to the field to milk the cows and there was a strange cow feeding with the other cows. The strange cow had a big udder and the woman milked her and she stayed there for some years\n(continues on next page)\n", "school_info": "School: Derryham", "metadata": [{"Location:": "Derryhum, Co. Cavan", "Teacher:": "\nA. Ó Máirtín\n"}, {"Informant": "Patrick Cooney", "Gender": "male", "Address": "Carrickacroman, Co. Cavan"}, {"Language": "English"}]}, "5044848/5043989/5086981": {"title": "Old Stories", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0981, Page 052", "Page 052"], "url": "https://www.duchas.ie/en/cbes/5044848/5043989/5086981", "text": "\nLong ago there was a woman and she was herding cows in a field near a lake called Lough Sturragh. A horse came up out of the lake and was feeding with the cows. The woman thought that it was one of the neighbours horses and when she was bringing home the cows the horse made a snap at her coat and brought a piece of it in his mouth and ran down and went into the lake again. He was seen often out after feeding on the grass.\n\n\n\n52This story was told to me by Patrick Cooney of Carrickacromin. Long ago there was a woman and she was herding cows in a field near a lake called Lough Sturragh. A horse came up out of the lake and was feeding with the cows. The woman thought that it was one of the neighbours horses and when she was bringing home the cows the horse made a snap at her coat and brought a piece of it in his mouth and ran down and went into the lake again. He was seen often out after feeding on the grass.This story was told to me by Patrick Cooney of Carrickacromin also. Some time ago there was a house beside a lake and the woman of the house went out one evening to the field to milk the cows and there was a strange cow feeding with the other cows. The strange cow had a big udder and the woman milked her and she stayed there for some years\n(continues on next page)\n", "school_info": "School: Derryham", "metadata": [{"Location:": "Derryhum, Co. Cavan", "Teacher:": "\nA. Ó Máirtín\n"}, {"Informant": "Patrick Cooney", "Gender": "male", "Address": "Carrickacroman, Co. Cavan"}, {"Language": "English"}]}, "5044848/5043990/5087007": {"title": "Old Stories", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0981, Page 053", "Page 053"], "url": "https://www.duchas.ie/en/cbes/5044848/5043990/5087007", "text": "\n(continued from previous page)\nand one day when the woman was milking her the cow gave a kick. The woman got vexed and she hit the cow with the gallon and the cow put her tail on her back and ran down and into the lake and she was never saw after.\n\n\n\nOne time long ago there was a little house beside a lake. One day when the man of the house was working in the field, he saw a big cow coming out of the lake and she went up around the house and stayed there for a few weeks and in a couple of days after she came out of the lake she calved and the man of the house brought her in and milked her and fed the calf and kept her there for some time and when he let the cow and calf out he went out to milk her in the evening and she started to kick and spilled the milk and the man stopped milking her and in a couple of hours he saw the cow and calf going\n(continues on next page)\n", "school_info": "School: Derryham", "metadata": [{"Location:": "Derryhum, Co. Cavan", "Teacher:": "\nA. Ó Máirtín\n"}, {"Informant": "Patrick Cooney", "Gender": "male", "Address": "Carrickacroman, Co. Cavan"}, {"Language": "English"}]}, "5044828/5042365/5087530": {"title": "A Tailor", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0976, Page 068", "Page 068"], "url": "https://www.duchas.ie/en/cbes/5044828/5042365/5087530", "text": "\n(continued from previous page)\nHackelty, lived the last of our country tailors.His name was Barney Keilleagher, he died fourteen or fifteen years ago. He usually kept two journey men tailors. I heard my Uncle say he remembers Barney to come to his house to make his first suit of boy's cloths. In good weather he took his work out to the garden. In winter time they would work till ten o clock by the light of two candles. They would have their supper of oat-meal-porridge. Before going home if their work was not completed they would return next morning about ten o clock.\n\n\n\nAbout twenty or thirty years ago a monster was seen in Annagh Lough by a couple. It was a big white horse that arose up out of the bottom of the lake and swam on the water for about twenty or thirty minutes and then went back down to the bottom of the lake again. At that time the scholars from Kilnalack school went out in a boat sailing when they got out at play-time. One day one of the boys were drowned in the lake. People said the water-horse foretold that somebody would be drowned.\n", "school_info": "School: Coill na Leac", "metadata": [{"Location:": "Kilnaleck, Co. Cavan", "Teacher:": "\nP. Mac Geibheannaigh\n"}, {"Collector": "Mary Masterson", "Gender": "female", "Address": "Inishbeg, Co. Cavan"}, {"Language": "English"}]}, "5070789/5063833/5095925": {"title": "Leprechauns and Mermaids", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1000, Page 300", "Page 300"], "url": "https://www.duchas.ie/en/cbes/5070789/5063833/5095925", "text": "\n(continued from previous page)\n300is seen at sunset it is a sign that a drowning is going to occur.Lock Sileann is frequently inhabited by a Mermaid. Patrick Carolan. Cornaslieve, Virginia.Patrick Corolan. Cornasleieve, Virginia.It is said that long ago a snow white horse was seen grazing one night on the edge of Mullagh lake. If anyone went near that horse it would disappear into the lake. Breedan Mooney. Ballaghanea, VirginiaCharlie Mooney. Ballaghanea, VirginiaSome time ago people heard beautiful music and singing some place around\n\n\n\nIt is said that long ago a snow white horse was seen grazing one night on the edge of Mullagh lake. If anyone went near that horse it would disappear into the lake.\n\n\n\nSome time ago people heard beautiful music and singing some place around\n(continues on next page)\n", "school_info": "School: Virginia (B)", "metadata": [{"Location:": "Virginia, Co. Cavan", "Teacher:": "\nE. O' Reilly\n"}, {"Collector": "Brendan Mooney", "Gender": "male", "Address": "Ballaghanea, Co. Cavan"}, {"Informant": "Charlie Mooney", "Gender": "male", "Address": "Ballaghanea, Co. Cavan"}, {"Language": "English"}]}, "5070813/5066557/5097828": {"title": "The Enchanted Horse of Ballyhoe Lake", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1008, Page 105", "Page 105"], "url": "https://www.duchas.ie/en/cbes/5070813/5066557/5097828", "text": "\nIt is said that, about sixty years ago, a man and foal used to come up out of Ballyhoe Lake, Co. Meath, to graze on the adjoining meadow.This went on for a long time until, one evening, a labouring man, coming home from his work saw them. Not knowing who owned them, he went and caught the foal. As he was going home with the foal, he met a wealthy farmer, who asked to buy him, so he agreed. One evening, the man who bought the foal was out hunting. When he came home, it was late and the horse was tired. As he went to put him in the stable, he gave him a crack of the whip. The horse disappeared and was never seen again.\n", "school_info": "School: Cabra, Kingscourt", "metadata": [{"Location:": "Cabra, Co. Cavan", "Teacher:": "\nViolet Irwin\n"}, {"Collector": "Winnie Shekleton", "Gender": "female"}, {"Language": "English"}]}, "5070810/5066440/5098356": {"title": "Strange Animals", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1007, Page 300", "Page 300"], "url": "https://www.duchas.ie/en/cbes/5070810/5066440/5098356", "text": "\nWild Water Animals.A long time ago there was a student in college and he became a priest and had a parish in America. Before he became a priest he came home and one dark night he was in a field near Tierworker Lough and he saw over twenty horses in the field near to Tierworker Lough and he saw them galloping. He ran after them and chased them for a long piece of the field and suddenly the horses disappeared out of his sight whether they went into the lake it is not known, and from that time onward it remains a mystery. It is known about fifty years ago that there were wild animals seen on Ervy lake fighting and there were lights seen on them in the middle of the night.\n", "school_info": "School: Edenagully", "metadata": [{"Location:": "Edennagully, Co. Cavan", "Teacher:": "\nS. Ó Cléirigh, C. Ó Baoighealláin\n"}, {"Language": "English"}]}, "5070798/5064951/5099821": {"title": "Mullach Lake", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1003, Page 328", "Page 328"], "url": "https://www.duchas.ie/en/cbes/5070798/5064951/5099821", "text": "\nA dull sound as of oars straining at the row-locks, is at certain times heard by people standing on the lake shore. It has been said it was caused by a ghostly boatman crossing the lake but it is more probably only what Mr Yates (Yeats) describes as \"lake-water lapping.\"A strange  story, believed in by many older people here, is that a young girl named Smyth lived close to the lake  was carried off by the Fairy Folk at the bottom of the water where she was detained for several years.(See story written by a girl from this school)After three years she made her escape, as described by a Fourth Standard boy from Crossreagh School. (See P. 2 from end)One of the castles of O'Reilly  chief of Breffni was built on the North shore of the lake.The place is still known as  \"The Gates\" (?)There is a legend of Fairy horses having appeared on the lake shore.(See story at end of this book)\n", "school_info": "School: Cros Riabhach", "metadata": [{"Location:": "Crossreagh, Co. Cavan", "Teacher:": "\nT. Ó Siordáin\n"}, {"Language": "English"}]}, "5070847/5069976/5099876": {"title": "A Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1022, Page 431", "Page 431"], "url": "https://www.duchas.ie/en/cbes/5070847/5069976/5099876", "text": "", "school_info": "School: Drong (2)", "metadata": [{"Location:": "Drung, Co. Cavan", "Teacher:": "\nBean Uí Fháinín\n"}, {"Collector": "May Hudson", "Gender": "female", "Address": "Rakenny, Co. Cavan"}, {"Language": "English"}]}, "5070798/5065028/5100290": {"title": "Fairy Horses of the Lake", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1003, Page 405", "Page 405"], "url": "https://www.duchas.ie/en/cbes/5070798/5065028/5100290", "text": "\n(Fairy horses of the Lake)Beautiful and very swift horses have been seen, it is said, on the shores of Mullagh lake. One time some of the O Reilly's people whose castle stood on the bank now called \"Hell Side\", saw five lovely horses grazing quietly near the water's edge.Stealing up very quietly a boy caught one by the long mane and held him while the others dived into the lake and disappeared.The boy brought the horse home to the O Reilly's stables but they were careful never to let him down to the lake with the other animals.     However, one day a new groom did bring him to the lake for a drink and the fairy steed dashed into the water and went home to the fairy stables at the bottom, the cleansing of which at certain periods, causes a muddy scum to float upwards and spoil the usual clearness of the water.Told by May Reilly      Cloughbally Lower           Mullagh\n", "school_info": "School: Cros Riabhach", "metadata": [{"Location:": "Crossreagh, Co. Cavan", "Teacher:": "\nT. Ó Siordáin\n"}, {"Informant": "May Reilly", "Gender": "female", "Address": "Cloghbally Lower, Co. Cavan"}, {"Language": "English"}]}, "5070798/5065058/5101054": {"title": "A Fairy Horse from Mullagh Lake", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1003, Page 435", "Page 435"], "url": "https://www.duchas.ie/en/cbes/5070798/5065058/5101054", "text": "\nOne spring day about 100 years ago an old farmer who was ploughing in Corryrourke saw a queer looking old horse standing on the headland.He yoked him in the plough and he was far better than his own horses. The man kept him some years and then one day he put him under the cart to go to Mullagh. As he was passing the lake the horse lay down. The man loosened him and the horse dived into the lake and disappeared.\n", "school_info": "School: Cros Riabhach", "metadata": [{"Location:": "Crossreagh, Co. Cavan", "Teacher:": "\nT. Ó Siordáin\n"}, {"Informant": "P. Duffy", "Address": "Mullagh, Co. Cavan"}, {"Language": "English"}]}, "5070798/5065102/5101282": {"title": "Scéal Eile i dtaobh an Loch", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1003, Page 478", "Page 478"], "url": "https://www.duchas.ie/en/cbes/5070798/5065102/5101282", "text": "\nMadain go moch ins an am fadó. Bhí fear ó Cros Riabhach ag dul go dti an aonach in Ceann-Alisnamidhe.Bhí se ag gabhail thart in aici an loch agus chonnaic se dha chapall sidhe in-a  seasamh in aici an loch.Nuair a bhí an fear ag teacht níos giorre, do léim an dha chapall isteach san loch agus chuadar síos fé an uisghe.Bhí iongantas ar an fhear.\n", "school_info": "School: Cros Riabhach", "metadata": [{"Location:": "Crossreagh, Co. Cavan", "Teacher:": "\nT. Ó Siordáin\n"}, {"Collector": "Mairid Ní Líond", "Gender": "female", "Address": "Corryrourke, Co. Cavan"}, {"Language": "Irish"}]}, "5009212/4998323/5105057": {"title": "Scéal", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0770, Page 005", "Page 005"], "url": "https://www.duchas.ie/en/cbes/5009212/4998323/5105057", "text": "\nLong ago the fairies used to be seen on Graigue hill. One night a man was coming home off his ceilid. As he went up the hill the fairies began shouting at him \"Come out here\". When he went out there, they shouted at him from some other place \"Come out here\". He was kept till morning going from one place to another.\n\n\n\nOne night a priest was sent for on a sick call. When he was coming near the house he heard music. He stood to listen to the music and when he went into the house the man was dead about as long as the music lasted.\n\n\n\nThere's a lough in Corclara bog and the name of it is Sammon's Lough. One day a white horse came out of it and began eating grass on Sammon's land. He stood there for a few days and the Sammons caught him to see what sort of a horse he was but he broke away from them and jumped into the lough.\n", "school_info": "School: Monedarragh, Mostrim", "metadata": [{"Location:": "Monadarragh, Co. Longford", "Teacher:": "\nBean Uí Mhealláin\n"}, {"Informant": "Mrs Mac Nerney", "Gender": "female", "Age": "53", "Address": "Corclaragh, Co. Longford"}, {"Language": "English"}]}, "5009212/4998323/5105064": {"title": "Scéal", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0770, Page 005", "Page 005"], "url": "https://www.duchas.ie/en/cbes/5009212/4998323/5105064", "text": "\nLong ago the fairies used to be seen on Graigue hill. One night a man was coming home off his ceilid. As he went up the hill the fairies began shouting at him \"Come out here\". When he went out there, they shouted at him from some other place \"Come out here\". He was kept till morning going from one place to another.\n\n\n\nOne night a priest was sent for on a sick call. When he was coming near the house he heard music. He stood to listen to the music and when he went into the house the man was dead about as long as the music lasted.\n\n\n\nThere's a lough in Corclara bog and the name of it is Sammon's Lough. One day a white horse came out of it and began eating grass on Sammon's land. He stood there for a few days and the Sammons caught him to see what sort of a horse he was but he broke away from them and jumped into the lough.\n", "school_info": "School: Monedarragh, Mostrim", "metadata": [{"Location:": "Monadarragh, Co. Longford", "Teacher:": "\nBean Uí Mhealláin\n"}, {"Informant": "Mrs Mac Nerney", "Gender": "female", "Age": "53", "Address": "Corclaragh, Co. Longford"}, {"Language": "English"}]}, "5009212/4998323/5105067": {"title": "Scéal", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0770, Page 005", "Page 005"], "url": "https://www.duchas.ie/en/cbes/5009212/4998323/5105067", "text": "\nLong ago the fairies used to be seen on Graigue hill. One night a man was coming home off his ceilid. As he went up the hill the fairies began shouting at him \"Come out here\". When he went out there, they shouted at him from some other place \"Come out here\". He was kept till morning going from one place to another.\n\n\n\nOne night a priest was sent for on a sick call. When he was coming near the house he heard music. He stood to listen to the music and when he went into the house the man was dead about as long as the music lasted.\n\n\n\nThere's a lough in Corclara bog and the name of it is Sammon's Lough. One day a white horse came out of it and began eating grass on Sammon's land. He stood there for a few days and the Sammons caught him to see what sort of a horse he was but he broke away from them and jumped into the lough.\n", "school_info": "School: Monedarragh, Mostrim", "metadata": [{"Location:": "Monadarragh, Co. Longford", "Teacher:": "\nBean Uí Mhealláin\n"}, {"Language": "English"}]}, "5009212/4998354/5105262": {"title": "Scéal", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0770, Page 036", "Page 036"], "url": "https://www.duchas.ie/en/cbes/5009212/4998354/5105262", "text": "\nEvery night a light used to rise in a field in Strokestown (beside Moredarragh). There were trees growing there, and the light used to rise over them. Then it used to go back slowly and disappear into (Matty MacCormack's fort in Moredarragh.\n\n\n\nA man was leading a horse by a well at Kilshrewley. The horse jumped into the well and disappeared. Anyone that ever went to the well, after that with a bucket or gallon, it would be taken out of their hands.\n", "school_info": "School: Monedarragh, Mostrim", "metadata": [{"Location:": "Monadarragh, Co. Longford", "Teacher:": "\nBean Uí Mhealláin\n"}, {"Informant": "Mrs Mac Nerney", "Gender": "female", "Address": "Corclaragh, Co. Longford"}, {"Language": "English"}]}, "5009212/4998354/5105264": {"title": "Scéal", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0770, Page 036", "Page 036"], "url": "https://www.duchas.ie/en/cbes/5009212/4998354/5105264", "text": "\nEvery night a light used to rise in a field in Strokestown (beside Moredarragh). There were trees growing there, and the light used to rise over them. Then it used to go back slowly and disappear into (Matty MacCormack's fort in Moredarragh.\n\n\n\nA man was leading a horse by a well at Kilshrewley. The horse jumped into the well and disappeared. Anyone that ever went to the well, after that with a bucket or gallon, it would be taken out of their hands.\n", "school_info": "School: Monedarragh, Mostrim", "metadata": [{"Location:": "Monadarragh, Co. Longford", "Teacher:": "\nBean Uí Mhealláin\n"}, {"Informant": "Mrs Doherty", "Gender": "female", "Address": "Cam, Co. Longford"}, {"Language": "English"}]}, "5009212/4998358/5105281": {"title": "Scéal", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0770, Page 040", "Page 040"], "url": "https://www.duchas.ie/en/cbes/5009212/4998358/5105281", "text": "\nIn old times the people said there used to be a white horse in Sammon's Lough and that he used to often be out on the shore feeding. One day a cow came out of the lough  and the Sammons brought her up to the house, but the lough rise after her and nearly ran in on Sammons' door, so they had to let go the cow. As soon as they did the lough went back again.\n\n\n\nThere was once a woman who had a child. The fairies took the child and left another instead of it, but the woman\n(continues on next page)\n", "school_info": "School: Monedarragh, Mostrim", "metadata": [{"Location:": "Monadarragh, Co. Longford", "Teacher:": "\nBean Uí Mhealláin\n"}, {"Informant": "Mrs Mac Nerney", "Gender": "female", "Address": "Corclaragh, Co. Longford"}, {"Language": "English"}]}, "5009212/4998361/5105290": {"title": "Scéal", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0770, Page 043", "Page 043"], "url": "https://www.duchas.ie/en/cbes/5009212/4998361/5105290", "text": "\nOne time a man was ploughing in a field. When he was ploughing the third scrape, the horses stood. The man shouted at them to go on, but he couldn't get them to move. Then he looked and saw a big stone. He moved the stone away and when he looked down he saw half a hames of gold. He brought it home with him and  got a lot of money for it.\n\n\n\nOne time there were two men living together,. There name was Sammons and they were very odd. There was a lough near their\n(continues on next page)\n", "school_info": "School: Monedarragh, Mostrim", "metadata": [{"Location:": "Monadarragh, Co. Longford", "Teacher:": "\nBean Uí Mhealláin\n"}, {"Informant": "Mrs Mahedy", "Gender": "female", "Address": "Cam, Co. Longford"}, {"Language": "English"}]}, "5009196/4996732/5105663": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0766, Page 105", "Page 105"], "url": "https://www.duchas.ie/en/cbes/5009196/4996732/5105663", "text": "\nIn the Annar of Galladu in Co. Leitrim there is a lake called Gulladu. In the year 1900 a huge big horse arose almost at the edge of the lake. He was about six feet in length and he had a very big head. He (loved) had long hair growing down his back.    All the neighbours gathered out to see him. He was fiered at with stones and hit many times but never stired.      He was seen by Pat Gill (40) who told Patrick McCabe, Aughagreagh,Parish:- Columbcille,Barony:- Granard, Co. Longford26th March 1936\n", "school_info": "School: Lislea, Ballinalee", "metadata": [{"Location:": "Lislea, Co. Longford", "Teacher:": "\nPádraig Mac Gréine\n"}, {"Collector": "Patrick Mc Cabe", "Gender": "male", "Address": "Aghagreagh, Co. Longford"}, {"Informant": "Pat Gill", "Gender": "male", "Age": "40"}, {"Language": "English"}]}, "5177653/5177255/5190807": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0599, Page 251", "Page 251"], "url": "https://www.duchas.ie/en/cbes/5177653/5177255/5190807", "text": "\n251Long ago there was a man and he had seven horses. Every day his seven sons used to go hunting on the Broadford Mountains.One morning that the boys got up they saw a fine young horse abroad in the field.Then the seven boys caught the horse and trained him.In about six months afterwards one of the seven boys was riding the stray horse near Rathlube Lake,and  suddenly a horse got up out of the water and threw the man and horse into the lake and ever since the the marks of the horse's hoofs are to be seen on a certain rock near the lake.\n\n\n\nLong ago there was a cruel steward in Ralahine and he would not let the people take any water from the pump\n(continues on next page)\n", "school_info": "School: Ballycar, Cuinche", "metadata": [{"Location:": "Ballycar, Co. Clare", "Teacher:": "\nLiam Mac Clúin\n"}, {"Collector": "Tom Hartigan", "Gender": "male", "Address": "Rathlaheen South, Co. Clare"}, {"Informant": "Patt Hartigan", "Relation": "parent", "Gender": "male", "Address": "Rathlaheen South, Co. Clare"}, {"Language": "English"}]}, "5170140/5169099/5196153": {"title": "Strange Animals", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0983, Page 260", "Page 260"], "url": "https://www.duchas.ie/en/cbes/5170140/5169099/5196153", "text": "\nThere are no strange animals in this part of the country. But sometimes when people are out late at night they meet ghosts. Here is a story I heard about a person who met a ghost at night and he was terrified at the shock.One very dark night he was whistling a tune to himself going past a wood. Suddenly a terrific sweat came over him and he couldn't move a step. Then he saw a ghostly figure riding a horse sitting straight in his saddle riding past him. the horse was very heavy footed and well caparisoned. They rode past him and they came to a well. The house stopped to take a drink and when he did so the pedestrian saw two big red eyes like big balls of fire in the horse. Then all disappeared again and there was a terrific\n(continues on next page)\n", "school_info": "School: Coronea, Arva", "metadata": [{"Location:": "Corraneary, Co. Cavan", "Teacher:": "\nP. Ó Dulchanta\n"}, {"Collector": "Brigid Mc Caffrey", "Gender": "female", "Address": "Drumbess, Co. Cavan"}, {"Informant": "James Burns", "Gender": "male"}, {"Language": "English"}]}, "5215809/5214058/5221677": {"title": "A Water Horse", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137F, Page 05_040", "Page 05_040"], "url": "https://www.duchas.ie/en/cbes/5215809/5214058/5221677", "text": "\nThere was a man and he lived in Ballinlough. One night he lost his mare. There was going to be a fair the next day in Westport and he wanted the mare. He could not get the mare so he said he would walk. Next morning he got up at four o'clock. There was a lot of other men going too, but they had their horses with then. Before he went he looked down at the lake and he saw a white horse the colour of his own horse grazing along the side of the lake. He went down to her and jumped up. The minute he was above the horse galloped out into the lake. In two minutes\n(continues on next page)\n", "school_info": "School: Lankill", "metadata": [{"Location:": "Lankill, Co. Mayo", "Teacher:": "\nSeán Ó Cibhil\n"}, {"Collector": "Mary Keane", "Gender": "female", "Address": "1419645"}, {"Informant": "Mr Hugh Keane", "Gender": "male", "Address": "1419645"}, {"Language": "English"}]}, "5235084/5233732/5235218": {"title": "Fairies", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0237, Page 047", "Page 047"], "url": "https://www.duchas.ie/en/cbes/5235084/5233732/5235218", "text": "\n(continued from previous page)\npassing by.Also that that same night that the fairies came for his child two children were dead in the same street next morning.\n\n\n\nThe Banshee still comes to warn the people that death is near.She is often reported heard round here, especially before old  natives die.\n\n\n\nMrs Oates says she saw a water horse in Lough [?] that it came up and ploughed round the fields and that a man followed it with a whip and that it kicked the man to death.\n\n\n\nOnce a girl who lived near a lake down below Carrick disappeared when she was washing her clothes on its brink. She used to wash there always but  one day she never returned and no trace of her could be found so it is\n(continues on next page)\n", "school_info": "School: Cortubber", "metadata": [{"Location:": "Cortober, Co. Roscommon", "Teacher:": "\nMary A. Burke\n"}, {"Language": "English"}]}, "5236078/5218077/5240426": {"title": "Water Horses", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0088E, Page 03_026", "Page 03_026"], "url": "https://www.duchas.ie/en/cbes/5236078/5218077/5240426", "text": "\nThere was once a man living in village name Gorrow, a little village in the parish of Aughagower. One day he left his mare grazing by the side of a lake until it was dusk. When he went out for his mare he came up to a water horse and thinking it was his own mare he put on the halter and went riding. The horse galloped to the lake and the man had just jumped off the horse when the horse dived into the lake again\n", "school_info": "School: Achadh Fobhair", "metadata": [{"Location:": "Aghagower, Co. Mayo", "Teacher:": "\nHannah T. Kevilla\n"}, {"Collector": "Martin Sheridan", "Gender": "male", "Address": "Aghagower, Co. Mayo"}, {"Language": "English"}]}, "5236078/5218227/5240708": {"title": "Water Horses", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0088E, Page 08_017", "Page 08_017"], "url": "https://www.duchas.ie/en/cbes/5236078/5218227/5240708", "text": "\nThere are water horses in a lake called Ail More. There was once a man coming from town with an ass. He saw a horse coming towards him from the lake. The horse jumped out of the lake and pulled the man down under the water. A few hours after his body was floating on top of the water.\n\n\n\nA woman was churning and a tinker came in. It is usually for people to churn when they come to a house where the churning is in progress. The tinker went out again and did not\n(continues on next page)\n", "school_info": "School: Achadh Fobhair", "metadata": [{"Location:": "Aghagower, Co. Mayo", "Teacher:": "\nHannah T. Kevilla\n"}, {"Collector": "Mary Reilly", "Gender": "female", "Address": "Lackaun, Co. Mayo"}, {"Language": "English"}]}, "5236078/5218262/5240772": {"title": "Water Dog", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0088E, Page 09_019", "Page 09_019"], "url": "https://www.duchas.ie/en/cbes/5236078/5218262/5240772", "text": "\n(continued from previous page)\nran acrosss when the water dashed after him and the water dog got killed. The man was afraid to go near the place where he killed the water dog\n\n\n\nThere is a water horse in Ballinlough lake. One night he left the lake and came up to a mans door and the people of the house heard him neighing and at last he went away and the people of the house were afraid to go near the lake at night.\n\n\n\nThere is an old saying that if a person ties a roundberry tree round the churn he will have luck in butter for all the year. On May day if a person brings a blade of thatch out of the house he will bring the luck of the butter for the\n(continues on next page)\n", "school_info": "School: Achadh Fobhair", "metadata": [{"Location:": "Aghagower, Co. Mayo", "Teacher:": "\nHannah T. Kevilla\n"}, {"Collector": "Sadie Gibbons", "Gender": "female", "Address": "Corveagh Upper, Co. Mayo"}, {"Language": "English"}]}, "5236078/5218345/5240929": {"title": "Water Horses", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0088E, Page 11_024", "Page 11_024"], "url": "https://www.duchas.ie/en/cbes/5236078/5218345/5240929", "text": "\nOne time a man was cleaning a drain He had finished his evenings work and when he came to the drain the next morning he got a dead water horse in the drainOne time a man was ploughing and he let his horse out to graze for a while during the dinner hour. When he went for his horse again he saw a horse by the lake which he thought was his own horse. He put the head collar on him and he went on his back. As soon as he went on his back the horse sprang right into the lake and the man was almost drowned and the next morning he died.\n", "school_info": "School: Achadh Fobhair", "metadata": [{"Location:": "Aghagower, Co. Mayo", "Teacher:": "\nHannah T. Kevilla\n"}, {"Collector": "James Noonan", "Gender": "male", "Address": "Aghagower, Co. Mayo"}, {"Language": "English"}]}, "5236078/5218377/5240963": {"title": "A Water Horse", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0088E, Page 12_030", "Page 12_030"], "url": "https://www.duchas.ie/en/cbes/5236078/5218377/5240963", "text": "\nOnce up on a time a man named Pat Malley of Ballagorman saw a water horse. He went near him and he jumped in to Ballin-lough lake. Another man got a water horse and he put shoes on him and he ploughed and harrowed him. One day he went to the river to give him a drink and when he brought him to the river he jumped in to the river and he never saw him again.\n", "school_info": "School: Achadh Fobhair", "metadata": [{"Location:": "Aghagower, Co. Mayo", "Teacher:": "\nHannah T. Kevilla\n"}, {"Collector": "Thomas Derrig", "Gender": "male", "Address": "Mountbrown, Co. Mayo"}, {"Language": "English"}]}, "5236078/5218435/5241086": {"title": "Fairy Forts", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0088E, Page 14_029", "Page 14_029"], "url": "https://www.duchas.ie/en/cbes/5236078/5218435/5241086", "text": "\n(continued from previous page)\n[?]\n\n\n\nOnce upon a time a man who lived near Ballin Lough lake went out to catch his horse in the field at night. He saw a horse which looked like his own horse and went up to catch him. He put the bridle on him and he went on his back. The horse began running as far as the lake in order to throw his rider into the lake but the man jumped off the horse and the water horse went into the lake.\n", "school_info": "School: Achadh Fobhair", "metadata": [{"Location:": "Aghagower, Co. Mayo", "Teacher:": "\nHannah T. Kevilla\n"}, {"Collector": "Kathleen Mc Donagh", "Gender": "female", "Address": "Mountbrown, Co. Mayo"}, {"Language": "English"}]}, "5215809/5231355/5264025": {"title": "A Water Horse", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137F, Page 11_025", "Page 11_025"], "url": "https://www.duchas.ie/en/cbes/5215809/5231355/5264025", "text": "\nThere was a water-horse seen often at Lisearney Lake. Once upon a time Mrs Morrison saw a water-horse coming swimming in the lake. Her house is not far from the lake and she could hear the noise coming through the water. She said it seemed to be swimming on its side like an ordinary horse. When it came to the brink it ran about and then went into a greenfield and ate there for half an hour. After a while it went in again. Many people after saw a crowd of water-horses grazing in the fields above the bank.\n(continues on next page)\n", "school_info": "School: Lankill", "metadata": [{"Location:": "Lankill, Co. Mayo", "Teacher:": "\nSeán Ó Cibhil\n"}, {"Collector": "Nora King", "Gender": "female", "Address": "Lanmore, Co. Mayo"}, {"Informant": "Mrs Morrison", "Gender": "female", "Address": "Lanmore, Co. Mayo"}, {"Language": "English"}]}, "5215809/5231451/5265032": {"title": "A Water Horse", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137F, Page 12_067", "Page 12_067"], "url": "https://www.duchas.ie/en/cbes/5215809/5231451/5265032", "text": "\nSome years ago a water horse was seen at Liscarney lake By Edward Scahill. He went near the horse to see him and he followed him a bit and then returned back again. He said the water horse was about the size of a horse-foal and that he was grey in colour.  He remarked also that he had a very long tail and it was brushing against the ground. When he came to the brink of the lake he galloped about the brink and then suddenly went into the water and disappeared.  A horse was seen lately swimming in Liscarney lake.\n", "school_info": "School: Lankill", "metadata": [{"Location:": "Lankill, Co. Mayo", "Teacher:": "\nSeán Ó Cibhil\n"}, {"Collector": "Eileen King", "Gender": "male", "Address": "Lanmore, Co. Mayo"}, {"Informant": "Edward Scahill", "Gender": "male", "Address": "Carrowmore, Co. Mayo"}, {"Language": "English"}, {"Location": "Liscarney"}]}, "5215809/5231452/5265034": {"title": "A Water Horse", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137F, Page 12_068", "Page 12_068"], "url": "https://www.duchas.ie/en/cbes/5215809/5231452/5265034", "text": "\nSome years ago Pat Walsh of Leitreen had no horse for ploughing. One day he saw a water horse at Leitreen lake. He went down to him and put the bridle on him and rode him up to his own house. Then he started ploughing. The water- h did a great bit of work for him. So when the dark came he put him into his barn. The water was very quiet but he was awful for biting. Pat Walsh himself said that he was bay in colour and he said the size of him was about the size of a horse-foal.The next day early in the morning he went down to the lake with him for a drink. When the water horse came in sight of the lake he got into a gallop with Pat Walsh on him. When Pat Walsh saw that\n(continues on next page)\n", "school_info": "School: Lankill", "metadata": [{"Location:": "Lankill, Co. Mayo", "Teacher:": "\nSeán Ó Cibhil\n"}, {"Collector": "Eileen King", "Gender": "female", "Address": "Lanmore, Co. Mayo"}, {"Informant": "Michael Kerrigan", "Gender": "male", "Address": "Knappagh Beg, Co. Mayo"}, {"Language": "English"}]}, "5215809/5231454/5265040": {"title": "A Water Horse", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137F, Page 12_070", "Page 12_070"], "url": "https://www.duchas.ie/en/cbes/5215809/5231454/5265040", "text": "\nSome years ago two young lads went fishing to a lake in Drummin called Loch na Quilligan. This lake is between two hills. They had a board for fishing with them and a fishing rod. When they had the board just left down in the lake they saw an animal coming towards them furiously in the lake. They said it had a very big mane and a very big head and they could hear it snuffing in the water. The animal was coming near the brink of the lake and they were getting afraid as they had no weapons with them so they took for the hills as quickly as they could They said it was like a water  horse. They never went fishing to that lake againSome years ago also\n(continues on next page)\n", "school_info": "School: Lankill", "metadata": [{"Location:": "Lankill, Co. Mayo", "Teacher:": "\nSeán Ó Cibhil\n"}, {"Collector": "Eileen King", "Gender": "female", "Address": "Lanmore, Co. Mayo"}, {"Language": "English"}]}, "5215809/5231502/5265174": {"title": "A Water Horse", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137F, Page 13_015", "Page 13_015"], "url": "https://www.duchas.ie/en/cbes/5215809/5231502/5265174", "text": "\nThere was once a man out visiting out late one moonlight night. When he came in from visiting he went out looking for his mare. He saw a mare very like his own mare near a lake. He went up and caught her by the mane and he jumped upon her back. The mare walked down to the lake and sprang into the water and drowned the man.John ReidKnappabeg, Westport.\n", "school_info": "School: Lankill", "metadata": [{"Location:": "Lankill, Co. Mayo", "Teacher:": "\nSeán Ó Cibhil\n"}, {"Collector": "James Reid", "Gender": "male", "Address": "Knappagh Beg, Co. Mayo"}, {"Informant": "John Reid", "Gender": "male", "Address": "Knappagh Beg, Co. Mayo"}, {"Language": "English"}]}, "5215809/5231504/5265176": {"title": "A Water Horse", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137F, Page 13_017", "Page 13_017"], "url": "https://www.duchas.ie/en/cbes/5215809/5231504/5265176", "text": "\nOnce upon at time there was a man out late at night and when he came home he went looking for his mare. He saw a mare in a field the same colour as his own mare. He jumped up on her back and she trotted down to Ballinglough lake and she sprang into the water. He jumped off her back in the water and he escaped.\n", "school_info": "School: Lankill", "metadata": [{"Location:": "Lankill, Co. Mayo", "Teacher:": "\nSeán Ó Cibhil\n"}, {"Collector": "James Reid", "Gender": "male", "Address": "Knappagh Beg, Co. Mayo"}, {"Informant": "Walter Walsh", "Gender": "male", "Address": "Knappagh Beg, Co. Mayo"}, {"Language": "English"}]}, "5215809/5231531/5265205": {"title": "A Water Horse", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137F, Page 14_020", "Page 14_020"], "url": "https://www.duchas.ie/en/cbes/5215809/5231531/5265205", "text": "\nA man in Ballinlough named John Kane saw a water horse several times but he failed to catch her. One day he said that he would catch her. When the water horse came in on land the man stole up and caught her and brought her at once to the forge and put shoes on her. He then went home and next day brought the horse back to the field and worked her for the whole day. The horse was very quiet and a good worker. This continued for four or five years. One day the horse lost her shoes and off she went as fast as she could for the lake and she was never heard of again.\n", "school_info": "School: Lankill", "metadata": [{"Location:": "Lankill, Co. Mayo", "Teacher:": "\nSeán Ó Cibhil\n"}, {"Collector": "Lena Keville", "Gender": "female", "Address": "Knappagh Beg, Co. Mayo"}, {"Informant": "Richard Walsh", "Gender": "male", "Address": "Lanmore, Co. Mayo"}, {"Language": "English"}, {"Location": "Ballinlough"}]}, "5215809/5231646/5265496": {"title": "A Water Horse", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137F, Page 16_017", "Page 16_017"], "url": "https://www.duchas.ie/en/cbes/5215809/5231646/5265496", "text": "\nThere is supposed to be a water-horse in Ballinlough lake long ago. They are supposed to be of different colours some black and white and others red and white. They are supposed to come up every evening eating grass by the side of the lake. Sometimes also they swim up the river.One evening when a man who was living near the lake came for his cows he saw a strange black and white pony grazing with the cows. It was a water horse but the man thought it was a stray horse.The man went up to him and went riding on him. He tried to drive him out on the road but he turned round and sprang into the water. When he got into the water\n(continues on next page)\n", "school_info": "School: Lankill", "metadata": [{"Location:": "Lankill, Co. Mayo", "Teacher:": "\nSeán Ó Cibhil\n"}, {"Collector": "Patrick Lavelle", "Gender": "male", "Address": "Cordarragh North, Co. Mayo"}, {"Informant": "John Lavelle", "Gender": "male", "Address": "Cordarragh North, Co. Mayo"}, {"Language": "English"}]}, "5215809/5231685/5265604": {"title": "A Water Horse", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137F, Page 17_013", "Page 17_013"], "url": "https://www.duchas.ie/en/cbes/5215809/5231685/5265604", "text": "\nOne morning long ago when a man from Ballinlough got up he saw a water horse in a field and he went up to the horse and caught him he did not stir until the man was riding on him and as soon as the man went riding on the horse he ran as quickly as he could and he jumped into the lake with the man riding on him and the man was never heard of from that day to this.\n", "school_info": "School: Lankill", "metadata": [{"Location:": "Lankill, Co. Mayo", "Teacher:": "\nSeán Ó Cibhil\n"}, {"Collector": "James Bernard Grady", "Gender": "male", "Address": "Cloonskill, Co. Mayo"}, {"Informant": "Pat Heneghan", "Gender": "male", "Age": "70", "Address": "Cloonskill, Co. Mayo"}, {"Language": "English"}]}, "5215809/5231762/5265834": {"title": "Water Horse and the Man", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137F, Page 19_045", "Page 19_045"], "url": "https://www.duchas.ie/en/cbes/5215809/5231762/5265834", "text": "\nWater horse and the manLong long ago there was a man living in Gleann na Glimack and his name was Martin Brown and he was to go to a fair.  In the evening he was talking to one of his neighbours and he told him that he would be with him in the morning and he said not to go to the fair with out him and the man said no.  He said to the neighbour he had no more time to delay because he had to go to look after his horse and the neighbour went home and Martin went looking for his horse and he could not get him.  He saw a lake and off Martin went to it.  When he was near the lake he saw a horse the very same\n(continues on next page)\n", "school_info": "School: Lankill", "metadata": [{"Location:": "Lankill, Co. Mayo", "Teacher:": "\nSeán Ó Cibhil\n"}, {"Collector": "Kitty Duffy", "Gender": "female", "Address": "Lanmore, Co. Mayo"}, {"Informant": "Richard Duffy", "Gender": "male", "Address": "Westport, Co. Mayo"}, {"Language": "English"}]}}