{"4428184/4384634/4435606": {"title": "Oíche Fhéile Eoin", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0787, Page 85", "Page 85"], "url": "https://www.duchas.ie/en/cbes/4428184/4384634/4435606", "text": "\nNí bhíonn an oireadh teineadh anois ann  as ba gnáth. Ba mhór an caitheamh aimsire bhíodh ann roimhe seo ag an aos óg ar shiubhal ag goid smután agus sean gráig. Bhíodh coimhlint mór ann go bhfeicfidhe cé aige a bhéadh an teine ba mhó.Is minic a bhíodh siad ag damhsa agus ag dul ceoil thart ar an teinidh. Annsin deirtí an Paidrín agus beireadh na sean daoiní leo smután as an teine agus d'iomparadh fríd a gcuid cuiridheachta é ag dul abhaile daobhtha.Tiomanann siad na ba fríd an teinidh fosda nuair a bíonn sé ag dul as le ádh a chur ortha. Ní shílim go bhfuil an  grás seo beo anois.\n", "school_info": "School: Naul", "metadata": [{"Location:": "Naul, Co. Dublin", "Teacher:": "\nC. Mac Fhíonntaigh\n"}, {"Collector": "Cathal Mac Fhíonntaigh", "Gender": "male"}, {"Informant": "Neans Ní Chealachain", "Relation": "unknown", "Gender": "female", "Age": "74", "Address": "Tawnaghgorm, Co. Donegal"}, {"Language": "Irish"}]}, "4427841/4349379/4440290": {"title": "Feast-Days - Halloween", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0096, Page 674", "Page 674"], "url": "https://www.duchas.ie/en/cbes/4427841/4349379/4440290", "text": "\n(continued from previous page)\ntop, what ever name would be on it that would be the girl he would get married to. Written by:- William Heneghan. Coole.Material from:- Thomas Heneghan. Coole. Aged 55 years.\n\n\n\nThe old people used to light bone fires at every cross road. They called them bone fires because they used to throw bones into the fires. They used to go from house to house for arms of turf. When they would have enough of turf they would gather to gather and and buy a gallon of oil. They used to get cans and milk people’s cows. They used milk goats also. When they would come home they would buy two loaves between them.\n(continues on next page)\n", "school_info": "School: Baile an Daingin (B)", "metadata": [{"Location:": "Ballindine, Co. Mayo", "Teacher:": "\nSéamus P. Ó Gríobhtha\n"}, {"Collector": "Patrick Grogan", "Gender": "male", "Address": "Newtown South, Co. Mayo"}, {"Informant": "James Grogan", "Gender": "male", "Age": "55", "Address": "Newtown South, Co. Mayo"}, {"Language": "English"}]}, "4428101/4378202/4443866": {"title": "Festival Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0638, Page 16", "Page 16"], "url": "https://www.duchas.ie/en/cbes/4428101/4378202/4443866", "text": "\nSaint Stephen's DaySaint Stephen's Day is the day after Xmas day. Some men find more fun out of Saint Stephen's day than any other day around Xmas. Men club together and decorate wren bushes. They then hire a motor car and bring their melodeons with them also mouth organs. Then they are off from town to town. When they are coming home they go into the nearest dance hall and they end the wren day in a merry mood.\n\n\n\nSaint John's DaySaint John's day falls on the twenty fourth of June. It is a customary thing on St John's eve for people to light a bonfire on some part of the land. It is nice to look up the hills at about ten o'clock and see\n(continues on next page)\n", "school_info": "School: Glencairn", "metadata": [{"Location:": "Glencairn, Co. Waterford", "Teacher:": "\nEibhlín Ní Dhuibhir\n"}, {"Informant": "Mrs Flynn", "Relation": "unknown", "Gender": "female", "Age": "54", "Address": "Glencairn, Co. Waterford"}, {"Language": "English"}]}, "4428101/4378218/4443873": {"title": "Saint John's Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0638, Page 21", "Page 21"], "url": "https://www.duchas.ie/en/cbes/4428101/4378218/4443873", "text": "\nOn the 24th of June St. John's Eve occurs. Before bon fires used to be lit in honour of the Feast, but now that custom is dying away in most places. People used to sing and dance and jump over the fire. It is an old custom to drive the cows over the fire so no harm could come to them during the coming year.\n\n\n\nOn the 1st of February this Irish Feast occurs. It is the old pious custom of the Irish mothers to put a strip of unwashed cloth out on the hedge on the eve of St. Brigid's all the night and this was supposed to cure headaches and toothaches.The children go round and gather rushes and reeds and make them into crosses \"Cross-Brigde\" is the old\n(continues on next page)\n", "school_info": "School: Glencairn", "metadata": [{"Location:": "Glencairn, Co. Waterford", "Teacher:": "\nEibhlín Ní Dhuibhir\n"}, {"Informant": "Mrs O' Neill", "Gender": "female", "Age": "58", "Address": "Glencairn, Co. Waterford"}, {"Language": "English"}]}, "4428102/4378393/4444004": {"title": "St John's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0638, Page 46", "Page 46"], "url": "https://www.duchas.ie/en/cbes/4428102/4378393/4444004", "text": "\nSaint John's Day is the 24th June. The night before is called Bonfire night. Long ago every lit a Bonfire, and the farmers made the cows go out over it.Then the people had great fun, sometimes crowds would gather toghter and have a dance around the fire until it would be burned out.Now no one bothers about making the cows go over the fire, even if they do have a fire. Very few people have a fire they might light a bush but that is all. Tis the remains of a Pagan custom they say and that it would not be right to do it.\n", "school_info": "School: Baile Dubh (1)", "metadata": [{"Location:": "Ballyduff, Co. Waterford", "Teacher:": "\nBríd Ní Dhúnaighe\n"}, {"Collector": "Kittie Barry", "Gender": "female"}, {"Informant": "Cornelius Barry", "Relation": "unknown", "Gender": "male"}, {"Language": "English"}]}, "4428163/4382821/4447551": {"title": "St John's Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0654, Page 158", "Page 158"], "url": "https://www.duchas.ie/en/cbes/4428163/4382821/4447551", "text": "\nSt John's Eve falls on the 23rd of June every years. There used be some customs carried out on that night. One was lighting a big fire of furze on the bohreen when the cattle would be coming out and drive them as near as possible to it so that they would go through it. Another custom was shaking Easter water at the four corners of a tillage field, this was done up to about fifteen years ago. Another custom that was done on that evening was puting eggs in a hole in the wall of the cowhouse to keep the cream good. It is over forty years since this was done.\n", "school_info": "School: Cluain Fhiadh (B.), Carraig na Siúire", "metadata": [{"Location:": "Clonea, Co. Waterford", "Teacher:": "\nLiam Ó Heireamhóin\n"}, {"Informant": "Patrick O' Rourke", "Relation": "unknown", "Gender": "male", "Age": "71", "Address": "Glenstown, Co. Waterford"}, {"Language": "English"}]}, "4427896/4355149/4449973": {"title": "Oíche Eoin Naofa", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0109, Page 154", "Page 154"], "url": "https://www.duchas.ie/en/cbes/4427896/4355149/4449973", "text": "\nTagann Oidhche Eoin Naomhta 23adh lá de Mí Mheitimh agus bíonn spórt mór ag gach duine an oidhche sin.Ins an t-sean aimsir bhíodh teine cnámh ag na daoine óga agus bhíodh siad ag damhsadh, ag óránaidheacht is ag innseacht sgéalta.Do théighidís isteach i bpáirc annsin agus do bhleághidís bó.Annsin do bhrisidís suas buillín agus do bhruithidís an bainne.Núair bhíodh sé bruithte do chuiridís an buillin isteach ann agus d'ithidís béile maith. Do thagadh na sean daoine amach annsin agus bhíodh síad  ag innseacht sgéalta fá na sídheóga agus ag déanamh spóirt.Nuair bhíodh sé ag eirigh mall san oidhche, do shuibhalaidís thart ar an teine cnámh agus déiridís an paidirín\n(continues on next page)\n", "school_info": "School: Log Buidhe", "metadata": [{"Location:": "Lugboy Demesne, Co. Mayo", "Teacher:": "\nSeán de Crúis\n"}, {"Collector": "Seosaimhín Ní Fhlaitle", "Gender": "female", "Address": "Cornacarta, Co. Mayo"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "female", "Address": "Cornacarta, Co. Mayo"}, {"Language": "Irish"}]}, "4427896/4355169/4450003": {"title": "Oíche Eoin Naofa", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0109, Page 174", "Page 174"], "url": "https://www.duchas.ie/en/cbes/4427896/4355169/4450003", "text": "\nBíonn oidhche Éoin Naomhtha againn ar an 23 ad lá de mí Mheithimh agus is mór an sport agus greann bhíos ag na daoine an oidhche sin go mór mhór an aois óg.Bailigheann na buachaillí móin agus lasann siad teine ag cros-bhothar agus cuireann siad cnámh isteach ann agus i gceann cúpla mhoimeadh bíonn teine mór aca.Bíonn na buacaillí agus na cailiní ag damsa agus ag gábhail amrán agus bíonn árd spórt aca.Deir mo athair liom oidhche amháin go raibh cruinneadh thart ag teine mar sin tráth agus san úair sin bhíod brogaí adhmaid ag na daoine agus bhí bhuacall in a sheasam in aice na teine agus bí splanc teine in aice a bhroige in an fhios dó agus níor mhochiugh sé go ndearna sé poll thríd\n(continues on next page)\n", "school_info": "School: Log Buidhe", "metadata": [{"Location:": "Lugboy Demesne, Co. Mayo", "Teacher:": "\nSeán de Crúis\n"}, {"Collector": "Sighle Ní Mhainnín", "Gender": "female", "Address": "Lisduff, Co. Mayo"}, {"Informant": "Tomás Mag Samhráin", "Gender": "male", "Age": "45", "Address": "Holywell Upper, Co. Mayo"}, {"Language": "Irish"}]}, "4428079/4376007/4450293": {"title": "St John's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0153, Page 225", "Page 225"], "url": "https://www.duchas.ie/en/cbes/4428079/4376007/4450293", "text": "\nSt. John's Night.Bonfire night falls on the twenty third of June every year. The night always comes the day. We intend to have a 'lo'(?) bonfire to night. In our district it is generally the rule (to) every house to have a bonfire of their own. But in some places all the people gather turf and make a large bonfire and have great sport.First of all the people get a good deal of turf  and bring out coals and light it up. They have to put a bone in the fire also. They put sticks in the fire to light it. When it is lit every one goes round it and say their prayers. When every one has their prayers said they take a coal out of the fire and throw the coal into the field. They throw a coal into the oats and one into the potatoes and one into the meadow in order to bless it.Introduction.\n", "school_info": "School: Eiscreach", "metadata": [{"Location:": "Eskeragh, Co. Mayo", "Teacher:": "\nSeán Ó Raghallaigh\n"}, {"Language": "English"}]}, "4427899/4356074/4450300": {"title": "Saint John's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0110, Page 352", "Page 352"], "url": "https://www.duchas.ie/en/cbes/4427899/4356074/4450300", "text": "\nSaint John's Night is kept much different now-a-days to what it used to be kept long ago.On Saint John's Night long ago all the people of each village used to gather together and they used to make a big bonfire in honour of Saint John.While some of the boys used to be making the bonfire others used to be gathering money for loaves and the rest used to milk the cows and the goats.When the loaves used to be bought and the milk used (?) be boiled they used to put the loaves in it and then they used to feast together.When they used to be going each person used to bring home\n(continues on next page)\n", "school_info": "School: Baile an Bhile (C.)", "metadata": [{"Location:": "Ballinvilla Demesne, Co. Mayo", "Teacher:": "\nBríd Nic Giollachlaoin\n"}, {"Collector": "Tessie Glynn", "Gender": "female"}, {"Informant": "Patrick Glynn", "Gender": "male", "Address": "Cuiltycreaghan, Co. Mayo"}, {"Language": "English"}]}, "4427909/4356965/4451226": {"title": "Ballyglass", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0113, Page 14", "Page 14"], "url": "https://www.duchas.ie/en/cbes/4427909/4356965/4451226", "text": "\n(continued from previous page)\nwheat to the mill. Each of these men had to wait for his turn to get the meal and flour ground. This mill has not been used for many years.\n\n\n\nOn the eve of Saint John's Feast June 23rd bonfires are lighted on almost every hill in Ireland. All the young boys and girls gather turf timber, and oil for the fire. A bone is usually put into the fire and this is how it got the name bonfire. When the bonfire is lighted, the old people gather together and tell stories about\n(continues on next page)\n", "school_info": "School: Cill Cheallaigh (C.)", "metadata": [{"Location:": "Kilkelly, Co. Mayo", "Teacher:": "\nEithne de Buitléir\n"}, {"Collector": "Mary O' Hara", "Gender": "female"}, {"Informant": "Mr Antony Duffy", "Gender": "male", "Address": "Kilkelly, Co. Mayo"}, {"Language": "English"}]}, "4427909/4356987/4451231": {"title": "Customs on Bonfire Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0113, Page 16", "Page 16"], "url": "https://www.duchas.ie/en/cbes/4427909/4356987/4451231", "text": "\nOn the Eve of Saints John's feast June 23rd there is an old custom of lighting fires in his honour. This custom was handed down to us from the pagans who used to light fires in honour of one of their gods. In the olden times the fires were lighted on the mountains and hills throughout Ireland. There are not so many fires now in Ireland on that night because that custom is dying out. But wherever those fires are still maintained some of the customs are also kept that were kept by the people long ago.In the olden times it was customary for the boys\n(continues on next page)\n", "school_info": "School: Cill Cheallaigh (C.)", "metadata": [{"Location:": "Kilkelly, Co. Mayo", "Teacher:": "\nEithne de Buitléir\n"}, {"Collector": "Tessie Flannery", "Gender": "female"}, {"Informant": "Miss Brigid Colleran", "Gender": "female", "Address": "Gowlaun, Co. Mayo"}, {"Language": "English"}]}, "4427824/4347643/4452095": {"title": "St John's Night Customs - The Bonfire Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0093, Page 35", "Page 35"], "url": "https://www.duchas.ie/en/cbes/4427824/4347643/4452095", "text": "\nSt John's night the 23rd of June is the bonfire night. A fire is lighted in every village. In the evening, a number of boys, go about from house to house gathering turf. They get a load or two in each house, they make a heap of it and at about seven or eight o'clock it is lighted. The people, of the village, gather to it, and they have great sport. After a while, the old people come, and they go around the fire three times, and say while doing so, three Our father's and three Hail Mary's and three\n(continues on next page)\n", "school_info": "School: Cruimghlinn", "metadata": [{"Location:": "Crumlin, Co. Mayo", "Teacher:": "\nMl. Ó Conchobhair\n"}, {"Collector": "Mary Kineavy", "Gender": "female", "Address": "Ross West, Co. Mayo"}, {"Language": "English"}]}, "4427824/4347665/4452096": {"title": "The Bonfire Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0093, Page 37", "Page 37"], "url": "https://www.duchas.ie/en/cbes/4427824/4347665/4452096", "text": "\nThe 23rd of June, is called the Bonefire night, or St John's night. On that night, there is a large Bonefire lighted in every village.During the day, a lot of boys go around with asses and gather a lot of turf, and everybody generally gives a load of turf or a bagful.When they have it all gathered, they make a heap of it, and towards the evening they light the Bonefire with oil and a match, and a few coals,. They put also a bone in the middle of it, as it is an old custom.The Bonefire is generally built at a crossroads, or sometimes at a bridge. When it is lighted, all the young and old people  gather to it. Then they start going around the Bonefire, and singing while doing so, Three Hail Marys or a decade\n(continues on next page)\n", "school_info": "School: Cruimghlinn", "metadata": [{"Location:": "Crumlin, Co. Mayo", "Teacher:": "\nMl. Ó Conchobhair\n"}, {"Collector": "Delia Grimes", "Gender": "female", "Address": "Crumlin, Co. Mayo"}, {"Language": "English"}]}, "4428075/4375740/4454293": {"title": "St John's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0152, Page 410", "Page 410"], "url": "https://www.duchas.ie/en/cbes/4428075/4375740/4454293", "text": "\nWe have St John's day every year on 23rd June. On that night it is a custom to light a bone fire. There is always a bone burned in the fire. That day the young boys and girls gather turf and whins for the fire. It is a custom to call John to a boy who is born on St John's day or before it. The people come around the fire and prays at it. The children rises burning whins and shout with joy When the people are leaving the fire they bring a coal with them, and throw it in the village field for luck. The people dance and play at the fire also.\n\n\n\nWe have  Garland Sunday  every year on the last Sunday in July. On that day the people go to\n(continues on next page)\n", "school_info": "School: Coill an Gharráin", "metadata": [{"Location:": "Killacorraun, Co. Mayo", "Teacher:": "\nMícheál Ó Riagáin\n"}, {"Collector": "Brigidh Ní Granachan", "Gender": "female"}, {"Language": "English"}]}, "4427829/4347932/4455032": {"title": "Oíche Fhéile Eoin", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0094, Page 103", "Page 103"], "url": "https://www.duchas.ie/en/cbes/4427829/4347932/4455032", "text": "\nBíonn a lán spóirt ag na páistibh ins an gceanntar seo oidhche Eoin. Lastar teine mór cnámh an oidhche sin in onóir  do Naomh Eoin. An lá roimhe sin téigheann na buachaillí móra ag bailiughadh brosna agus móna agus crann feosaidhe, agus deanann siad cárn mór ag crois bhóthar agus cuireann siad cnámh mór imasc na mbrosna.Tagann daoine o'n gceanntar timcheall na teineadh oidhche Fhéile Sheáin. Nuair a bíonn an teine lasta bhíonn na páistí ag léimrid timcheall na teineadh. Tagann na daoine fásta chomh maith agus bíonn siad ag cainnt agus ag comhrad i rith na h-oidhche. Ag dul abhaile dóib téigheann said timceall na teineadh sé uair agus iad ag guidhe De. Annsan togann siad fód móna lasta agus cuireann síad  isteach i ngach páirc a bhfuil sa fheirm e ionnas go mbead rath ar na barrai i rith na bliadhna. Mártan Mhac Cuimilín(Rang VI)GortCaisleán-a-Barraigh29.11.1937\n", "school_info": "School: Grianán", "metadata": [{"Location:": "Greenans, Co. Mayo", "Teacher:": "\nMáiréad Bean Uí Riagáin\n"}, {"Collector": "Mártan Mhac Cuimilín", "Gender": "female", "Address": "Gort, Co. Mayo"}, {"Language": "Irish"}]}, "4428068/4374756/4455262": {"title": "A Bonfire (St John's Night)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0151, Page 118", "Page 118"], "url": "https://www.duchas.ie/en/cbes/4428068/4374756/4455262", "text": "\nAbout 45 years ago I attended the first \"bone-fire in my life.  I was not then alone, but was accompained by my father, some of my neighbours.Everyone brought with him a bag of turf, some furze and a bottle of (whiskey) paraffin oil.  In addition to this I brought some branches of an ash tree.We selected a place where the Ballinahaglish road joins the \"burial ground road\" to light the fire.  Then we gave 3 shouts, and people came from every direction carrying the turf, furze, and oil.\n(continues on next page)\n", "school_info": "School: Ráithíní (Rehins)", "metadata": [{"Location:": "Rahans, Co. Mayo", "Teacher:": "\nMáirtín Ó Longáin\n"}, {"Collector": "Winnie Foody", "Gender": "female", "Address": "Ballynahaglish, Co. Mayo"}, {"Informant": "Mr John Foody", "Relation": "parent", "Gender": "male", "Address": "Ballynahaglish, Co. Mayo"}, {"Language": "English"}]}, "4428068/4374804/4456926": {"title": "Bonfire Night Long Ago", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0151, Page 162", "Page 162"], "url": "https://www.duchas.ie/en/cbes/4428068/4374804/4456926", "text": "\nAbout sixty years ago, I remember of a bonfire that was lighted at the Crossroads at Corroy, Backs, Co. Mayo.  A big fire was lighted, and the old people and the young people gathered round it, and said some payers at it first.They got a big pot, and all the people brought some milk with them.  They boiled the milk in the pot on the fire.  Every one brought a penny to buy some loaves.  The loaves were cut into the pot of milk, and they all had a good meal.After they had eaten, they were dancing and singing until twelve o clock that night.  When they were going home, they each brought a quenched coal out of the fire, and put it in their\n(continues on next page)\n", "school_info": "School: Ráithíní (Rehins)", "metadata": [{"Location:": "Rahans, Co. Mayo", "Teacher:": "\nMáirtín Ó Longáin\n"}, {"Collector": "Emily Flynn", "Gender": "female", "Address": "Ballyderg, Co. Mayo"}, {"Informant": "Mrs Bridget Callaghan", "Gender": "female", "Age": "90", "Address": "Ballyderg, Co. Mayo"}, {"Language": "English"}]}, "4428071/4375049/4457374": {"title": "Festival Customs - St John's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0151, Page 380", "Page 380"], "url": "https://www.duchas.ie/en/cbes/4428071/4375049/4457374", "text": "\nSt John's Day.The 23rd June is St John's day. It is customary with the people of this district to make a big fire, which is called a bonfire, because there is a bone in it. There is usually great fun at the bonfire. The old people as well as the young people attend at the fire. They put paraffin oil on a bag and throws it up in the air. Before the fire quenches each person says some prayers around the fire. Each householder brings a coal from the\n(continues on next page)\n", "school_info": "School: Droichead na Daoile", "metadata": [{"Location:": "Lackalustraun, Co. Mayo", "Teacher:": "\nMáire, Bean Uí Ghallchobhair\n"}, {"Collector": "Bridgie Eileen Rowland", "Gender": "female", "Address": "Tubbrid Beg, Co. Mayo"}, {"Language": "English"}]}, "4427911/4356969/4457642": {"title": "St John's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0113, Page 144", "Page 144"], "url": "https://www.duchas.ie/en/cbes/4427911/4356969/4457642", "text": "\nSt John's Day is on the 24th June and on the eve of that night there are lots on bonefires.At 9 o'clock in the evening the fire starts. Sometimes the fire is lit at a cross-roads or on hill tops.At 12 o'clock they quench the fire and each person brings a coal home and throws it into the tillage field and this brings a blessing on the crops and it also stops the blight from the potatoes. The old people say that Bone-fire is the wrong name and 'Bon fire' the right name which means 'Good fire'.\n", "school_info": "School: Teamhrán (B.)", "metadata": [{"Location:": "Tavraun, Co. Mayo", "Teacher:": "\nS. Mac Conmara\n"}, {"Language": "English"}]}, "4427931/4358464/4457707": {"title": "St John's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0117, Page 153", "Page 153"], "url": "https://www.duchas.ie/en/cbes/4427931/4358464/4457707", "text": "\nA big bonfire is made in the evening on some hill or cross-roads. The boys and girls collect turf from the neighbouring reeks of turf or the bogs. A bone is put in the middle of the fire - (usually the bone of an animal who died during the year) The youngsters enjoy themselves dancing and singing. When leaving the bonfire each one takes a live coal home for luck. Some throw the coal into the potato field.There is a custom of jumping the bonfire, to keep diseases from the cattle during the year, others drive the cattle between two bonfires for the same reason.\n\n\n\nA cock is killed in every house and the blood spilled in the four-corners of the house and in the outshot in honour of St. Martin.This must be done between November (Night) Day and St. Martins Day.\n(continues on next page)\n", "school_info": "School: Páirc Íseal (C.)", "metadata": [{"Location:": "Lowpark, Co. Mayo", "Teacher:": "\nSorcha Ní Dhumhnaigh\n"}, {"Language": "English"}]}, "4428107/4378894/4460288": {"title": "Local Belief and Customs - Bonfire Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0640, Page 39", "Page 39"], "url": "https://www.duchas.ie/en/cbes/4428107/4378894/4460288", "text": "\nBonfire or Bone-Fire night. 24th June. Fire lit. Ashes sprinkled in each field. Cattle driven three times round fire. Jumping over it. Bone put into it. A weed called moguard was put into it. Then this was brought home and put into thatch.\n\n\n\nTaking three sups of Easter water in name of Holy Trinity.  Easter water sprinkled in house and fields on May Eve.   Drop of Easter water put in first mash of bran given to a cow after calving.  Hair burned from cows udder with blessed candle when first milked after calving. Easter water put into first churn, into \"sciollain\". Kept in house for seven years and there is then a cure in it.\n\n\n\nCandle lit on Xmas eve and left lighting through night and next day. Prayers said when candle is lighting. It is lit by man of the House. Candles on All Souls night. One candle is supposed to be lit for each member of the family who is dead. Those candles do not be used for any other purpose. Sometimes 5 or 7 are only lit.\n\n\n\nThe door is left on the latch on Xmas eve. The fire is left lighting. The chimney is swept.\n", "school_info": "School: West Waterford Branch I.N.T.O", "metadata": [{"Location:": "Coshmore and Coshbride, Co. Waterford", "Teacher:": "\nJames Cashman\n"}, {"Collector": "James Cashman", "Gender": "male"}, {"Language": "English"}]}, "4428064/4374305/4464550": {"title": "The Bonfire Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0149, Page 366", "Page 366"], "url": "https://www.duchas.ie/en/cbes/4428064/4374305/4464550", "text": "\nThe Bonfire night is kept in honour of St John. It falls on the 23rd of June. A week before the Bonfire night the young people gather the fire. They light it at eight o clock. All the old people come to the fire. The young people bring melodions and flutes. When the fire is burned every one [sic] says a prayer in honour of St John. When they are leaving they bring a coal and throw it into their stalks.\n", "school_info": "School: Sruthán an Aifrinn", "metadata": [{"Location:": "Massbrook Lower, Co. Mayo", "Teacher:": "\nBríd Ní Mhóráin\n"}, {"Language": "English"}]}, "4428064/4374340/4464639": {"title": "The Bonfire Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0149, Page 401", "Page 401"], "url": "https://www.duchas.ie/en/cbes/4428064/4374340/4464639", "text": "\nThe bonfire night is kept in honour of Saint John. It falls on the 23rd of June. About eight o’clock the bonfire is lighted and they gather sticks and whins  for it. They generally light the bonfire on the sides of roads and mountains.\tThe people wait at the bonfire until about twelve o clock. When some people are leaving the bonfire they go round the fire three times and say their prayers.\tSome of them bring a coal with them and throw it into their stalks. It is the custom to put a bone in the fire.\n", "school_info": "School: Sruthán an Aifrinn", "metadata": [{"Location:": "Massbrook Lower, Co. Mayo", "Teacher:": "\nBríd Ní Mhóráin\n"}, {"Language": "English"}]}, "4427956/4360890/4465202": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0123, Page 129", "Page 129"], "url": "https://www.duchas.ie/en/cbes/4427956/4360890/4465202", "text": "\n(continued from previous page)\nby one who had some to spare, an extra amount would be given the day before.  Lighting the firs.  People do not like to light the fire early on May Day, lest the fairies see the smoke.  In case it is necessary to light it early, put a pieace of the Round- berry tree (called bush) in the fire.  This prevents the fairies seeing the smoke.  There is a belief that the fairies are out on the night before May-day.\n\n\n\n23rd June -  St John's night.This is bone-fire night. No one dances that night on account of the girl, who danced before the execution of John the Baptist. When people  are leaving the fire, they bring a lighted sod, and throw it into one's own field; the crops there will then be good.This custom is dying out.\n", "school_info": "School: Tomghéis", "metadata": [{"Location:": "Tumgesh, Co. Mayo", "Teacher:": "\nM. Ó Casaide\n"}, {"Language": "English"}]}, "4427966/4361864/4466869": {"title": "St John's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0125, Page 414", "Page 414"], "url": "https://www.duchas.ie/en/cbes/4427966/4361864/4466869", "text": "\nSt. John's Day falls on June 23rd. The boys and girls of the village come together and go around from house to house for turf. They get a bag of turf in each house. They make a fire of this turf which is called a \"bonfire\". They make this fire on top of a hill or at a crossroads. This is the way they light it. They spill some paraffin oil on a few of the sods of turf. Then they light the fire with matches. They put a bone into the fire and this is why it is called a \"bonfire\" or sometimes it is called a \"bonefire\". Someone of the crowd brings a voilin with him and they have a dance. They sit round the fire on stones and they start shouting and clapping their hands as they see the flames going up in the air. They  stay there until two or three o'clock in the morning. When they  are going home each  person takes a coal or a half burnt sod with him and throw it into someone of their fields to bring\n(continues on next page)\n", "school_info": "School: Clún na Gaoithe", "metadata": [{"Location:": "Cloongee, Co. Mayo", "Teacher:": "\nPádraig Ó Héaráin\n"}, {"Informant": "Thomas Molloy", "Relation": "unknown", "Gender": "female", "Address": "Toomore, Co. Mayo"}, {"Language": "English"}]}, "4427982/4363706/4468802": {"title": "Lá Fhéile Stiofáin", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0129, Page 227", "Page 227"], "url": "https://www.duchas.ie/en/cbes/4427982/4363706/4468802", "text": "\n(continued from previous page)\nagus tom leo é gléasta suas le paipear daiththe agus ribíní daithte. Téigheann siad go gac teach agus deireann siad rann agus tabhaireann na daoine airgead dóibh.An RannDreolín, dreolín Rí na n-éanLá’il Stiopáin ceapadh mé.Éirigh suas a bhean a tighe,Caith an donacht as do chroidheAgus tabhair cúpla pighinn don dreoilínFado ó shoin bhíodh na buachailli ag dul thart le málai ag iarraidh aráin.\n\n\n\nLá Nodlag BeagSé an chéad lá den bliadhain úr é agus deireann na daoine nach ceart uisge salach a caitheadh amac agus nach cóir rud ar bith a thabhairt isteach taréis dul faoi don gréin, go mór mór uisge, mar deireann na daoine go dtionnuigheann sé isteach i fuil é oidhche Nodlag beag.\n\n\n\nSgéalBhí bean ann fado agus chuala sí go dtionnuigheann an t-uisge isteach i fuil. Thug sí isteach canna uisge tar éis dul faoi don gréin. Nuair a thainig sí go dtí an doras chonnaic sí gur fuil a bhí ann agus tógadh suas í agus caiteadh isteach san canna agus bathadh í. Ón lá sin amac bhí mí-adh agus annro san teach sin.\n\n\n\nOidhche Seáin – Bíonn teine cnámh ag gac duine in onoin Naomh Seán\n", "school_info": "School: Droimslaod", "metadata": [{"Location:": "Drumsleed, Co. Mayo", "Teacher:": "\nMaire, Bean Mhic Suibhne\n"}, {"Collector": "Róise Ní Thachair", "Gender": "female"}, {"Informant": "Bean Ui Tachair", "Relation": "grandparent", "Gender": "female", "Age": "86", "Address": "Ballycroy, Co. Mayo"}, {"Language": "Irish"}]}, "4427995/4365715/4468815": {"title": "An Inid", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0132, Page 176", "Page 176"], "url": "https://www.duchas.ie/en/cbes/4427995/4365715/4468815", "text": "\n'Sí an Inid an tráth de'n bhliladhain ó'n lá deiridh de Nodlaig go dtí Céadaoin an luaithridh. Tá an t-am seo leagtha amach le h-aghaidh pósadh agus caitheamh ainsire de gach saghas. Tugtar Máirt na h-Inide ar an lá deiridh de'n Inid. Déanann muintetear na h-áite seo trosgadh ó feóil an lá sin. Bíonn cácaí  friochtáin againn le h-aghaidh an tae. Ní imrigheann na daoine cártaí ná ní bhíonn caitheamh aimsire ar bith aca an oidhche sin. Níor chualaidh na sean-daoine fá caitheamh salainn ar na buachaillí óga agus ar na cailíní óga annseo ariamh fé mar atá i n-áiteacha eileBríghid Ní FhlannghaileRang a VII\n\n\n\nDéantar teine cnámh ag an gcros bhóthar nó i n-aice an tighe. Tagann na cómharsannaí ar fad agus deireann siad an paidrín ag siubhal thart timcheall na teine. Tugann gach duine splannc leis agus caitheann sé isteach sa mbárr fataí no coirce é. Creideann siad go gcuireann sé feabhas ar an mbárr.\n", "school_info": "School: Gleann Cuileann", "metadata": [{"Location:": "Glencullin Lower, Co. Mayo", "Teacher:": "\nMáire Ní Loinn\n"}, {"Language": "Irish"}]}, "4427982/4363711/4468820": {"title": "Oíche San Seán", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0129, Page 231", "Page 231"], "url": "https://www.duchas.ie/en/cbes/4427982/4363711/4468820", "text": "\nOidhche San SeánBíonn teine cnámh ag gach teach an oidhche sin. Nuair a bhíonns an teine muctha tógann fear a’ tighe aitheann agus caitheann sé isteach san móinfhéar é.\n\n\n\nNaomh PádhraicNuair a bhí Naomh Pádhraic ar a bhealach trid Muigheo thainig sé go Tir an Áir in aice le Maolreathnaigh. Casadh bean leis ag iomchar dhá channa uisge. D’iarr sé deoc uirthe. Dubhairt sí leis dul go dtí an tobar agus é fhághail. Ní thug sé aon áird uirthi acht lean sé ag siubhal no go sroic se Baile Garbhán i Baile Cruaidh.Thainig sé go teach agus d’iarr sé deoch. Chuaidh bean a’ tighe amac agus bhligh sé na ba. Nuair a thainig sí isteach thug sí deoc bhainne dó agus thug sé a bheannacht dí agus dubhairt sé“Go raibh a dhá oiread ime i Baile Garbháin agus atá in Tír an Áir”.Ón lá sin amac bhí an oiread ime ag muinntir Baile Garbhán a raibh dhá bhó aca is do bhí ag muinntir Tír an Air a raibh ceithre bó aca.\n", "school_info": "School: Droimslaod", "metadata": [{"Location:": "Drumsleed, Co. Mayo", "Teacher:": "\nMaire, Bean Mhic Suibhne\n"}, {"Collector": "Seamas O Dálaigh", "Gender": "male"}, {"Language": "Irish"}]}, "4427999/4366302/4469234": {"title": "Seanscéal - Buachaill an Dea-Chroí", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0133, Page 271", "Page 271"], "url": "https://www.duchas.ie/en/cbes/4427999/4366302/4469234", "text": "\n(continued from previous page)\nbuachaill annsin fá dhéin na tuismuigheóra agus tainiceadar chuige agus mhaireadar uile í seilbh na h-áite sin ar feadh í bfhad.\n\n\n\nTaghann Lá t-sín Seáin ar an gceathramhad la fichead de Mheitheamh bíonn teine mhór cnáimh acha an oidhche sín ag gach teach.Timcheall is seachtmáin roimh Lá t-sin Seáin teigheann na páiste amach agus bailigheann siad go leor rudaí.Bailigheann\n(continues on next page)\n", "school_info": "School: Beannchor Iorrais", "metadata": [{"Location:": "Bangor, Co. Mayo", "Teacher:": "\nMícheál Mac Énrí\n"}, {"Collector": "Brighid Nich Énrí", "Gender": "female", "Address": "Bangor, Co. Mayo"}, {"Informant": "Bean Uí Coscair", "Relation": "not a relative", "Gender": "female", "Address": "Bangor, Co. Mayo"}, {"Language": "Irish"}]}, "4427984/4363918/4469372": {"title": "Pisreogaí", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0129, Page 418", "Page 418"], "url": "https://www.duchas.ie/en/cbes/4427984/4363918/4469372", "text": "\nTá   fad coiscéim coillig ar a' lá.- Ar lá Nodlag Beag a déarfadh siad é sin, nuair a bhéadh síneadh a teacht ar an lá.\n\n\n\nB'fhírinní Brighid h-éin na PádhraicSin sean-rádh atá aca annseo agus eo mar a tháinic sé:-Dubhairt Naomh Brighid aon am amháin:\"Ch aon darna lá ó mo lá-sa amach beidh sé go maith\"Dubhairt Naomh Pádraic:\"Chuile lá ó mo lá-sa amach beidh sé go maith\"Ní raibh an fhírinne age duine a bith acaach ba chirte Brighid.\n\n\n\nAn fáth    atá leis na teinntí crámh an oidhche sin:-Fadó bhíodh ar gach teach in Éirinn saighdiúir de chuid Shasannaí a choinneáil agus a thógáil i rith na bliana. Chruinnigh na daoiní annsin le chéile agus rinne siad margadh\n(continues on next page)\n", "school_info": "School: Gleann Caisil", "metadata": [{"Location:": "Glencastle, Co. Mayo", "Teacher:": "\nEoghan Ó Súilleabháin\n"}, {"Informant": "Liam Ó Raghallaigh", "Gender": "male", "Age": "45", "Address": "Doolough, Co. Mayo"}, {"Language": "Irish"}]}, "4427991/4364993/4469427": {"title": "Oíche Fhéile Bríde", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0131, Page 194", "Page 194"], "url": "https://www.duchas.ie/en/cbes/4427991/4364993/4469427", "text": "\n(continued from previous page)\nuair amháin agus nár chuimhnigh siad an brat do chur amach. Nuair a bhí siad ag ithe a suipéir le dul a chodladh, thainic torann beag ag an doras. Chuaidh an bhean síos gur oscail sí é. Thainic Naomhm Brighid isteach agus d'fhiafruigh sí díobhtha tuige nár chur siad an brat amach. Nuair a bhí siad le freagra a thabhairt bhí sí imthighthe. Chuaid an bhean amach leis an mbrat, ach ní raibh Brigid le feiceáil.Pádraig Ó GallchobhairCorrán Buidhea d'innisBrighid Ní Ghallchobhair a scríobh.\n\n\n\nTigeann Oidhch 'l tSin Seáin ar an tríomhadh lá fichead de Mheitheamh. Timcheall trí seachtmhainí roimhe sin tagann na páistí an bhaile uilig le chéile\n(continues on next page)\n", "school_info": "School: Ceathrú Thaidhg", "metadata": [{"Location:": "Carrowteige, Co. Mayo", "Teacher:": "\nPádraig Mag Shamhráin, Pádhraic Ó Gacháin\n"}, {"Collector": "Éamonn Ó Muireadhaigh", "Gender": "male", "Address": "Curraunboy, Co. Mayo"}, {"Informant": "Mártan Ó Muireadhaigh", "Relation": "parent", "Gender": "male", "Age": "45", "Address": "Curraunboy, Co. Mayo"}, {"Language": "Irish"}]}, "4427991/4364995/4469429": {"title": "Oíche Fhéile tSin Seáin", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0131, Page 196", "Page 196"], "url": "https://www.duchas.ie/en/cbes/4427991/4364995/4469429", "text": "\n(continued from previous page)\nreathaidh thart air.Nuair a bhíos an teine laguithe  anuas téigheann siad ag cur gualach (gual na gcrompán dóighte)  ar a chéile agus bíonn an-spóirt acú. Nuair a bhíonn siad ag dul abhaile tugann gach duine crompán leis a bhíons gar do bheith dóighte agus caitheann sé isteach ins na fataí é. *Éaomonn Ó MuireadhaighCorrán Buidhe  a scríobhA athair (Mártan) a d'innis.*   Caithtear na crompáin leath-dhóighte seo isteach ins na gais agus ins an choirce.\n\n\n\nAn lá roimh Aoil tSin tSeáin cruinnigheann na páistí cáirseán (cársán)  teara, giumhsach, fraoch, aitinn, ola, agus móin. Cuirtear an mhóin agus na h-aitinní síos i dtosaeach, agus nuair\n(continues on next page)\n", "school_info": "School: Ceathrú Thaidhg", "metadata": [{"Location:": "Carrowteige, Co. Mayo", "Teacher:": "\nPádraig Mag Shamhráin, Pádhraic Ó Gacháin\n"}, {"Collector": "Liam Ó Dochartaigh", "Gender": "male", "Address": "Portacloy, Co. Mayo"}, {"Informant": "Liam Ó Burnách", "Relation": "grandparent", "Gender": "male", "Age": "80", "Address": "Portacloy, Co. Mayo"}, {"Language": "Irish"}]}, "4428016/4368437/4471719": {"title": "Festival Customs - May Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138, Page 109", "Page 109"], "url": "https://www.duchas.ie/en/cbes/4428016/4368437/4471719", "text": "\n(continued from previous page)\nan altar in the home and put fresh flowers on it regularly during the month.\n\n\n\nJune 23rd the bonfire is lighted in each village. The children gather turf from house to house. They sit round the big fire and tell stories A bone is thrown into the middle of the fire. Before they leave some of the ashes is scattered into the fields where the crops are growing.\n\n\n\nThe first goose is killed for this day's dinner to honour St. Michael.\n\n\n\nThis is a night of great amusement. The children here look forward to it with great delight. They have barm-brack with the ring for supper. Diving for apples and snap apple are played. The old trick of the three saucers with ring, clay and water is common in the district. Nuts are burned too. When the amusement in the home is over some of the boys go through the village and throw cabbage stalks at the doors. I don't know what is the origin of this last trick. The púca is supposed\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire, Leac an Anfa, Cathair na Mart", "metadata": [{"Location:": "Leckanvy, Co. Mayo", "Teacher:": "\nAn tSr. Treasa\n"}, {"Language": "English"}]}, "4428000/4366516/4473506": {"title": "Lá Fhéile Seáin", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0133, Page 486", "Page 486"], "url": "https://www.duchas.ie/en/cbes/4428000/4366516/4473506", "text": "\nTuiteann La Fhéil Seáin ar an tríomhadh lá ficheadh de Mheitheamh. Deireann na sean daoine gurab é sin an lá is fuide sa mblidhan agus ná ceart é a chaitheamh díomhaoin nó droch ghnóthach. Tugtar oichche Fhéil' Seáin ar an oidhche roimh Lá Fhéil' Sheáin. Deantar teine crámh an oidhche sin i ngach baile lé onóir  a thabhairt do Sheán. Cúpla seachtmhain roimh ré bíonn aos óg na tíre gnaitheach ag bailiúghadh stumpaí giúsaighe aitinn agus blocáin. San oidhche a théigheann siad amach ag bailiúghadh na rudaí seo mar is iomdha ceann a ghoideann siad ar na cómharsanaibh agus nach maith\n(continues on next page)\n", "school_info": "School: Dubhloch", "metadata": [{"Location:": "Doolough, Co. Mayo", "Teacher:": "\nEibhlín Bean Uí Shioradáin\n"}, {"Language": "Irish"}]}, "4428037/4370946/4474422": {"title": "A Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0143, Page 073", "Page 073"], "url": "https://www.duchas.ie/en/cbes/4428037/4370946/4474422", "text": "\nBon fire night is the twenty third of June. It is called St. John's night. People gather turf and sticks and old straw to make a big Bon fire on the highest hills they can get. In places they wait out nearly all the night playing music and dance round the fire.Long ago the people big and small used to go round the fire three times saying their prayers and it was only the best one that could steal the first coal out of the fire for to put in their potatoes to have the best crops\n", "school_info": "School: Teampall Mhuire", "metadata": [{"Location:": "Carbad Beg, Co. Mayo", "Teacher:": "\nEithne, Bean Uí Mhaonghaille\n"}, {"Collector": "Bridie Howard", "Gender": "female", "Address": "Killala, Co. Mayo"}, {"Informant": "Mrs Howard", "Gender": "female", "Address": "Killala, Co. Mayo"}, {"Language": "English"}]}, "4428026/4369435/4475235": {"title": "St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0140, Page 143", "Page 143"], "url": "https://www.duchas.ie/en/cbes/4428026/4369435/4475235", "text": "\nThis falls on 10th November.A very old custom is still kept that of spilling blood for St Martin's to commerorate his martyrdom. This is done in every household before the 10th as there is an old belief that St Martin will accept the sacrifice before but not after the Eve of the 10th. It is considered that ill luck will those who do no properly observe this old custom.\n\n\n\nThis occurs at the Summer Solistice. This is called \"Bonfire Night\" each has put forth her best and most beautiful, and there is a spirit of thanksgiving in the hearts of the people.\n(continues on next page)\n", "school_info": "School: Ballycastle Boys'", "metadata": [{"Location:": "Ballycastle, Co. Mayo", "Teacher:": "\nMícheál de Búrca\n"}, {"Collector": "Dan Lenihan", "Gender": "male", "Address": "Ballycastle, Co. Mayo"}, {"Informant": "Mrs Polke", "Gender": "female", "Age": "63", "Address": "Ballinglen, Co. Mayo"}, {"Language": "English"}]}, "4428287/4391915/4478658": {"title": "Bonfire Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1036, Page 132", "Page 132"], "url": "https://www.duchas.ie/en/cbes/4428287/4391915/4478658", "text": "\nBonfire night is a celebrated feast throughout the country. It is on the twenty third of June. The old people used to call it \"Oidhche Fhéil Eoin\", but nowadays the people call it \"Midsummer Night\".The people always expect a change of weather at midsummer. If the weather is good up to midsummer they think that it will then change and that a bad harvest will follow. This year the weather is bad and the people are waiting anxiously for a change at midsummer because they think we will then have a good, dry, harvest.The young people make preparations for bonfire night. They gather turf, sticks, shavings and fir. They light the fire a little after sundown. Generally there is a fire at every house and on a small hill a large fire is lighted. The young people gather to this large fire later.\n(continues on next page)\n", "school_info": "School: Na Frasa", "metadata": [{"Location:": "Frosses, Co. Donegal", "Teacher:": "\nSeán Mac Robhartaigh\n"}, {"Collector": "Sean Kelly", "Gender": "male", "Age": "12", "Address": "Roes, Co. Donegal"}, {"Informant": "Michael Gallagher", "Gender": "male", "Age": "75", "Address": "Roes, Co. Donegal"}, {"Language": "English"}]}, "4428268/4390161/4478993": {"title": "Bonfire Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1031, Page 357", "Page 357"], "url": "https://www.duchas.ie/en/cbes/4428268/4390161/4478993", "text": "", "school_info": "School: Baile Mhic Dáibhid (Ballydevitte)", "metadata": [{"Location:": "Ballydevitt Beg, Co. Donegal", "Teacher:": "\nCathal Mac  an Luain\n"}, {"Collector": "Patrick J. Muldoon", "Gender": "male", "Age": "12", "Address": "Doonan, Co. Donegal"}, {"Informant": "Seosaibh Ó Maoldúin", "Relation": "unknown", "Gender": "male", "Occupation": "saor adhmaid", "Address": "Doonan, Co. Donegal"}, {"Language": "English"}]}, "4480654/4408371/4480739": {"title": "Bonfire Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1083, Page 111", "Page 111"], "url": "https://www.duchas.ie/en/cbes/4480654/4408371/4480739", "text": "\nBonfire Night is an Annual Festival held by all the young people. In olden times this was an outstanding festival when all the young people gathered around at the crossroads or some other place, where a bonfire was lit and a dance was held and all made merry. But now there customs  have fell through except some small boys who gather together and set all the whin hedges on fire, and if one looks out on May Eve or Bonfire Night one, will see the country side all ablaze and also see the boys running with pieces of lighted sticks from one place to another until in the end you would think the whole country is burning as the smoke and sparks fly skywards while the children cheer until they are hoarse, and try their best to keep all the fires burning at the same time.Some people say that May Eve bonfire is a protestant celebration in connection with\n(continues on next page)\n", "school_info": "School: Naomh Colmcille, Leitir Cheanainn", "metadata": [{"Location:": "Letterkenny, Co. Donegal", "Teacher:": "\nAn Mháthair Ignatius Ní Bhroin\n"}, {"Collector": "Francis Harkin", "Gender": "female"}, {"Language": "English"}]}, "4428319/4394460/4481932": {"title": "Féilí na Bliana - Oíche Fhéile Eoin", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1043, Page 328", "Page 328"], "url": "https://www.duchas.ie/en/cbes/4428319/4394460/4481932", "text": "\nIs é an nós atá ag na daoine oidhche Fhéil' Eoin teine a chur amach gach bliadhain. Nuair a théighimid abhaile ó'n scoil an tráthnóna sin túsuigheann ag cruinniughadh féir agus sean cócáin agus cipíní agus raithneach agus gach rud a dtig linn greim a fhághail air. Nuair a thigheann 10 a chlog nó mar sin cuireann muid amach an teinidh i n-áit eighinteacht. Bheir muid amach aibhleóg agus braon beag ola agus lasann muid an teinidh. Éirigheann na bladhairí suas go h-árd leis an spéir annsin. Nuair a bhíos an bladhairí ag gabhail síos cuireann muid tuilleadh adhbhair teineadh isteach ins an teinidh. Nuair a bhíos an teinidh lásta againn imireann muid thart fán teine. Nuair a bhíos ár sáith imirthe againn téigheann muid abhaile agus cuireann muid amach an teine. Sin an nós atá aca Oidhche Fhéil’ Eoin.\n\n\n\nIs é an nós atá ag na daoine lá Bhealtaine gráinín de lusta bhuidhe Bealtaine a chaitheamh ag gach doras agus fuinneóg atá ar an teach. San tráthnóna téigheann na daoine amach ag cruinniughadh lusta bhuidhe Bealtaine. Nuair a thigheann siad abhaile caitheann siad gráinín ag gach doras agus fuinneóg atá ar an teach\n(continues on next page)\n", "school_info": "School: Mucros", "metadata": [{"Location:": "Muckros, Co. Donegal", "Teacher:": "\nAodh Ua hEigeartaigh\n"}, {"Informant": "Máire Ní ", "Relation": "unknown", "Gender": "female", "Age": "46", "Address": "Kilcar, Co. Donegal"}, {"Language": "Irish"}]}, "4428316/4394123/4482701": {"title": "Féilí na Bliana - Lá Fhéile Pádraig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1042, Page 339", "Page 339"], "url": "https://www.duchas.ie/en/cbes/4428316/4394123/4482701", "text": "\nLá'l PádraicBa mhór an lá é seo ins an cheanntar seo roimhe seo. Chuir mé síos  moran fa dtaoibh de nuair a scríobh mé fa Druimnafionaigle.Bhí droch-chleachtadh ar an lá sin comh maith leis an déagh rud. Bhíodh dream beag agus shaoileadh (?) siad nar cóir an lá seo a leigint thart gan  an seamróg  a bháitheadh. Is furast leithscéal  fhagháil nuair atá mian ag duine an rud a dheanadh.\n\n\n\nBíonn teintreacha amuigh ag na daoine ar an oidhche seo (Meitheamh 23adh). Bíonn ceann mór in gach uile bhaile. Cuireann siad an teine ar an bhall is airde sa bhaile sa dóigh go mbéidh sí le feiceail ag na bailtibh uilig thart, bíonn na bailte annsin uilig ag dréim cia aca a bheás an ceann is mó.Cruinnigheann an t-aos óg thart fá'n teine go mbíonn sé mall san oidhche agus mar bhfuil callan agus gleo annsin ní lá go fóill é.Cúpla ar bith atá mór le chéile agus a bhfuil súil aca gabhail i gcionn an t-saoghail gan mhoill b'fearra daobhtha fanacht amach  ua'n soluis na geobhaidh siad Tally ho ar an teine.Cuireann an t-sean bhunadh  teine bheag daobhtha féin taob' amuigh de'n teach agus deireann siad\n(continues on next page)\n", "school_info": "School: Cill Chartha", "metadata": [{"Location:": "Kilcar, Co. Donegal", "Teacher:": "\nEighneachan Ó Muireadhaigh\n"}, {"Language": "Irish"}]}, "4428332/4396152/4484445": {"title": "Customs - St John's Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1048, Page 198", "Page 198"], "url": "https://www.duchas.ie/en/cbes/4428332/4396152/4484445", "text": "\nBonfires were lighted on St John's eve. Nearly every house had a little bonfire.The young people of a townland also assisted in gathering material for one real big bonfire, where all gathered round. Many sports and pastimes were indulged in round the fire. When the fires had burned out, those present took away the burned cinders and scattered them through the fields of growing crops.This was believed to bring \"good luck\" and prosperity.\n", "school_info": "School: An Tulach Mór", "metadata": [{"Location:": "Tully More, Co. Donegal", "Teacher:": "\nMáire, Bean Uí Bhrisleáin\n"}, {"Collector": "John Mc Hugh", "Gender": "male", "Age": "12", "Address": "Tullycleave Beg, Co. Donegal"}, {"Language": "English"}]}, "4428377/4401309/4492702": {"title": "Féilte na Bliana - Oíche Fhéile Eoin", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1062, Page 294", "Page 294"], "url": "https://www.duchas.ie/en/cbes/4428377/4401309/4492702", "text": "\nBíonn Oidhche Fhéil Eoin ar an 23 adh lá de Mheitheadh. Bíonn teinidh ag gach aon dhuine an oidhche sin. Bíonn na daoine amuigh ag cruinniughadh cupla lá roimhe an teinidh.Cuireann siad an teinidh suas ar an áit is airde acu. gearann siad crainn agus mórán rudaí nach bhfuil maith ar bith ann.Nuair a bhíonn sé ag éirighe dorcha lastar an teinidh. Bíonn na daoine ag scairtigh comh láidir as tígh leobhtha ag deanamh amach go mbéadh gach aon dhuine. ag amharc ar a d'teinidh s'aca fhéin. Rachaidh gach aon dhuine síos ar a nglúine agus a deirfidh siad paidir. Nuair a bhíos an teinidh uilig dóighte bheirfidh gach aon dhuine aibhléog leobhtha agus caithfidhe siad isteach ins na préatai é fa choinne adh mhaith a bheith ortha.  In onoir Naomh Eóin a bhíonn an teinidh acu.\n", "school_info": "School: Leitir", "metadata": [{"Location:": "Templecrone, Co. Donegal", "Teacher:": "\nProinsias Ó hEachaidh\n"}, {"Collector": "Gráine Ní Chnáimhsighe", "Gender": "female"}, {"Language": "Irish"}]}, "4428244/4388111/4510800": {"title": "St John's Eve - Bonfire Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0799, Page 302", "Page 302"], "url": "https://www.duchas.ie/en/cbes/4428244/4388111/4510800", "text": "\nBonfire night was always celebrated in the Farney District.  The scene of celebrations was usually a crossroads.  A fire of old sticks and whines was kindled in the centre of the triangular green patch.  The boys and girls partaking in the celebrations sat around the fire and whiled away the hours in telling stories and singing songs.\n", "school_info": "School: St Peter's, Phibsboro", "metadata": [{"Location:": "Phibsborough, Co. Dublin", "Teacher:": "\nSs. Breathnach\n"}, {"Language": "English"}]}, "4427830/4348245/4511394": {"title": "The Bonfire Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0094, Page 384", "Page 384"], "url": "https://www.duchas.ie/en/cbes/4427830/4348245/4511394", "text": "\nThere is a lot of customs about the bonfire night. Most people look forward to the bonfire night. It is an old custom with the people to leap over the fire before they go home. It is another custom with the people to get a snail and throw him in the potatoes so they would grow. They also get a coal of fire and throw it in the crops so that none of them would fail. They also dance around the fire and play music. It is not right for the to have a bonfire if  they have no bone in it.Some people say that it is not right to come to the bonfire unless you bring a sod of turf. It is an old custom with the people not to quinch the fire when they are going home. Nearly all the people try to have their turf dry for the bonfire.\n\n\n\nThere is a lot of customs about the days of the year. If you wash your face on May morning with the dew you will have no freckles for the\n(continues on next page)\n", "school_info": "School: Belcarra (Buachaillí)", "metadata": [{"Location:": "Ballycarra, Co. Mayo", "Teacher:": "\nSeosamh Ó Heireamhóin\n"}, {"Collector": "John Mac Donnell", "Gender": "male", "Address": "Ballycarra, Co. Mayo"}, {"Informant": "Patrick Mac Donnell", "Relation": "parent", "Gender": "male", "Age": "40"}, {"Language": "English"}]}, "4428394/4403839/4514064": {"title": "Oíche Fhéile Eoin", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1069, Page 288", "Page 288"], "url": "https://www.duchas.ie/en/cbes/4428394/4403839/4514064", "text": "\nCoidcís roimh an oidhche sin is gnáthach le aos-óg na h-áite seo gach uair díomhaoin a chathaimh ag cruinniú smután is grágann go dtí áiteacha áirighthe mar chrois bhótair agus i n-amanna ar bharraibh na gcnoc le teine Feil' Eóin a lasadh ar an oidhche sin. Is minic iad féin agus na seandaoine ag troid le chéile mar rinne na seandaoine usáid de mhaidí phoill agus de ghrágain le claidheacha a thógail fá n-a gcuid páirceanna agus nuair a théidh an aos óg a chruinniú ádhbhar teineadh is minic a bheir siad leo na maidí seo.Ag dul o sholus oidhche Feil' Eóin cruinnigheadh buachaillí agus cailíní agus lastar na teinte seo agus nuair a bhíos sí ag dóghadh i gceart toisigheann an greann agus an chuideachta agus an damhsa. Nuair a bhíos siad tuirseach ag an obair sin, tiomanan baicle aca leó agus maidí ar lasadh\n(continues on next page)\n", "school_info": "School: Gort an Choirce", "metadata": [{"Location:": "Gortahork, Co. Donegal", "Teacher:": "\nSéamus Mac Giolla Easbuic\n"}, {"Language": "Irish"}]}, "4493684/4410501/4524590": {"title": "Bonfire Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1090, Page 354", "Page 354"], "url": "https://www.duchas.ie/en/cbes/4493684/4410501/4524590", "text": "\nThe 23rd June is Mid Summer Eve. On that night we see Bonfires on all the hills.This custom has come down to us from the time the Irish were Pagans and worshipped the Sun.It was not the people of Ireland alone put up Bonfires.The people of Sweden and Norway put up Bonfires too. The people of Sweden and Norway go up to hills and put up Bonfires and play a melodeon and they dance to it.Those people do not see the sun for many months. They are so glad to catch a glimpse of the sun once more that they welcome it with fires, songs and dances.The custom still remains in Ireland of lighting fires on the tops of hills in honour of the sun.The people say that the sun is worthy of honour, for if its light was withdrawn, it would mean an end of all vegetable and animal life on this earth.On midsummer night the ancient Irish had a belief which still\n(continues on next page)\n", "school_info": "School: Tamney (Robertson)", "metadata": [{"Location:": "Tawny, Co. Donegal", "Teacher:": "\nMrs Kyle\n"}, {"Collector": "Sarah Thompson", "Gender": "female", "Age": "12"}, {"Informant": "Hugh Thompson", "Relation": "parent", "Gender": "male", "Age": "67", "Address": "Moross, Co. Donegal"}, {"Language": "English"}]}, "4493706/4412958/4528676": {"title": "Good Friday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1096, Page 329", "Page 329"], "url": "https://www.duchas.ie/en/cbes/4493706/4412958/4528676", "text": "\n(continued from previous page)\nold people to put in a little of each crop that evening to bring a blessing on their share for the year - a few potatoes onions etc were always set on that day.\n\n\n\ncalled locally \"bonfire night\". The custom of lighting bonfires is dying out.The old people used to send the younger members with burning brands from the bonfire to each field in which a crop was planted — the blazing branch was flung into the fields and the crops were not supposed to 'do any good' unless and until this was done. If any crop were doing badly the old people were wont to say \"Wait till after bonfire night — you will see a change for the better after it.\"\n", "school_info": "School: Dubhais", "metadata": [{"Location:": "Dooish, Co. Donegal", "Teacher:": "\n-\n"}, {"Language": "English"}]}, "4493761/4417782/4531815": {"title": "Bonfire Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1112, Page 411", "Page 411"], "url": "https://www.duchas.ie/en/cbes/4493761/4417782/4531815", "text": "\nBonfire nightOn the bonfire night the custom is to light a fire, and to pray at it, and jump over it three times. When people would be driving home the cows, someone would hit each cow with a coal. This is an old Pagan custom and this is supposed to bring goof luck on the cows. It is done sometimes yet, but it used to be always the custom, and another custom was to throw a coal into each field. This was to bring good luck on the crops, and it is done sometimes yet.And as well as having one big bonfire for every townland, each house as well as that has its own bonfire. At dusk a wee pile of turf is made in the garden or field and hot coals are brought from the kitchen fire to light them. This fire is always lit near where the cows will pass at milking time and a blazing turf is pitched after each cows as she goes by. After that the fire is scattered and let die.The people used meet at the big bonfire in Desertegney till about 25 years ago. They danced and sang and tried to jump over the fire for luck. They don't do that now.\n", "school_info": "School: St Egney's (C.), Buncrana", "metadata": [{"Location:": "Buncrana, Co. Donegal", "Teacher:": "\nEllen Daly\n"}, {"Collector": "Sadie Doherty", "Gender": "female", "Address": "Glebe, Co. Donegal"}, {"Informant": "Neil Mc Laughlin", "Gender": "male", "Age": "68", "Address": "Glebe, Co. Donegal"}, {"Language": "English"}]}, "4493771/4418744/4534303": {"title": "May Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1114, Page 302", "Page 302"], "url": "https://www.duchas.ie/en/cbes/4493771/4418744/4534303", "text": "\n(continued from previous page)\nsometimes mayflowers are placed in the form of a heart on the doorstep. The white ribbon which ties the pole is supposed to be a cure for a sore head.\n\n\n\nOn St. John's Eve a great fire is made of logs of fir and sticks. When the fire is lighted the people dance beside it and the  play many musical instruments. It is customary for them to stay out very late singing and dancing. When the fire is nearly dead the cows and horses are driven around it as it said that this brings a blessing on them. A coal is then taken from the fire and placed in each of the field, and the ashes are also scattered through them and it is believed that there are better crops when this is done. A burning\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire, Carn Domhnaigh", "metadata": [{"Location:": "Ballylosky, Co. Donegal", "Teacher:": "\nAn tSr. M. Beirín Ní Bhaoighill\n"}, {"Language": "English"}]}, "4493776/4419626/4535154": {"title": "Hallow-Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1116, Page 74", "Page 74"], "url": "https://www.duchas.ie/en/cbes/4493776/4419626/4535154", "text": "\n(continued from previous page)\nThen when the moon begins to wane, and stars are growing dimmer,They know that dawn’s approaching, that ere day they must disband.Oe’r dewy meads and moors they group as dawn begins to glimmer—Back to their homes, in hill and glen, scattered throughout the land.\n(continues on next page)\n\n\n\nBonfire Night(1)The evening shades are falling, and the summer sun's gone down,A grey mist's creeping lazily across the bogland brown,Come! let us hasten, ere it's late, to gather peat and whins;There's plenty bog-wood on the moor and turf on Arnaduns,We'll bring them to the usual spot on Ned O'Donnell's Height,For our town shall not be behind upon a Bonfire Night!(II)Sure, willing hand to help us, soon, will come from many a part;And Micky's John has promised us to his horse and cart:Yonder comes John, with horse and cart, down\n(continues on next page)\n", "school_info": "School: Glassalts", "metadata": [{"Location:": "Glasalt or Treanfasy, Co. Donegal", "Teacher:": "\nM. P. Ó Dochartaigh\n"}, {"Language": "English"}]}, "4493776/4419270/4535284": {"title": "Feast and Festivals - Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1116, Page 122", "Page 122"], "url": "https://www.duchas.ie/en/cbes/4493776/4419270/4535284", "text": "\n(continued from previous page)\nHere a fire is put on and eggs are boiled and eaten. Each child brings his own eggs. Afterwards they play together.\n\n\n\nThis a great day for playing jokes on people\n\n\n\nOn the last evening of April it is usual to erect a \"May Pole\". Sometimes it is put up in the \"Doiche all\"  (manure-heap) or in a garden or at an entrance to house. A fork, graip, or long stick  put standing and on top a whin bush in blossom is placed. Below this May flowers and primroses are tied around the stick. The children play around the May Pole. It is taken down next day.\n\n\n\nThe people used to gather sticks, fir blooks and turf so as to have a big Bonfire in every townland. All the people both young and old would gather out to the Bonfire and they would sing and dance until the morning. When putting in the cows it was the custom to throw a \"coal\" from the Bonfire after them to bring good luck. Some people would throw a \"coal\" into a field of their corn to bring a good harvest. There used to be a Bonfire in every townland. Some of the boys from the townland would go to the neighbouring townlands and would try to steal a burning.....( In some townlands a dozen men with big sticks guarded the.....)\n(continues on next page)\n", "school_info": "School: Glassalts", "metadata": [{"Location:": "Glasalt or Treanfasy, Co. Donegal", "Teacher:": "\nM. P. Ó Dochartaigh\n"}, {"Language": "English"}]}, "4493795/4421393/4540192": {"title": "The Bonfire Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1121, Page 120", "Page 120"], "url": "https://www.duchas.ie/en/cbes/4493795/4421393/4540192", "text": "\nEverybody has a fire on the 23 June in honour of St. John. On the evening of the bonfire night all the boys in the town gather and gather a lot of bushes. In a big town all the boys go round and collect money and buy oil for the fire. Just when it is getting dark everybody light the fire. An old custom they had everybody puts out a little fire of their own and as the cows are going in at night they throw a coal over the cows backs and they put a coal into every field belonging to them for St. John to bless them. They would lift sticks no matter where they would get them, if you would have any bushes on a slap to keep in cattle you would need to be up and out very early because all the bushes would be away. There was a man who had a lot of fir and it was coming on to the bonfire night all the people gathered and made themselves in two groups and the man and his wife were out watching the fir. There were two doors on the barn, the woman was at the front and the\n(continues on next page)\n", "school_info": "School: Gaddyduff", "metadata": [{"Location:": "Gaddyduff, Co. Donegal", "Teacher:": "\nP. H. Kavanagh\n"}, {"Collector": "Liam Grant", "Gender": "male", "Age": "14", "Address": "1419770"}, {"Informant": "Frank Doherty", "Gender": "male", "Age": "56", "Address": "1419770"}, {"Language": "English"}]}, "4493796/4421573/4540494": {"title": "The Old Customs of the Bonfire Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1121, Page 283", "Page 283"], "url": "https://www.duchas.ie/en/cbes/4493796/4421573/4540494", "text": "\nOn the Bonfire night a crowd of us gather together and light a fire in honour of St. John.Long ago soldiers were looking for St. John to kill him. They told the people to put out a fire at the house he would come to so that they could find him. So every house put out a fire and they did not know what house to get him in.A big fire is lit and a crowd gather around it and dance and sing. Someone plays tunes on a melodion.When the cows are coming in they are put past the fire so that the smoke can blow on\n(continues on next page)\n", "school_info": "School: Gaduidhe Dubh (C.)", "metadata": [{"Location:": "Gaddyduff, Co. Donegal", "Teacher:": "\nCáitlín Ní Mhiothagáin\n"}, {"Language": "English"}]}, "4493796/4421586/4540500": {"title": "The Customs on St John's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1121, Page 296", "Page 296"], "url": "https://www.duchas.ie/en/cbes/4493796/4421586/4540500", "text": "\nThe custom on St John's night   is that every body puts fires outside the byres and when the cows go in some one person of the house throws a lighted turf over the cow's back.Another custom is that every person of the house jumps over the fire three times and throws a lighted turf three times towards the donkey or horse to bring luck on them during the year.\n\n\n\nIn olden times there were not as many blacksmiths as there are now. There are five blacksmiths in this parish now. They have a different way of working now from olden times. In olden times when people would go to get a set of shoes on a horse they would have to take a spade with them. Old spades and old irons and old horse-shoes were doubled together to make new ones. He had to get a new bar of nailrod and put eight nails in every shoe.\n", "school_info": "School: Gaduidhe Dubh (C.)", "metadata": [{"Location:": "Gaddyduff, Co. Donegal", "Teacher:": "\nCáitlín Ní Mhiothagáin\n"}, {"Collector": "Annie Devlin", "Gender": "female", "Address": "Gaddyduff, Co. Donegal"}, {"Language": "English"}]}, "4427850/4350552/4569279": {"title": "St Stephen's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0098, Page 365", "Page 365"], "url": "https://www.duchas.ie/en/cbes/4427850/4350552/4569279", "text": "\nSong said on St. Stephens Day.Dreoilín, Dreoilín Rí na n-éán,Lá Fhéile Sthiopáin gabhadh é,Ní mór é an dreoilín,Is beag é  é féin,Is dá bfághainn-se  capaire,Domhseochaid  mé céim.\n\n\n\nOn Saint John's night all the children gather together and go round gathering turf  to make a bon-fire. When the fire is made they dance and sing round it. And each one when going home brings a coal of fire with him. In olden times the people brought milk to the bon-fire and the bought loaves and sweetcakes and had a tea-party round the bon-fire.Nancy O'Connell(12 years)Dromineen,Claremorris\n", "school_info": "School: Cnocán Mhichíl Naofa (Clochar)", "metadata": [{"Location:": "Claremorris, Co. Mayo", "Teacher:": "\nSiúracha na Trócaire\n"}, {"Collector": "Nancy O' Connell", "Gender": "female", "Address": "Drumneen, Co. Mayo"}, {"Language": "English"}]}, "4566066/4563938/4570603": {"title": "St John's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0027, Page 0090", "Page 0090"], "url": "https://www.duchas.ie/en/cbes/4566066/4563938/4570603", "text": "\nBonfire nightbonfire night is an old custom the old people like to keep up. On bonfire night the people light a fire in honour of St John and this showed the faith of the Irish people. When the bonfire is lit they always put a bone into it. All the old men and women go around it and pray three times. When the people are going home they always bring a coal from the fire and each person would throw it into their crops and by doing this they would believe that theri crops would grow better.All the young people would would stay up until three o clock in the morning singing dancing then they would go around to the neighbours fields and milk their cows then they would go into the house and get a saucepan, some bread and spoons. They would also get a baisin and go around the fire and eat the bread and milk. The neighbours when theyt would get up they would go out into their fields and see if their cows were milked but they would not blame the people because it was old custom and they would pass it as a joke.I got this from my grandmother, Mrs McGrath,Old Road,Tuam.\n", "school_info": "School: Clochar na Trocaire", "metadata": [{"Location:": "Tuam, Co. Galway", "Teacher:": "\nan tSiúr M. Oilibhéir\n"}, {"Collector": "Vera Mc Grath", "Gender": "female", "Address": "Tuam, Co. Galway"}, {"Informant": "Mrs Mc Grath", "Relation": "grandparent", "Gender": "female", "Address": "Tuam, Co. Galway"}, {"Language": "English"}]}, "4569044/4566434/4574680": {"title": "St John's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0033, Page 0209", "Page 0209"], "url": "https://www.duchas.ie/en/cbes/4569044/4566434/4574680", "text": "\nSt. Johns NightSt John's Night falls on the 23 - of June and that night is called Bonfire Night. On that evening the young people of the village go around from house to house gathering coal, sticks, turf, and oil in order to have a fine big fine that night. When the things are gathered they leave them on the road beside the green and some man from the village settles the coal, sticks and turf and makes a big fire. They light the fire about eight or nine o'clock. Then the people gather around the fire. Some of them go home at eleven or twelve o'clock and the rest stay at the fire singing and dancing until it is out and that usually is about three or four o'clock.\n", "school_info": "School: Droichead a' Chláirín (Buachaillí)", "metadata": [{"Location:": "Clarinbridge, Co. Galway", "Teacher:": "\nSeán Sabhaois\n"}, {"Collector": "Tomás Ó Ceallaigh", "Gender": "male", "Address": "Clarinbridge, Co. Galway"}, {"Language": "English"}]}, "4583295/4577294/4584851": {"title": "Festival Customs  - St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0047, Page 0047", "Page 0047"], "url": "https://www.duchas.ie/en/cbes/4583295/4577294/4584851", "text": "\nOn St. Martin's Day everyone in our parish kills a cock or a sheep. They gather the blood into a bowl or basin and every person in the house dips his finger into it and makes the sign of the cross on his forehead with it. They do no eat the meat until two days afterwards.\n\n\n\nOn St. John's night, June 23rd, there are bonfires lit all over the place. Each village has its own bonfire. All the boys and girls gather the firewood and pile it in a heap. When they have it heaped they set it a light and soon after they start dancing around the fire. After a few hours dancing they go home.\n\n\n\nThe night of the 23rd June - bonfire night or commonly known in the parish of Kiltartan as \"the night of the wisps\". On that night the old people of the parish light a sheaf of corn which is called a wisp and shake it on the crops to bless them. It is an old pagan\n(continues on next page)\n", "school_info": "School: Cill Tártáin", "metadata": [{"Location:": "Kiltartan, Co. Galway", "Teacher:": "\nMícheál Ó Tuathaigh\n"}, {"Collector": "Vincent O' Shaughnessy", "Gender": "male", "Address": "Kiltartan, Co. Galway"}, {"Language": "English"}]}, "4583295/4577294/4584858": {"title": "Festival Customs  - St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0047, Page 0047", "Page 0047"], "url": "https://www.duchas.ie/en/cbes/4583295/4577294/4584858", "text": "\nOn St. Martin's Day everyone in our parish kills a cock or a sheep. They gather the blood into a bowl or basin and every person in the house dips his finger into it and makes the sign of the cross on his forehead with it. They do no eat the meat until two days afterwards.\n\n\n\nOn St. John's night, June 23rd, there are bonfires lit all over the place. Each village has its own bonfire. All the boys and girls gather the firewood and pile it in a heap. When they have it heaped they set it a light and soon after they start dancing around the fire. After a few hours dancing they go home.\n\n\n\nThe night of the 23rd June - bonfire night or commonly known in the parish of Kiltartan as \"the night of the wisps\". On that night the old people of the parish light a sheaf of corn which is called a wisp and shake it on the crops to bless them. It is an old pagan\n(continues on next page)\n", "school_info": "School: Cill Tártáin", "metadata": [{"Location:": "Kiltartan, Co. Galway", "Teacher:": "\nMícheál Ó Tuathaigh\n"}, {"Collector": "Joe Tannian", "Gender": "male", "Address": "Lissatunny, Co. Galway"}, {"Language": "English"}]}, "4583289/4576796/4587010": {"title": "St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0046, Page 0051", "Page 0051"], "url": "https://www.duchas.ie/en/cbes/4583289/4576796/4587010", "text": "\nSt. Martin's Day is celebrated about here on the 8th of Nov. On that day a fowl is killed and its blood spilled on the four corners of the house. On St. Martin's Day all corn mills are closed because St. Martin was ground in a corn mill.\n\n\n\nOn 23rd June there is a bone fire lighted each year. It is said why the fire is lighted is because on 22 June the Irish defeated the Danes and on the following night there was a fire lighted for joy.\n\n\n\nSt. John's Day falls on the 24th June and on the evening before a fire is lighted and a bone put into it. The young boys of a village get a bag of turf from each family and make a fire. At night a person from each house brings home a cole.\n", "school_info": "School: Gort na Gaoithe", "metadata": [{"Location:": "Windfield, Co. Galway", "Teacher:": "\nM. Ó Lócháin\n"}, {"Collector": "Pakie Crehan", "Gender": "male", "Age": "14", "Address": "Rushestown, Co. Galway"}, {"Language": "English"}]}, "4583360/4583125/4588305": {"title": "Oíche Fhéile Sin Seáin", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0062, Page 0198", "Page 0198"], "url": "https://www.duchas.ie/en/cbes/4583360/4583125/4588305", "text": "\nTuiteann Oidhche 'Teine Cnáma ar an 23adh de mhí Mheitheamh. Nach ar na páistibh sgoile a bhíos an bród an oidhche sin, nuair a thagann siad abhaile ó'n sgoil! Ní dhéanann siad tada acht a ndinnéar a ithe, agus tagann siad isteach i dteach atá i n-aice an chnocáin, a bhíonn siad ag fadú na teine ann, agus tugann siad cúpla splannc leóbh as an teach sin, agus gabháil mhaith món. Faduigheann siad an teine sin ar an gcnocán is aoirde ar an mbaile, agus fágann siad annsin í, nó go mbíonn sé na thráthnóna. Annsin cruinnuigheann na daoine fásta thart timcheall na teine, agus piocann siad amach beirt bhuachaillí beaga a cheapfhas siad a bheith cneasta, agus cuireann siad iad sin ag cruinniú airgid i ngach teach ar an mbaile. Tugann gach duine ar an mbaile, ubh nó pinghin dhóibh. Bíonn builcín maith uibheacha aca, agus iad go sócamhlach aca i gciseán beag deas. Téigheann siad ag an siopa leób sin, agus fághann siad ola ortha. Tugann fear nó bean an t-siopa braon beag eile ola lé cois dhóibh.Téigheann siad go dtí an teine annsin, agus bíonn na liathróidí déanta aca rómpa as ceirteachaí. Caitheann siad braon den ola sin ar chuid de na liathróidí, agus annsin a bheadh an spraoi ag caith 'suas na liathróidí agus iad lasta, agus gach duine aca ag iarraidh an liathróid a chur níos aoirde ná an duine eile. Nuair a bhíos na liathróidí caithte aca, agus é in am dhul a chodladh, tugann gach duine splannc abhaile leis. Sgaoileann siad an splannc\n(continues on next page)\n", "school_info": "School: An Tulach", "metadata": [{"Location:": "Tully, Co. Galway", "Teacher:": "\nTadhg Ó Séaghdha, Máire, Bean Uí Dhuigneáin\n"}, {"Collector": "Bairbre Ní Choisdealbha", "Gender": "female", "Age": "14", "Address": "Keeraunnagark North, Co. Galway"}, {"Language": "Irish"}]}, "4583331/4580251/4591707": {"title": "Festival Customs - St John's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0055, Page 0123", "Page 0123"], "url": "https://www.duchas.ie/en/cbes/4583331/4580251/4591707", "text": "\nSt. John's NightSt. John's night is known as bone-fire night. On that night big fires are lit, and into the middle there is a big bone put.  They usually light them in the street.  Sometimes a number of neighbours collect at a cross roads around a huge fire and sing and dance for a couple of hours.  The head of each farmer's house takes a coal from the bone-fire and casts it into his potatoe or oat crop.\n\n\n\nNovember NightIt is customary to have a feast on this night. There are also many strange games played on this night.  Apples and nuts are always very plentiful.  The children amuse themselves\n(continues on next page)\n", "school_info": "School: Baile Mór Síl Anmchadha (Laurencetown)", "metadata": [{"Location:": "Laurencetown, Co. Galway", "Teacher:": "\nSeán Ó Cogaidhín\n"}, {"Language": "English"}]}, "4583349/4581921/4606148": {"title": "St John's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0059, Page 0358", "Page 0358"], "url": "https://www.duchas.ie/en/cbes/4583349/4581921/4606148", "text": "\nSt John's night is celebrated on the eve of the 23rd June. On that night everyone lights a bonfire in honour of St. John. Many people believe that the crops would not be lucky if they did not light a bonfire in them on St. John's night.It was often heard that many people used to go out on that night and pick certain kinds of herbs which they mix in water and they give it to sick cattle to drink.\n", "school_info": "School: Sonnagh (cailíní agus buachaillí)", "metadata": [{"Location:": "Sonnagh Old, Co. Galway", "Teacher:": "\nÚna Bean Uí Mhuireadhaigh\n"}, {"Language": "English"}]}, "4613671/4607037/4623956": {"title": "Months of Year in Irish", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0016, Page 143", "Page 143"], "url": "https://www.duchas.ie/en/cbes/4613671/4607037/4623956", "text": "\n1) January=I don't know what it is called2) February=Mí na Feilim Bridhge.3) March-Márta.4) April=Aibráin.5) May=Bealtaine6) June=Mivane7) July=No Irish for the month of July.8) August=An chéad mí an ovar.9) September=Mí na feilemh Meeheel10) October=I don't know.11) November=Mí na Samaina12) December=Mí na Nodlaig.\n\n\n\nTwo or three young lads would go around with an ass and cart and gather some turf. Each house in the village would give a bag full and all the turf would be made into a big fire at the crossroads. This fire was called a bonefire. All the young lads and girls would begin dancing and singing while the\n(continues on next page)\n", "school_info": "School: Gort na Díogha", "metadata": [{"Location:": "Gortnadeeve West, Co. Galway", "Teacher:": "\nSéamus Ó Dochartaigh, Bean Uí Dhochartaigh\n"}, {"Informant": "Thomas Brennan", "Gender": "male", "Age": "91", "Address": "Knockmascahill, Co. Galway"}, {"Language": "English"}]}, "4613671/4607038/4623957": {"title": "Oíche Sin Seáin", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0016, Page 144", "Page 144"], "url": "https://www.duchas.ie/en/cbes/4613671/4607038/4623957", "text": "\n(continued from previous page)\nfire would be burning.\n\n\n\nEvery-one would take a halfburned coal and throw it into a field near the house. Some people used to bring milk and meal and boil it and hand it around.\n\n\n\nAll the lads would be hurling on Sunday evenings. Sarah Collin's grandfather Tom Welshe used to go to Abbey Turlough in a field eighteen acres hurling. He used to go walking up and down again. Old Mentin Collins was a great footballer.\n\n\n\nThere was a blacksmith living near Knockmaskahill by the name of Broghan. He had a horse shoe down in the fire and he saw a woman coming at Pete Murray's. He threw the shoe out on the road and when the woman came along she picked up the shoe and\n(continues on next page)\n", "school_info": "School: Gort na Díogha", "metadata": [{"Location:": "Gortnadeeve West, Co. Galway", "Teacher:": "\nSéamus Ó Dochartaigh, Bean Uí Dhochartaigh\n"}, {"Informant": "Flash Kearney", "Gender": "male"}, {"Language": "English"}]}, "4622965/4617825/4628176": {"title": "Tine Chnámh - Lá Fhéile San Seáin", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0070, Page 080", "Page 080"], "url": "https://www.duchas.ie/en/cbes/4622965/4617825/4628176", "text": "\n( lá Fhéil Shin Seáin )1)  Bíonn cnámha aca ilár na teineadh.2) Tugann na sean daoine turas thart ar an teine seacht n-uaire agus iad ag paidileáil  rith an achair.3)  Tugann siad leob splanc agus caithfidh siad cuid dhe isteach ingach garrdha  Cuir ar an mbealach abhaile go mbéidh toradh agus fataí maithe sa ngarrdha. 4)  Balluigheann siad pighneacha le h aghaidh olla mhór a ceannacht don teine (cnámh)  Téigheann siad thart ó theach go teach ghá gcruinniú.\n", "school_info": "School: An Tuairín", "metadata": [{"Location:": "Bealadangan, Co. Galway", "Teacher:": "\nSéamus Ó Tomhnra\n"}, {"Collector": "Séamus Ó Tomhnra", "Gender": "male", "Occupation": "múinteoir"}, {"Language": "Irish"}]}, "4622966/4617950/4628378": {"title": "Scéal faoi Fhéile San Seáin", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0070, Page 205", "Page 205"], "url": "https://www.duchas.ie/en/cbes/4622966/4617950/4628378", "text": "\nBhí fear ann fadó agus baintreacbhach abhí ann. Fuair bean tailliúra bás ar an mbaile agus seachtmhain tar éis í a chur bhí teine cnámha ag muinntear an bhaile agus bhí an bhainteabhach ag an dteine cnámha. Núair a bhí píosa de'n oidhche caitthe dubhairt an baintreabhach go mbiodh an Cnoc lasta 'chuile Oidhche Féile Shan Seáin \"agus beidh fhios againn anocht imbeidh sí lasta\" deir sé.D'imthigh siad leo go dtí an cnoc. Nuair bhí siad inaice leis an gcnoc bhí go leór ag dul siar coiscéim. Nuair bhí siad ag an gcnoc ní raibh éinne ann acht an baintreabhach. Chonnaic sé teach mór agus go leór solais ann. Nuair thainig sé isteach 'sa\n(continues on next page)\n", "school_info": "School: An Cnoc (Leitir Mór)", "metadata": [{"Location:": "Knock, Co. Galway", "Teacher:": "\nBríd Puirséal, Máire, Bean Uí Dhuibheagáin\n"}, {"Informant": "Stiofán Seóige", "Gender": "male", "Occupation": "feirmeoir", "Address": "Baile na Cille, Co. Galway"}, {"Language": "Irish"}]}, "4622966/4617965/4628396": {"title": "Féile San Seáin", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0070, Page 220", "Page 220"], "url": "https://www.duchas.ie/en/cbes/4622966/4617965/4628396", "text": "\nTagann oidhche feiltean Seáin ar an bhficheadh  lá de Meitheamh, agus bionn lá Feiltean Sean againn ar an lá ina dhiaidh sin. An oidhche sin bionn teine ar lasadh ag na daoine agus bhiodh féasta ag na daoine fadó.'Sé an sórt féasta bhiodh aca Bhainfeadh siad fatai nua agus rachaidh siad ag iasgach agus mara mbiodh iasg aca marbhuigh siad cearcaí nó siciní, le haghaidh an féasta.Bhiodh Teine Cnamh aca. 'Sé'n chaoi a dheanfadh siad an teine ar dtúis rachaidh siad ag bailliughadh airgid ar daoine an bhaile agus rachaidh siad ag an siopa agus cheannóchadh siad ola le haghaidh na teineadh.Annsin rachadh na daoine eile agus gheobhfadh siad cúpla cléibh móna, agus chuirfeadh siad na gasúir ag cuartughadh cnámha le hagaidh na teineadh a dheanamh suas. Nuair bhiodh chuile\n(continues on next page)\n", "school_info": "School: An Cnoc (Leitir Mór)", "metadata": [{"Location:": "Knock, Co. Galway", "Teacher:": "\nBríd Puirséal, Máire, Bean Uí Dhuibheagáin\n"}, {"Language": "Irish"}]}, "4622964/4617707/4628498": {"title": "Lá Fhéile tSin Seáin", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0069, Page 686", "Page 686"], "url": "https://www.duchas.ie/en/cbes/4622964/4617707/4628498", "text": "\nLá Fhéile tSin Seáin    Tá sé de nós ag na daoine teine do Iasadh Oidhche Fhéil Tin Seáin. 'Sé sin 23 adh de Mí Meadhan. 'Sa tráthnóna a lastar í. Deirtear gur i n-onóir Naomh Seán a lastar í. 'Sé an chaoi a faduightear an teine cuireann gach teach mála móna ann. Bíonn ola mhóir agus sean mhálaí acu le caitheamh isteach sa teine. Ar chnócán a deintear an teine i gcomhnaidhe le go mbeadh sí le feiceál níos fearr. Nuair a bíonns na daoine ag dul abhaile tugann siad turas i dtosach. 'Sé an\n(continues on next page)\n", "school_info": "School: Ros Muc", "metadata": [{"Location:": "Rosmuck, Co. Galway", "Teacher:": "\nStiofán Ó hOisín\n"}, {"Collector": "Bríghid Ní Conaire", "Gender": "female", "Address": "Garrivinnagh, Co. Galway"}, {"Informant": "Seán Ó Conaire", "Gender": "male", "Age": "60", "Address": "Garrivinnagh, Co. Galway"}, {"Language": "Irish"}]}, "4622968/4618228/4628653": {"title": "Féilí na Bliana - Oíche Shamhna", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0071, Page 055", "Page 055"], "url": "https://www.duchas.ie/en/cbes/4622968/4618228/4628653", "text": "\n(continued from previous page)\nLíontar suas an poll le féar tirm. Cuirtear splannc isteach ann agus séidhtear an splannc le na mbéal. Bíonn deatach as an splannc. Líontar suas an teach le deatach.5.\tCuireann siad fáinne i gcáca agus cé ar bith cé gheobhthas é is túisce a phósfas.\n\n\n\nTagann lá Fhéil Sin Seáin ar an 24adh de mhí Meitheamh. Bíonn na barranta fásta agus bíonn fataí nua ar fághail. Tá nós  ag na daoine ag cur teine cnámh suas in-onóir do Naomh Seán. Téigheann cupla duine thart an tráthnóna sin agus bailigheann siad pingneacha le h-aghaidh ola mhór. Bíonn cupla duine eile ag déanamh liathróidí le málaí. Nuair a thagas an oidhche faduigheann síad teine ar chnocán agus cuireannsiad cupla  cnámh isteach ann. Líonann síad soitheach le ola mhór agus tiomaun síad na liathróidí síos ann. Annsin lasann siad iad agus caitheann siad san aer iad. Bíonn siad ag  cur liathróidí san aer mar sin ar feadh na h-oidhche. Nuair a bhíonns siad ag imtheacht tugann chuile dhuine splannc leis.\n", "school_info": "School: An Druim", "metadata": [{"Location:": "Drim, Co. Galway", "Teacher:": "\nMicheál Ó Concheanainn\n"}, {"Language": "Irish"}]}, "4602727/4598747/4628819": {"title": "Bonfires", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0190, Page 349", "Page 349"], "url": "https://www.duchas.ie/en/cbes/4602727/4598747/4628819", "text": "\nBonfiresBurning Bonfires is an old custom still carried on in Ireland in honour of Saint John whose feast falls on the 24th of June; and are lighted on the 23rd of June the eve before.This night is a night of great enjoyment for all the young people of the district on the neighbouring townlands. This night is greatly looked forward to by the children. When they come home from school and have their work all done they all gather together to prepare for the Bonfire. Some got old turf, others get fir-blocks and whins and pile them all on top of other on the summit of the highest hill in the district. When the night for lighting the bonfires comes the man that lives nearest to the bonfire supplies the coal or matches. Then before the bonfire the bonfire is lighted the grown-ups and young can be seen wending their ways. Somet through fields, others through lanes towards the fire.When it is just getting (lighted) dark the bonfire is lighted and as the blazes rise the gathering gives three cheers\n(continues on next page)\n", "school_info": "School: Askill", "metadata": [{"Location:": "Askill, Co. Leitrim", "Teacher:": "\nPadraig Ó Treabhair\n"}, {"Collector": "Edward Gallagher", "Gender": "male"}, {"Informant": "Thomas Timoney", "Gender": "male", "Address": "Askill, Co. Leitrim"}, {"Language": "English"}]}, "4622972/4618978/4629225": {"title": "Féilí na Bliana - Lá Fhéile Mártan", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0072, Page 243", "Page 243"], "url": "https://www.duchas.ie/en/cbes/4622972/4618978/4629225", "text": "\n(continued from previous page)\nagus ní raibh aon bhlás le marbuigheadh aici in ónóir don naomh. Bhí páiste aici agus mharbhuigh sí é agus í lár na h-oidhche bhí an páiste chómh beó is bhí sé ariamh. Lá le Mártan ní ceart d'aon duine bhéith ag sníomhacán ná rotha a chasadh.\n\n\n\n1. Bíonn lá fhéile Sheagháin againn ar an 24adh de Mheitheamh gach bliadhain. Tráthnóna téigheann na buachaillí thárt ag criunú airghidh le h-aghaidh ola agus tearra. Goideann cuid eile acú móin agus adhmadh agus cnámha. Nuair a bhíonn sé 'na oidhche lastar an téine chnámh. Nuair a bhíonn\n(continues on next page)\n", "school_info": "School: Tír an Fhiaidh", "metadata": [{"Location:": "Teeranea, Co. Galway", "Teacher:": "\nAn tSr. M Benín\n"}, {"Collector": "Dara Mac Donnchadha", "Gender": "male"}, {"Language": "Irish"}]}, "4622985/4620891/4630612": {"title": "Aoine an Chéasta", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0076, Page 187", "Page 187"], "url": "https://www.duchas.ie/en/cbes/4622985/4620891/4630612", "text": "\nCill Bhríghdeó Micheál Ó Somacáin, Cill BhríghdeNósana fé Lá le Naomh EoghainTagann lá 'le Naomh Eoghain ar an 23adh lá fichead de mhí Meithimh. Féile mór in Éirinn iseadh an lá sin. An  oidhche sin lastar teine agus cuirtear cnámh isteach ina lár.Annsin bíonn an-spóirt ag na páistí ag súgradh thart air. Cruinnigheann sean agus óg ann   Seo é an rud a dhéanann siad. Teigheann siad thart seacht n'uaire ar an teine agus an duine a bhíos amach i dtosach bíonn glac cloch beag aige agus caitheann sé ceann isteach\n(continues on next page)\n", "school_info": "School: Clochar ar an bhFáirche", "metadata": [{"Location:": "Clonbur, Co. Galway", "Teacher:": "\nSiúr Iarfhlaith Ní Mhóráin\n"}, {"Collector": "Aine Ní Shomacáin", "Gender": "female", "Address": "Kilbride, Co. Mayo"}, {"Informant": "Micheál Ó Somacáin", "Gender": "male", "Address": "Kilbride, Co. Mayo"}, {"Language": "Irish"}]}, "4602708/4597356/4631122": {"title": "Féilí na Bliana - Oíche Fhéile Sheáin", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0082, Page 204", "Page 204"], "url": "https://www.duchas.ie/en/cbes/4602708/4597356/4631122", "text": "\nTugtar oidhche Seáin ar an 23adh Meitheamh. Lasann na daoine teine cnámh an oidhche sin. Le onoir do Naomh Sheáin Baisdeach. Bhíonn na búachaillí ag cruinniú sprús adhmaid agus móna. Thugann duine gabhail móna agus thugann duine eile gabhail tuighe agus duine eile cnámh agus splanc chun na h-áite a bhíonns an teine cnámh le bheith aca. In áiteacha deireann síád an padrín páirteach. tart ar an teine. Fadó bhí nós ag na págánaibh agus dheanaidís teine agus sheólaidis na ba tríd an teineadh seo agus shíl siad go mbeadh na ba saor ó gach aicíd na blíadhna.Anois núair a múchta cuireann síad  lúaithe no splanc as an teine isteach sa bpáirc a bhíonns in aice na teineadh agus thugann daoine aithinne abhaile leó agus chaitheann síad  isteach i ngort na bhfata a bhionns aca féin. Creideann síad go gcoinnigheann sé seo an galar ó na fataibh ar feadh na bliadhna.Lá le Seáin bhíonn aonach i Mainistear. Úain is mo a bhíonn  'gá dhíol ann. Fadó bé   an lá sin teigheadh na fir go Sasanach mar bíodh an síol fad curtha aca na fataí lánta agus an mhóin bainte an t-am sin.\n", "school_info": "School: Cromghlinn (B)", "metadata": [{"Location:": "Crumlin, Co. Galway", "Teacher:": "\nSeán Ó Donnchadha\n"}, {"Collector": "Micheál de Búrca", "Gender": "male", "Age": "13", "Address": "Crumlin, Co. Galway"}, {"Language": "Irish"}]}, "4605938/4604024/4645172": {"title": "St Martin's Eve - 11th November", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0204, Page 315", "Page 315"], "url": "https://www.duchas.ie/en/cbes/4605938/4604024/4645172", "text": "\nOn St Martin's eve the blood of some living thing is spilled. A goose is generally what is killed. St Martin was ground in a mill on the 11th November and that is why something is is killed on St Martin's eve\n\n\n\nOn St John's eve a bone-fire is lit on every hill. Some say it is in honour of St John. Others say that a while before the battle of Clontarf the Danes were scattered and they fled to neighbouring houses for safety. Brian sent out a secret message to tell all the people to kill the Dane and to light a bone-fire on a high-hill as a warning to him when the Dane was killed This the people did and in memory of this it is said people light bone fires.\n\n\n\nThe first person that comes in on New Year's day brings good luck or bad luck. A red haired girl is unlucky there will be bad luck in that house for twelve months. A black haired man is very lucky to come in on New Year's morning. If you give away anything New Year's day you will be giving away the whole year. If you break a mug or anything you will be breaking the whole year.\n", "school_info": "School: Kilmore", "metadata": [{"Location:": "Kilmore, Co. Leitrim", "Teacher:": "\nEilís, Bean Uí Cheallaigh\n"}, {"Language": "English"}]}, "4649692/4647804/4659560": {"title": "Bonfire Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0211, Page 369", "Page 369"], "url": "https://www.duchas.ie/en/cbes/4649692/4647804/4659560", "text": "\n369Bonfire CustomsThe Bonfire is held in this district on the 23rd and 29th of June.  Long ago all the people of the town-land contributed to the Bonfire with either sticks, turf, or hay and on the night it was held both young and old gathered to it.  There they danced and sung around it until midnight. It was also a custom to say the rosary at the Bonfire,  When the Bonfire was burned out the people gathered they ashes and scattered it through their crops.  This was supposed to bring good luck to their crops. for the next twelve months. Others drove the cattle through the ashes.\n", "school_info": "School: Crummy", "metadata": [{"Location:": "Crummy, Co. Leitrim", "Teacher:": "\nPádhraic Ó Rodacháin\n"}, {"Collector": "Rita Mahon", "Gender": "female", "Address": "Mullaun Glebe, Co. Leitrim"}, {"Language": "English"}]}, "4658424/4654078/4661227": {"title": "Customs on Bonfire Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0219, Page 313", "Page 313"], "url": "https://www.duchas.ie/en/cbes/4658424/4654078/4661227", "text": "\nIn olden times, the people were out for two weeks before that night gathering turf and blocks. They would have cart loads of turf gathered. The people would be dancing and playing the flute at the bonfire. They would dance there until twelve o'clock, then they made up a subscription. Then the boys went to the nearest shop and they bought bread and sugar. The girls got gallons and went into the fields and milked the cows. Put down the gallons of milk on the fire, broke the bread into it and threw in the sugar and had it good and sweet. They then had porringers and everyone ate out of a porringer. As soon as they had one porringer-ful eaten, they got another one and when they had this eaten they danced away until morning and then they went home and had a good sleep.\n", "school_info": "School: Cluain Eich", "metadata": [{"Location:": "Clooneagh, Co. Leitrim", "Teacher:": "\nSr. Ó Donnabhair\n"}, {"Collector": "Miss Gertie Bohan", "Gender": "female", "Address": "Derreen, Co. Leitrim"}, {"Informant": "Mrs John Mallon", "Gender": "female", "Age": "48", "Occupation": "mason's wife", "Address": "Derreen, Co. Leitrim"}, {"Language": "English"}]}, "4649705/4648910/4662290": {"title": "Bonfire Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0214, Page 404", "Page 404"], "url": "https://www.duchas.ie/en/cbes/4649705/4648910/4662290", "text": "", "school_info": "School: Gort Leitreach", "metadata": [{"Location:": "Gortletteragh, Co. Leitrim", "Teacher:": "\nSeosamh Mac Cionnaith\n"}, {"Collector": "J. Mc Kenna", "Gender": "male", "Address": "Fearnaght, Co. Leitrim"}, {"Language": "English"}]}, "4666602/4665842/4667991": {"title": "St John's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0413, Page 217", "Page 217"], "url": "https://www.duchas.ie/en/cbes/4666602/4665842/4667991", "text": "\nThe 23rd of June is St John's night and the 24th of June is St John's day. On St John's night people light bonfires every where and the people used to strike the cows' backs with a lighted furze bush.The Friday and Saturday before St John's day people go to Wehters well in Tubrid to cure themselves from sickness and trouble.\n\n\n\nWether's Well is near Ardfert. It is about four miles from our district. Wether's Well is called Tobar na Molt. It was in Wether's Well the stain of original sin on Brendan's soul was blotted out. St Brendan was Baptised by Bishop Erc. On the night of St Brendan's birth there was a wonderful light that filled all Fenit. People go to Wethers Well and pay rounds and if they had any sickness or sores they would be cured.Every one that goes to Wether's Well leaves a token after them. Some people say that if any one saw a trout in the Well he would be cured from any sickness. Near Wether's Well in a sheltered nook lies the font of St Brendan's Baptism. St Brendan was buried where he was Baptised. Some people say that there is a cure on the earth of St. Brendan's grave.\n", "school_info": "School: Killahan (B.)", "metadata": [{"Location:": "Killahan, Co. Kerry", "Teacher:": "\nLiam Ó Leathlobhair\n"}, {"Informant": "Pat Carroll", "Gender": "male", "Age": "54", "Address": "Parknageragh, Co. Kerry"}, {"Language": "English"}]}, "4658459/4657746/4668578": {"title": "The Festival of Christmas", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0228, Page 094", "Page 094"], "url": "https://www.duchas.ie/en/cbes/4658459/4657746/4668578", "text": "\n(continued from previous page)\nabout four o'clock. At six oclock tea and sweet cakes were taken. The last meal which consisted of boiled rice in which were put currants and raisins was taken about 9 oclock p.m. The rosary was again said before the crib and at 10 oclock the family went to bed, the children lonely that Christmas was gone for another year.\n\n\n\nSt John's Eve the bonfire night.About 40 years ago children hurried home from school on June 23rd to gather whins for the bonfire. All the evening they went around gathering withered whins and putting them in a pile. They sometimes stole turf from their father to improve the fire.The turf and whins were piles on a high spot. The children went home in turn to eat their suppers of indian porridge and milk, the other children guarded the pile afraid anyone would light it before dark. At nightfall all the children gathered around the pile. Some one put a match to it. All formed in a long chorus of cheers which was answered by cheers from other bonfires. The whole country was a scene of jubilation.\n(continues on next page)\n", "school_info": "School: Druim Bréan Lios", "metadata": [{"Location:": "Drumbreanlis, Co. Leitrim", "Teacher:": "\nEibhlín Nic Ghuidhir\n"}, {"Informant": "Mrs H. Duffy", "Gender": "female", "Age": "86"}, {"Language": "English"}]}, "4678399/4677054/4683118": {"title": "Cluichí", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0424, Page 208", "Page 208"], "url": "https://www.duchas.ie/en/cbes/4678399/4677054/4683118", "text": "\nTá Lá  Sin Seáin ar an ceathramhadh  lá fichead de Mheitheamh. Deintear teinte cnámha i ngach áit an oidhche sin agus bíonn na daoine óga ag rinnce   ina dtímcheall agus suidheann siad síos ar cloca móra. Nuair a bhíonn an teine ag dul amac bíd ag breith ar na lasair  le na lámha.OIDHCHE  SHAMHNAOidhche móir  spóirt ag na Gaedhil iseadh oidhche Shamhna. Tagann sí an t-aonadh lá fichead do Dheire Fóghmhair. Bíonn súipeár  mór i ngach aon tig an oidhche sin agus deintear bairighin breac i gcoir an tsuipeár agus cuirtear  mórán rudaí  isteach ann fainne, ceirt, méaracán, cipín, agus raol. Nuair a bhíd ag ithe is mó fonn cuardaig\n(continues on next page)\n", "school_info": "School: Baile an Ghóilín (Scoil N. Finghín)", "metadata": [{"Location:": "Burnham East, Co. Kerry", "Teacher:": "\nDll. Ó Loingsigh\n"}, {"Collector": "Séamus Ó Loinghsigh", "Gender": "male", "Address": "Burnham East, Co. Kerry"}, {"Informant": "Muiris Ó Loinghsigh", "Gender": "male", "Address": "Burnham East, Co. Kerry"}, {"Language": "Irish"}]}, "4687714/4686489/4689794": {"title": "Féilí na Bliana - St John's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0434, Page 169", "Page 169"], "url": "https://www.duchas.ie/en/cbes/4687714/4686489/4689794", "text": "\nó Aoife Ní FhoghludhaSr. Uacht. an DroichidCill-OrglanSt John's Day falls on the 24th June. On the previous night, the 23rd, people used to light bonfires at cross-roads in honour of St. John. Crowds of people used to sit around the fires while the younger people would sing and dance and play music for the rest of the night.\n", "school_info": "School: Killorglin (C.)", "metadata": [{"Location:": "Killorglin, Co. Kerry", "Teacher:": "\nÚna Nic Coluin\n"}, {"Collector": "Aoife Ní Fhoghludha", "Gender": "female", "Address": "Killorglin, Co. Kerry"}, {"Language": "English"}]}, "4687714/4686490/4689795": {"title": "St John's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0434, Page 170", "Page 170"], "url": "https://www.duchas.ie/en/cbes/4687714/4686490/4689795", "text": "\nó Mháire Ni ChéitinnAn Baile Nua,Cíll-OrglanOn St. John's Day people make rounds to grave-yards and old churches. People also go to holy well on the Saturday after St. John's Day.On the Eve of St. John's Day boys make bon-fires up on a high place. For the bonfires the boys have to get turf and bushes.If cows happened to pass the boys would often strike\n(continues on next page)\n", "school_info": "School: Killorglin (C.)", "metadata": [{"Location:": "Killorglin, Co. Kerry", "Teacher:": "\nÚna Nic Coluin\n"}, {"Collector": "Máire Ní Chéitinn", "Gender": "female", "Address": "Killorglin, Co. Kerry"}, {"Language": "English"}]}, "4701698/4693564/4706938": {"title": "Fairy Fort", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0169, Page 016", "Page 016"], "url": "https://www.duchas.ie/en/cbes/4701698/4693564/4706938", "text": "\n(continued from previous page)\nmeans Red Hill and on the top of this hill King Dathies wife is buried.\n\n\n\nIn this district people honour St. John's Eve by lighting bonfires. Children especially gater the turf and sticks and they get paraffin oil and tar. Some big boy or girl lights the fire. They get a stick and put a lit sod of turf on it and they march round the big fire. The bonfires are lighted on hill top and at crossroads. It is said that in olden times the boys and girls used to jump the fire and if a boy and girl jumped the fire altogether it was supposed that they would be married but no one of the two could scatter the fire.\n", "school_info": "School: Dromard (Clochar na Trócaire)", "metadata": [{"Location:": "Dromard, Co. Sligo", "Teacher:": "\nAn tSr. Maighréad\n"}, {"Language": "English"}]}, "4687719/4687016/4708716": {"title": "Féilte na Bliana - Sean-Bhealtaine", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0435, Page 393", "Page 393"], "url": "https://www.duchas.ie/en/cbes/4687719/4687016/4708716", "text": "\n(continued from previous page)\ngo mbeadh an bainne go flúirseach aca ar feadh na bliadhna. Ní thugaidís bainne d'aoine an lá san gan airgid ar eagla go gcailleadh a gcuid buaibh a mbainneGobnait Ní ChonnchubhairRínCill Daglan,Ciarraidhe,1. Ainm an duine a bhfuaras an t-eolas uaidhMícheál S. Ó Cathaláin2. A Aois57A SeoladhLeath-fearann Cill OrglanCiarraidhe\n\n\n\nLá le'n SeáinLasaidís teintreacha cnámha annso agus annsúd ar fuaid na háite. Lasaidís tor aitinn fé bholg na mbó.Bhailighidís géaga de chrannaibh, tuir aitinn cúpla fód móna agus cnámha na hainimhidhe a fuair bás i rith na bliadhna. Sé cúis\n(continues on next page)\n", "school_info": "School: Dubhghlas (C.)", "metadata": [{"Location:": "Douglas, Co. Kerry", "Teacher:": "\nEibhlín, Bean de Róiste\n"}, {"Collector": "Eibhlín Ní Cathaláin", "Gender": "female", "Address": "Laharan, Co. Kerry"}, {"Informant": "Mícheál S. Ó Chathaláin", "Gender": "male", "Age": "57", "Address": "Laharan, Co. Kerry"}, {"Language": "Irish"}]}, "4687719/4687036/4708783": {"title": "Féilte na Bliana - Lá Fhéile Seáin", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0435, Page 413", "Page 413"], "url": "https://www.duchas.ie/en/cbes/4687719/4687036/4708783", "text": "\nDaoine an-aerach do b'eadh na sean-daoine. Idir buachallaí agus cailíní ní bhíodh aon nídh ag dul uatha. Ar an 24adh lá de Meitheamh dheinidís teintreacha cnámha. Caithidís an lá roimh ré ag bailiú  adhbhar teintreacha. Bíodh spórt an domhain aca ag dul mór thimcheall na h-áite ag tógaint nó uaireannta ag goid tor aitinn agus géaga feochta annso agus annsúd i slighe  go mbeadh teintreacha móra aca nuair a thiocfad an tráthnóna. Chuiridís cnámha d'aon ainmhidhe a fuair bás ortha i rith na bliana isteach sa teine. Bidhidís dhá n-iarraidh léimnig treasna na teine annsan chun spórt beith aca.\n(continues on next page)\n", "school_info": "School: Dubhghlas (C.)", "metadata": [{"Location:": "Douglas, Co. Kerry", "Teacher:": "\nEibhlín, Bean de Róiste\n"}, {"Collector": "Máire Ní Scannaill", "Gender": "female", "Address": "Garrane West, Co. Kerry"}, {"Informant": "Míchael Ó Griobhtha", "Gender": "male", "Age": "68", "Address": "Garrane West, Co. Kerry"}, {"Language": "Irish"}]}, "4706324/4702497/4708907": {"title": "An Old Feast - St John's", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0439, Page 036", "Page 036"], "url": "https://www.duchas.ie/en/cbes/4706324/4702497/4708907", "text": "\nIn nearly every feast day in Ireland great feast is held in almost every parish. The feast which I am going to describe the feast held on St. John's day. The young people of every district join together. Some get mouth-organs and go from house to house gathering money, sticks, turf, and oil. A strong boy get the money and goes to the nearest shop. There he buys buns, cakes, and lemonade. Then, the boys carry the turf, sticks, and oil to a high patch of ground, there the turf is built into a small reek. Then it is lit and all children sit around the fire and eat the buns, sweets, and  cakes, and drink the lemonade. When they are finished eating and drinking the men get their melodians and play tunes. The young boys and girls dance untill they are tired. Then, they all go home tired and satisfied after the day.The reason why the feast is held on that night is, the king of Palestine was Herod. One night he gave a feast.\n(continues on next page)\n", "school_info": "School: Scoil na mBráthar, Tralee", "metadata": [{"Location:": "Tralee, Co. Kerry", "Teacher:": "\nMícheál Ó Ruairc, Ss. Ó Ruacháin\n"}, {"Informant": "Mrs J. Harris", "Gender": "female", "Age": "42", "Address": "Boherbee, Co. Kerry"}, {"Language": "English"}]}, "4706324/4702499/4708908": {"title": "An Old Feast Day - St John's", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0439, Page 038", "Page 038"], "url": "https://www.duchas.ie/en/cbes/4706324/4702499/4708908", "text": "\nThe people of Ireland are very holy and they have a special ceremony for each Saint's day.On St. John's night many people build big bon-fires. St. John's night is on the 24th June. On that night the people light huge bon-fires and dance and make merry around the fire.People sometimes have feasts around the bon-fires. They also  offered sacrifices that night long ago.Once, a bunch of young boys lit a big bon-fire in Ballymullen and they began to dance and race around the fire. Suddenly one boy tripped and fell into the fire.His clothes began to take fire and with the fright the boy ran for a nearby stream and he jumped into the stream. Although the boy was not burned to death he was badly scorched in many places.People still light bon-fires especially in the country where they burn logs of wood and turf.\n", "school_info": "School: Scoil na mBráthar, Tralee", "metadata": [{"Location:": "Tralee, Co. Kerry", "Teacher:": "\nMícheál Ó Ruairc, Ss. Ó Ruacháin\n"}, {"Informant": "Miss J. Fleming", "Gender": "female", "Age": "24", "Address": "Farmers Bridge, Co. Kerry"}, {"Language": "English"}]}, "4706349/4704977/4713930": {"title": "Lore Connected with Certain Days and Feasts - St John's Night - 24th June", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0445, Page 340", "Page 340"], "url": "https://www.duchas.ie/en/cbes/4706349/4704977/4713930", "text": "\nLong ago people used to light bon-fires on this night. They used also hunt the cows around the field with a burning bush. This was supposed to bring the cows to dairy.\n\n\n\nOn the eve of Michaelmas, that is the 29th Sept everyone is supposed to have a goose for supper.There is an old rhyme which says\"On Michaelmas night by right divineThe goose is choosen to be the swine\"\n\n\n\n(1) An apple is put into a pan in a tub of water. Whoever can get the apple out of the water in his mouth is allowed to eat it. (2) Two beans a put in coals of fire on the hearth. One is supposed to represent a boy, and the\n(continues on next page)\n", "school_info": "School: Kilsarcon (B.), Fearann Fuar", "metadata": [{"Location:": "Kilsarkan West, Co. Kerry", "Teacher:": "\nSs. Ó Murchadha\n"}, {"Informant": "David Daly", "Gender": "male", "Age": "70", "Occupation": "farmer", "Address": "Farranfore, Co. Kerry"}, {"Language": "English"}]}, "4701669/4691563/4714148": {"title": "Customs on St John's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0158, Page 078", "Page 078"], "url": "https://www.duchas.ie/en/cbes/4701669/4691563/4714148", "text": "\nIn some places here in Ireland the following night of St. John's Day is called \"Bonfire Night\". It occurs about the 23rd of June each year and sometimes the 24th.All the young people bury about a ton of coal, and arrange some special spot to burn it on Bonfire night. When Bonfire night comes they set the coal on fire and a great crowd gathers.There are some local players who play the whole night, all who are present dance to the music and they dance and sing till morning.This is the custom on St John's Day in my district.\n", "school_info": "School: Rathcormac", "metadata": [{"Location:": "Rathcormack, Co. Sligo", "Teacher:": "\nM. Bean Uí Fhéinneadha\n"}, {"Collector": "Gerty Currid", "Gender": "female"}, {"Language": "English"}]}, "4713249/4711267/4714272": {"title": "St John's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0455, Page 015", "Page 015"], "url": "https://www.duchas.ie/en/cbes/4713249/4711267/4714272", "text": "\nSt Johns NightLong ago in this country many customs were observed on the eve of the Feast of St. John, but most of them are no longer practiced now.  The people always looked forward to that night because they celebrated it with great joy and had plenty fun.  A few days before the Feast the young people were very busy gathering turf and sticks to make the fire and they marked out a special place to make it and like it.  The previous night they prepared the fire by placing the turf and sticks in a large heap ready to be lit.  When the night came all the young people\n(continues on next page)\n", "school_info": "School: Lios Uí Bhigín (B.)", "metadata": [{"Location:": "Lissyviggeen, Co. Kerry", "Teacher:": "\nSéamus P. Ó Raghallaigh\n"}, {"Collector": "Brigid Courtney", "Gender": "female", "Address": "Minish, Co. Kerry"}, {"Language": "English"}]}, "4713249/4711282/4714289": {"title": "St John's Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0455, Page 030", "Page 030"], "url": "https://www.duchas.ie/en/cbes/4713249/4711282/4714289", "text": "\nSt John's EveAbout sixty or seventy years St John's Eve was observed by young and old but nowadays this custom has died except that a furze bush is lighted in a remote place.  Long ago a few days before Bonfire Night all the young men and boys were busily engaged gathering sticks,turf and other kinds of fuel.  When they had enough gathered they made them all up into one big heap so as to have a blaze fire. When the sun went down all the neighbours gathered around.  The fire was lighted and the flames could be seen for miles.  Then all at once there was wild applause\n(continues on next page)\n", "school_info": "School: Lios Uí Bhigín (B.)", "metadata": [{"Location:": "Lissyviggeen, Co. Kerry", "Teacher:": "\nSéamus P. Ó Raghallaigh\n"}, {"Collector": "Donie O Keeffe", "Gender": "male", "Address": "Lissyviggeen, Co. Kerry"}, {"Language": "English"}]}, "4701770/4701321/4727232": {"title": "Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0188, Page 088", "Page 088"], "url": "https://www.duchas.ie/en/cbes/4701770/4701321/4727232", "text": "\nUntil quite recently the young people use to build a little hut usually in the bog and cook eggs there on Easter Sunday. The young people still strive to see who will eat the most number of eggs on Easter Sunday. It is a firm local belief that the Sun dances on Easter Sunday morning and many who have got up at dawn to witness this phenomenon declare that such is the case.\n\n\n\nI can find no trace of any local customs for this feast.\n\n\n\nBonfires are still built in this area and coals from the dying fire brought and thrown into the tilled fields to bless the crops for the year.\n\n\n\nA fowl is killed and the blood spilled for St Martin to prevent sickness or death in the year. It is a believe that\n(continues on next page)\n", "school_info": "School: St. Michael's Clooncunny", "metadata": [{"Location:": "Clooncunny, Co. Sligo", "Teacher:": "\nÚna, Bean Uí Stondúin\n"}, {"Language": "English"}]}, "4701702/4694124/4742229": {"title": "The Bonfire Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0170, Page 0139", "Page 0139"], "url": "https://www.duchas.ie/en/cbes/4701702/4694124/4742229", "text": "\nThe bonfire is held on the eve of the twenty fourth of June which is St John's Day. It is customary for the boys and girls of each village to gather at a certain place and light the bonfire there  on this particular night. The younger boys gather a large heap of turf and sticks. All gather round the fire and have fun and laughter till mid-night.Sometimes when music  is available they dance Irish dances. Songs are sung and stories are told and at twelve o'clock all return to their homes after an enjoyable night.Long ago the old people said that the first one to take a coal from the bonfire and throw it into the potato field would have new potatoes first. There was great fun and excitement trying to snatch the first coal. Kathleen GildeaMoylough G.S.Tubbercurry\n", "school_info": "School: Moylough (C.)", "metadata": [{"Location:": "Moylough, Co. Sligo", "Teacher:": "\nMargaret Devine\n"}, {"Collector": "Kathleen Gildea", "Gender": "female", "Address": "Moylough, Co. Sligo"}, {"Language": "English"}]}, "4701705/4694428/4760496": {"title": "The Bonfire Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0170, Page 0443", "Page 0443"], "url": "https://www.duchas.ie/en/cbes/4701705/4694428/4760496", "text": "\nThe Bonfire Night.The custom of holding bonfires on St John's Eve, was a red-letter event here long ago. Early on that evening, children went round to the various houses collecting turf. More often, they had to go to the bog as the new turf is not drawn home by that date, and people are inclined to conserve the old turf lest wet weather comes. The bonfire was usually built at cross-roads. The turf was heaped up and live coals and a bone placed in the middle. When it was well alight, Young and old gathered roung it. The old people indulged in a seanachas. The young people indulged in dancing, generally to the music of a melodeon. As the bonfire decreased in size, the young men indulged in a jumping competition - who could first jump over the fire? Sometimes a competitor scattered coals and sparks in all directions. On leaving the bonfire, each person brought a live coal which he threw into his potato field. This was supposed to bring good luck during the year. The bonfires are still numerous, but it is left to the children to carry on this ancient custom.\n", "school_info": "School: Curraigh (B.)", "metadata": [{"Location:": "Curry, Co. Sligo", "Teacher:": "\nPeadar Ó Braonáin\n"}, {"Collector": "Peter Brennan", "Gender": "male", "Occupation": "teacher"}, {"Language": "English"}]}, "4758475/4747207/4761969": {"title": "The Bonfire Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0250, Page 226", "Page 226"], "url": "https://www.duchas.ie/en/cbes/4758475/4747207/4761969", "text": "\nThe old custom of lighting a bon-fire on the 23rd June, the eve of St John's Day, has been observed from time immemorial and is still observed, but to a less extent, in this part of the country.For weeks previous to the event the young people look forward to the fun and merriment that always accompany the occasion. It is one of the big events of the year for the youngsters. Days beforehand they start to gather material for the fire and a collection of fuel in the shape of turf and old sticks is piled on the site of the fire. Early on the evening the children gather to the chosen site, generally a cross-roads or some central place and proceed to light the fire. Gradually the grown up folk and the old people arrive and all sit round the fire. The old people relate stories of the doings and carrying-on that were practised  in their boyhood-days and recount the many tricks they played.\n(continues on next page)\n", "school_info": "School: Clooncullaun", "metadata": [{"Location:": "Clooncullaan, Co. Roscommon", "Teacher:": "\nLiam Mac Leastair\n"}, {"Informant": "Mr John Nolan", "Gender": "male", "Age": "76", "Address": "Clooncullaan, Co. Roscommon"}, {"Language": "English"}]}, "4758455/4745474/4779203": {"title": "May Eve Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0231, Page 247", "Page 247"], "url": "https://www.duchas.ie/en/cbes/4758455/4745474/4779203", "text": "\n(continued from previous page)\nThis Saint met his death by being ground in a millPeggy Gallagher\n\n\n\nSaint John's day is on the 24th June. On the eve of Saint Johns day all the young boys and girls light a fire either in some shady place convenient to the road side or on the top of a high hill so that it can be seen for miles around the district. On that night no one has any objection to boys taking their turf. It is nice to look around the country on that night and see a blazing bonfire on top or each hill.When the fire is lighted some musician plays a flute, melodeon, or fiddle and they dance until midnight. When they are leaving they bring a coal and throw it into their potato crop because they believe it is a lucky thing to do, and that they will have a successful crop that year.There is great rivalry among the boys and girls of the different town lands to see who has the best bonfire and the best crowd.Bonfire means bone fire. Bonfires are sometimes lighted to denote  a victory.Margaret Pender\n", "school_info": "School: Drom Bhaoghalláin", "metadata": [{"Location:": "Ardcarn, Co. Roscommon", "Teacher:": "\nM. Pagnam\n"}, {"Collector": "Margaret Pender", "Gender": "female"}, {"Language": "English"}]}, "4706346/4704679/4779999": {"title": "Festival Customs - May Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0444, Page 456", "Page 456"], "url": "https://www.duchas.ie/en/cbes/4706346/4704679/4779999", "text": "", "school_info": "School: O'Brennan, Baile Mhic Ealgóid, Tráighlí", "metadata": [{"Location:": "Tonreagh Lower, Co. Kerry", "Teacher:": "\nPádraig Ó Loingsigh\n"}, {"Collector": "Aine Lynch", "Gender": "female"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "male"}, {"Language": "English"}]}, "4742143/4740307/4816759": {"title": "Tobar Beannaithe", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0479, Page 181", "Page 181"], "url": "https://www.duchas.ie/en/cbes/4742143/4740307/4816759", "text": "\n(continued from previous page)\nfós 'na sluaghtaibh chun leigheas d’fághailt ann.Siad na láethannta is gnáthaí a téigheann siad ann nuair a bhíonn siad ag deanamh turas trí lá ná De haoine, Dé Satharn is Dé Domhnaigh\n\n\n\nBíonn lá fhéile Seáin ar an fíche ceatharadh lá de mí an Mheithimh agus an tráthnóna roimis sin deineann na daoine teinte -cnámh in onóir Naomh Sheáin.Tímcheall seachtfó blian ó thoin do dhein roinnt daoine i bhFiadhachmeadhon teine cnámh agus bhí páistí ag súgradh inaice leis an dteine agus bhí dhá cailín ann ceann díobh dhá bhlian agus an ceann eile trí bliana agus ní raibh aon chiall ag aon ceann díobh agus bhíodar ana chómhgarach leis an dteine ar fad agus bhí an bheirt acu ag súgradh leó féin.Bhí an ceann aosta ag caitheamh an leinbh eile isteach san dteine mar dheadh agus do sleamhnuig sí uaithi agus do thuit sí isteach san dteine agus annsan do thosnuig an bheirt aca ag béicig agus do rith na paistí eile chúcha agus annsan na daoine aosta.Bhí an bheirt aca san dteine mar bhí ceann\n(continues on next page)\n", "school_info": "School: Baile an Tighearna (Ballyhearnay)", "metadata": [{"Location:": "Ballyhearny West, Co. Kerry", "Teacher:": "\nPartolan Ó Gríbhthín\n"}, {"Collector": "Eibhlín Ní Dhonnchadha", "Gender": "female", "Address": "Chapeltown, Co. Kerry"}, {"Informant": "Pádraig Ó Donnchadha", "Gender": "male", "Age": "47", "Occupation": "oibrí iarnróid", "Address": "Chapeltown, Co. Kerry"}, {"Language": "Irish"}]}, "4742087/4734696/4819537": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0465, Page 156", "Page 156"], "url": "https://www.duchas.ie/en/cbes/4742087/4734696/4819537", "text": "\nOn St John's night June 23rd the people light the bonfire in honour of St John. They place it in an elevated location and build it of furze turf, bushes etc. Quite a number of these fires can be seen all around. People congregate round the fire and chat and tell stories, sing songs, and sometimes dance.On   this night also the people take the Holy Water and sprinkle it on the crops, the animals, and persons on the farm. Meadows, oatsfields, garden byres, pigsty etc are visited in turn and God's blessing is invoked upon the crops etc.\n", "school_info": "School: Droichead na Dóinne", "metadata": [{"Location:": "Blackwater Bridge, Co. Kerry", "Teacher:": "\nTadhg Ó Scolaidhe\n"}, {"Language": "English"}]}, "4798672/4789105/4922463": {"title": "My Townland", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0239, Page 269", "Page 269"], "url": "https://www.duchas.ie/en/cbes/4798672/4789105/4922463", "text": "\n(continued from previous page)\nexpensive on him.Water is very scarce especially round Fairymount but at the foot of the hill there are fine pumps.\n\n\n\nAll the people both young and old go to the bonfire and when they are leaving they always bring home a coal and put it in their own field especially in the potatoes. It is said that if a person goes home without bringing a coal has no luck until the next bonfire night and that he will not be at the next bonfire but no one ever goes home without a coal.\n", "school_info": "School: Mullach na Sídhe (B.)", "metadata": [{"Location:": "Fairymount, Co. Roscommon", "Teacher:": "\nTomás Ó Dubhthaigh\n"}, {"Collector": "Pádraig Ó Flionn", "Gender": "male"}, {"Language": "English"}]}, "4798708/4792109/4924578": {"title": "St John's Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0254, Page 218", "Page 218"], "url": "https://www.duchas.ie/en/cbes/4798708/4792109/4924578", "text": "\nSt. John's Eve.There was a big bonfire at every cross-roads on this evening. This was celebrated in every townland by lighting a great fire which was called a Bonfire. The turf was subscribed by all the people of the townland. Some gave much some little as they could afford.The young boys went round  Early in the evening and and gathered in the turf. Then the fire was lighted in the nicest and most comfortable place they could find.Everyone out of every house came to the Bonfire. Then the old people told stories. The younger people usually danced as there was always some musicianer there. This was sometimes continued until the small hours of the morning.When leaving the fire everyone carried a lighted coal home.Violet Notley 14th June 1938\n", "school_info": "School: Kilmore", "metadata": [{"Location:": "Kilmore, Co. Roscommon", "Teacher:": "\nMáiréad, Bean Mhic Giolla Críost\n"}, {"Collector": "Violet Notley", "Gender": "female"}, {"Language": "English"}]}, "4742099/4735844/4924665": {"title": "Oíche Fhéile Seáin", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0468, Page 309", "Page 309"], "url": "https://www.duchas.ie/en/cbes/4742099/4735844/4924665", "text": "", "school_info": "School: Bunaneer", "metadata": [{"Location:": "Bunaneer, Co. Kerry", "Teacher:": "\nSiobhán Ní Choncubhair\n"}, {"Collector": "Siobhán Ní Concubhair", "Gender": "female"}, {"Informant": "Bean Siobhán Ní Conchubhair", "Gender": "female"}, {"Language": "Irish"}]}, "4798660/4787933/4926163": {"title": "Stories of Leprechauns", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0234, Page 349", "Page 349"], "url": "https://www.duchas.ie/en/cbes/4798660/4787933/4926163", "text": "\n(continued from previous page)\nHe saw a little man under a bush reading a book. He caught him and said he would kill him unless he gave him a pot of gold. They went to where the gold was. They began digging and as they were working a voice was heard behind them saying \"what are you digging for\" The man looked behind and the leprachaun disappeared.\n\n\n\nThe feast in the year that we have most fun at, is bonfire night. A few days before it, the children go around with a money box and collect money which they spend on buying sweets and things for it.  On bonfire night all the children gather and light a big fire. After a good  while they make tea and give it out in cups with slices of cakes. When it is over they sit on forms   and chairs around the fire and wait till half eleven or twelve then they all go home.\n(continues on next page)\n", "school_info": "School: Tighmhanach", "metadata": [{"Location:": "Tivannagh, Co. Roscommon", "Teacher:": "\nMrs E. Jordan\n"}, {"Language": "English"}]}, "4811599/4800574/4929098": {"title": "St John's Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0270, Page 210", "Page 210"], "url": "https://www.duchas.ie/en/cbes/4811599/4800574/4929098", "text": "\nSt. John's EveIt was a local custom some years ago, for the young people of this neighbourhood to collect a quantity of turf and wood and light a huge bonfire on a high hill, on St. John's Eve. They passed the night in singing and dancing round the fire, and cheering their loudest. When leaving for home, they always carried away with them a lighted sod which they threw into a corner of the nearest field to avert sickness from cattle during the year.\n", "school_info": "School: Cluain na Cille", "metadata": [{"Location:": "Cloonakille, Co. Roscommon", "Teacher:": "\nEithne , Bean Uí Fhallamhain\n"}, {"Language": "English"}]}, "4921567/4880368/4930037": {"title": "St John's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0269, Page 150", "Page 150"], "url": "https://www.duchas.ie/en/cbes/4921567/4880368/4930037", "text": "\nOn the eve of St. John's day bonfires were and are still lighted. The practice of bringing a coal away has however been discontinued.\n\n\n\nSome fowl usually a cock or two were killed in honour of St Martin Blood has to be shed in any case. Formerly some one in a townland killed a calf or sheep & the neighbours bought portions of him.Should a beast be sick, it was very often offered up for St Martin I mean if a beast happend to be sick during the year. Then on the day the animal would be slaughtered Hi was not to be sold alive in any case. The poor people in former times looked upon fresh meat or fowl as a great luxury. Now-a-days although the people keep up the old custom of killing, there is not much notice taken.\n", "school_info": "School: Baile 'n tSléibhe (B.)", "metadata": [{"Location:": "Cornalee, Co. Roscommon", "Teacher:": "\nMáirtín Mac Conchradha\n"}, {"Language": "English"}]}, "4921935/4911306/4932562": {"title": "St John's Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0480, Page 323", "Page 323"], "url": "https://www.duchas.ie/en/cbes/4921935/4911306/4932562", "text": "\nAbout twenty years ago St.John's Eve ws faithfully kept . It is kept in several places still but not so generally as in the past.      Creels of turf and bog deal were drawn to the appointed place before hand. The \"bone-fire\" was made and lift ready  for lighting . The young people dresses in their best accompanied in many cases by their parents watch the blaze arise when the 'Red\" sod of turf had kindled the  dry wood. Matches were not  commonly used.    The fiddlers arrived and the Irish dancing began. A  few pleasant hours were  spent  Fire was taken from the bon-fire and put into the potato -garden for a blessing on the crop.    Some waited for the last embers to die out, others retired early\n", "school_info": "School: Glin (C.)", "metadata": [{"Location:": "Glin, Co. Limerick", "Teacher:": "\nBean Mhic Cárthaigh\n"}, {"Language": "English"}]}, "4921935/4911307/4932564": {"title": "Bonfires", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0480, Page 324", "Page 324"], "url": "https://www.duchas.ie/en/cbes/4921935/4911307/4932564", "text": "\nAll got away before dark as the \"pooka\"  was supposed \"to be out' that night.On one occasion, a party who had visited their friends after the bonfire, were frightened almost to death, on the way home . Their path led past the remains of the bonfire . A mighty wind tore across the place throughout the neighbouring rushes, and left a road in its trail. The bonfire ceased to be held there afterwards. It was held about a quarter of a mile nearer to the houses.Now , the bonfire is held near a cross roads as the young people are fewer in number and it requires more than one townsland to make up a number sufficient for the dance.The fire from the remains of the bonfire is no longer taken away for the gardens and 'pookas' are regarded as things of a foolish age\n", "school_info": "School: Glin (C.)", "metadata": [{"Location:": "Glin, Co. Limerick", "Teacher:": "\nBean Mhic Cárthaigh\n"}, {"Language": "English"}]}, "4811603/4800841/4934449": {"title": "Fishing off Bothallach St John's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0274, Page 060", "Page 060"], "url": "https://www.duchas.ie/en/cbes/4811603/4800841/4934449", "text": "\nThere is a place on the side of the Point of Oileán Beag, and it was a noted place for killing bream. A man from Baile 'n Chalaidh went fishing there - fishing bream off the rock with a fishing rod - one St. John's Day. He killed a fine strap of fish - as much as he could bring home. Several people went fishing bream there since but not a bream did they kill.It is said that it isn't right to go fishing St. John's Day; and that is why the Bream left Bathallach.\n\n\n\nGo h-ana minic tagann stoirm timcheall an lae sin agus deineann sé ana scrios ar na garrdhaí  - go h áirighthe na prátaí. An bhlian áirighthe  seo tháing storm mar sin agus do dhein sé ana scrios ar gharrdha prátaí Dhomhnaill Peadar i mBaile'n Chalaidh.\"Hanam an Diabhal, ar seisean, \"níl\n(continues on next page)\n", "school_info": "School: Oileán Baoi (Dursey)", "metadata": [{"Location:": "Dursey Island, Co. Cork", "Teacher:": "\nEoghan Ó Súilleabháin\n"}, {"Collector": "Nóra Ní Dhuinneacha", "Gender": "female"}, {"Language": "English"}]}, "4723825/4716643/4938719": {"title": "Bonfire Night on Lisdinny Hill", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0936, Page 380", "Page 380"], "url": "https://www.duchas.ie/en/cbes/4723825/4716643/4938719", "text": "\nRejoice you bold Clontibret boys, you sons of Brian Boru,You showed your light on Saint Johns night your distant hill to view,Your coal and tar was seen so far to show you're living still,To celebrate all victory and illuminate the hillSt Marys band it did beat grand in circles round the blaze,Both young and  old they did make bold and on it they did gazeTheir drums did sound like thunder their flutes played sweet and shrill,It mad the valleys echo around Lisdinney Hill.The Derrynoose men to make noise in thousands they did come,They marched that night with grand torch light to the noise of fife and drum,To view the famed Clontibret maids it was their motive stillWho lived along the border of sweet Lisdinny HillWhen the door was laid down the dancing did begin,Derrynoose against Clontibret to see which of them would\n(continues on next page)\n", "school_info": "School: An Léim Gearr", "metadata": [{"Location:": "Lemgare, Co. Monaghan", "Teacher:": "\nP. Duffy\n"}, {"Language": "English"}]}, "4921983/4915369/4943420": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0494, Page 070", "Page 070"], "url": "https://www.duchas.ie/en/cbes/4921983/4915369/4943420", "text": "\nThe parish priest of Lixnaw, all his butter was carried with pishogues. He had twelve cows milking and whatever bit of butter he used to make he used to send it to the market in Cork. At that time he was only able to get sixth quality for it and this quality was titled \"Bishop\". He used to say \"I have the privilege of being parish priest of Lixnaw and Bishop of Cork.\"\n\n\n\n\"St John's night  bonfires were lit always long ago and the cows were followed around the field with burning bushes in order to bring them in calf\"Nora LyonsCratloe West\n\n\n\nJoan Grogan was in league with the devil and if you want to know about a first-class rogue here she is R.I.P.  She used be always telling stories of dead people. One day she was telling a story to a woman about her daughter who was dead. \"I won't believe a word of it unless\n(continues on next page)\n", "school_info": "School: Cnoc Uí Choileáin, Mainistir na Féile", "metadata": [{"Location:": "Mountcollins, Co. Limerick", "Teacher:": "\nPádraig Ó Coileáin\n"}, {"Informant": "Nora Lyons", "Gender": "female", "Age": "circa 90", "Address": "Crataloe West, Co. Limerick"}, {"Language": "English"}]}, "4921989/4915790/4945870": {"title": "St John's Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0495, Page 128", "Page 128"], "url": "https://www.duchas.ie/en/cbes/4921989/4915790/4945870", "text": "\nSt John's Eve falls in Midsummer just as Christmas night falls in Midwinter. What a sight it is to look around the countryside to see a bonfire by every family. The bonfire is lighted in the open during the Summer Solstice while the yule log is burned for a fire in the Winter Solstice. In some places families gather together to light the bonfire. One person brings a bart of brosna, another person brings a sop of hay while another brings a pint of petrol. It is lighted at dusk. Some sing a song and more dance. When the embers are dying out they jump across it so as to have luck for the year. Then they bring a cow and make her jump it so as to have an increase in her milk in the future. In former days if the people had a sick animal they would burn it in the fire and if they hadn't they would\n(continues on next page)\n", "school_info": "School: Radharc na Féile", "metadata": [{"Location:": "Abbeyfeale West, Co. Limerick", "Teacher:": "\nTadhg Mac Coitir\n"}, {"Collector": "John Cotter", "Gender": "male", "Address": "Kilmaniheen West, Co. Kerry"}, {"Language": "English"}]}, "4922073/4850045/4950018": {"title": "Digging a Grave on Monday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0517, Page 451", "Page 451"], "url": "https://www.duchas.ie/en/cbes/4922073/4850045/4950018", "text": "\nSome people never open a grave on Monday for man or beast because it is said another person or beast will die soon after. Other people never give out a change money on Monday.\n\n\n\nOn Shrove Tuesday there is a piece of meat left after the dinner. It is stuck on a scolb and put up in the thatch and left there till Easter Sunday morning. Then it is taken down and fried and each person must eat a piece of it.\n\n\n\nOn St. John's Eve there is a sheaf lighted and taken out and each beast is struck with it. The end of the sheaf is them brought in and placed between the thatch and the rafters. This was done to protect the cows from all harm during the year.\n", "school_info": "School: Fedamore (B.)", "metadata": [{"Location:": "Fedamore, Co. Limerick", "Teacher:": "\nMartin Moloney\n"}, {"Informant": "James Marshall", "Gender": "male", "Age": "55", "Occupation": "farmer", "Address": "Kildonnell, Co. Limerick"}, {"Language": "English"}]}, "4922062/4848897/5009807": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0514, Page 122", "Page 122"], "url": "https://www.duchas.ie/en/cbes/4922062/4848897/5009807", "text": "\nSt John's Day, 24th June.On St. John's Eve all farmers light large blasts in their gardens. They light it so that the wind will blow the smoke across the garden. They do this in order to get the Saint's blessing on the crop and to prevent blight.They also drive the cattle through the flames.The 15th of August is the Pattern Day of Ballylanders Co. Limk. People make the rounds at Our Ladys Well for 8 days before the 15th and many do so on the 15th itself. Its the great day in this part of East Limk. and people look forward to the Pattern for months before. hand. \"Are you going the Pattern?\" is the usual question in August. Tinkers thimble-rigers, card-sharpers and sweet-cars begin to arrive in the village a week before hand.One old fellow with a shooting gallery always takes up his place at the Church Gate and shouts out \"Two shots a penny or five for two pence, Two wagons of gold to be given away between\n(continues on next page)\n", "school_info": "School: Gleann na gCreabhar (Anglesboro), Baile Mhistéala", "metadata": [{"Location:": "Anglesborough, Co. Limerick", "Teacher:": "\nPádraig Ó Cadhla\n"}, {"Language": "English"}]}, "4922109/4852944/5011002": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0527, Page 196", "Page 196"], "url": "https://www.duchas.ie/en/cbes/4922109/4852944/5011002", "text": "\nSt John's Day 25th June. In the village of Patrickswell it was the custom to light a bonfire on the eve of 25th June. Celebrations with eye-fiddles and playing of bag-pipes continued during the night.Seán Ó Riain\n\n\n\nA Ghost Story.A ghost story told by John Ryan, Patrickswell. It happened near Kildimo.  A young man went out at night to visit a neighbouring farm house, and on the pier of the gate he saw a man sitting.  He spoke to him and said \"Oiche maith duit\".  The man on the pier replied. \"Gurab (?) duit\".  He said also, \"Is mise d'athair\".  If I were an evil spirit now, I would destroy you for speaking.  \"I am\", said the father, here every night since I died 21 years ago, and I want you now to suffer a little on my behalf\".So first thing he had to do was to meet him another night in a certain field near by.  Where he had a long conversation with the father in this field.  Where there were also many ghosts.  His father told him that these were put in purgatory.  The boy had to go twice weekly to meet the father in this field, and in the meantime a man died in the neighbourhood.  His friends came to the son to ask his father what way was the man who died recently circumstanced.  The son asked the father the next night about him.\n(continues on next page)\n", "school_info": "School: Tobar Pádraig", "metadata": [{"Location:": "Patrickswell, Co. Limerick", "Teacher:": "\nAnraoi Ó Broin\n"}, {"Collector": "Seán Ó Riain", "Gender": "male"}, {"Language": "English"}]}, "4922138/4855968/5011432": {"title": "Galloping Hogan", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0536, Page 127", "Page 127"], "url": "https://www.duchas.ie/en/cbes/4922138/4855968/5011432", "text": "\n(continued from previous page)\nSome people say the money is hid in Donoghans. One time when he was running he turned the shoes on the horse so that they would think he was gone the other way.\n\n\n\nWe have St Johns Day the 24th of June. The people light bonfires that night. They used to light them on the hills. It was the custom in olden times. They used to light them in the fields where the crops are sown. It was a custom that the farmers used to light furze bushes in the tillage fields. There used to be big crowds around the bonfires and they used to be dancing and singing around the fires. they used to stay up all night. There was a bonfire in Ballentimple one time and there was a man burned he fell into the fire. He had to go to hospital for three weeks. There was never a bonfire there from that out. It\n(continues on next page)\n", "school_info": "School: Clais", "metadata": [{"Location:": "Clash, Co. Tipperary", "Teacher:": "\nCristíona Ní Chearbhalláinn\n"}, {"Language": "English"}]}, "4758520/4751042/5012612": {"title": "An Old Custom Observed in Co. Waterford - Feast of St John the Baptist 24th June", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0850, Page 141", "Page 141"], "url": "https://www.duchas.ie/en/cbes/4758520/4751042/5012612", "text": "\nA bonfire is lighted on St. John's Night in each farmer's field. A quantity of Furze is piled up in a field and in the evening when cows are milked, the fire is lighted, then the animals are driven into this field, where there is a person appointed to get the animals to pass under the smoke as near as possible to the fire.This custom is supposed to keep sickness from the land during the year. If a cow got a sore foot, she might lick it, and the mouth contracted the sore. This is called \"Foot and Mouth Disease\" long ago it was cured by simple means without publication, such as soft foods and drinks. This was the only trouble people had with Cattle.Told bySister M. Michael O'Donnell            (77 years)Holy Faith Convent,MullinavatCo. Kilkenny.\n", "school_info": "School: Mullinavat Convent", "metadata": [{"Location:": "Mullinavat, Co. Kilkenny", "Teacher:": "\nSr. M. Lorcán\n"}, {"Collector": "Sister M. Michael O' Donnell", "Gender": "female", "Age": "77", "Address": "Mullinavat, Co. Kilkenny"}, {"Language": "English"}]}, "4922210/4861025/5016201": {"title": "Saint John's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0553, Page 371", "Page 371"], "url": "https://www.duchas.ie/en/cbes/4922210/4861025/5016201", "text": "\nThe people of this district in olden times used to look forward to St. John's day, which is commemorated on the 24th June, for it was a great time of merrymaking for them. On the eve of this day they could be seen drawing logs of wood, turf, and everything they could procure to make a good bone-fire to an appointed cross-road.When the fire was lit the people gathered round it, and a lively dance went on. The ringing laughter and the merry shouts of the dancers could be heard for miles around. This great night of amusement was commonly called Bon-fire night.Joan O'Keefe,Parkstown\n\n\n\nOn May morning the people get up early to judge the point from which the wind is blowing. If it be blowing from the north it is an omen of a good Summer. If from the south a bad Summer, and\n(continues on next page)\n", "school_info": "School: Moycarkey, Thurles", "metadata": [{"Location:": "Moycarky, Co. Tipperary", "Teacher:": "\nMichael Myers\n"}, {"Collector": "Joan O' Keeffe", "Gender": "female", "Address": "Parkstown, Co. Tipperary"}, {"Language": "English"}]}, "4922161/4857215/5016281": {"title": "New Year's Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0540, Page 117", "Page 117"], "url": "https://www.duchas.ie/en/cbes/4922161/4857215/5016281", "text": "\n1)   Long ago people stayed up until twelve or one o'clock in the night to welcome in the New Year and bands went out at midnight to play the old year out and the new year in.2)   In \"gentlemen's\" places they had canons in the roofs of the houses and they use to shoot out the old year.Sir Charles Barrington had canons in his castle in Glenstal.Sheila CumminsGurtnaskehaNewport\n\n\n\nThe custom of lighting bone-fires on St John's Eve still prevails but many of the attendant ceremonies such as throwing in a bone, etc. have fallen into disuse. At the present time people usually light a bush in the corner of\n(continues on next page)\n", "school_info": "School: Tuar, Tulach Sheasta", "metadata": [{"Location:": "Toor, Co. Tipperary", "Teacher:": "\nSíghle Ní Riain\n"}, {"Collector": "Mary Murnane", "Gender": "female", "Address": "Bealaclave, Co. Tipperary"}, {"Language": "English"}]}, "4922146/4856345/5016368": {"title": "Saint John's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0537, Page 180", "Page 180"], "url": "https://www.duchas.ie/en/cbes/4922146/4856345/5016368", "text": "\nSaint John's day is on the twenty fourth of June. It is celebrated by lighting bone fires in this District. All the young boys and girls collect on various hill. The gather rotten furs, sticks and a bag of turf. They take these to the top of the hill and make a big bone fire. They also bring with them a mouth-organ and a fluit. They spend three or four hours dancing and singing around the bone fire. Some people when the are coming home bring a burned stick them and they throw it after the cattle as the old people said is was lucky Saint John is the Patron Saint of light.There are no stories or expressions about Saint John's feast day.Peg Ní Coinleáin 8ad Mí Nodlagh\n", "school_info": "School: Cill na Naomh", "metadata": [{"Location:": "Kilnaneave, Co. Tipperary", "Teacher:": "\nMícheál Ó Flannagáin\n"}, {"Collector": "Peg Ní Coinleáin", "Gender": "female"}, {"Language": "English"}]}, "4798739/4794786/5017395": {"title": "Nósanna a Bhain le Féile Naomh Eoin", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0278, Page 034", "Page 034"], "url": "https://www.duchas.ie/en/cbes/4798739/4794786/5017395", "text": "\nFuaras an t-Eolas seo ó Sean Ó Murchadha, Sean Baile Léith, Baile an Easa, Baile Chaisleán BéarraTuiteann féile Naomh Eoín ar an 24 adh lá de mhí Meithimh. Is féile Eaglaise é agus féile náisiúnacha leis.Tá a lán nós ag baint leis an tráthnóna roimh ré. Lastar teinte cnámha ar an dtaobh de'n gháirdín as a thagann an ghaoth, i dtreó is go raghadh an deatach treasna na páirce agus má théigheann deirtear go mbeidh gáirdín maith sa'n áit sin, agus scartar uisge coisrichthe ar an gháirdín leis.Lastar teine cnámh leis taobh amuigh de chró na mbó agus toimeántar na ba thart agus léimeann na daoine thart leis. Deinntear na ba agus na daoine  do bheannughadh leis le h-uisge coisrichthe.Deintear cró na mbó agus an tig cómhnuidhthe do bheannughadh leis.Nuair a bhíonn tuitim na h-oidhche  ann téigheann na daoine amach ag féacaint ar an deatach go léir agus má bhíonn an oidhche go ciúin bíonn sé bailighthe ag bun an cnuic agus an ghealach ag soillsií ortha a dhéanamh níos gile. Máire Ní Mhurchadha  ( Failleán)\n", "school_info": "School: An Clochar, Baile Caisleáin Bhéara", "metadata": [{"Location:": "Castletownbere, Co. Cork", "Teacher:": "\nAn tSr. M. Rosáraí\n"}, {"Collector": "Máire Ní Mhurchadha", "Gender": "female", "Address": "Felane West, Co. Cork"}, {"Informant": "Seán Ó Murchadha", "Gender": "male", "Address": "Shanavallyleigh, Co. Cork"}, {"Language": "Irish"}]}, "4922285/4867286/5022772": {"title": "St Martin's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0577, Page 120", "Page 120"], "url": "https://www.duchas.ie/en/cbes/4922285/4867286/5022772", "text": "\n(continued from previous page)\nwords in Irish.\"Nine nights and a night without counting\"It is said that St. Martin was ground in a mill.In olden times if a person had a pig sick they would offer him up to St. Martin and he generally got cured. When the pig is cured he should be killed and not sold.\n\n\n\nSt John's Eve falls on the 23rd June and there is an old custom associated with it, which is still observed here. On that night a group of youths gather together at a cross roads and they light a bone-fire. They sit around it singing and playing music and some of them dance. They often remain on until early morning. Some people take a lighted furze bush from the bonefire and walk around the potato garden with it. This is supposed to prevent disease in the crop. Other farmers drive their cows through the embers of the bone-fire to keep them from disease.\n", "school_info": "School: Currach Púir (Curraghpoor), Dún na Sgíath", "metadata": [{"Location:": "Curraghpoor, Co. Tipperary", "Teacher:": "\nLiam Ó Duibhir\n"}, {"Collector": "Mary Carroll", "Gender": "female", "Address": "Coolacussane, Co. Tipperary"}, {"Informant": "Mrs J. Carroll", "Gender": "female", "Age": "42", "Address": "Coolacussane, Co. Tipperary"}, {"Language": "English"}]}, "4922309/4869021/5051611": {"title": "Herbs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0582, Page 231", "Page 231"], "url": "https://www.duchas.ie/en/cbes/4922309/4869021/5051611", "text": "\n(continued from previous page)\nWart Weed:  Contains a milky liquid in the stem + this when applied to warts helps to banish them\n\n\n\nOn Michaelmas day the first goose of the year is eaten.\n\n\n\nOn St. John's night fires are lit at cross-roads and on top of mountains. Every farmer lights a bush in the midst of his cattle and in his garden.\n\n\n\nOn May eve a bush is cut off a hawthorn and on the bush a bunch of wild flowers are tied with ribbons it is then stuck down in the ground and left there. This is done to honour the Blessed Virgin.\n\n\n\nBreadthe bread was called Wheaten bread baked on a griddle. Other bread they had was made of potatoes washed and\n(continues on next page)\n", "school_info": "School: Coill an Easbuig (Bishopswood), Dundroma", "metadata": [{"Location:": "Bishopswood, Co. Tipperary", "Teacher:": "\nMícheál Mac Cárthaigh\n"}, {"Collector": "Mary Dwyer", "Gender": "female", "Address": "Bishopswood, Co. Tipperary"}, {"Language": "English"}]}, "4922266/4865687/5055325": {"title": "St John's Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0572, Page 450", "Page 450"], "url": "https://www.duchas.ie/en/cbes/4922266/4865687/5055325", "text": "\nSt. John's EveOn St. John's Eve it is an old custom for young men to light bonfires at the cross roads.\n\n\n\nMay EvePeople believe that a great deal of witchcraft was carried out on May Eve long ago. On that account people used to sprinkle Easter Water on the fields, crops, cattle and other animals.\n\n\n\nShrove TuesdayShrove Tuesday night is called Pancake Night. People made pancakes and put a ring in one of them. For the person who gets the ring it is looked on as a lucky omen.\n", "school_info": "School: Gormanstown, Árd Fhíonáin", "metadata": [{"Location:": "Gormanstown, Co. Tipperary", "Teacher:": "\nPeadar de Mhóiréis\n"}, {"Collector": "Maureen Marsh", "Gender": "female"}, {"Informant": "Mr Marsh", "Gender": "male", "Address": "Gormanstown, Co. Tipperary"}, {"Language": "English"}]}, "5008826/4959209/5072946": {"title": "Halloween", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0662, Page 099", "Page 099"], "url": "https://www.duchas.ie/en/cbes/5008826/4959209/5072946", "text": "\nHallowe'en    Two basins - one of clean water and of dirty water. A girl was blindfolded, and if she selected the clean water she got a young man, and if the dirty water an old man.A girl blindfolded goes out and pulls a cabbage stalk. If she gets a straight one she gets a nice man, and if a crooked one a bad man.\n\n\n\nTwelfth Night: On eve of twelfth night twelve blessed candles were lighted in honour of the twelve apostles, and the remains of the candles were put up over the stable door.\n\n\n\nHallowe'en: The hearth was swept clean and a plate of champ was left for the poor souls.\n\n\n\nBonfire night: On St. John's eve 24th June fiddlers came and there was Irish dancing round the bonfire.\n\n\n\nThe Black Pig ran down the Ardee Road on his way to the Boyne. There will be trouble on the [Race?] of the Black Pig. (Miss Annie Costello).\n", "school_info": "School: Mullaharlin", "metadata": [{"Location:": "Mullagharlin, Co. Louth", "Teacher:": "\nSs. Mac Siúrdáin\n"}, {"Informant": "Miss Annie Costello", "Gender": "female", "Age": "82", "Address": "Killally, Co. Louth"}, {"Language": "English"}]}, "5008896/4964708/5079712": {"title": "May Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0683, Page 053", "Page 053"], "url": "https://www.duchas.ie/en/cbes/5008896/4964708/5079712", "text": "\nThis was a favourite day on which tenants \"flitted\" from an old house to a new one          They were afraid that if they \"flitted\" on any other day bad luck would follow them in their new home.\n\n\n\nThis was expected to be a lucky day for sowing of mangolds. At least the farmers in olden times would not sow mangolds until  after that date.\n\n\n\nOn this day a Pilgrimage used take place to St John's Well in Warrenstown. Only the rich people used go on this pilgrimage. At 12 o'ck on that night. the water\n(continues on next page)\n", "school_info": "School: Duleek (C.)", "metadata": [{"Location:": "Duleek, Co. Meath", "Teacher:": "\nMáire, Bean Uí Dhonnchadha\n"}, {"Language": "English"}]}, "4922368/4874900/5080725": {"title": "Bonfire Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0617, Page 253", "Page 253"], "url": "https://www.duchas.ie/en/cbes/4922368/4874900/5080725", "text": "\nSt. Johns night is called bonfire night because it is a custom of the Irish people to light bonfires in honour of St John. The bonfires are lit on St Johns Eve which falls on the twenty third of June.The fire is lit when it is getting dark. All the children dance, sing, and roar around it. The people also light a torch and follow the cattle with it and make the sign of the cross over them with it. Most bonfires are lit on the top of hills.\n\n\n\nSt Bridgets Crosses\n(continues on next page)\n", "school_info": "School: Cill Seanaigh (B.), Inis", "metadata": [{"Location:": "Kilshanny, Co. Clare", "Teacher:": "\nMícheál Mac Craith\n"}, {"Collector": "Liam Ó Murchadha", "Gender": "male", "Address": "Kilshanny, Co. Clare"}, {"Informant": "Stephen Reynolds", "Gender": "male", "Address": "Kilshanny, Co. Clare"}, {"Language": "English"}]}, "5008880/4963191/5082520": {"title": "Saint John's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0678, Page 058", "Page 058"], "url": "https://www.duchas.ie/en/cbes/5008880/4963191/5082520", "text": "\nBonfires were lit long ago on St John's Day with old bushes bones old wood etc. All the people used to gather round the young and old to keep the lights on till the middle of the night. The people used to dance and sing round the bonfires. They used to sprinkle holy water on the bonfire and light the first bush of it and drag the bush through the fields where the crops were grown and strike the cows with it\n\n\n\nGirls stay up till twelve oclock to get a looking glass and go down the stairs backways and keep looking into the glass By the time she gets to the bottom of the stairs she will see the face of the man she is to marry. She must go down the stairs and have her back to the bottom of the stairs\n", "school_info": "School: Mell, Mell N. School, Drogheda", "metadata": [{"Location:": "Mell, Co. Louth", "Teacher:": "\nE. Ní Cholmáin\n"}, {"Language": "English"}]}, "4922383/4876308/5083098": {"title": "May Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0621, Page 417", "Page 417"], "url": "https://www.duchas.ie/en/cbes/4922383/4876308/5083098", "text": "\n(continued from previous page)\nin the country. Green branches are placed over the  doors of homes and stables, supposed to keep out the fairies from doing harm to the stock. The cabins and dairies are all locked this night to prevent fairies from taking away the milk and butter.\n\n\n\nBonfires are lit on all the hillsides on this evening and singing and dancing are continued long into the night until the fires die out.Stories are told by the older boys sitting peacefully around the fire and games are played by the younger crowd.In some remote districts farmers burn a bush in the middle of the field of their farm.MICHAELMASA goose is killed in almost every home in this festival\n", "school_info": "School: Lahinch", "metadata": [{"Location:": "Lehinch, Co. Clare", "Teacher:": "\nDónall Ó Ríordáin\n"}, {"Informant": "John O' Dwyer", "Gender": "male", "Age": "72", "Address": "Calluragh South, Co. Clare"}, {"Language": "English"}]}, "5044803/5040022/5083164": {"title": "Easter", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0968, Page 323", "Page 323"], "url": "https://www.duchas.ie/en/cbes/5044803/5040022/5083164", "text": "\n(continued from previous page)\nduck eggs and potatoes for their breakfast. Often a gosoon ate eight eggs, and went away to mass then. Even to this day people have the eggs, but instead of potatoes, we now have bread and tea. The very poorest family will try to have three or four eggs each for this morning for breakfast. Children eat from four to seven eggs each.People eats eggs again to their tea, and some eat them to their dinner too. On Easter Monday children used to put on fires put on a cast of roasties, boil eggs, and have a great feast out under a tree, or along a ditch.\n\n\n\nOn this night the young people gather up turf, sticks and heather, and made a great fire that lasted till past mid-night. They sang, danced, and played themselves till tired.  Every district had a fire. The fire in this part was at the ''Bars'' beside Tiercahan School. They make the fire there still on the 23rd May. Old people each has a fire in his own land, (it wouldnt be counted lucky if he hadnt) and he carries some of the burned cipeens to his crop field so as to give him a good yield.\n", "school_info": "School: Tiercahan", "metadata": [{"Location:": "Tircahan, Co. Cavan", "Teacher:": "\nP. Ó Riain\n"}, {"Language": "English"}]}, "5044787/5038088/5084116": {"title": "Festival Customs - St John's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0963, Page 485", "Page 485"], "url": "https://www.duchas.ie/en/cbes/5044787/5038088/5084116", "text": "\nor lend anything especially milk. Nobody would give a setting of eggs because they would be unlucky.The bonfire is lighted on the night of the 23rd of June is said by some to be in honour of St. John. Others say it is a pagan custom to light a fire in the night. The fire is made of turf, rushes, whins and heather. Cheers are passed on from one bonfire to another until all the countryside is cheering. Songs are also sung around them.Hallowe'en\n", "school_info": "School: Tomena", "metadata": [{"Location:": "Gortullaghan, Co. Cavan", "Teacher:": "\nT. Mac Uidhir\n"}, {"Language": "English"}]}, "5070768/5060899/5094372": {"title": "The Bonfire Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0993, Page 363", "Page 363"], "url": "https://www.duchas.ie/en/cbes/5070768/5060899/5094372", "text": "\nThere are two bon-fire nights the bonfire night and the old bon-fire night. The bon-fire night falls on the 23rd of June and the old bon-fire night falls on the 28th of June every year.A few evenings previous to the bon-fire night the young people gather, turf sticks, hay, straw, and whins to the place where the bon-fire is going to be held which is usually on a hill-top or at a cross-roads.When the bon-fire night comes all the young people assemble at the place where they have the firestuff collected. They build up the fire first and at dusk they light it. When it is lighted the young people sit around it, telling stories, singing songs, and amusing themselves. Sometimes there is a man playing a violin or a floot and the people dance. When the fire is near burned out the people extingush it and return home.\n", "school_info": "School: Crosserlough", "metadata": [{"Location:": "Crosserlough, Co. Cavan", "Teacher:": "\nL. Reilly\n"}, {"Language": "English"}]}, "5070796/5064689/5096396": {"title": "Festival Customs - The Bonfire Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1003, Page 066", "Page 066"], "url": "https://www.duchas.ie/en/cbes/5070796/5064689/5096396", "text": "\nThe Bonfire Night is held on the 23rd of June, St. Johns Eve. The reason is not known for which in is held. On that evening people gather sticks (peoples) and turf and put them all together on the side of the road. When night comes a crowd of people go to the sticks and turf and light them. Then they start dancing and singing (an) round the fire. Some people do not (do not) sing or dance round the fire, they just sit down beside the bonfire, and talk. At twelve p.m. they go home. When they are going home  they bring a lighted turf on a fork and throw it into the field of oats or wheat. They say that the turf burns the bad luck out of the crop. It is usual to have and an other bonfire on the on the 29th of June, but they do not throw the lighted turf into the field when they are going home.\n", "school_info": "School: Mullagh (B)", "metadata": [{"Location:": "Mullagh, Co. Cavan", "Teacher:": "\nJames Drury\n"}, {"Collector": "Michael Murchan", "Gender": "male", "Address": "Shancarnan, Co. Meath"}, {"Informant": "Mr M. Murchan", "Gender": "male", "Age": "52", "Address": "Shancarnan, Co. Meath"}, {"Language": "English"}]}, "5070793/5064476/5097543": {"title": "Bonfires", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1001, Page 382", "Page 382"], "url": "https://www.duchas.ie/en/cbes/5070793/5064476/5097543", "text": "\nBonfires were very common until 20 years ago and they are now completely wiped out. The chief cause of the decay of bonfires is due in part to lack of firewood and another cause is the decrease of the population of youngsters. In the olden times there was a bonfire on every hill but in parts of the locality there was a special bonfire and young men and some old people too walked a considerable distance to one of those given out bonfires. There would be fiddlers and all kinds of musicians, tambouring and fires. Young girls were there by the score and if the night was good and dry they sang and danced until the small hours of the morning and this custom was continued from the time of St. Patrick. When he came to convert the Irish people they had their great bonfires especially the great fire they had to the memory of Baal, their chief god. Young men frequented these bonfires which were (was) held on the 1st of May. They had various games and athletic fetes and other games, mirth and carousing and the Pagan youth watched and\n(continues on next page)\n", "school_info": "School: Lattoon", "metadata": [{"Location:": "Lattoon, Co. Cavan", "Teacher:": "\nP. Ó Hiorraí\n"}, {"Collector": "Brigid Coyle", "Gender": "female", "Address": "Coragh, Co. Cavan"}, {"Informant": "Mr P. Mc Gennis", "Gender": "male", "Address": "Coragh, Co. Cavan"}, {"Language": "English"}]}, "5070797/5064838/5097639": {"title": "A Christmas Eve Custom", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1003, Page 215", "Page 215"], "url": "https://www.duchas.ie/en/cbes/5070797/5064838/5097639", "text": "\n(continued from previous page)\nBethlehem on the first Xmas -eve night, instead of closing their doors and saying \"No room\", they would have open-wide their doors and have a big welcome for the Travellers.\n\n\n\nA huge bonfire is lit near Mullagh on St. John's eve each year and the young people dance around it.\n", "school_info": "School: Mullagh (C )", "metadata": [{"Location:": "Mullagh, Co. Cavan", "Teacher:": "\nElizabeth Murchan\n"}, {"Collector": "Ida Deignan", "Gender": "female"}, {"Language": "English"}]}, "5070798/5064963/5099863": {"title": "Bonfires", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1003, Page 340", "Page 340"], "url": "https://www.duchas.ie/en/cbes/5070798/5064963/5099863", "text": "\nThere are two bonfire nights celebrated one on 23rd June and the other on 28th June.It is a common belief that if the weather breaks between these nights, it will be a wet Summer and I have known this to happen sometimes.The bonfire is made on the hill top or often at a roadside convenient to a bog from which supplies of fuel could be easily provided.When the fire blazes up as the result of a sprinkling of dry turf and sticks with paraffin oil supplied gratis by the local shopkeeper.It is a pretty sight when on a dark night one after another of the bonfires of surrounding highlands all twinkle in the night while faint cheering may be carried from far off on calm nights.I met an old woman on bonfire night carrying half-burnt turf sods from the bonfire. She told me that her husband had always taken turf home with him to throw into his cottage garden and that she was so to speak continuing the old custom.Cattle are never driven through the smouldering ashes though I have heard of that custom in other counties.While the fire burns brightly, the people - young and old gather round talking, singing or listening to the music of a violin or melodian.\n", "school_info": "School: Cros Riabhach", "metadata": [{"Location:": "Crossreagh, Co. Cavan", "Teacher:": "\nT. Ó Siordáin\n"}, {"Language": "English"}]}, "5009138/4990401/5101148": {"title": "St John's Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0750, Page 380", "Page 380"], "url": "https://www.duchas.ie/en/cbes/5009138/4990401/5101148", "text": "\nIn the Forgney district of Longford I have never seen a bon fire on St. John's Eve, though I have  lived here for the past twenty-nine years. The people here seem never to have heard of this custom.But   in my native district of Carrick-on-Shannon it is still observed. When I was a child, the lighting of the bonefire was a most exciting event. Outside each house would be kindled a fine fire of turf, sticks etc. All the members of the household would sit on the ditch or on stools, near the fire. The older people would tell stories or play games with the younger ones. Sometimes we had music or dancing. As the fire waned it would be replenished.Sometimes, neighbours after sitting a while by their own bonfires, would visit ours, and vice versa. When bed-time\n(continues on next page)\n", "school_info": "School: Forgney, Ballymahon", "metadata": [{"Location:": "Forgney, Co. Longford", "Teacher:": "\nMrs B. Higgins\n"}, {"Collector": "B. Higgins", "Gender": "female", "Address": "Forgney, Co. Longford"}, {"Language": "English"}]}, "5103353/4992655/5103711": {"title": "Other Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0756, Page 236", "Page 236"], "url": "https://www.duchas.ie/en/cbes/5103353/4992655/5103711", "text": "\nIt is a custom in this locality to \"bleed for Martin\". The Martin referred to must be St. Martin who was a martyr.    On a day in the week before the 11th November each year it is a custom to as they say to \"bleed for Martin\". A bird is taken from the farmyard and killed. In some places the blood is sprinkled in the four corners of the kitchen    Geese are in season at this time of the year, and in the well-to-do farmers houses the bird killed is usually the goose.    The dinner partaken of \"for Martin\", of course is not on a scale with the Easter dinner, or the dinner on St Patrick's Day.\n\n\n\nThe \"Bonfire Night\" occurs on the eve of the feast of St. John, that is, the 23rd June.   In few places around here are bonfires collected now. The custom is dying out. Some years ago there would scarcely be a school boy who would not be out from the time school was over, collecting\n(continues on next page)\n", "school_info": "School: Cluainteach (C.), Newtownforbes", "metadata": [{"Location:": "Cloontagh, Co. Longford", "Teacher:": "\nBean Mhic Garaidh\n"}, {"Language": "English"}]}, "5009165/4993430/5104132": {"title": "The Bonfire Nights", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0758, Page 166", "Page 166"], "url": "https://www.duchas.ie/en/cbes/5009165/4993430/5104132", "text": "\nOn the eve of St John's day and also on the night of St Peter and Paul's day the people have bonfires. It is the children that are usuall at the bonfire on the eve of St Johns day but on the 29th June the grown up people have bonfires on the bye roads and the boys and girls dance at the bonfire until bed time.\n\n\n\nLong ago there were dances known as week dances. There was an old fiddler in Clonelly named Corrigan. He would announce a week dance for a certain place on the road, or in a field or in a barn. The young people gathered there on about three nights dewing the week and the dance finished up on Sunday night when a collection of money was made for the fiddler. When the dance was in a barn it lasted only as long as a halfpenny candle kept lighted. When the candle died out the musician stopped playing, announced the place of the next dance and the young people went home.\n", "school_info": "School: Gaigue (B.), Ballinamuck", "metadata": [{"Location:": "Gaigue, Co. Longford", "Teacher:": "\nPeter Duignan\n"}, {"Language": "English"}]}, "5008912/4966277/5106254": {"title": "Crosses", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0687, Page 149", "Page 149"], "url": "https://www.duchas.ie/en/cbes/5008912/4966277/5106254", "text": "\nCrosses were made of strong tape or plaited straw and were placed in the cow-houses on St Brigid's Eve to protect  the animals form disease during the year.\n\n\n\nBonfires were lighted on St John's Eve and on the Eve. of the 29th June.\n\n\n\n\"When the 1st of March falls on a Sunday,The d---- a stick will we lay till \"Monday.\"Crows start building their nests on March 1st. It is noted in this locality that when March 1st falls on Sunday the crows postpone their operations until the following day.It is also noted that if the weather is to be wet and stormy for the beginning of the month they defer the building until such time as it is on the point of clearing up.If crows forsake their usual building places in the neighbourhood of residences it is said to portend misfortune to the family.\n", "school_info": "School: Johnstown", "metadata": [{"Location:": "Johnstown, Co. Meath", "Teacher:": "\nMiss H.C. Hickie\n"}, {"Informant": "Mrs Fitzpatrick", "Gender": "female", "Age": "65", "Address": "Kilcarn, Co. Meath"}, {"Language": "English"}]}, "5009198/4996948/5106831": {"title": "Old Festive Customs - St John's Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0766, Page 398", "Page 398"], "url": "https://www.duchas.ie/en/cbes/5009198/4996948/5106831", "text": "\nSt John's Eve is usually called Bonfire Night. Youngsters light bonfires still but the good old custom is slowly dying out. Here is a description of it fifty years ago by old Matt Farrelly. The bonfire night you'd see the boys gathering from glen and dale and heading off to Legga Hill. Everyone would bring a glach of brosna and whins with him. Then came bands of girls wearing their white blouses and Sunday best to join in the dance which was soon to follow the bonfire. Last came the ould men and women chatting up the hill. As night fell we lit ours and you'd think the sky was in a blaze with all the bonfires lit in Leitrim and Longford. Then we started to cheer and were answered\n(continues on next page)\n", "school_info": "School: Moyne (B.)", "metadata": [{"Location:": "Moyne, Co. Longford", "Teacher:": "\nFrancis Doyle\n"}, {"Collector": "Francis Doyle", "Gender": "male", "Address": "Moyne, Co. Longford"}, {"Informant": "Matt Farrelly", "Gender": "male", "Age": "77", "Address": "Cloonelly, Co. Longford"}, {"Language": "English"}]}, "5070818/5067298/5110657": {"title": "Bonfires", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1010, Page 429", "Page 429"], "url": "https://www.duchas.ie/en/cbes/5070818/5067298/5110657", "text": "\nBonfires were common about thirty years ago and they are not completely a thing of the past yet. The chief cause of the decay of bonfires is due in part to the lack of firewood and another cause is the decrease in the population of youngsters. In olden times there was a bonfire on every hill but in parts of the locality there was a special bonfire and young men and some old people too walked a considerable distance to one of these given out (?) bonfires. There used to be fiddlers and all kinds of musicians present at the bonfires, tambouring and fives. Young girls were there by the score and if the night was good and dry they sang and danced unti the small hours of the morning and this custom was continued from the time of St. Patrick. When he came to convert the Irish people they had their great bonfires especially the great fire they had to memory of Baal, then chief God. Young men frequented these bonfires which were\n(continues on next page)\n", "school_info": "School: The Vale (An Gleann)", "metadata": [{"Location:": "Leiter, Co. Cavan", "Teacher:": "\nS. Ó Brolcháin\n"}, {"Language": "English"}]}, "5008974/4972517/5111652": {"title": "Feast Days - May Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0704, Page 266", "Page 266"], "url": "https://www.duchas.ie/en/cbes/5008974/4972517/5111652", "text": "\nIt is a custom for people on May Day to make a may bush and decorated it with flowers and egg shells and other things. They make this bush at night and when the people get up in the morning they see the nice may bush, then during the day the children gather flowers and hang them on the bush.\n\n\n\nOn St. John's Day the people gather sticks and turf and when night comes they pile them up in a big heap and lite a huge fire and then they dance and sing all night round the fire.\n\n\n\nOn New Year's Eve a bell is rung at twelve o'clock which means ringing the old year out and the new year in. It is a custom also for people not to throw out water on that night because you\n(continues on next page)\n", "school_info": "School: Kilskeer (B.)", "metadata": [{"Location:": "Kilskeer, Co. Meath", "Teacher:": "\nMáirtín Ó Loingsigh, R. Ó Fithcheallaigh\n"}, {"Language": "English"}]}, "5008982/4973695/5112779": {"title": "Feast-Days - St Patrick's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0706, Page 516", "Page 516"], "url": "https://www.duchas.ie/en/cbes/5008982/4973695/5112779", "text": "\n(continued from previous page)\nto the nearest public house and drink according to the money they would have. The next day they would brag how well they drowned their shamrock. The women also would indulge in a naggin of punch.Lena Carolan,Druminiskin\n\n\n\nThe feast of Saint John is kept on the twenty fourth of June. On the Eve of Saint John's day there are bonfires lit. They are lit on the side of the road usually, but sometimes they are lit on the top of a hill.The fires are made of sticks. The children gather the sticks the previous day. The fires are lit when it gets dark about eleven o'clock. It is only children that light the fires now. Long ago young men used to light them. They danced and they sung around the fire till it quenched.\n", "school_info": "School: Maio", "metadata": [{"Location:": "Trohanny, Co. Meath", "Teacher:": "\nMáire Ní Chreaig\n"}, {"Collector": "Brigid Mc Cormack", "Gender": "female", "Address": "Druminiskin, Co. Meath"}, {"Language": "English"}]}, "5009009/4976630/5113538": {"title": "St John's Eve and Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0715, Page 006", "Page 006"], "url": "https://www.duchas.ie/en/cbes/5009009/4976630/5113538", "text": "\nOn St. John's Eve a group of men join to light a bonfire.They first select a site, usually on the road-side.They pile up furze, sticks etc. and set it alright at night fall. They dance, sing and play round it, until it burns down and look for other fires over the countryside. When going home each person takes a piece of a stick that was in the fire, and puts it in the home-fire.\n", "school_info": "School: Grangegeeth", "metadata": [{"Location:": "Grangegeeth, Co. Meath", "Teacher:": "\nSéosaimhín, Bean Uí Dhubhghaill\n"}, {"Language": "English"}]}, "5009049/4981092/5116940": {"title": "Hair Cutting and Putting By", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0727, Page 149", "Page 149"], "url": "https://www.duchas.ie/en/cbes/5009049/4981092/5116940", "text": "\n(continued from previous page)\nfor the last day. We often find it in old walls still.\n\n\n\nBonfire Night in Ballinahea.Up to about 10 years ago there were great gatherings at Ballinahea on bonfire night.Long ago the thought of the bonfire brought joy to young and old. About six o clock the fire was lit. Early in the day a few lads went round begging a cart, they usually got one, and pushed it down to the bog themselves. They took twenty sods out of each clamp of turf. My father's father played the flute at the bonfire, and Tom Kelly from the bog played the Melodon. A half barrel of porter which was brought by Pat Gaffney was distributed among the players and dancers. The custom has almost died out now. About three years ago there was a fight over breaking and pulling bushes out of Dargans and Bliths ditches.\n", "school_info": "School: Raharney (B.)", "metadata": [{"Location:": "Raharney, Co. Westmeath", "Teacher:": "\nS. Ó Conmhidhe\n"}, {"Language": "English"}]}, "5009220/4999112/5122861": {"title": "Tintern Parish - St Martin's - St John's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0871, Page 006", "Page 006"], "url": "https://www.duchas.ie/en/cbes/5009220/4999112/5122861", "text": "\nNo 47.  St. John's Day.it was a custom on this night to have a bonfire on the fair green of Nash.  (See No. 24 page 4)  This particular St. John's night the maid at Annesley's the \"Big House\", Dunmain, was late going to the bonfire, which also included a dance.  And, as each one was expected to bring wood or other material for the fire the girl thought how she was to comply with the Rule in the quickest possible way.  She solved the problem.  Taking the shortest cut to the fun, she crossed the fields, and going through the graveyard of Nash, she took the wooden crosses that marked the graves!  These would be her donation to the fire!  Arrived there, she threw the wood into the huge fire, and just then an unknown young man claimed her as his dancing partner.  A step or two and screaming for all she was worth the girl was lifted up and up away into the night.  The other merrymakers were horror-stricken.  The girl was never heard of afterwards.  This incident ended the Nash bonfire on St. John's night in or about the year 1850.  So local tradition says.\n", "school_info": "School: San Leonard, Ballycullane", "metadata": [{"Location:": "Saintleonards, Co. Wexford", "Teacher:": "\nMary B. Dunphy\n"}, {"Collector": "Mary P. Dunphy", "Gender": "female", "Occupation": "teacher"}, {"Language": "English"}]}, "5009116/4988228/5123061": {"title": "Festival Customs - St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0745, Page 038", "Page 038"], "url": "https://www.duchas.ie/en/cbes/5009116/4988228/5123061", "text": "\n(continued from previous page)\nPeople never thresh on that day because St. Martin was ground in a mill while it was grinding corn.\n\n\n\nIn my district the annual custom is observed of lighting a fire on St. John's Night. The fire is lighted in honour and memory of the Saint.On St. John's Day the young men and boys of the place collect together and arrange to have a bonfire that night. When the place is selected which is generally on a height.This is how the fire is made. Some one of the men gets a tar-barrel with some tar in it and places it in the place where the fire is to be lighted. Then some turf is put round it. They leave the rest of the turf there until the fire is started. Then they go in threes\n(continues on next page)\n", "school_info": "School: Ballinahowen", "metadata": [{"Location:": "Ballynahown, Co. Westmeath", "Teacher:": "\nT. Hanly\n"}, {"Collector": "Proinnsias Mac Giolla Pádraic", "Gender": "male"}, {"Language": "English"}]}, "5009108/4987359/5123508": {"title": "Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0742, Page 306", "Page 306"], "url": "https://www.duchas.ie/en/cbes/5009108/4987359/5123508", "text": "\nOn Easter Sunday the sun dances with joy at the Resurrection of Our Lord. Everyone eats the Good Friday eggs for their breakfast.\n\n\n\nIt is very lucky to cut or wash your hair on Good Friday but a man should never shave as it is unlucky to draw blood on that day. You should never shave, cut hair or your nails on a Sunday for\"Sunday cut hair or Sunday cut hornTwere better for that man he never was born\".\n\n\n\nSt John's day falls on the twenty first of June. People gather furze bushes and sticks and light a bonfire. Then they dance and sing all around the fire.\n", "school_info": "School: Loughanvally", "metadata": [{"Location:": "Loughanavally, Co. Westmeath", "Teacher:": "\nMrs. O'Connor\n"}, {"Language": "English"}]}, "5009261/5002566/5132166": {"title": "Bonfire Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0882, Page 159", "Page 159"], "url": "https://www.duchas.ie/en/cbes/5009261/5002566/5132166", "text": "\n159\"Bon-fire Night\"In olden times it was the custom to light a huge fire on St John's Eve.  On one occasion when the fire had been lighted and songs and dancing were being merrily carried on about it, the fuel ran short and some few went off in search of more.  One went to a wood and another to a grove, and the third who was not succeeding very well entered an old cemetary and having gatered up many little wooden crosses she hurried off to the bon-fire and piled on her load.  Then the dancing was resumed but to the awe and astonishment of the onlookers the unlucky girl was taken in a whirlwind and was never heard of any more.Told to me by,   Maura DoyleJohn Doyle. Bridgetown.\n", "school_info": "School: Clochar Naoimh Mhuire", "metadata": [{"Location:": "St. John's, Co. Wexford", "Teacher:": "\nSr. Breandán\n"}, {"Collector": "Maura Doyle", "Gender": "female", "Address": "Bridgetown, Co. Wexford"}, {"Informant": "John Doyle", "Gender": "male"}, {"Language": "English"}]}, "4921591/4882416/5138632": {"title": "St Brigid's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0287, Page 076", "Page 076"], "url": "https://www.duchas.ie/en/cbes/4921591/4882416/5138632", "text": "\nCustoms were also observed on St. Brigid's Day. It was customary for the people of this locality in past times to put a cross on their right arm on cloth. It was usually made with burnt stick. Some also made croses of timber and hung them in their house in honor of St. Brigid.\n\n\n\nThe usual Irish custom on St John's Eve in this locality is to light bonfires. These fires are chiefly lit near potato gardens as the Irish think that it prevents blight from coming on their potatoes. It is a beautiful sight to witness the hill sides ablaze on St John's eve but on the following day the black hillside look dreary.\n", "school_info": "School: Cruachán, An Sciobairín", "metadata": [{"Location:": "Crookhaven, Co. Cork", "Teacher:": "\nSaidhbhín Ní Bhoidbléir\n"}, {"Language": "English"}]}, "5044596/5024583/5139436": {"title": "Customs on Easter Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0805, Page 354", "Page 354"], "url": "https://www.duchas.ie/en/cbes/5044596/5024583/5139436", "text": "\n(continued from previous page)\n[-]\n\n\n\nWell: two days before St. John's Eve all the people get horses and carts and carry firewood to a certain place. Then on St. John's Eve  a fire is lit in honour of the St.\n\n\n\nIt is the custom here when a boy wants to get married and he does not\n(continues on next page)\n", "school_info": "School: Island Parish", "metadata": [{"Location:": "Ballina, Co. Offaly", "Teacher:": "\nSeán Ó Móráin\n"}, {"Collector": "Patrick Kinahan", "Gender": "male", "Address": "Deerpark, Co. Offaly"}, {"Informant": "Peter Kinahan", "Gender": "male", "Address": "Deerpark, Co. Offaly"}, {"Language": "English"}]}, "5044617/5026390/5141357": {"title": "St Martin's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0812, Page 145", "Page 145"], "url": "https://www.duchas.ie/en/cbes/5044617/5026390/5141357", "text": "\nOn St Martin's Day the people used to kill a cock, and sprinkle the blood on the door-step for luck.On St Martin's Day, St Martin was ground in a mill. No mill grinds on St Martin's Day.On St Martin's Day the old people kill a hen, and sprinkle the blood on the door for luck.Long ago St Martin's Day was known as \"Old Hallow Eve\", and some of the old people have their Hallow Eve customs on this day.\n\n\n\n1. On St John's Day long ago the old people used to say Seven Rosarys to St John to bring a blessing down on the family.2. On the eve of St John's Day bonfires are lighted on the tops of high hills. All the people go to the nearest bonfire, and they sing and dance till the fire burns down.\n", "school_info": "School: Clonmacnoise", "metadata": [{"Location:": "Clonmacnoise, Co. Offaly", "Teacher:": "\nP. Ó Maolmhuaidh\n"}, {"Language": "English"}]}, "5044699/5032932/5146103": {"title": "St John's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0911, Page 254", "Page 254"], "url": "https://www.duchas.ie/en/cbes/5044699/5032932/5146103", "text": "\nSt. John's Day is on the 24th June. In olden days and up to the present day in some places people light a bonfire in his honour. When the fire would have died down the people would take two fistfulls of ashes each and spread some in each of their fields and pray to St. John to bless their crops.\n\n\n\nOn St. John's Night the people used to hang a piece of paper on the door and write a prayer on it in honour of St. John, and leave it until the next night.\n", "school_info": "School: Kildavin, Ferns", "metadata": [{"Location:": "Kildavin, Co. Carlow", "Teacher:": "\nTadhg de Brí\n"}, {"Collector": "Aidan Murphy", "Gender": "male"}, {"Informant": "Mr Kehoe", "Gender": "male", "Age": "74", "Occupation": "farmer", "Address": "Drumderry, Co. Wexford"}, {"Language": "English"}]}, "5044699/5032932/5146121": {"title": "St John's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0911, Page 254", "Page 254"], "url": "https://www.duchas.ie/en/cbes/5044699/5032932/5146121", "text": "\nSt. John's Day is on the 24th June. In olden days and up to the present day in some places people light a bonfire in his honour. When the fire would have died down the people would take two fistfulls of ashes each and spread some in each of their fields and pray to St. John to bless their crops.\n\n\n\nOn St. John's Night the people used to hang a piece of paper on the door and write a prayer on it in honour of St. John, and leave it until the next night.\n", "school_info": "School: Kildavin, Ferns", "metadata": [{"Location:": "Kildavin, Co. Carlow", "Teacher:": "\nTadhg de Brí\n"}, {"Collector": "Luke Hayden", "Gender": "male"}, {"Informant": "Mrs Hayden", "Gender": "female", "Age": "56", "Occupation": "farmer's wife", "Address": "Crowsgrove, Co. Carlow"}, {"Language": "English"}]}, "4798761/4796076/5148372": {"title": "Lá Bealtaine", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0298, Page 006", "Page 006"], "url": "https://www.duchas.ie/en/cbes/4798761/4796076/5148372", "text": "\n(continued from previous page)\ncómharsa aon ím do dheunamh as uachtar an bhainne sin go deó.   Fós, má chonnaich duine bean ruadh ar a slighe dho an lá sin do chried sé go dtuitfheadh mí-ádh éigin amach do agus do rith sé abhaile.\n\n\n\nOn the night of 23rd June ( Saint John's night ) it is customary in this district to light bonfires on the hills and in the fields. It is believed that this practice was handed down to us from pre-Christian Ireland. Baal or the Sun being one of the deities adored by our Pagan ancestors, they lighted a fire in his honour in mid-Summer.After the coming of Saint Patrick the fires were still lighted in honour of the Birthday of Saint John the Baptist, to whom the Irish have always  shown great devotion.In this locality it was the custom for each farmer to go to a stream or river where three townlands met. He brought home a\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire (Convent of Mercy)", "metadata": [{"Location:": "Skibbereen, Co. Cork", "Teacher:": "\nNa Siúracha\n"}, {"Collector": "Séosaimhín Ní Chochláin", "Gender": "female", "Address": "Licknavar, Co. Cork"}, {"Informant": "Pádraig Ó Cochláin", "Relation": "parent", "Gender": "male", "Age": "60", "Address": "Licknavar, Co. Cork"}, {"Language": "English"}]}, "4798773/4797503/5150711": {"title": "Sean-Nósa - Lá Bealtaine", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0302, Page 188", "Page 188"], "url": "https://www.duchas.ie/en/cbes/4798773/4797503/5150711", "text": "\n(continued from previous page)\nsa bhaile sar a lastar an teine ar maidin. Annan bheadh a lán bainne agus im ag an nduine san i rith na bliadhna agus ní bheadh an t-ádh ag an gcomharsan. Droch nós dob eadh é sin agus bhíodh eagla ar na daoine agus mar gheall air leigidís amach na ba an oidhche sin.Bí nós eile ann leis dul fé dhein uisge go dtí sruth no tobar no aon áit eile mar sin a bheadh ar theorainn “Bounds Water a tugadh air. Agus ní mór dóibh bheith sa bhaile leis an t-uisge sar a lastar an teine.\n\n\n\nTéigheann buachaillí  is cailíní an tighe amach an oidhche sin agus bailigheann siad aitinn feochta agus cipíní feochta agus deineann\n(continues on next page)\n", "school_info": "School: Drom Dhá Liag (C.)", "metadata": [{"Location:": "Drimoleague, Co. Cork", "Teacher:": "\nBean Uí Dhrisceoil\n"}, {"Language": "Irish"}]}, "4921608/4884614/5150810": {"title": "St Stephen's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0291, Page 546", "Page 546"], "url": "https://www.duchas.ie/en/cbes/4921608/4884614/5150810", "text": "\n(continued from previous page)\nis held with the money\n\n\n\nSt John's EveIn this district fires are lit in the potato fields on St John's Eve.  Withered bushes are gathered together, and they are so placed that when lit, the wind blows the smoke over the crop.The people say that the lighting of these fires brings a blessing on the crops.This custom has been carried out in this district as long as the people can remember.\n", "school_info": "School: Scoil Mhuire (B.)", "metadata": [{"Location:": "Skull, Co. Cork", "Teacher:": "\nLiam Ó Raghallaigh\n"}, {"Language": "English"}]}, "5138257/4970940/5151735": {"title": "Bonfire", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0699, Page 354", "Page 354"], "url": "https://www.duchas.ie/en/cbes/5138257/4970940/5151735", "text": "\nOn the 29th June there is always a Bon fire lit on a hill about a ¼ mile from our house. The boys go round and collect about three cart fulls of turf and make a big fire. While the fire is blazing the young people dance on the road till about three o'clock in the morning. The music they have are violins and melodians and tamberines. Before the fire dies out any farmer who likes, can bring his cattle and drive them through the blaze. This is supposed to keep away all diseases during the year.\n", "school_info": "School: Clochar na Trócaire, An Uaimh", "metadata": [{"Location:": "Navan, Co. Meath", "Teacher:": "\nAn tSiúr Concepta\n"}, {"Collector": "Eileen Norton", "Address": "Navan, Co. Meath"}, {"Informant": "Michael Norton", "Gender": "male", "Address": "Finnea, Co. Westmeath"}, {"Language": "English"}]}, "4921672/4889117/5152216": {"title": "Saint John's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0319, Page 371", "Page 371"], "url": "https://www.duchas.ie/en/cbes/4921672/4889117/5152216", "text": "\nLong ago the people used to have a big Bone-fire, on St John's night. For months beforehand they used to gather trees, furze and have them dry for that great night. All night long the bone-fire could be seen blazing for miles about. The people used to jump over it three times. They also had tin cans, to make the music to which they danced, dressed in all sorts of funny costumes. The Farmers used to throw a piece of the burning wood into their fields and gardens, so as to drive away the fairies and to bring good luck on the crops. The people also took a bit of stick home with them and threw it in their doors to\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire, Ceann tSáile", "metadata": [{"Location:": "Kinsale, Co. Cork", "Teacher:": "\nAn tSr. Úna\n"}, {"Collector": "Máire Ní Thuama", "Gender": "male"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "male"}, {"Language": "English"}]}, "4921654/4887865/5152433": {"title": "St John's Eve and Bonfires", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0315, Page 066", "Page 066"], "url": "https://www.duchas.ie/en/cbes/4921654/4887865/5152433", "text": "\nBonfires are still kept up and in one family the farmer or his wife jump over the red embers for luck. The wife Mrs Murphy takes a kindled stick and ashes to each field where a crop is growing i.e. corn, wheat, potatoes and  roots. This red ash is supposed to banish the fairies and keep the crop from being blighted.In other parts the people dance around the fire and in Mayo a boy who has a wish to marry a neighbouring girl is particular to catch her hands and dance around the fire hoping to be lucky in this way of getting the colleen.\n\n\n\nOn May morning a few people go out before sunrise to wash their faces in the dew. This is supposed to keep them from headaches for the year (Mrs Collins Gurranes)\"Taking The Milk\" was very prevelant for some miles around & oftentimes a man or woman has been pointed out to me as the son or daughter of Maura or Cait such a one. Her mother was able to take the good of the milk from her neighboursSpancels (= short bits of rope for tying the hind legs of the cow). Milking pails & stools are put carefully into the dwelling house on May eve night, never kept in the stall\n(continues on next page)\n", "school_info": "School: Gurranes, Bandon", "metadata": [{"Location:": "Garranes, Co. Cork", "Teacher:": "\nNóra O' Halloran\n"}, {"Language": "English"}]}, "4921642/4887309/5153036": {"title": "Bonfire Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0313, Page 162", "Page 162"], "url": "https://www.duchas.ie/en/cbes/4921642/4887309/5153036", "text": "\nBonfire Night is on St John's Eve June 23rd. People light fires of furze and bushes. They used not light them near a house where someone had died out of respect for the dead, but lately they nearly always light them. People in this locality \"try\" thenew potatoes that night. They go out after supper and dig a few stalks bring in the potatoes and wash and boil them immediately. They eat them with \"just a grain of salt\" to try the taste. The old saying is \"While you'd be eating one new potatoe the rest would be boiled.\"People used to take a bit of stick out of the dying bon fire and throw it into each tilled field for luck on the crops. Some used put a bit into every field. Some people do it still.\n", "school_info": "School: Boireann", "metadata": [{"Location:": "Burren, Co. Cork", "Teacher:": "\nEibhlín Ní Bhriain\n"}, {"Language": "English"}]}, "4921638/4887142/5162212": {"title": "Religious - St John's Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0312, Page 244", "Page 244"], "url": "https://www.duchas.ie/en/cbes/4921638/4887142/5162212", "text": "\nBonfire night comes on 23rd. June. The bonfires are lit on the tops of hills, in brakes & in potato gardens. The reason why they are lit in potato gardens is to keep away the blight.   Bonfire night is kept in memory of St. John. People go to his tomb to pray on bonfire night.\n", "school_info": "School: Cill Moluda, Clanna Caoilte", "metadata": [{"Location:": "Kilmaloda, Co. Cork", "Teacher:": "\nLaura Nugent\n"}, {"Collector": "William Wagner", "Gender": "male", "Address": "Clogagh North, Co. Cork"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "female", "Age": "40", "Address": "Clogagh North, Co. Cork"}, {"Language": "English"}]}, "4798767/4796540/5163821": {"title": "Observances on St. John's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0299, Page 242", "Page 242"], "url": "https://www.duchas.ie/en/cbes/4798767/4796540/5163821", "text": "\nIn front of the Parish church in Drimoleague is a Tomb or grave in which the following Parish Priests are laid to rest.Revd. Father Ryan P.P.Revd. Father Creedon P.P.Revd. Father Forrest P.P. 1897-1922    From time immemorial on Saint John's Eve people from various parts of the parish visit this Tomb to make a \"Rounds\". The vault is under-ground, but over-ground there is an iron railing and at each corner of this railing the people recite a decade of the Rosary I have seen people make this Rounds who rarely come to Mass.   On one occasion the Parish Priest at the time Rev. Father John Coakley, tried to put a stop to it. He said why not go into the Church and pray there But the people seemed to take no notice of the Pastor's advice for on next Saint John's Eve they were seen again making their customary \"Rounds\".\n", "school_info": "School: Doire Clathach", "metadata": [{"Location:": "Derryclogh Upper, Co. Cork", "Teacher:": "\nÉamonn Mac Firbisigh\n"}, {"Language": "English"}]}, "5162159/5160106/5164045": {"title": "Bonfires", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0939, Page 156", "Page 156"], "url": "https://www.duchas.ie/en/cbes/5162159/5160106/5164045", "text": "\nBonfires.St. John the Baptist suffered a martyr's death for his faith on the 23rd June. Since then a bon fire is lighted on the anniversary to commemorate the event. Another bonfire is lighted on the 28th June to commemorate the martyrdom of Sts. Peter and Paul.\n", "school_info": "School: Láithreach", "metadata": [{"Location:": "Laragh, Co. Monaghan", "Teacher:": "\nMrs Duffy\n"}, {"Collector": "Brighid Ní Leannáin", "Gender": "female"}, {"Informant": "Michael Lennon", "Relation": "parent", "Gender": "male"}, {"Language": "English"}]}, "4921918/4910865/5166078": {"title": "Old Customs - Saint John's Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0395, Page 213", "Page 213"], "url": "https://www.duchas.ie/en/cbes/4921918/4910865/5166078", "text": "\nA very old custom here is lighting a bonfire in honour of St John on the eve of June the 24th. It was always done long ago, but now it is dying out. Every house in the town or village would provide something for the fire. Then some of the young people would help build it on some open space or cross roads. Just before it becomes dark, the oldest person in the place would put the fire alight. They make the Sign of the Cross over it with the youngest person present. They also burn a weed called Muggard and keep it for a cure. They dance and sing and play games around the fire and some people take home a burned stick out of the last embers of the fire and keep it for luck.Kathleen Laar\n\n\n\nIn olden times St Brigid's night was called \"Bredeog Night\" in this district. On that night a sack of hay was dressed up, to represent a girl of seven or eight years of age, and she was called \"the Biddy.\"The young men of the district, when their day's work was over went around to every house. They would entertain the household in the kitchen, singing, playing, music, dancing, and reciting. Afterwards\n(continues on next page)\n", "school_info": "School: Clochar na Toirbhirte, Mainistir na Corann", "metadata": [{"Location:": "Midleton, Co. Cork", "Teacher:": "\nAn tSr. Seosamh\n"}, {"Collector": "Kathleen Laar", "Gender": "female"}, {"Language": "English"}]}, "4798788/4798545/5166475": {"title": "Tobairín Naomh Fachtna", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0308, Page 134", "Page 134"], "url": "https://www.duchas.ie/en/cbes/4798788/4798545/5166475", "text": "\n(continued from previous page)\nthe ground, a well of spring water sprang up.Máire Ní MhionacháinScoil an ClochairRos Ó gCáirbre\n\n\n\nSt. John's eve and St. John's day 23rd and 24th JunePeople visit the well and make rounds to obtain the cure of such diseases and afflictions as rheumatism, lameness, blindness, deafness, paralysis, delicacy, or birth disfigurements, and sores of any kind.Our Father, and Hail Mary are repeated five times while kneeling at the well. Most of the pilgrims then pay a visit to the Blessed Sacrament in the Parish Church. In olden times pilgrims remained up all night, and spent part of the time in the church.No special traditional prayers are said. Some pilgrims say the Rosary, Litany of Our Lady, and other prayers according to their devotion.\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire, Ros Ó gCairbre", "metadata": [{"Location:": "Ross Carbery, Co. Cork", "Teacher:": "\nAn tSr. Áilbe\n"}, {"Collector": "Máire Ní Mhionacháin", "Gender": "female"}, {"Informant": "Bean Uí Hodnett", "Gender": "female", "Address": "Barleyhill East, Co. Cork"}, {"Language": "English"}]}, "4921914/4900194/5168516": {"title": "Festival Customs - Saint John's Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0394, Page 170", "Page 170"], "url": "https://www.duchas.ie/en/cbes/4921914/4900194/5168516", "text": "\nOn Saint John's Eve all the children gathered bushes, broken boxes, papers and sticks. They made a big fire on top of a hill. In the evening a man set fire to it. When the fire was lighting, a group of girls - some with shawls and more with white dresses - marched around it playing a mouth-organ and a band. When the fire was nearly burned down all the girls and boys tried to jump over it.Information received fromThomas Canavan,Spittal Street,Cloyne,Kitty Cahill VI StdSpittal Cottage,Cloyne,\n", "school_info": "School: Cluain Uamha (C.)", "metadata": [{"Location:": "Cloyne, Co. Cork", "Teacher:": "\nE. Geeleher\n"}, {"Collector": "Kitty Cahill", "Gender": "female", "Address": "Cloyne, Co. Cork"}, {"Informant": "Thomas Canavan", "Gender": "male", "Address": "Cloyne, Co. Cork"}, {"Language": "English"}]}, "4811666/4810650/5170199": {"title": "Christmas Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0342, Page 193", "Page 193"], "url": "https://www.duchas.ie/en/cbes/4811666/4810650/5170199", "text": "\n(continued from previous page)\nmiddle, and one smaller on each side, to represet the three wise kings. a \"little xmas rhyme  :\"Nodlaig na mban, Nodlaig gan mhaith\"\n\n\n\nHave seen my father (R.I.P) going out at midnight to observe direction of the wind. if it blew from the West the coming year favoured the Irish, if from the East the Sassanach would get the upper hand during the following year.\n\n\n\nA big bonfire is still erected in favourable spots in different parts of the town on St John's eve. All the neighbours young and old gather round and there is dancing for a considerable time.A custom obtained of jumping across portions of the fire, and a great many take with them for luck a portion of the burning stick or fagot to carry home.\n", "school_info": "School: Maghcromtha (B.)", "metadata": [{"Location:": "Macroom, Co. Cork", "Teacher:": "\nPádraig Ó Deasmhumhna\n"}, {"Language": "English"}]}, "4921780/4906629/5178220": {"title": "Saint John's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0362, Page 297", "Page 297"], "url": "https://www.duchas.ie/en/cbes/4921780/4906629/5178220", "text": "\nIn every townland in this district and in the districts around it the boys and young men used to light large bonfires on St. John's Eve.After school the boys used to assemble and collect furze bushes from the fences and pile them up on some elevated spot from which the fire could be seen for miles around.When evening came the pile was set on fire and the young  people shouted, danced and sang around it. According as the fire showed signs of dying down fresh supplies of fuel were brought in because it would considered a disgrace if the local bonfire was not as large as those in view in other places.Some remained around the fire until midnight and then, before departing the more active used to try to jump over the griosach.It sometimes happened that boys in their desire to have a bonfire set fire to furze bushes on a farmer's fence and did a great deal of damage in this way.The observance of \"Bonfire Night\" has almost entiredly disappeared in this locality in  recent years.T. Coleman,Glantane N.S.Lombardstown,Co. Cork.21 . 11 . 1938\n", "school_info": "School: An Gleantán, Lombardstown", "metadata": [{"Location:": "Glantane, Co. Cork", "Teacher:": "\nTomás Ó Colmáin\n"}, {"Collector": "T. Coleman"}, {"Language": "English"}]}, "4921797/4908081/5180644": {"title": "Festival Customs - St John's Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0367, Page 437", "Page 437"], "url": "https://www.duchas.ie/en/cbes/4921797/4908081/5180644", "text": "\nFESTIVAL CUSTOMS: ST. JOHN’S EVE.On St. John’s Eve bonfires are lighted on the hillsides.Long ago tar barrels were lighted in the villages and towns and kept lighting all night.Boys and girls used to stand around them singing.A furze bush on fire used to be thrown into the midst of the cattle to bring luck.\n", "school_info": "School: Dromina, Ráth Luirc", "metadata": [{"Location:": "Dromina, Co. Cork", "Teacher:": "\nDaniel Hishon\n"}, {"Collector": "Margaret O' Sullivan", "Gender": "female", "Address": "Rath, Co. Cork"}, {"Informant": "Mrs Wall", "Gender": "female", "Address": "Churchtown, Co. Cork"}, {"Language": "English"}]}, "4921798/4908233/5180836": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0368, Page 132", "Page 132"], "url": "https://www.duchas.ie/en/cbes/4921798/4908233/5180836", "text": "\nTo night of the 23rd of June is the eve of St. John's Day. It is celebrated by lighting bonfires.The material for big bonfires was being gathered for about a week before. Everything obtainable that would light was gathered in one big heap.Long ago where the people were near a bog a big piece of bog-deal was procured. The piece of deal was got about a month before the fire and for that night it was as dry as pepper and blazed splendidly.Before the fire was lit the material was arranged in such a way as it would blaze well. First the piece of bog-deal which might be about twenty feet long was put standing straight up. Then the turf was settled around\n(continues on next page)\n", "school_info": "School: Brughtheine (B.), Malla", "metadata": [{"Location:": "Churchtown, Co. Cork", "Teacher:": "\nTomás Ó Tighearnaigh\n"}, {"Collector": "Matthew Coghlan", "Gender": "male", "Address": "Annagh South, Co. Cork"}, {"Informant": "Mr John Coghlan", "Gender": "male", "Age": "60", "Address": "Annagh South, Co. Cork"}, {"Language": "English"}]}, "4921798/4908240/5180981": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0368, Page 139", "Page 139"], "url": "https://www.duchas.ie/en/cbes/4921798/4908240/5180981", "text": "\nIt was a custom long ago to light bonfires on St. John's night.  All the boys and girls of the district would be gathering material for the bonfire a week before hand.  The fire was made of furze and limbs of trees piled up on one another until they were about ten feet high.When St. John's night came the fire was lit and held blazing for four or five hours.  Whilst the fire was burning, the boys and girls were dancing on a stage nearby, and all the old people looking on.  The children caught hands and ran around the fire.  the people did not leave until the fire was dying out.Thomas SampsonBallinamuck ChurchtownMallowJohn SampsonBallinamuckChurchtownMallow(58 years)\n", "school_info": "School: Brughtheine (B.), Malla", "metadata": [{"Location:": "Churchtown, Co. Cork", "Teacher:": "\nTomás Ó Tighearnaigh\n"}, {"Collector": "Thomas Sampson", "Gender": "male", "Address": "Ballynamuck, Co. Cork"}, {"Informant": "Mr John Sampson", "Gender": "male", "Age": "58", "Address": "Ballynamuck, Co. Cork"}, {"Language": "English"}]}, "4921798/4908241/5180984": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0368, Page 140", "Page 140"], "url": "https://www.duchas.ie/en/cbes/4921798/4908241/5180984", "text": "\nIn my Grandfather's young fays the Bonfire on St. John's Eve was attended by young and old.When the fire had died down those who owned land in the neighbourhood took some of the burning sticks and threw them into the tillage fields.The also took some to the stalls where the cattle were housed and drew them along the hind quarters of the cattle.This was supposed to prevent the bad spirits from doing harm to the crops or the animals.\n", "school_info": "School: Brughtheine (B.), Malla", "metadata": [{"Location:": "Churchtown, Co. Cork", "Teacher:": "\nTomás Ó Tighearnaigh\n"}, {"Collector": "Thomas Sampson", "Gender": "male", "Address": "Ballynamuck, Co. Cork"}, {"Informant": "Mr John Sampson", "Gender": "male", "Age": "58", "Address": "Ballynamuck, Co. Cork"}, {"Language": "English"}]}, "4921821/4909249/5182741": {"title": "St John's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0373, Page 214", "Page 214"], "url": "https://www.duchas.ie/en/cbes/4921821/4909249/5182741", "text": "\nThere was an old custom on St John's Eve of lighting bon fires.These fires were considered good for men and beasts.On that night all the neighbours used gather together and get sticks and furbushes and make a very big fire.Anybody who was able used jump it.A weed called Bugoord was used in this way.The people gathered the weed and made the Sign of the Cross over the fire.This was put away and used as a cure for the cattle for the year.When the fire was nearly burned out every neighbour took a share of what was left.He took this home with him.He put it in the gap and drove the cows over it and this was\n(continues on next page)\n", "school_info": "School: Currach an Ghála, Cill Úird", "metadata": [{"Location:": "Kilworth, Co. Cork", "Teacher:": "\nMáiréad, Bean Uí Shúilleabháin\n"}, {"Collector": "Liam Galleabhair", "Gender": "male", "Address": "Dunmahon, Co. Cork"}, {"Informant": "Edmond Gallagher", "Gender": "male", "Address": "Dunmahon, Co. Cork"}, {"Language": "English"}]}, "4921897/4899401/5183946": {"title": "Bonfire", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0391, Page 072", "Page 072"], "url": "https://www.duchas.ie/en/cbes/4921897/4899401/5183946", "text": "\nLong ago all labourers had half an acre or less of ground for potatoes.On bon fire night June 24 they used to have a bon fire at the cross roads. All the boys and girls used to jump over it and dance around it. At 12 o'clock they would return home carrying a piece of stick from the bon fire to throw   over their garden and while doing this they used to pray.This was always  a great night in Carrigaline, as  it is the night before the feast of their patron St. St John. There is also a well dedicated to St John in the parish. On this night visits were made to the well.On St John's Sunday all the natives who were in other parishes used to return to Carrigaline and vist the well.\n", "school_info": "School: Clochar na Toirbhirte, Bun an tSábhairne, Corcaigh", "metadata": [{"Location:": "Crosshaven, Co. Cork", "Teacher:": "\nAn tSr. Caitríona\n"}, {"Collector": "Miss Angela O' Mahony", "Gender": "female", "Age": "14", "Occupation": "pupil", "Address": "Carrigaline, Co. Cork"}, {"Informant": "Miss M. O' Connor", "Gender": "female", "Age": "circa 80", "Address": "Carrigaline, Co. Cork"}, {"Language": "English"}]}, "4921837/4895610/5184193": {"title": "Saint John's Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0377, Page 019", "Page 019"], "url": "https://www.duchas.ie/en/cbes/4921837/4895610/5184193", "text": "\nSt. John's day comes on the 22nd of June and it is a custom for the boys of this district to light bon-fires on St. John's eve. For two or three days before St John's eve all the young boys go gathering furzes and sticks for the fire. The furzes and sticks are put in a dry place so that they would wider. On St. John's eve they are put in one great heap at the cross roads, and then one of the boys light the fire.   Then the boys and girls of the district gather around the fire and wait there until it is quenched. Then they watch the fires of the other districts and see which fire remains lighting the longest. Long ago the people used bring home a burned stick and rub it to their cattle. Others used drive their cattle around the fire. It is said that this would keep away ill-luck for the next year.\n", "school_info": "School: Araglin (B.), Cill Úird", "metadata": [{"Location:": "Araglin, Co. Cork", "Teacher:": "\nLiam Ó Mothair\n"}, {"Collector": "Liam Ó Gaordha", "Gender": "male", "Address": "Gortnaskehy, Co. Cork"}, {"Language": "English"}]}, "4921840/4895808/5184881": {"title": "Festival Customs - Saint John's Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0377, Page 217", "Page 217"], "url": "https://www.duchas.ie/en/cbes/4921840/4895808/5184881", "text": "\nSt. John's Eve or  bon-fire night as it is called locally falls on the 23rd of June each year. Various customs are carried out in this district (Cornhill, Fermoy, Co Cork) on that night, the principal one being bon-fire lighting.Up to recent years cross-roads used be almost impassable with bon-fires and for a month after, the sign would remain on the road. The unmarried people then try to jump the fire. If a person's clothes are burned by the fire it is said that they will not get married at all.Fires are also lit on farms on this night. Those are lit with straw, and dock-roots that have been picked out of new mown hay. When it is lighting briskly a stalk is pulled out of the potato garden and held over the blaze until it is burnt to the end of the stem. Then a little bit of stem is kept and buried where the stalk was pulled.When the blaze  subsides the bawn of cows are brought and made jump over it. It is said that the cow that jumps over\n(continues on next page)\n", "school_info": "School: An Ghráinseach, Mainistir Fhearmuighe", "metadata": [{"Location:": "Grange West, Co. Cork", "Teacher:": "\nPádraig Ó Díomsaigh\n"}, {"Collector": "Peggy Twomey", "Gender": "female", "Address": "Cornhill, Co. Cork"}, {"Informant": "Mrs Roche", "Gender": "female", "Age": "59", "Address": "Cornhill, Co. Cork"}, {"Language": "English"}]}, "5177598/5172150/5185508": {"title": "Customs of Saint John's Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0585, Page 117", "Page 117"], "url": "https://www.duchas.ie/en/cbes/5177598/5172150/5185508", "text": "\nWe celebrate the feast of Saint John on the 24th of June. It is anxiousley looked forward to by young, and old, on account of the big bon-fires that are lit the preceding night.Days before it, long ago, people were very busy gathering sticks, furze-bushes, sods of turf, old timber, and all kinds of fire material. There was great excitement in each locality. Each one wanting to have the biggest fire.On this night, the members of each locality gathered together. They went up to a hill, and here, they lit the fire. Everyone had to do something. The old sate down, and told many stories of the adventures of old, at the same, they  enjoyed a smoke of the clay pipe:  The young entertained themselves by telling stories, singing and reciting pieces. Then they gave refreshments to the old people.The fire lasted until morning, almost, as, they had a lot of material\n(continues on next page)\n", "school_info": "School: Clonlara", "metadata": [{"Location:": "Cloonlara, Co. Clare", "Teacher:": "\nDll. Ó Heoghanáin\n"}, {"Collector": "Bridget Clancy", "Gender": "female"}, {"Informant": "John Clancy", "Gender": "male", "Age": "68", "Occupation": "farmer", "Address": "Monaskeha, Co. Clare"}, {"Language": "English"}]}, "5177602/5172495/5185629": {"title": "St John's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0586, Page 110", "Page 110"], "url": "https://www.duchas.ie/en/cbes/5177602/5172495/5185629", "text": "\nSt Johns DayIt is on the twenty fourth of June on the eve of the feast bonfires are lighted all people sit around then and sing and play and dance in hounour of St John\n\n\n\nIt is the Sunday after Sharove Tuesday. Anybody who did not get married and who were of age to get married are chalked on that Sunday. Young and old enjoy chalking those people.\n\n\n\nLentEvery Wednesday and Friday is fast during lent and every day there is abstainence . Nearly every body fasts from some thing for instance some fast\n(continues on next page)\n", "school_info": "School: Belvoir, Kilkishen", "metadata": [{"Location:": "Belvoir, Co. Clare", "Teacher:": "\nBríd Ní Chadhla\n"}, {"Language": "English"}]}, "4921814/4895042/5189314": {"title": "An Drúichtín", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0372, Page 083", "Page 083"], "url": "https://www.duchas.ie/en/cbes/4921814/4895042/5189314", "text": "\n(continued from previous page)\nNós eile a bhí aca ann ná fanamhaint in a suidhe go dtí meadhon oídhche. Chaithfead sí fanacht  anáirde staighre agus an scathán aici. Nuair a bhuaileadh an clog in am mharbh na h-oídhche chaithfeadh sí siúbhal síos an staighre i ndiaidh a cúl, agus annsan bheadh fhios aici, cé bheadh mar chéile aici.\n\n\n\nNuair a thagadh Oidche len Seain i gcómhnuide do lastaí teintreacha móra ar gach don bhaile ar fud na Raithe Móire. Tintreacha  cnámh a tugtaí ar na teintreachaibh shin. Is amlaidh a  cruinnigeadh muintear gach baile le chéile go mór mhór na daoine óga idir cailíní agus buachaillí, agus do dheinidís a lán neithe mar fraoch, is aiteann críon, sean-adhmad, sean cnámha agus mórán rudaí eile do bhailiughadh i dteannta a chéile in aon charn mór amháin agus annsan teine a chur leó tar éis tuitim na h-óichche. Bíodh an oiread san adbhar teine bailighthe in-áiteannaibh go gcoinnightí na teinte cnám ar lasadh go dtí uair an meadhon oidhche. Bíodh muintir gach baile ag formad le na chéile, leis, feachaint ciocha baile go mbeadh an teine cnámh is fearr air. Bhíodh rinnce agus gach rud ar siúbhal tímcheall na dteinte.\n", "school_info": "School: Baile Caisleáin an Róistigh (B.)", "metadata": [{"Location:": "Castletownroche, Co. Cork", "Teacher:": "\nPádraig Ó Luineacháin\n"}, {"Language": "Irish"}]}, "4921856/4896634/5189714": {"title": "Old Customs Observed in the Locality in the Past - The Caoining Women", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0382, Page 076", "Page 076"], "url": "https://www.duchas.ie/en/cbes/4921856/4896634/5189714", "text": "\n(continued from previous page)\nthe chant remained silent and one of the others took up and carried on until each of the four had done her part. At the finish of the \"caoine\" the four walked around the corpse several times crying and clapping their hands. This finished the \"caoining\" for the day. The day of the Funeral the \"caoiners\" followed the coffin from the door, the four chanting in a weird fashion.\n\n\n\nWritten by Peggy Sarsfield Skahanagh  Watergrass hillTold by my Father John Sarsfield of Skahanagh aged 62Bonfire night was an event looked forward to by the young folk very much years ago.For some days previous a supply of furze had to be cut and got ready for the fire. After sunset the fire was lighted the whole family attended the ceremony. Everyone had to jump at least three times over the fire. Generally some songs were sung and in some places dances were held.When the fire had nearly died down one of the older members of the family took a number of burned sticks and put one of those in every field of the farm for good crops.During Fr Prowts time in Watergrasshill he did much to discourage those customs. He instead advised the people to get better educated and have more confidence in themselves.\n", "school_info": "School: Cnoc na Biolaraighe", "metadata": [{"Location:": "Watergrasshill, Co. Cork", "Teacher:": "\nDll. Mac Carrthaigh\n"}, {"Collector": "Peggy Sarsfield", "Gender": "female", "Address": "Skahanagh South, Co. Cork"}, {"Informant": "John Sarsfield", "Relation": "parent", "Gender": "male", "Age": "62", "Address": "Skahanagh South, Co. Cork"}, {"Language": "English"}]}, "4921856/4896638/5189723": {"title": "St Brigid's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0382, Page 080", "Page 080"], "url": "https://www.duchas.ie/en/cbes/4921856/4896638/5189723", "text": "\n(continued from previous page)\ndressed up a figure which they called a \"Breeda\". It was the custom to call to every house in the neighbourhood. On entering a house they demanded money for \"Breeda\", and generally danced for a few minutes with the girls of the house. In a house in which the owner took the thing as a joke the always departed quietly, but when they were taken roughly the generally took all the bread they could find in the house away with them. On entering a Public House they took whatever drinks were on the counter, this often caused a row with the people who had paid for the drinks, but as the \"Brideogs\" were always in considerable numbers they generally came out best.When two bunches of \"Brideogs\" met there was some excitement as the strongest party always relieved the other of whatever money they had collected. When they were finished there round the generally got up a danse with what money they collected.\n\n\n\nSt Johns eve falls on the 23rd day of June.  People do many a thing on that night which is supposed to keep ill luck from them throughout the year.  They throw a lighting bush after every one of the cows which is supposed to keep them from harm.  The people here go to the holy well in Glenville to pray in honour of Saint John.  Also in every farm\n(continues on next page)\n", "school_info": "School: Cnoc na Biolaraighe", "metadata": [{"Location:": "Watergrasshill, Co. Cork", "Teacher:": "\nDll. Mac Carrthaigh\n"}, {"Collector": "Willie Mc Carthy", "Gender": "male"}, {"Informant": "Mrs Mc Carthy", "Relation": "parent", "Gender": "female", "Age": "53", "Address": "Meenane, Co. Cork"}, {"Language": "English"}]}, "5177626/5173945/5199864": {"title": "St John's Eve 23rd June", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0591, Page 330", "Page 330"], "url": "https://www.duchas.ie/en/cbes/5177626/5173945/5199864", "text": "\nBonfires were always lighted at Cross roads and on hill on the Eve of St John's Day, 24th June.  Crowd of boys and girls would go to the fire for an hour or so and often had a bit of a dance.This turf for fire was got - (gotten or stolen if you like) in the bog near by.I remember the June of 1921.  I got my own children to light a little fire in our own avenue some of their companions were with them.The Black and Tans and police came into the village in Lorries and came in around our yard. We quenched the fire immediately with water because fires were one way the volunteers had of signaling in the night that to the sentry boys on the run - military were coming.My boy, Declan, aged 9 then a young girl of 12, Mary Wiely were at the little bonfire and were terrified of the B & T's (who did nothing except walk about the place) got diphtheria the following Sept and lots died. That was the 1st and last bonfire they attended.People drove their milk cows through the fire when it was burned low - to preserve them from sickness and disease till the next 23rd of June.A boy child born around St John's Day gets the name \"John\". As they say \"he brought home his name.\"\n", "school_info": "School: Lúbán Díge (Bodyke)", "metadata": [{"Location:": "Bodyke, Co. Clare", "Teacher:": "\nBríd, Bean Uí Chadhla\n"}, {"Language": "English"}]}, "5162106/5154799/5200654": {"title": "The Bonfire Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0246, Page 047", "Page 047"], "url": "https://www.duchas.ie/en/cbes/5162106/5154799/5200654", "text": "\nLast night was bonfire night. Bonfire night is celebrated each year on the 23rd June, There is an old custom which the people keep up. At seven o'clock each person goes to the bog and gets a load of turf and some sticks. They get a good load and a bonfire is bade in each village.Then all the neighbours gather together and have a great night. They have tea and bread and butter and when tea is over they have music and dancing.They dance and play till near morning and they have a great time until the bonfire burns out.All the young children love to hear of bonfire night, as they have a great sport playing around the bonfire.This custom is observed by the old people and they always like to keep it up. It is a custom which is strictly observed that when the people are going from from the bonfire, they take a coal and bring it home, to put it into the potato\n(continues on next page)\n", "school_info": "School: Baile an Tobair", "metadata": [{"Location:": "Ballintober, Co. Roscommon", "Teacher:": "\nMáiréad, Bean Uí Dhomhnaill\n"}, {"Language": "English"}]}, "5177649/5176756/5202236": {"title": "Féilí na Bliana - Lá Bealtaine", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0598, Page 199", "Page 199"], "url": "https://www.duchas.ie/en/cbes/5177649/5176756/5202236", "text": "\n(continued from previous page)\nof taking neigbour's butter etc. If they did take it they cd. keep it for the year. However other people were said to have the power of bringing it back. These did not divulge their secret power. Some used to go to Biddy Early to get it back.\n\n\n\nBonfires lit on St. John's Eve. - in honour of saint. Visits to St. John's well in Cratloe to make rounds were common 60 years ago.  Some do so yet.\n\n\n\nFéile MhichílGoose or other fowl killed in honour of saint. Blood spilled on jambs of door to keep away the Destroying Angel.\n", "school_info": "School: Meelick (B.)", "metadata": [{"Location:": "Meelick, Co. Clare", "Teacher:": "\nEoghan Ó Néill\n"}, {"Language": "English"}]}, "5177651/5176985/5202610": {"title": "Feasts of the Year - St John's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0598, Page 474", "Page 474"], "url": "https://www.duchas.ie/en/cbes/5177651/5176985/5202610", "text": "\n474             St John's Day St John's day falls on he 24th of June.On that day people visit a well in Newhall which is two miles from Ennis.and this well is called St John's well. On St John's Eve it is an old custom to have a bonfire .                It is said that there are many cures in this well.Many people go and do a certain amount of rounds,more people go on their knees back and forwards ,several times .The people who do these things are those who have faith in the well.More people drink this water or bring it home with them.\n(continues on next page)\n", "school_info": "School: Coradh Chaitlín (C.)", "metadata": [{"Location:": "Newmarket on Fergus, Co. Clare", "Teacher:": "\nEibhlin, Bean Mhic Conmara\n"}, {"Language": "English"}]}, "5215779/5208214/5221034": {"title": "St John's Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0090F, Page 09_041", "Page 09_041"], "url": "https://www.duchas.ie/en/cbes/5215779/5208214/5221034", "text": "\nThere was a man long ago and he used to be at every bone-fire. As soon as he had finished with one bone-fire he would go off to another one. St John's eve falls on the twenty third of June every year. It a custom to throw a bone into the middle of the fire. There is a bone-fire on the top of every hill because the first fire was lit on the top of a hill. It is a custom to have a fire\n(continues on next page)\n", "school_info": "School: Ballyburke", "metadata": [{"Location:": "Bellaburke, Co. Mayo", "Teacher:": "\nMicheál Ó Cheallaigh\n"}, {"Collector": "James Ludden", "Gender": "male", "Address": "Bellaburke, Co. Mayo"}, {"Informant": "Maggie Ludden", "Gender": "female", "Address": "Bellaburke, Co. Mayo"}, {"Language": "English"}]}, "5215801/5213039/5221105": {"title": "Bonfire", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137C, Page 02_012", "Page 02_012"], "url": "https://www.duchas.ie/en/cbes/5215801/5213039/5221105", "text": "\nLast night was the bonfire night. It is lighted on the twenty fourth of June, because it was on that night St John  was beheaded.Every house has  a bonfire of their own, and it is a custom to do stations round the fire. The bonfire is made of turf coal and a bone. There is great joy on all\n(continues on next page)\n", "school_info": "School: Kelladone", "metadata": [{"Location:": "Killadoon, Co. Mayo", "Teacher:": "\nPadhraic Maguidhir\n"}, {"Collector": "William G. Kelly", "Gender": "male", "Address": "Feenune, Co. Mayo"}, {"Informant": "Michael Needham", "Gender": "male", "Age": "72", "Address": "Feenune, Co. Mayo"}, {"Language": "English"}]}, "5215801/5213056/5221136": {"title": "Bonfires", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137C, Page 03_008", "Page 03_008"], "url": "https://www.duchas.ie/en/cbes/5215801/5213056/5221136", "text": "\nEach year on the twenty-third of June there are bonfires lighted in everypart of the world. This fire is lighted in honour of Saint John, because it was He who went before the Lord teaching and preaching to the people of Gallilee. St John was a cousin of Our Lord and he was the son of Elizabeth and Zachary.He was a very good holy boy and he was the hope and delight of his parents. When he was but twelve years of age he left his fathers house and\n(continues on next page)\n", "school_info": "School: Kelladone", "metadata": [{"Location:": "Killadoon, Co. Mayo", "Teacher:": "\nPadhraic Maguidhir\n"}, {"Collector": "Thomas O' Malley", "Gender": "male", "Address": "Cloonty, Co. Mayo"}, {"Informant": "William O Malley", "Gender": "male", "Age": "76", "Address": "Feenune, Co. Mayo"}, {"Language": "English"}]}, "5215801/5213076/5221159": {"title": "Bonfires", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137C, Page 04_014", "Page 04_014"], "url": "https://www.duchas.ie/en/cbes/5215801/5213076/5221159", "text": "\nThe bonfire night comes on the twenty fourth night of June. It is kept in honour of St. John because on that night he was beheaded. Other people say that it was a custom of the druids. In some villages all the boys gather together and each bring a bag of turf and they light a big fire. The old people take coals and throw them on their crops in order that they would be good. They also go round it and do the Stations of the Cross in honour of St. John. When they\n(continues on next page)\n", "school_info": "School: Kelladone", "metadata": [{"Location:": "Killadoon, Co. Mayo", "Teacher:": "\nPadhraic Maguidhir\n"}, {"Collector": "Anthony Mannion", "Gender": "male", "Address": "Killadoon, Co. Mayo"}, {"Informant": "Patrick Fadden", "Gender": "male", "Age": "80", "Address": "Killadoon, Co. Mayo"}, {"Language": "English"}]}, "5215801/5213099/5221184": {"title": "The Bonfire", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137C, Page 05_012", "Page 05_012"], "url": "https://www.duchas.ie/en/cbes/5215801/5213099/5221184", "text": "\nIn every place on the night of June the 23rd all the young boys light a fire.It is called a Bonfire in honour of St. John.In some villages all gather together and make a big fire.In other places each house make one. It is (is) made of turf and a bone is thrown into it.All the people say prayers around it.\n(continues on next page)\n", "school_info": "School: Kelladone", "metadata": [{"Location:": "Killadoon, Co. Mayo", "Teacher:": "\nPadhraic Maguidhir\n"}, {"Collector": "Eamonn Maguire", "Gender": "male", "Address": "Killadoon, Co. Mayo"}, {"Informant": "Mrs Maguire", "Gender": "female", "Age": "86", "Address": "Killadoon, Co. Mayo"}, {"Language": "English"}]}, "5215801/5213127/5221219": {"title": "The Bonfire", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137C, Page 06_015", "Page 06_015"], "url": "https://www.duchas.ie/en/cbes/5215801/5213127/5221219", "text": "\nOne of the old pastimes of long ago, which is the Bon Fire is still done every year on the 23rd of June.This day which is St. John's Day the fire is lit. All the boys and girls of a village gather together and make a big fire.The origin of this fire is uncertain. Some say it is kept in honour of (the fire) the fire lit at Tara, but that was at Easter.\n(continues on next page)\n", "school_info": "School: Kelladone", "metadata": [{"Location:": "Killadoon, Co. Mayo", "Teacher:": "\nPadhraic Maguidhir\n"}, {"Collector": "Mary Rita Maguire", "Gender": "female"}, {"Informant": "Patrick Needham", "Gender": "male", "Age": "89", "Address": "1419621"}, {"Language": "English"}]}, "5215801/5213160/5221232": {"title": "The Bonfire", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137C, Page 07_010", "Page 07_010"], "url": "https://www.duchas.ie/en/cbes/5215801/5213160/5221232", "text": "\nLong ago on St. John's Eve the people used to make Bonfires, and that custom is kept up still.First of all they gather bones and sticks and turf. They put the bones and sticks in the middle of the fire and they put the turf around them. Then they get oil and light. When it is fully lighted the old people do the stations of the Cross in honour\n(continues on next page)\n", "school_info": "School: Kelladone", "metadata": [{"Location:": "Killadoon, Co. Mayo", "Teacher:": "\nPadhraic Maguidhir\n"}, {"Collector": "Norah Fadden", "Gender": "female", "Address": "Barnabaun, Co. Mayo"}, {"Informant": "Patrick Fadain", "Gender": "male", "Age": "69", "Address": "Barnabaun, Co. Mayo"}, {"Language": "English"}]}, "5215801/5213203/5221273": {"title": "The Bonfire", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137C, Page 09_010", "Page 09_010"], "url": "https://www.duchas.ie/en/cbes/5215801/5213203/5221273", "text": "\nThe twenty-third of June is kept in honour of St. John, because on that night he died. There is a bonfire lighted in every place on that night. The little boys have great fun gathering bones, old bags and tarred-boards. They then get two or three bags of fry turf and place it on a hillock, they put the bones and bags and boards in the centre and they put the turf around it. When they\n(continues on next page)\n", "school_info": "School: Kelladone", "metadata": [{"Location:": "Killadoon, Co. Mayo", "Teacher:": "\nPadhraic Maguidhir\n"}, {"Collector": "Kathleen O' Malley", "Gender": "female"}, {"Informant": "Anthony Staunton", "Gender": "male", "Age": "88", "Address": "Tallavbaun, Co. Mayo"}, {"Language": "English"}]}, "5215801/5213233/5221291": {"title": "The Bonfire", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137C, Page 10_013", "Page 10_013"], "url": "https://www.duchas.ie/en/cbes/5215801/5213233/5221291", "text": "\nThe twenty-third night of June is called the bonfire night. Tis called that name because it was on that night he died. The fire is made of turf and a little timber they also put a little bone in it. When it is kindled they pray about it. They take a sod and leave it on a ridge of potatoes this means that the potatoes will produce a better crop. They also take a sod from the bonfire and leave it\n(continues on next page)\n", "school_info": "School: Kelladone", "metadata": [{"Location:": "Killadoon, Co. Mayo", "Teacher:": "\nPadhraic Maguidhir\n"}, {"Collector": "Bridgie Morrison", "Gender": "female"}, {"Informant": "John Mc Namara", "Gender": "male", "Age": "76", "Address": "Devlin North, Co. Mayo"}, {"Language": "English"}]}, "5215813/5214665/5221360": {"title": "Festival Customs - May Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138D, Page 02_026", "Page 02_026"], "url": "https://www.duchas.ie/en/cbes/5215813/5214665/5221360", "text": "\n(continued from previous page)\nnothing is given out of the house.\n\n\n\nOn St John's night which is the night before St. John's Day each family (have) a Bonefire of its own to honour St. John.For weeks before Bonefire night the boys of each family are busy gathering bogdeal all sorts of timber and whin and choosing the dryest turf. At night fall all the children go to the place the bonefire is\n(continues on next page)\n", "school_info": "School: St Bridget's", "metadata": [{"Location:": "Derrymore, Co. Mayo", "Teacher:": "\nMáire Uí hOistín\n"}, {"Collector": "Áine Ní Oistín", "Gender": "female", "Address": "Derrymore, Co. Mayo"}, {"Language": "English"}]}, "5215779/5208635/5235915": {"title": "Saint John's Eve", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0090F, Page 16_020", "Page 16_020"], "url": "https://www.duchas.ie/en/cbes/5215779/5208635/5235915", "text": "\nWe will soon have the bonfire night back again. It is a great custom in this part of the country to light a bonfire on St John's night. Young and old help to gather turf and sticks for the bonfire and they love that night to arrive. It is said that people are allowed to steal any amount of turf for the bonfire on that night. The men of the villages stay out under the stacks of turf in order that when the little boys and the little girls would come along with bags\n", "school_info": "School: Ballyburke", "metadata": [{"Location:": "Bellaburke, Co. Mayo", "Teacher:": "\nMicheál Ó Cheallaigh\n"}, {"Collector": "Mary Gavin", "Gender": "female", "Address": "Bellaburke, Co. Mayo"}, {"Language": "mixed"}]}, "5215813/5214894/5237482": {"title": "May Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138D, Page 06_041", "Page 06_041"], "url": "https://www.duchas.ie/en/cbes/5215813/5214894/5237482", "text": "\n(continued from previous page)\nIt left it ousdie Coill Mór hill. When it went out of sight Mícheál Mór said \"God speed you and you did'nt leave us enough thread for the year.\" When he said that every blade of it came back to its place again.\n\n\n\nThis is the way St. John's night is observed in this district. Every family has a bonfire of its own on St. John's Eve. Before leaving the fire the people go around it seven times and say prayers. Then they take a coal out of the fire and throw\n(continues on next page)\n", "school_info": "School: St Bridget's", "metadata": [{"Location:": "Derrymore, Co. Mayo", "Teacher:": "\nMáire Uí hOistín\n"}, {"Collector": "Seán Máirtín Caoigín Ó hOistín", "Gender": "male"}, {"Informant": "Ted Hastings", "Gender": "male", "Address": "Derrymore, Co. Mayo"}, {"Language": "English"}]}, "5215813/5215016/5237867": {"title": "May Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138D, Page 09_006", "Page 09_006"], "url": "https://www.duchas.ie/en/cbes/5215813/5215016/5237867", "text": "\n(continued from previous page)\nany knot that would be put on a rope or a string.\n\n\n\nEvery one do have a bonfire of there own on St Johns night in honour of St John. The people do make there bon-fire on the Creagans so that every one would be able to see it. The people do stations around the bon-fire. When the old people are going om they take a few coals with them and put them in the meadows so that good crops of corn and hay will be expected.\n\n\n\nEvery one kill some-thing before St Martins Day in honour of St Martin. The people say that he will not\n(continues on next page)\n", "school_info": "School: St Bridget's", "metadata": [{"Location:": "Derrymore, Co. Mayo", "Teacher:": "\nMáire Uí hOistín\n"}, {"Collector": "Tomás Ó Tónra", "Gender": "male"}, {"Language": "English"}]}, "5215813/5215368/5239330": {"title": "St John's Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138D, Page 15_005", "Page 15_005"], "url": "https://www.duchas.ie/en/cbes/5215813/5215368/5239330", "text": "\nOn St Johns night every house makes a fire in honour of St John.They put a bone in the fire and it is called a bone fire. When the people are going home from the bonefire the say prayers and take a coal out of the fire and through it in it in to the potatoes so that they will have better crops.In some places all the people gather to one fire and they dance and sing songs at the bonfire.They go around the fire and say prayers.1-9-38\n", "school_info": "School: St Bridget's", "metadata": [{"Location:": "Derrymore, Co. Mayo", "Teacher:": "\nMáire Uí hOistín\n"}, {"Collector": "Caitlín Ní Oistín", "Gender": "female"}, {"Language": "English"}]}, "5215813/5215468/5240085": {"title": "May Day", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138D, Page 17_013", "Page 17_013"], "url": "https://www.duchas.ie/en/cbes/5215813/5215468/5240085", "text": "\n(continued from previous page)\nrest of the year. It is also said if you get up before the sun on May morning and wash your hands in the dew, that you will be able to loosen any knot after that.\n\n\n\nSt Johns night is always a great night in this district. Where there is a lot of houses they gather together and each person out of each puts two or there bags of turn in what is called a bonefire. There is a bone put in the middle of it. There is whins\n(continues on next page)\n", "school_info": "School: St Bridget's", "metadata": [{"Location:": "Derrymore, Co. Mayo", "Teacher:": "\nMáire Uí hOistín\n"}, {"Collector": "Máire Ní Raghallaigh", "Gender": "female"}, {"Language": "English"}]}, "5260376/5244464/5260416": {"title": "Saint John's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0036D, Page 01_008", "Page 01_008"], "url": "https://www.duchas.ie/en/cbes/5260376/5244464/5260416", "text": "\nThe people in every village makes a big fire St Johns night and that night falls on the 23th of June. The small people gather a lot of sticks and turf the evening before and they leave them where the fire is going to be.Then the next evening all the people gather to the fire and they have musical instruments and they play them until they go home.The people get a sheal and they light the top of it in the fire and the shake it into the their gardens and they think they will have a better\n(continues on next page)\n", "school_info": "School: Ballyglass", "metadata": [{"Location:": "Ballyglass West, Co. Galway", "Teacher:": "\nname not given\n"}, {"Collector": "Paddy Moylan", "Gender": "male", "Address": "Rathcosgry, Co. Galway"}, {"Language": "English"}]}, "5260376/5244501/5260430": {"title": "November's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0036D, Page 02_011", "Page 02_011"], "url": "https://www.duchas.ie/en/cbes/5260376/5244501/5260430", "text": "\n(continued from previous page)\nplate of clay he will die soon and if he pushes hand into the plate where the ring is he will get married soon and if he puts his hand into the water he will go across the sea to another country.Michael Holland FiddaneArdrahanCo GalwayDate 24 - 11 - 1937\n\n\n\nSt John's night falls on the twenty third of June. The people have a very queer custom that night The\n(continues on next page)\n", "school_info": "School: Ballyglass", "metadata": [{"Location:": "Ballyglass West, Co. Galway", "Teacher:": "\nname not given\n"}, {"Collector": "Michael Holland", "Gender": "male", "Address": "Fiddaun, Co. Galway"}, {"Language": "English"}]}, "5260376/5244650/5260493": {"title": "November's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0036D, Page 07_007", "Page 07_007"], "url": "https://www.duchas.ie/en/cbes/5260376/5244650/5260493", "text": "\n(continued from previous page)\nleave their hand in the clay they will die before a year and if the leave their hand in the ring they will be getting married before a year.the woman of the house makes a cake and she puts a ring in it and they all try get it and whoever gets it is very happy.\n\n\n\nSt John's Night falls on the twenty third of June every year. All the people light\n(continues on next page)\n", "school_info": "School: Ballyglass", "metadata": [{"Location:": "Ballyglass West, Co. Galway", "Teacher:": "\nname not given\n"}, {"Collector": "Bridie Howley", "Gender": "female", "Address": "Lavally, Co. Galway"}, {"Language": "English"}]}, "5260376/5244700/5260542": {"title": "St John's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0036D, Page 09_008", "Page 09_008"], "url": "https://www.duchas.ie/en/cbes/5260376/5244700/5260542", "text": "\nSt John’s Night falls on the twenty third of June.  The people of this part of the country have a very queer custom in that night.  All the people of the village gather together and they make a very big fire in the side of the road.  Some one of them brings a musical instrument with them and then they have great sport dancing and after a long time the people quench the big fire and then every one brings a coal from the big fire and put’s it in his own garden and he believes\n(continues on next page)\n", "school_info": "School: Ballyglass", "metadata": [{"Location:": "Ballyglass West, Co. Galway", "Teacher:": "\nname not given\n"}, {"Collector": "John Tarpey", "Gender": "male", "Address": "Ballyglass East, Co. Galway"}, {"Language": "English"}]}, "5260488/5259349/5263233": {"title": "Bonfire Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1054B, Page 05_028", "Page 05_028"], "url": "https://www.duchas.ie/en/cbes/5260488/5259349/5263233", "text": "\nThe people about here always make a large bon-fire    on the twenty third of June. They go then and take some of the old burned sticks that are not burned out and they carry them in to every field of potatoes on their lands. They throw a bit into  every field to see will the tops of potatoes hold them up. If the potato tops  hold them up they say that there is a good crop in it.\n", "school_info": "School: Mín a Ghabhann (Meenagowan)", "metadata": [{"Location:": "Meenagowan, Co. Donegal", "Teacher:": "\nSéamus Ó Glacáin\n"}, {"Collector": "Domhnaill Ó Toláin", "Gender": "male", "Address": "Madavagh, Co. Donegal"}, {"Language": "English"}]}, "5215784/5209855/5277839": {"title": "St John's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0095C, Page 02_034", "Page 02_034"], "url": "https://www.duchas.ie/en/cbes/5215784/5209855/5277839", "text": "\nSt John's night is on the 23rd of June. There is a big fire made in every village with a bone in it. One person out of every house goes to the bog with the ass and creels and brings a load of turf to the fire. The boys light the fire in the evening. All the people gather to it then. The oldest person present says the Rosary and the rest answer it. After the Rosary the old people go home and bring a\n(continues on next page)\n", "school_info": "School: Gleann an Dúin - Prison", "metadata": [{"Location:": "Prison East, Co. Mayo", "Teacher:": "\nMáire A. Ní Dhocartaigh\n"}, {"Collector": "Mary Kate Kelly", "Gender": "female", "Address": "Prison North, Co. Mayo"}, {"Language": "English"}]}, "5215784/5209857/5277840": {"title": "St John's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0095C, Page 02_036", "Page 02_036"], "url": "https://www.duchas.ie/en/cbes/5215784/5209857/5277840", "text": "\nSt John's night is on the 23rd of June. There is a big fire with a bone in it made in every village. One boy out of every house goes to the bog with the ass and creels and brings a load of turf to the fire. All the people gather to it then. The oldest person present says the Rosary and the rest answer it. After the Rosary the old people go home and bring a coal with them and throw it into the field of stalks\n(continues on next page)\n", "school_info": "School: Gleann an Dúin - Prison", "metadata": [{"Location:": "Prison East, Co. Mayo", "Teacher:": "\nMáire A. Ní Dhocartaigh\n"}, {"Collector": "Mary Kate Kelly", "Gender": "female", "Address": "Prison North, Co. Mayo"}, {"Informant": "John Kelly", "Gender": "male", "Address": "Prison North, Co. Mayo"}, {"Language": "English"}]}, "5215784/5209941/5277918": {"title": "Bonfire Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0095C, Page 03_059", "Page 03_059"], "url": "https://www.duchas.ie/en/cbes/5215784/5209941/5277918", "text": "\nWe make a bone-fire on the 24th June. Every one goes to the bog with an ass and creels for a load of turf. They make a big heap of it at the cross-road. They get a bone for it and they go into the nearest house for a coal to set fire to the turf. All the people of the village gather to the fire. The old people say the rosary around\n(continues on next page)\n", "school_info": "School: Gleann an Dúin - Prison", "metadata": [{"Location:": "Prison East, Co. Mayo", "Teacher:": "\nMáire A. Ní Dhocartaigh\n"}, {"Collector": "Annie M. Reilly", "Gender": "female"}, {"Informant": "Patrick Reilly", "Gender": "male", "Age": "87", "Address": "Prison North, Co. Mayo"}, {"Language": "English"}]}, "5215784/5210012/5278407": {"title": "Saint John's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0095C, Page 04_047", "Page 04_047"], "url": "https://www.duchas.ie/en/cbes/5215784/5210012/5278407", "text": "\nThe bone fire night is always on the 23rd June, the eve of St John's day. All the boys of a village go to the bog with asses and creels for loads of turf. They put the turf in a heap at a cross-road. They get half of it and build it in the shape of a fire. They leave a small hole in the middle of it for the coals of fire. They also put a bone in it. The children look out for the bones a month before the bone fire night.When the fire is kindled all the old people and children go to the fire and say the rosary around it . Then the old people go into\n(continues on next page)\n", "school_info": "School: Gleann an Dúin - Prison", "metadata": [{"Location:": "Prison East, Co. Mayo", "Teacher:": "\nMáire A. Ní Dhocartaigh\n"}, {"Collector": "Annie Mc Nicholas", "Gender": "female"}, {"Informant": "John Mc Nicholas", "Gender": "male", "Age": "50", "Address": "Tawnagh More, Co. Mayo"}, {"Language": "English"}]}, "5215784/5210253/5278580": {"title": "Saint John's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0095C, Page 08_038", "Page 08_038"], "url": "https://www.duchas.ie/en/cbes/5215784/5210253/5278580", "text": "\nThe bone fire night is always on the 23rd June. The eve of St. John's day all the boys of one village go to the bog with asses and creels for loads of turf. They put the turf in one big heap at a cross-roads. They put half of it in the shape of a fire. They leave a small hole in the middle of it. The small children look out for the bone a month before a bone-fire night.When the fire is kindled all the old people and children go to it and say a rosary around\n(continues on next page)\n", "school_info": "School: Gleann an Dúin - Prison", "metadata": [{"Location:": "Prison East, Co. Mayo", "Teacher:": "\nMáire A. Ní Dhocartaigh\n"}, {"Collector": "Margaret Ruane", "Gender": "female"}, {"Informant": "Mr Wiliam Ruane", "Gender": "male", "Age": "50", "Address": "Tawnagh More, Co. Mayo"}, {"Language": "English"}]}, "5215784/5210303/5278608": {"title": "St John's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0095C, Page 09_027", "Page 09_027"], "url": "https://www.duchas.ie/en/cbes/5215784/5210303/5278608", "text": "\nOn St John's night a lot of people gather together. Each one brings an ass-load of turf from the bog and they appoint to meet at a certain place. When they have a lot of turf gathered they make a big fire. They put a bone in it. Then the old people come out and they say the rosary and all the children answer it. They keep walking around the fire\n(continues on next page)\n", "school_info": "School: Gleann an Dúin - Prison", "metadata": [{"Location:": "Prison East, Co. Mayo", "Teacher:": "\nMáire A. Ní Dhocartaigh\n"}, {"Collector": "Annie Kearns", "Gender": "female", "Address": "Manulla, Co. Mayo"}, {"Informant": "Mrs Kearns", "Gender": "female", "Address": "Manulla, Co. Mayo"}, {"Language": "English"}]}, "5215784/5210386/5278644": {"title": "St John's Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0095C, Page 10_044", "Page 10_044"], "url": "https://www.duchas.ie/en/cbes/5215784/5210386/5278644", "text": "\nThe bone-fire night is always on the 23rd of June. On the eve of St John's day all the men of the village go to the bog with asses and creels for turf and sticks. They put the turf in a heap at the nearest crossroad.They get half of it and build in the shape of a V. They leave a small hole in the middle of it for coals of fire. They also put a\n(continues on next page)\n", "school_info": "School: Gleann an Dúin - Prison", "metadata": [{"Location:": "Prison East, Co. Mayo", "Teacher:": "\nMáire A. Ní Dhocartaigh\n"}, {"Collector": "Bridgie Kennedy", "Gender": "female"}, {"Informant": "Michael Kennedy", "Gender": "male", "Age": "48", "Address": "Rush Hill, Co. Mayo"}, {"Language": "English"}]}, "5215784/5210497/5279056": {"title": "The Bonfire Night", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0095C, Page 12_035", "Page 12_035"], "url": "https://www.duchas.ie/en/cbes/5215784/5210497/5279056", "text": "\nOn the 23rd June I get turf, blocks and make a big fire. Then I put a bone in the middle of it. I bring a lighted coal or two from the house and with them the bonfire is lit. Then I go around the fire and say the rosary and say prayers for the dead. When leaving the fire I take a coal and throw it into the field of oats in honour of Saint John.\n", "school_info": "School: Gleann an Dúin - Prison", "metadata": [{"Location:": "Prison East, Co. Mayo", "Teacher:": "\nMáire A. Ní Dhocartaigh\n"}, {"Collector": "Patrick James Moran", "Gender": "male"}, {"Informant": "Mrs Kelly", "Gender": "female", "Age": "70", "Address": "Cregg, Co. Mayo"}, {"Language": "English"}]}, "5215784/5210653/5279150": {"title": "The Bonfire", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0095C, Page 16_022", "Page 16_022"], "url": "https://www.duchas.ie/en/cbes/5215784/5210653/5279150", "text": "\nEvery year we make a bonfire in the village of Prison, Barony of Carra, County of Mayo. We always make it in the middle of the village so that all the old people in the village can come to it.That evening one person out of every house in the village goes to the bog with the ass for a bag of turf for the bonfire. Then they build it up in the\n(continues on next page)\n", "school_info": "School: Gleann an Dúin - Prison", "metadata": [{"Location:": "Prison East, Co. Mayo", "Teacher:": "\nMáire A. Ní Dhocartaigh\n"}, {"Collector": "Annie Kearns", "Gender": "female"}, {"Informant": "Michael Kearns", "Gender": "male", "Age": "50", "Address": "Prison North, Co. Mayo"}, {"Language": "English"}]}}