{"4428236/4387494/4459002": {"title": "Woodside House", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0797, Page 255", "Page 255"], "url": "https://www.duchas.ie/en/cbes/4428236/4387494/4459002", "text": "\nAbout 200 yards south of the School there is a residence where King James during his flight after the Battle of the Boyne, it supposed to have stopped a night.\n\n\n\nIn this district there are quantities of furze bushes and these whins used to be sold to the bakers of Dublin long ago. Bakers considered furze was the best material for heating ovens. It was supposed to give flavour to the bread. In those days bakeries were to be found only in large cities and it was only the wealthier people who could afford to have their bread baked for them.\n", "school_info": "School: Sandyford (B.)", "metadata": [{"Location:": "Sandyford, Co. Dublin", "Teacher:": "\nM. O'Keeffe\n"}, {"Language": "English"}]}, "4428236/4387494/4459003": {"title": "Woodside House", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0797, Page 255", "Page 255"], "url": "https://www.duchas.ie/en/cbes/4428236/4387494/4459003", "text": "\nAbout 200 yards south of the School there is a residence where King James during his flight after the Battle of the Boyne, it supposed to have stopped a night.\n\n\n\nIn this district there are quantities of furze bushes and these whins used to be sold to the bakers of Dublin long ago. Bakers considered furze was the best material for heating ovens. It was supposed to give flavour to the bread. In those days bakeries were to be found only in large cities and it was only the wealthier people who could afford to have their bread baked for them.\n", "school_info": "School: Sandyford (B.)", "metadata": [{"Location:": "Sandyford, Co. Dublin", "Teacher:": "\nM. O'Keeffe\n"}, {"Language": "English"}]}, "4498820/4385741/4510815": {"title": "A Famous Person of the District", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0792, Page 201", "Page 201"], "url": "https://www.duchas.ie/en/cbes/4498820/4385741/4510815", "text": "\nKing James on his way from the Boyne slept a night with Mrs. Fagan who was living on Feltrim Hill. When she saw the figure coming she reconised him as her uncle. Then a though that I might be King James so she asked who won the battle and he answered.\"My cowardly Irish troops have run away\" and the woman answered.\"Your Magesty you have won the race\". And then he carried on on his journey to Dublin. He stayed there for a few days and then he made up his mind that he would sail away and join another army. Then he got ready and went down to the dock, and went on board ship and sailed away.\n", "school_info": "School: Kinsealy", "metadata": [{"Location:": "Kinsaley, Co. Dublin", "Teacher:": "\nC. Mac Domhnaill\n"}, {"Collector": "Thomas Saunders", "Gender": "male", "Address": "Baskin Lane, Co. Dublin"}, {"Informant": "Matthew Rielly", "Gender": "male", "Address": "Baskin Lane, Co. Dublin"}, {"Language": "English"}]}, "4706332/4703514/4726194": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0441, Page 168", "Page 168"], "url": "https://www.duchas.ie/en/cbes/4706332/4703514/4726194", "text": "\nIn the time of James II, when the Battle of the Boyne was fought and lost, the Earl of Kenmare lost his estates as he fought on the side of the Stuarts. One half of the army of James was recruited by the Earl in and around Killarney, so the people here were much attached to him as their leader. When the Earl fled to France with the Brigade his estates around Killarney were taken over by two men Cronin and Griffin who had reformed to the Established Religion.Some tenants of the estate who refused to pay rents to Griffin surrounded and captured him near the Deer Park Gate on the north side of Killarney. They proceeded at once to pass sentence of death on him and duly hanged him off one of the large trees of the park at the gate. Ever since that deed was performed there terrible noises are heard near the gate at night and indeed wicked deeds are performed there in the day time by the evil spirits.Cronin lived in a large house near Rathmore and was acting with the help\n(continues on next page)\n", "school_info": "School: Naomh Breandán (B.), Blennerville", "metadata": [{"Location:": "Blennerville, Co. Kerry", "Teacher:": "\nMl. Ó Scannaill\n"}, {"Collector": "Mícheál Ó Scannaill", "Gender": "male", "Occupation": "múinteoir"}, {"Informant": "Mrs Patrick Scannell", "Gender": "female", "Age": "95"}, {"Language": "English"}]}, "4723817/4716056/4743442": {"title": "The Wild Goose Lodge", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0935, Page 006", "Page 006"], "url": "https://www.duchas.ie/en/cbes/4723817/4716056/4743442", "text": "\nThere is a rock not far from Carrickmacross called \"The Wild Goose Lodge\". It is said that there was a hiding place under this rock where \"The Earls of Ulster who were called Wild Geese, took shelter when flying to France\n\n\n\nWolfe ToneWhen Wolfe Tone was being taken prisoner to Dublin he passed close to Carrickmacross. There is a meadow close to the town where men were drilled who fought at the Boyne and Aughrim. The great John O Donovan who visited Carrick in 1835 declared that the inhabitants were as Irish then as in the days of Owen Roe O'NeillAt Lough afooka (Loch a' Phúca)\n(continues on next page)\n", "school_info": "School: Clochar Lughaidh, Carraig Machaire Rois", "metadata": [{"Location:": "Carrickmacross, Co. Monaghan", "Teacher:": "\nSr. Máire\n"}, {"Informant": "Mr Peter Connolly", "Gender": "male", "Address": "Mullylusty, Co. Monaghan"}, {"Language": "English"}]}, "4723845/4718194/4942704": {"title": "Local Place Names", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0942, Page 215", "Page 215"], "url": "https://www.duchas.ie/en/cbes/4723845/4718194/4942704", "text": "\nThere is a lake in the Vicinity of Castleblayney called Muckno Lake. A long time ago Malldoid wished to build a Church near that lake. When he was praying to find a place a pig swam out of the lake three times standing on the same spot each time. He built the Church on this spot. The lake takes its name Muckno from 'muc shnámh' which means 'pig swam.' From this lake this parish is called Muckno Parish. One of the streets in Castleblayney is called Muckno Street.\n\n\n\nsgithisteThere is a field in Aghadreenan called \"Páirc scithiste na saidiúirí\" which means the resting field of the soldiers. It is called by this name because Jacobite soldiers cast their tents and stayed in it for a night on their way to a battle. People said they were going to a fight at the battle of the Boyne. In the townland of Drumgoose there is a fort. About thirty eight years ago Issac Marshall levelled the mound on the fort. He threw lots of clay in the hole which was on the fort. But in the morning all the hair which was on his head the previous day had fallen off. People say that it is not right to interfere with any forts or enchanted places. The fort is called Drumgoose Fort.\n(continues on next page)\n", "school_info": "School: Annalitten", "metadata": [{"Location:": "Annalittin, Co. Monaghan", "Teacher:": "\nA. Mac Suibhne\n"}, {"Collector": "Máighréad Ní Dhálaigh", "Gender": "female", "Address": "Clonavogy, Co. Monaghan"}, {"Language": "English"}, {"Location": "Muckno"}]}, "4922147/4856410/5017265": {"title": "A Historical Account", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0537, Page 244", "Page 244"], "url": "https://www.duchas.ie/en/cbes/4922147/4856410/5017265", "text": "\nAfter the Battle of the Boyne 1st July 1691 the Irish army retreated to Limerick, General De Ginkel followed on, he was one of William of Orange's General's. On his was to Limerick he passed by Tulla, and rested with his army for one night. To this day a field in Tulla goes by the name of the \"Picket Field\", which means the camping field.The people in this area got friendly with them, and he gave them free holds of land for service rendered.\n", "school_info": "School: Béal Átha Gabhann (Silvermines), Nenagh", "metadata": [{"Location:": "Silvermines, Co. Tipperary", "Teacher:": "\nPádraig Ó Floinn\n"}, {"Collector": "Bridie Nolan", "Gender": "female", "Address": "Tulla, Co. Tipperary"}, {"Informant": "Mr John Nolan", "Gender": "male", "Age": "52", "Address": "Tulla, Co. Tipperary"}, {"Language": "English"}]}, "5008883/4963584/5078123": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0679, Page 208", "Page 208"], "url": "https://www.duchas.ie/en/cbes/5008883/4963584/5078123", "text": "\nMany stories are told concerning the Battle of the Boyne, and many arguments are raised as to exact spot where King Billy crossed the Boyne.  There yet remains a track from Slane road to the Ford, strange to say there is now at the Ford a large island called the Sally Island.  Here some said he crossed.  In the middle is a large pool of water called the duck's pond.  One night a man went into the island to shoot ducks.  He did not notice the rising tide until the island was completely surrounded by water.  He had to remain\n(continues on next page)\n", "school_info": "School: St. Vincent de Paul, Drogheda", "metadata": [{"Location:": "Drogheda, Co. Louth", "Teacher:": "\nSr. Magdalen\n"}, {"Informant": "Patrick Mc Enaney", "Gender": "male", "Address": "Trinity Gardens, Co. Louth"}, {"Language": "English"}]}, "5008892/4964349/5078595": {"title": "Hidden Treasure", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0682, Page 005", "Page 005"], "url": "https://www.duchas.ie/en/cbes/5008892/4964349/5078595", "text": "\n(continued from previous page)\nbeen buried there before the time of Christ.\n\n\n\nIt is said that King James watched the Battle of the Boyne from Donore Churchyard.  When he saw that his men were being beaten he fled through Donore on his way to Dublin.  The people in Donore asked him how the battle was going on and he said \"It is all done over\".  It is believed locally that that  is how Donore came to be called 'Donover'.It is still called 'Donover' by older people, and some of the carts have 'Donover' on them.\n", "school_info": "School: Donore", "metadata": [{"Location:": "Donore, Co. Meath", "Teacher:": "\nMaighréad Nic Eóin\n"}, {"Collector": "Peggie Mc Guinness", "Gender": "female", "Address": "Oldbridge, Co. Meath"}, {"Informant": "Patrick Mc Guinness", "Relation": "parent", "Gender": "male", "Age": "50", "Address": "Oldbridge, Co. Meath"}, {"Language": "English"}]}, "4922345/4872310/5080909": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0608, Page 462", "Page 462"], "url": "https://www.duchas.ie/en/cbes/4922345/4872310/5080909", "text": "\n46216. Stephen Hehir of Kilmaley fought at the Battle of the Boyne with Clare's Dragoons.Tadhg O Hehir of Kilmaley fought in Col Charles O'Brien's regiment from 1689 to 1700. There is a field in Murphy's farm at Rathmarie called to Dragoons used to be drilling there.20.The Burkes came from Galway to Kilmaley .\n\n\n\n16Conor O'Brien of Ballymacooda used to be collecting money in Kilmaley to make pikes.\n", "school_info": "School: Cill Mháille (B.), Inis", "metadata": [{"Location:": "Kilmaley, Co. Clare", "Teacher:": "\nTomás Ó Cuinneáin\n"}, {"Collector": "John J. Murphy", "Gender": "male", "Address": "Kilmaley, Co. Clare"}, {"Language": "English"}]}, "5008895/4964610/5095970": {"title": "Duleek and the Battle of the Boyne", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0682, Page 266", "Page 266"], "url": "https://www.duchas.ie/en/cbes/5008895/4964610/5095970", "text": "\nThe Battle of the Boyne took place in the year 1690. Our own village was very much connected with it. It was fought between King James and King William at the River Boyne about four miles away.The evening before the battle King James stayed here for a night in a castle about three miles from the village. This castle is called Athcarne Castle, the home of the Downdall's at the time.He had been also invited to stay in [?] House, and on that account, the people who lived there had a special room built to the house for the King to remain the night in, but to their great disappointment he passed on to Athcarne Castle. Up to this present time anyone who wished to see the rooms in the castle is at liberty to do so.Next day he went to the Battle to meet King William of Orange, King Willaim was son-in-law of King James.the Battle started and after a few shots were fired King James fled leaving his men to the mercy of King William.The Irish were badly trained and under bad leadership. They could not possibly have won.There is a story told about King James, that when he arrived back in Dublin he met an Old Duchess who he told the Irish fled and she replied \"\n(continues on next page)\n", "school_info": "School: Duleek (B.)", "metadata": [{"Location:": "Duleek, Co. Meath", "Teacher:": "\nMicheál Ó Braonáin\n"}, {"Collector": "Éanna Ó Baoighill", "Gender": "male", "Address": "Duleek, Co. Meath"}, {"Informant": "Anthony Wall", "Gender": "male", "Age": "50", "Occupation": "labourer", "Address": "Duleek, Co. Meath"}, {"Language": "English"}]}, "5008895/4964611/5097259": {"title": "Duleek and the Battle of the Boyne", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0682, Page 267", "Page 267"], "url": "https://www.duchas.ie/en/cbes/5008895/4964611/5097259", "text": "\n(continued from previous page)\n\"Yes, and their leader has won the race\"\n\n\n\nThe Battle of the Boyne took place round or about Oldbridge and Rossnaree in the year 1690. Oldbrige is about four miles from the village of Duleek.Christopher Connor, the Commons Duleek, was going for a walk by the side of the Boyne, one day and he found a sharpening stone for sharpening sword, in the ground.When King James was running away from the Battle he stayed in Athcarne Castle, then the \"Dowdalls\". They gave him a special room in the back of the castle. I myself saw the room in which he slept.The meaning of \"Kings Gate\" (in Duleek) is :- when King James was fleeing from the battle he was getting across a gate about a quarter of a mile from the village of Duleek. He nearly broke his two shin bones as he fell from the gate, and the place is now called \"King's Gate\" The gate is not to be seen now, as the place where the gate was is not known.King James rested his last guns on the Old Nanny Bridge. There is some writing on the Bridge, but I could not make it out because I think it is Latin or French or some other language. James afterwards ran to the Naul\n(continues on next page)\n", "school_info": "School: Duleek (B.)", "metadata": [{"Location:": "Duleek, Co. Meath", "Teacher:": "\nMicheál Ó Braonáin\n"}, {"Collector": "Ronan Brennan", "Gender": "male", "Address": "Duleek, Co. Meath"}, {"Informant": "Joseph Wall", "Gender": "male", "Age": "43", "Occupation": "labourer", "Address": "Duleek, Co. Meath"}, {"Language": "English"}]}, "5008895/4964613/5097260": {"title": "Duleek and the Battle of the Boyne", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0682, Page 269", "Page 269"], "url": "https://www.duchas.ie/en/cbes/5008895/4964613/5097260", "text": "\nThe Battle of the Boyne was fought in the year 1690. It was fought at a place not far from Duleek, Oldbridge. King James and King William that were fighting at it. William won the battle and when James saw that he fled away. He came down a lane that runs through Clonlusk and [?], called Freelan Lane; he then galloped across the Commons on his horse and went into Duleek at King's Gate. There used to be an old black gate here, and a wall alongside of it. When James arrived here, he got off his horse, and sat up on the wall, to rest himself. Then someone told him that William's soldiers were near Duleek. He was in such a hurry going, that he forgot his sword, and it was found years after. Then he went down the King's lanes that are called after him.On Mr. Toaffe's land in Clonlusk, is a big rocky place and it is a cave called the Cobbler's Hole. It this cave, James's soldiers stored a lot of guns. William came down the [?] Road with his soldiers. some of them came marching from Rosnaree, but Sarfield's men mety them at the Bog of Thomastown and drove them back. When Willaim came to the top of the Red Mountains and looked down and saw such good land down below, he said to the soldiers and men\n(continues on next page)\n", "school_info": "School: Duleek (B.)", "metadata": [{"Location:": "Duleek, Co. Meath", "Teacher:": "\nMicheál Ó Braonáin\n"}, {"Collector": "John Connor", "Gender": "male"}, {"Informant": "Richard Connor", "Relation": "grandparent", "Gender": "male"}, {"Language": "English"}]}}