{"4428095/4378078/4437284": {"title": "An Arc Luachra", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0637, Page 39", "Page 39"], "url": "https://www.duchas.ie/en/cbes/4428095/4378078/4437284", "text": "\nThere once was a man who lived in Clottahina and one day he was coming home from Cappoquin when he got very tired. So he went into Clottahina Wood and fell asleep. When he woke up he felt sick so he went to the doctor. The doctor gave him medicine but it did not cure him so he went to Father -, the P.P. of Cappoquin. Father - asked him when he first got sick. He told him the day he went to sleep in Clottahina Wood. The priest told him to go home and get a beefstake and boil it and when it was boiled to hold his mouth open over it. The man did as the priest said and when he opened his mouth over the beefstake out came an arc luacra and seven young ones. The animal had gone into his mouth while he slept in the wood and made him sick.\n", "school_info": "School: Ceapach Chuinn (B.)", "metadata": [{"Location:": "Cappoquin, Co. Waterford", "Teacher:": "\nProinnsias Ó Laoghaire\n"}, {"Collector": "Carl O' Leary", "Gender": "male"}, {"Informant": "Mary Cunningham", "Relation": "unknown", "Gender": "female"}, {"Language": "English"}]}, "4493784/4420060/4536607": {"title": "The Man and the Mankeeper", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1118, Page 188", "Page 188"], "url": "https://www.duchas.ie/en/cbes/4493784/4420060/4536607", "text": "\nOne time a man went out to the hill. He fell asleep at night along a river. When he was sleeping a mankeeper went down his throat to his stomach. After that he could never eat enough. He ate a basket of potatoes and he wanted more. After that they put him into a room and gave him salt to eat and he got very thirsty and he was calling for a drink. At the end of three days they took him to a river where there was a water-fall. The mankeeper heard the water falling and he came out for a drink. They killed the mankeeper and went home and from that the mankeeper grew fatter.\n", "school_info": "School: Bredagh Glen", "metadata": [{"Location:": "Bredagh Glen, Co. Donegal", "Teacher:": "\nTomás Ó Catháin\n"}, {"Collector": "Conchobhar Ó Catháin", "Gender": "male"}, {"Language": "English"}]}, "4493784/4420077/4536686": {"title": "The Man and the Mankeeper", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1118, Page 200", "Page 200"], "url": "https://www.duchas.ie/en/cbes/4493784/4420077/4536686", "text": "\nThere was a man who used to sleep along the river. One night while he was sleeping, a mankeeper went down his throat. And from that on he grew thiner every day. He could never eat enough. The doctor gave him all sorts of medicine and it was no use. The sent for a smarter doctor and he said. \"He swallowed a mankeeper he told them to put him into a room and let him eat salt for three days.\" He was calling for a drink. They gave him nothing to drink. At the end of three days they took him to a river where there was a waterfall. When the mankeeper heard the water falling, it rushed out for a drink. The mankeeper wanted to get down his throat again but they killed it. And from that day on he grew fater every day.\n", "school_info": "School: Bredagh Glen", "metadata": [{"Location:": "Bredagh Glen, Co. Donegal", "Teacher:": "\nTomás Ó Catháin\n"}, {"Collector": "Micheál Mac Lochlainn", "Gender": "male"}, {"Language": "English"}]}, "4613682/4608126/4623284": {"title": "Scéal", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0018, Page 248", "Page 248"], "url": "https://www.duchas.ie/en/cbes/4613682/4608126/4623284", "text": "\nBhí fear amuigh i bpáirc lá ag sábháil fhéir agus luigh sé síos ar an talamh le na sgíth a leigint, thárla gur thuit an codhladh air. Fad is bhí sé in a chodladh bhí a bhéal fhosgailte aige agus chuaidh alplóchar isteach ann agus slug sé é. Nuair a dúisigh sé níor airigh sé é féin chomh maith is a bhí roimhe sin agus chuaidh sé chuig an doctúir agus d’innis sé a sgéal dhó. Annsin, dubhairt an dochtúr dhó go dtiubhradh sé leigheas dhó agus thug ach níor éirigh leis an leigheas sin. Thárla gur casadh tinncéar leis ar an mbóthar lá agus d’innis sé a sgéal dhó sin freisin agus dubhairt an tinncéar leis go dtuibhradh sé leigheas dhó dá dtiubhradh sé dídean na h-oidhche dhó agus dubhairt an fear go dtiubhradh , ansin thug an fear an tinncéar isteach agus thug sé suipéar breagh dhó. Ar maidin nuair a d’eirigh an fear bhí an tinncéar sguabtha agus bhí fearg an domhan ar an bhfear. Sa trathnóna tháinic an tinncéar céadna go teach a fhir arís agus is beag nár bhuail an fear é. Seard a bhí ag an tinncéar annsin mar leirgheas ná sgadán gort a ithe agus pota uisce a fhaghail ansin agus a bhéal a fhosgailt ós cionn an phota agus go lumfeadh an alplóchar amach san uisce le deoch a faghail.\n(continues on next page)\n", "school_info": "School: Leath-bhaile", "metadata": [{"Location:": "Levally, Co. Galway", "Teacher:": "\nSéamus Ó Maoldhomhnaigh\n"}, {"Collector": "Tomás Mac Aodha", "Gender": "male", "Address": "Cappadavock, Co. Galway"}, {"Informant": "Maolradh Mac Aodha", "Relation": "parent", "Gender": "male", "Age": "70", "Address": "Cappadavock, Co. Galway"}, {"Language": "Irish"}]}, "4769976/4763659/4929033": {"title": "Ailments and Cures - Dark Lucre", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0781, Page 210", "Page 210"], "url": "https://www.duchas.ie/en/cbes/4769976/4763659/4929033", "text": "\n\"Dark Lucre\"A dark lucre is like a lizard. It is small with black and brown colour. It lives mostly in bogs. It would jump into your mouth and go down your neck like a flash. It would live inside you and you would get very thin. If you left your coat down it would get into the coat and at night when you are asleep it would go down your neck. The cure is, not to take any drinks but eat salty foods and go to the river or lake and keep eating until your stomack turns. Then the lucre will come up. My mother told me that a man from Timolin swallowed a dark lucre an the salt got the lucre up.\n", "school_info": "School: Skerries, Athy", "metadata": [{"Location:": "Skerries North, Co. Kildare", "Teacher:": "\nE. Tansey\n"}, {"Collector": "Joseph Mahon", "Gender": "male", "Address": "Ballynabarna, Co. Kildare"}, {"Language": "English"}]}, "5008831/4959457/5073766": {"title": "The Cure of the Man-Creeper", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0664, Page 085", "Page 085"], "url": "https://www.duchas.ie/en/cbes/5008831/4959457/5073766", "text": "\nA local belief is that if a person catches a man-creeper (a brown insect found under stones) and licks his belly three times and swallows the spittle each time he will be able to cure any burns.\n", "school_info": "School: Síolach", "metadata": [{"Location:": "Sheelagh, Co. Louth", "Teacher:": "\nS. Ó Gnímh\n"}, {"Language": "English"}]}, "4922353/4873439/5074554": {"title": "Ainmhithe Allta", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0612, Page 105", "Page 105"], "url": "https://www.duchas.ie/en/cbes/4922353/4873439/5074554", "text": "", "school_info": "School: Leitir Uí Cheallaigh, Sráid na Cathrach", "metadata": [{"Location:": "Letterkelly, Co. Clare", "Teacher:": "\nSeosamh Mac Dáibhid\n"}, {"Language": "Irish"}]}, "5044756/5036567/5137707": {"title": "The Alp Luachra", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0925, Page 041", "Page 041"], "url": "https://www.duchas.ie/en/cbes/5044756/5036567/5137707", "text": "\nThere was once a wealthy farmer in Connacht, and he had plenty of substance and a fine family, and there was nothing putting grief nor trouble on him, and you would say yourself that its he was the comfortable, satisfied man, and that the luck was on him as well as on e'er a man alive. He was that way without mishap or misfortune, for many years, in good health and without sickness or sorrow on himself or his children, until there came a fine day in the harvest, when he was looking at his men making hay in the meadow that was near his own house, and as the day was very hot he drank a drink of buttermilk, and stretched himself back on the fresh cut hay, and as he was tired with the heat of the day and the work he was doing, he soon fell asleep, and he\n(continues on next page)\n", "school_info": "School: Barraniskey, Avoca", "metadata": [{"Location:": "Barranisky West, Co. Wicklow", "Teacher:": "\nMiss Kavanagh\n"}, {"Language": "English"}]}}