{"4921610/4884859/5150210": {"title": "Daoine Cáiliúla", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0293, Page 243", "Page 243"], "url": "https://www.duchas.ie/en/cbes/4921610/4884859/5150210", "text": "\nNuair a bhuail na Sasanaigh ar na Gaéidhil i gcath Cionn tSáile cúaidh na Gaédhil go léir ar theithe leó féin. Níor stad ceann acu gur tháinig sé go Meall a tSruthán i bparóiste na Léime. Mac Cárcalán ab ainm do, agus bhí sé cómh thréith tuirseach gur thuitr sé a codhladh cois claídhe fé sgocán. Do bhí an grían ag go h-árd sa spéir sar a dhúisigh sé agus é in a ana ocrach. Nuair deirigh sé dféach sé mór thímpal air agus ní raibh radharc ar aon tig aige. Do bhúail sé roimis agus casad tig air cúaidh sé isteach agus dinnis sé an sgéal dóibh agus cad dimig air agus bhí an fáilte roimis. Do cuir sé fé ann agus bhí mach amhain aighe a bhí ana láidir. Nuair a fúair a Máthair bás la'n socruide ní leighfheadh sé aon duine ina goire. Bhí sé cómh ceannamhail bhí cóta bréide air agus thóg sé an Cóimhra fé na oscail agus do rug sé ar iarbaill an chóta agus do rug sé go dtí an uaigh é. Do cúaidh sé ceithre míle go dtí an uaigh agus tá a sinnsear san áit fós.\n", "school_info": "School: Garrán (B.)", "metadata": [{"Location:": "Garrane, Co. Cork", "Teacher:": "\nConchobhar Ó Drisceoil\n"}, {"Collector": "Cíaran Nolan", "Gender": "male", "Address": "Garrane, Co. Cork"}, {"Informant": "John Hurley", "Gender": "male", "Age": "60", "Address": "Garrane, Co. Cork"}, {"Language": "Irish"}]}, "4811664/4810359/5167077": {"title": "Quaint County Cork Town - Kinsale", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0341, Page 542", "Page 542"], "url": "https://www.duchas.ie/en/cbes/4811664/4810359/5167077", "text": "\n542 Quaint Co Cork Town - Kinsale The quaint old-world town of Kinsale abounds in tradition and quaint lore dear to the heart of any lover of Irish tradition. Kinsale is within easy reach of Cork city and would well repay a visit by any student of the past. Mount Long Castle at Oyster Heaven a few miles from Kinsale town, has interesting associations. It was built in 1631 by John Long \"of Ryngnyan\" (Ringinanes), who was an assignee of Thomas Lord Kerry, and resembled in its general architecture style, Monkstown Castle which was built some seven years later. John Long was at the period a person of some not, because some years after building his castle he was given the authority to hold courts at Mount Long and in 1641 - the year of the great rebellion - he was created High Sheriff of County Cork. John Long immediately threw in his lot with the Rebels' and organized a camp at Belgooley, whither flocked most of the local Catholics\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire, Maghcromtha", "metadata": [{"Location:": "Macroom, Co. Cork", "Teacher:": "\nNa Siúracha\n"}, {"Collector": "Máire Ní Ceallacháin", "Gender": "female", "Address": "Coolkisha, Co. Cork"}, {"Informant": "Sean Ó Tuama", "Gender": "male", "Address": "Coolkisha, Co. Cork"}, {"Language": "English"}]}}