{"4493755/4416836/4531047": {"title": "Fairy Haunts", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1110, Page 326", "Page 326"], "url": "https://www.duchas.ie/en/cbes/4493755/4416836/4531047", "text": "\n(continued from previous page)\nthem and is still believed to be living with them. Many incidents like this happened all over the country.\n\n\n\nThere was a man one time called Johnny Hardy living in Fallask. Fallask is about three miles outside Buncrana. Johnny was a member of an organisation known as the Ribbon men. Any time any outsider interfered with any of the members the rest of them would wait in some dark road and then when the man would come along they\n(continues on next page)\n", "school_info": "School: N. Colmcille, Buncrana", "metadata": [{"Location:": "Buncrana, Co. Donegal", "Teacher:": "\nPilib Mac Riada\n"}, {"Collector": "Colm Mc Laughlin", "Gender": "male", "Address": "Buncrana, Co. Donegal"}, {"Informant": "Mrs J. Mc Laughlin", "Gender": "female", "Address": "Buncrana, Co. Donegal"}, {"Language": "English"}]}, "4742161/4741077/4818869": {"title": "Ethnographic", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0773, Page 406", "Page 406"], "url": "https://www.duchas.ie/en/cbes/4742161/4741077/4818869", "text": "\nNames in this locality bear traces of having descended from Cromwell's followers.  Recently, a few names of Irish origin have settled, but previous to this the Jones, Sargeants, Hills, Woods, Sinnotts were predominant.  These are all in small holdings.  Tradition has it that a Sinnott was hung from the shafts of a dray in his own yard for having given information about a stolen horse by the Ribbons men from the Red Bog. Another time a Cornwall (still big land-holders in the district) land agent for the district round, was passing up Furry hill.  He saw a farmer named Hill, with a good horse on his land.  He went in and ordered him to have the horse at his place by morning and the unfortunate man had to travel all the way to Arklow with the horse and walk back.  His own relative I heard telling this.\n", "school_info": "School: Kilteel, Naas", "metadata": [{"Location:": "Kilteel Lower, Co. Kildare", "Teacher:": "\nBríd Ní Nualláin\n"}, {"Language": "English"}]}, "4922309/4868991/5022874": {"title": "Keogh and Grace and Brave Mick Long and Kirby the Stout Hero", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0582, Page 201", "Page 201"], "url": "https://www.duchas.ie/en/cbes/4922309/4868991/5022874", "text": "\n\"Keogh + Grace + Brave Mick Long + Kirby the Stout Hero\"[-]Many stories are told in Tipperary of Keoghs, Grace, Mick Long and Kirby, whose desperate deed of daring struck terror in the hearts of the landlords and Protestants ascendancy in the early portion of the 19th century. From what I can gather they were ribbon-men, holding away sometime between 1800 + 1820. There were two Keoghs: - Croppy Keogh, X? Keogh, Brothers  from Holy Cross.Grace was from Gooldscross + his parents were of the \"Gentry\" class. Michael Long was from the Mount of Rathe Cannon (parish of Holy Cross) Kirby: Was from the Parish of Knockavilla. On their first morning together they raided Murphy's of Ballinamona for arms. When about the leave he said to them \"Boys! do nothing to day you'd be sorry for to morrow\" thinking that he knew them they turned on him + shot him dead.In Garrane that morning they shot a man named Conway(?) + his two horses - he had been ploughing. Then they proceeded to the Gibbet's Cross\n(continues on next page)\n", "school_info": "School: Coill an Easbuig (Bishopswood), Dundroma", "metadata": [{"Location:": "Bishopswood, Co. Tipperary", "Teacher:": "\nMícheál Mac Cárthaigh\n"}, {"Collector": "Micheál Mac Cárthaigh", "Gender": "male", "Address": "Bishopswood, Co. Tipperary"}, {"Informant": "Denis Mc Carthy", "Gender": "male", "Age": "71", "Address": "Kilmore, Co. Tipperary"}, {"Language": "English"}]}, "4922309/4868995/5022876": {"title": "The Shooting of Cooper and Welland", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0582, Page 205", "Page 205"], "url": "https://www.duchas.ie/en/cbes/4922309/4868995/5022876", "text": "\nThe Shooting of Cooper and Welland5th April 1838[-]This shooting is of great historical importance. It caused the landlords of Tipperary to band together and call upon the viceroy of that time to use his influence in getting a bill passed for their protection. He declined and became famous for making the much quoted statement. \"Landlords have duties as well as rights.\" He was soon recalled to England.Welland was about to evict one Ryan Bawn (Great Great Grand Uncle to JWG). From his farm in Kilmore - now the \"Rape field.\" Ryan appealed for help to his friends + the result was the shooting on April the 5th of Welland of Ballywalter + Cooper of Kellenure. Those who took part in it were: Hickey of Ballinard, Corbett of Garrane, Ryan Mongo of Lisheen, Billy Walsh of Ballahurst. Near Graves' beyond Mough the shooting took place. Cooper + Welland were in an open car - a 'tar - car' or Back to Back car. They were both armed and when fired upon they returned fire + Son Hickey was hit in the face with gun-shot from a pistol.Cooper was hit in\n(continues on next page)\n", "school_info": "School: Coill an Easbuig (Bishopswood), Dundroma", "metadata": [{"Location:": "Bishopswood, Co. Tipperary", "Teacher:": "\nMícheál Mac Cárthaigh\n"}, {"Collector": "Mícheál Mac Cárthaigh", "Gender": "male"}, {"Informant": "Denis Mc Carthy", "Gender": "female", "Age": "71", "Address": "Kilmore, Co. Tipperary"}, {"Language": "English"}]}, "4922309/4868998/5022878": {"title": "The Tithe War", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0582, Page 208", "Page 208"], "url": "https://www.duchas.ie/en/cbes/4922309/4868998/5022878", "text": "\nThe Tithe WarThey came out of the fortSix gallant and true MilescausSaying \"Scott you evil Ghost!Give up your books + post,Or to hell your soul will go,Without Salvation!\"Part of an old song very probably a hundred years oldThe Proctor (Scott) set out with his men from Golden to Collect tithes in Ballinard.When they came to Guilfoyle's fort (Ballimond) They were set upon by six men -two Hickeys, Ryan Mhaiteis, and three others. They were dragged into the fort, placed in deep hols - the ground that were prepared for them, and the clay thrown about them with only their heads were visible above the ground. They were then obliged to chew all the account books + papers + to swear never to come near the police againThat was the best attempt to collect tithes in Ballimond\n", "school_info": "School: Coill an Easbuig (Bishopswood), Dundroma", "metadata": [{"Location:": "Bishopswood, Co. Tipperary", "Teacher:": "\nMícheál Mac Cárthaigh\n"}, {"Collector": "Mícheál Mac Cárthaigh", "Gender": "male"}, {"Informant": "Denis Mc Carthy", "Gender": "male", "Age": "71", "Address": "Kilmore, Co. Tipperary"}, {"Language": "English"}]}, "4922309/4868999/5022879": {"title": "The Battle of Kilfeacle", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0582, Page 209", "Page 209"], "url": "https://www.duchas.ie/en/cbes/4922309/4868999/5022879", "text": "\nThe faction fight or \"Battle\" of Kilfeacle was fought sometime about 1820. It was some time after the return of the 'pressed soldiers' who had been fighting at Waterloo (1815) as two such ex-soldiers took part in fight in Kilfeacle.The Loobys and  Hogans fell out with the Hickeys and Kellys.The trouble arose when Black Din Kelly refused to marry a girl of the Loobys.The Hickeys backed the Kellys and were left to fight the issue on their own in the end. The Hogans backed the Loobys. The fight took place in July at the fair of Kilfeacle.The Hickeys gathered there and were so strong that the Hogans were afraid to leave Tipperary. The Hickeys drank and fired off their guns. Word of this was brought to Tipperary by the Hogans' landlord -- Mansergh of Greenane, and they left the town and engaged their enemies when they least expected them. A pitched battle ensued. Two were killed and several badly wounded. The two killed were Duggan of Garrane and  Charlie McCarthy of Gurtussa Dundrum---both home from Waterloo.They were among those that were pressed (conscripted) when the British\n(continues on next page)\n", "school_info": "School: Coill an Easbuig (Bishopswood), Dundroma", "metadata": [{"Location:": "Bishopswood, Co. Tipperary", "Teacher:": "\nMícheál Mac Cárthaigh\n"}, {"Collector": "Mícheál Mac Cárthaigh", "Gender": "male"}, {"Informant": "Denis Mc Carthy", "Gender": "male", "Address": "Kilmore, Co. Tipperary"}, {"Language": "English"}]}, "4922309/4869000/5022881": {"title": "The Battle of Kilfeacle", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0582, Page 210", "Page 210"], "url": "https://www.duchas.ie/en/cbes/4922309/4869000/5022881", "text": "\n(continued from previous page)\nwere warring with Napoleon.They were caught in the corner of a field and shot from behind by the Hogans.Charlie McCarthy was from Gurtussa Dundrum and a 1st. cousin to my (the collectors) .e Michael MacCarty who was the Principal teacher of Knockavilla N.S. the collector ,great grandfather Jack he slept in Kilmore with my great grandfather the night prior to the fight & was begged of to stay at home\"Isaw more men dead in Waterloo\" said Charlie \"than will ever walk to the fair of Kilfeacle\". He was armed with a Blunderbus which was loaded with eighteen slugs of iron.Duggan was also armed with a Blunderbus.McCarty was buried in Kilpatrick churchyard &a head stone was erected over him.The Hogans came by night and smashed it. It can be seen to this day.My natural great great greatgrand father Watt Carey was also on the side of the Hickeys & was nearly killed, he was thrown into a dyke & a large stone thrown on him.\n\n\n\nThe Hickeys were very numerous in Ballinard and the adjoining townslands.Each family was known\n(continues on next page)\n", "school_info": "School: Coill an Easbuig (Bishopswood), Dundroma", "metadata": [{"Location:": "Bishopswood, Co. Tipperary", "Teacher:": "\nMícheál Mac Cárthaigh\n"}, {"Language": "English"}]}, "4922309/4869030/5051723": {"title": "Tadhg Gabha agus Sir John", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0582, Page 240", "Page 240"], "url": "https://www.duchas.ie/en/cbes/4922309/4869030/5051723", "text": "\nTadhg Gabha + Sir JohnSomebody once reported to Sir John that Tadgh Gabha had a gun + was a Whiteboy (or Ribbonman?) He came to accuse him but Tadgh was ready for him + had a deep hole dug in the dung. Into this he was thrown + the dung packs around him leaving nothing overground but his head. Sir John then swore he would never meddle with Tadgh again.\n", "school_info": "School: Coill an Easbuig (Bishopswood), Dundroma", "metadata": [{"Location:": "Bishopswood, Co. Tipperary", "Teacher:": "\nMícheál Mac Cárthaigh\n"}, {"Collector": "Mícheál Mac Cárthaigh", "Gender": "male"}, {"Informant": "Denis Mc Carthy", "Gender": "male", "Age": "71", "Address": "Kilmore, Co. Tipperary"}, {"Language": "English"}]}, "5070738/5058738/5092515": {"title": "Ribbon Men", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0986, Page 110", "Page 110"], "url": "https://www.duchas.ie/en/cbes/5070738/5058738/5092515", "text": "\nNear the village of Gowna when I was a boy lived an old man named Páid Carthy. On his own admission Páid was a Ribbon man - agin the Law, death dealer to Land Lords and their supporters and an enemy to the Proctors, and all they stood for. Páid told me of raids he was on around Brunere Mountain. he wand his comrades were disguised with straw and carried slónt sticks. A Pike was pushed into the ends of these sticks.Rhyme of the RibbonmenBoney is burning lime says the Sean béan bhuchg\"  \"  \"  \" to build up walls of time Says the Sean béan bhuchg.\n\n\n\nA local clan now extinct named \"The Keaneys' were Fenians and led a very strong faction.'The McGasterns another local clan were Ribbon men and had a very wicked Party. At the fair of Scrably. these\n(continues on next page)\n", "school_info": "School: Gowna", "metadata": [{"Location:": "Lough Gowna, Co. Cavan", "Teacher:": "\nHugh Murray\n"}, {"Informant": "Thomas Smith", "Gender": "male"}, {"Language": "English"}]}, "5162170/5160636/5164979": {"title": "Traditions about Old Scotshouse", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0947, Page 072", "Page 072"], "url": "https://www.duchas.ie/en/cbes/5162170/5160636/5164979", "text": "\n(continued from previous page)\nhis orange sash and handkerchief. It was the Ribbonmen who did this. One of the Ribbonmen went to Burk's funeral and was shouldered into the ditch and it was in revenge for this and for his past actions in Scotshouse that this deed was done. The deed was planned before hand, after doing it they took refuge in a barn belonging to D'Alton of Lisnalee, near the road and on the following morning they could hear one fo the Keatings shouting news of the deed to his neighbours.\n\n\n\nCullough Mac Mahon lived at Cruck na cush (now called Cush). He was descended from the Mac Mahon chiefs and owned 105 acres of land. When Scotshouse old chapel was being dedicated Cullough Mac Mahon was present. The whole country attended. It was dedicated by the Bishop of Kilmore who also preached the sermon. It took place in the chapel yard. When Madden heard of this he came tearing to the chapel to know who gave permissions to hold the meeting. Then Cullough Mac Mahon jumped off his knees at an early age and ordered him to take off his hat and kneel down or leave the premises. Madden did so\n(continues on next page)\n", "school_info": "School: Killyfargy", "metadata": [{"Location:": "Killyfargy, Co. Monaghan", "Teacher:": "\nB. Ó Mórdha\n"}, {"Collector": "Seamus P. Moore", "Gender": "male"}, {"Informant": "Henry Walsh", "Gender": "male", "Age": "circa 75", "Occupation": "labourer", "Address": "Dunsrim, Co. Monaghan"}, {"Language": "English"}]}}