{"4428215/4386643/4456673": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0794, Page 370", "Page 370"], "url": "https://www.duchas.ie/en/cbes/4428215/4386643/4456673", "text": "\nThis story was told to BRENDAN CASEY of BLACKCHURCH INN  CO DUBLIN   29TH October 1937There is an old legend told by the people of the localities of Rathcoole and Newcastle that during the rebellion of 1641, Maguire the leader of the Co Dublin rebels hearing of the approach of the English troops, buried all the treasure which he and his army possessed. The treasure is believed to be buried half-way between Rathcoole and Newcastle. It is also rumoured that on the night of October 23rd a body of ghosts came from the direction of Newcastle and start digging for the treasure. One night they were seen by a man who shouted loudly whereupon they all disappeared under the ground.\n", "school_info": "School: Saggart", "metadata": [{"Location:": "Saggart, Co. Dublin", "Teacher:": "\nMichael Ó Cléirigh\n"}, {"Collector": "Brendan Casey", "Gender": "male", "Address": "Steelstown, Co. Dublin"}, {"Language": "English"}]}, "4428215/4386654/4456707": {"title": "Folklore Story - Hidden Treasure", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0794, Page 380", "Page 380"], "url": "https://www.duchas.ie/en/cbes/4428215/4386654/4456707", "text": "\nFolklore Story: Hidden Treasure.There is an old legend going around this locality for about two hundred years .It says that there is hidden treasure between Newcastle and Rathcoole. The story goes that in the time of the rebellion of 1641, Maguire, the Dublin leader hearing of the approach of the English buried all the money that he and his army had. The story was told to me by a man of about ninety years of age. He also told me that every year, on October 23rd, an army of ghosts come from the direction of Newcastle, armed with weapons and start digging for the treasure. One night he saw them himself and shouted .Then they all disappeared under the ground.\n", "school_info": "School: Saggart", "metadata": [{"Location:": "Saggart, Co. Dublin", "Teacher:": "\nMichael Ó Cléirigh\n"}, {"Language": "English"}]}, "4428251/4388449/4465736": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1027, Page 024", "Page 024"], "url": "https://www.duchas.ie/en/cbes/4428251/4388449/4465736", "text": "\n(continued from previous page)\nblack pig he meant the train and it has come to pass.\n\n\n\nThe Irish long ago were very superstitious. They would not take milk out of the house after sunset without putting salt in it. They used always pray when they saw the new moon. People would not leave a young child in the house without putting the tongs across the cradle. This was done to prevent the fairies taking it away.\n\n\n\nBrachin Lane is a small lane about a mile to the south of Ballyshannon. Long ago the people used work on this lane for\n(continues on next page)\n", "school_info": "School: St Joseph's, Béal Átha Seanaigh", "metadata": [{"Location:": "Ballyshannon, Co. Donegal", "Teacher:": "\nAn Br. S. Ó Murchadha\n"}, {"Collector": "Danny Breslin", "Gender": "male", "Address": "Rathmore, Co. Donegal"}, {"Informant": "Mr P. Loughlin", "Gender": "male", "Address": "Rathmore, Co. Donegal"}, {"Language": "English"}]}, "4498681/4385582/4509846": {"title": "The Old Graveyards", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0791, Page 59", "Page 59"], "url": "https://www.duchas.ie/en/cbes/4498681/4385582/4509846", "text": "\n(continued from previous page)\niron. There are two disused graveyards in the parish. Cave, ene and the old grave-yard in Mulhuddart. The old people around this locality say they remember burials to have taken place there. These graveyards were called cemetries. It is a custom that all the family should be buried together in the same graveyard, even if the grave-yard is not in the parish.\n\n\n\nA Find near Ashtown     Recently, a man living on the river road, near Ashtown, was digging in his garden when he dug up part of a human skeleton he kept on digging thinking he would discover something. He reported the matter and a number of men were sent to continue the work and the number of skeletons found amounted up to three hundred. As there was no wood found or anything it is believed that they were not buried in -\n(continues on next page)\n", "school_info": "School: Castleknock", "metadata": [{"Location:": "Castleknock, Co. Dublin", "Teacher:": "\nSr O' Leary\n"}, {"Language": "English"}, {"Location": "Ashtown"}]}, "4493661/4408921/4520501": {"title": "The Battle of Scarriffhollis", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1084, Page 284", "Page 284"], "url": "https://www.duchas.ie/en/cbes/4493661/4408921/4520501", "text": "\nThe battle of Scarriffhollis was fought in this district about three hundred years ago. They fought from a fort in Dooen to a trench in Roughan, This is in Mr Gibbons field and the trench is in Mr White's field. They say that the River Swilly ran red with blood for three days and three nights. When my grandfather was draining the fields afterwards he dug up some of the old rifles and bullets. My father saw the trench open and he was in it and he says that the smell of the powder is in it to this day. The trench is built of stone sides and flagged roof and it is about seven feet wide and about fourteen feet in length. The fort is built of clay and it is of a round shape. Godfiery O'Donnell lived in a castle at\n(continues on next page)\n", "school_info": "School: Glendooen", "metadata": [{"Location:": "Doon Glebe, Co. Donegal", "Teacher:": "\nEdith V. Jennings\n"}, {"Collector": "Frances Clarke", "Gender": "female", "Address": "Newmills, Co. Donegal"}, {"Language": "English"}]}, "4569054/4567263/4575133": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0035, Page 0349", "Page 0349"], "url": "https://www.duchas.ie/en/cbes/4569054/4567263/4575133", "text": "\n(continued from previous page)\n[-]\n\n\n\nIn the time of the Fianna there was a bishop named Dr. Madden who lived in Clunoo. He was arrested by the English forces under command Power, and he was taken to Galway. As he was going in the gate Power asked him for hire, the hire at that time was twelve shillings a week. The Dr. said that he was late and all I will give you is the hangman's hire which is thirteen pence. He said go now and you will have a new story before you, and when he went home his wife met him at the gate. She said come in\n(continues on next page)\n", "school_info": "School: Cill Críosta", "metadata": [{"Location:": "Kilchreest, Co. Galway", "Teacher:": "\nSeán Ó Cléirigh\n"}, {"Collector": "Maureen Forde", "Gender": "female", "Address": "Raheen Oughter, Co. Galway"}, {"Informant": "Michael Forde", "Gender": "male", "Address": "Raheen Oughter, Co. Galway"}, {"Language": "English"}]}, "4569054/4567264/4575139": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0035, Page 0350", "Page 0350"], "url": "https://www.duchas.ie/en/cbes/4569054/4567264/4575139", "text": "\n(continued from previous page)\nuntil I Show you Dr. Madden. What! Is it the man I Have left in Galway. She brought him into the room, and her only son was dead and that was the end of the Powers in booiheen.Michael Jorde,Raheen.There was a blacksmith in Kilchreest lond ago whose name was Bonnors, and he used to be always talking about the Tianna. Bajtain Perfse who lived in Roxborro (he) used to have forty men working for him. The blacksmith used to say  that the French were  to come to Killala.When the men told that to the   Bajtain , he, He came raging back to the forge. He shouted in to the blacksmith , and asked him ws he inside. The blacksmith asked him what did he want.The Bajtain said\n\n\n\nThere was a blacksmith in Kilchreest long ago who'se name was Connors, and he used to be always talking about the Fianna. Captain Perfse who lived in Roxboro (he) used to have forty men working for him. The blacksmith used to say that the French were to come to Killala.When the men told that to the Captain, He came raging back to the forge. He shouted in to the blacksmith, and asked him was he inside. The blacksmith asked him what did he want. The Captain said\n(continues on next page)\n", "school_info": "School: Cill Críosta", "metadata": [{"Location:": "Kilchreest, Co. Galway", "Teacher:": "\nSeán Ó Cléirigh\n"}, {"Collector": "Maureen Forde", "Gender": "female", "Address": "Raheen Oughter, Co. Galway"}, {"Informant": "Michael Forde", "Gender": "male", "Address": "Raheen Oughter, Co. Galway"}, {"Language": "English"}]}, "4723874/4721284/4759935": {"title": "The Battle of Drumbanagher", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0961, Page 038", "Page 038"], "url": "https://www.duchas.ie/en/cbes/4723874/4721284/4759935", "text": "\nThe battle of Drumbanagherfought in the old fort, half a mile from Glasslough, on the 13th March, 1688, is a prominent landmark in local tradition which connects the final over throw of the influence and away of the Mac Kenna clan with it. Glaslough, which had been purchased, May 22nd, 1665, by John Leslie, Protestant Bishop of Clogher, from the trustees of the late Lord Ridgeway, was able to muster a strong fighting force. Lord Blaney, the Governor of Co. Monaghan, ordered this force to proceed to Antrim. On the 13th March, 1688, they set out under the command of Captains Richardson, Boll and Anketell. The Catholics hearing of their arrangements some time\n", "school_info": "School: Killyraine", "metadata": [{"Location:": "Killyrean Upper, Co. Monaghan", "Teacher:": "\nS. Ó Coilleadh\n"}, {"Language": "English"}]}, "4723876/4721379/4779977": {"title": "Story of Tynan Abbey", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0961, Page 132", "Page 132"], "url": "https://www.duchas.ie/en/cbes/4723876/4721379/4779977", "text": "\n(continued from previous page)\nback again. It was on a moonlight night about seven o'clock that they visited the cave after my grandfather's return from the Great War. The cave is still there with the Mass Rock inside. The bullet is still in the Altar. People have tried to remove it but it has never been taken out. Three graves marked with stones have been located behind the cave by a man named Hughes from Coolkill who is still alive but they were unable to distinquish the names written on the stones.\n\n\n\nA detachment of Irish infantry was going northwards to help King James (1659). Now it happened that there was a tyrant of English breed living in the neighbourhood called Ankatell whose castle can be seen to this day (Ankatell Grove Emyvale) and he helped to intercept the Jacobite troops. The two forces came together at Drumbanagher and a fierce hand to hand struggle took place. Most of the soldiers on both sides were either killed or injured. In the circle of trees on the top of the hill swords and spears were found in trees and in a quarry hole not far from it. Other such arms were recovered dated 1659.\n", "school_info": "School: Baile i Meadhon Locha", "metadata": [{"Location:": "Bellanaman, Co. Monaghan", "Teacher:": "\nC. Nic Gabhann\n"}, {"Collector": "Peggy Mc Kenna", "Gender": "female", "Age": "11", "Address": "Lisgoagh, Co. Monaghan"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "female"}, {"Language": "English"}]}, "4742056/4731373/4815618": {"title": "The Pillory in Monaghan", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0957, Page 139", "Page 139"], "url": "https://www.duchas.ie/en/cbes/4742056/4731373/4815618", "text": "\nIn Monaghan it was a common thing to put a man in the pillory which was in the Diamond Monaghan. In  1796 one James Moan, who was tried and convicted for tendering an unlawful  oath of secrecy to one William Gillespie, which oath was in all probability that of the United Irishmen. He was placed in the pillory, which consisted of a large wooden frame attached to the steps of the old cross (?) which was then in the Diamond. The prisoner's head was put through a hole in the upper boards of the frame. The mob usually through rotten eggs and dirt at the prisoner's head.But at this time political prisoners were not usually interfered with but James Moan had the misfortune to be at enmity with a one Batters'by who resided  in the Diamond. This man gave eggs and other missles to children to pelt Moan.\n", "school_info": "School: Monaghan (Christian Bros.)", "metadata": [{"Location:": "Monaghan, Co. Monaghan", "Teacher:": "\nM. Ó Floinn\n"}, {"Language": "English"}]}, "4769963/4763064/4924125": {"title": "Three Wonders of Batle of Alllen", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0779, Page 038", "Page 038"], "url": "https://www.duchas.ie/en/cbes/4769963/4763064/4924125", "text": "\nThe Battle of Allen was fought in 720 between the men of Leath-Chuinn under Fearghal King of Ireland and the men of Leinster under Donnchadh, son of Murchadh the Noble and Aodh, son of Colgan and heir presumptive to the sovereignty. King Fearghal had in his army 21,000 men well armed and the Leinstermen 9,000. Long indeed was this muster of forces being carried on. Among the men of Leath-Chuinn was one Donibo. Now Donibo was a widow's son of the Fera Ros. a tribe inhabiting the district round the present town of Carrickmacross. He never went away from his mother's house for one day or one night, and then was not one in all Ireland of fairer countenance, or of better figure\n(continues on next page)\n", "school_info": "School: Cill Dara (Pres. Convent)", "metadata": [{"Location:": "Kildare, Co. Kildare", "Teacher:": "\nSr. Philomena\n"}, {"Language": "English"}]}, "4921974/4914601/4938255": {"title": "Local Heroes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0491, Page 243", "Page 243"], "url": "https://www.duchas.ie/en/cbes/4921974/4914601/4938255", "text": "\nOf all the local heroes, legendary or otherwise who enshrined themselves in the hearts of the West Limerick people, the greatest is perhaps Daneen Dan Hantnett, one of the most prominent local leaders of the '48 movement. His escapades and exploits with the military and police are still recounted around many a country fireside on a winters night.On one occasion he held up the royal mail coach at Devon road to search for spies letters - an exploit considered most daring in those days but quite common place during the late \"Tan\" war. For weeks after, the whole country side was combed by military and police. On one occasion some cowardly spy gave the information that he was located in a house at Tullig pound.This place was surrounded right away and it looked as if escape for Daneen was out of the question. The fenian was seized with the inspiration to lie between two feather ticks which comprised the usual bedding in farmers\n(continues on next page)\n", "school_info": "School: Móin na nGé (C.), An Caisleán Nua", "metadata": [{"Location:": "Rahanagh, Co. Limerick", "Teacher:": "\nMáire, Bean Uí Eachtigheirn\n"}, {"Collector": "Joan Conway", "Gender": "female", "Address": "Rathcahill East, Co. Limerick"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "male", "Age": "50", "Address": "Lissurland, Co. Limerick"}, {"Language": "English"}]}, "4742049/4730893/4939176": {"title": "Drumloo - Drom Lughbhaidh", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0955, Page 274", "Page 274"], "url": "https://www.duchas.ie/en/cbes/4742049/4730893/4939176", "text": "\nThere was a battle fought in Drumloo in 1688, between the English and the Irish who lived in Drumloo. A soldier’s button was found in a field in Drumloo by Peter McGuire. According to McGuire the name “Right Honourable Jones”, was on the button.McGuire gave the button to Dr Elliot of Smithboro’. The latter consulted a book and gave McGuire some information about the battle viz.:- the English drove the Irish out of the Fort but were finally defeated. A number of men were buried in the field where McGuire found the button.\n", "school_info": "School: Iorball Sionnaigh", "metadata": [{"Location:": "Scotstown, Co. Monaghan", "Teacher:": "\nE. Mac Thaidhg\n"}, {"Collector": "Séamus Ó Daighne", "Gender": "male", "Age": "13", "Address": "Drumloo, Co. Monaghan"}, {"Informant": "Peadar Mag Uidhir", "Gender": "male", "Age": "66", "Address": "Drumloo, Co. Monaghan"}, {"Language": "English"}]}, "4922055/4848076/5009540": {"title": "Battle of Moanmore 1151", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0512, Page 409", "Page 409"], "url": "https://www.duchas.ie/en/cbes/4922055/4848076/5009540", "text": "", "school_info": "School: Cnoc Cairn, Imleach Iubhair", "metadata": [{"Location:": "Knockcarron, Co. Limerick", "Teacher:": "\nTomás Ó Dúthaigh\n"}, {"Language": "English"}]}, "4922254/4864499/5051738": {"title": "Mushrooms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0568, Page 170", "Page 170"], "url": "https://www.duchas.ie/en/cbes/4922254/4864499/5051738", "text": "\nMushrooms grow very plentiful in some parts of Ireland. Mushrooms grow on rich ground. It has a shape like a cap with a short stem. People make hair-oil from them others boil them in new-milk and eat them.Annie Lonergan,Kincor,Clonmel,My Mother Mrs Lonergan told me this story.\n\n\n\nThe ancestors lived in Ballinaraha for the last three hundred years. It was my great Grandfather that brought John Omahoney to Dungarvan. John OMahoney was a Fenian in the year 1848 and the English were looking for him to hang him. When they were in Dungarvan my Great-Grandfather got a man named Lynch to bring John Mahoney to America. They took three days to got to Dungarvan. They in the ditches during the day and they travelled in the night.A man named Mandeville brought them to Ballinaraha first. They were living in the count(y) Waterford before.\n", "school_info": "School: Newtownanner, Cluain Meala", "metadata": [{"Location:": "Newtownanner Demesne, Co. Tipperary", "Teacher:": "\nProinnsias Ó Corcoráin\n"}, {"Collector": "Annie Lonergan", "Gender": "female", "Address": "Tikincor Lower, Co. Waterford"}, {"Informant": "Mrs Lonergan", "Relation": "parent", "Gender": "female", "Address": "Tikincor Lower, Co. Waterford"}, {"Language": "English"}]}, "4922254/4864499/5051739": {"title": "Mushrooms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0568, Page 170", "Page 170"], "url": "https://www.duchas.ie/en/cbes/4922254/4864499/5051739", "text": "\nMushrooms grow very plentiful in some parts of Ireland. Mushrooms grow on rich ground. It has a shape like a cap with a short stem. People make hair-oil from them others boil them in new-milk and eat them.Annie Lonergan,Kincor,Clonmel,My Mother Mrs Lonergan told me this story.\n\n\n\nThe ancestors lived in Ballinaraha for the last three hundred years. It was my great Grandfather that brought John Omahoney to Dungarvan. John OMahoney was a Fenian in the year 1848 and the English were looking for him to hang him. When they were in Dungarvan my Great-Grandfather got a man named Lynch to bring John Mahoney to America. They took three days to got to Dungarvan. They in the ditches during the day and they travelled in the night.A man named Mandeville brought them to Ballinaraha first. They were living in the count(y) Waterford before.\n", "school_info": "School: Newtownanner, Cluain Meala", "metadata": [{"Location:": "Newtownanner Demesne, Co. Tipperary", "Teacher:": "\nProinnsias Ó Corcoráin\n"}, {"Collector": "Mary F. Prendergast", "Gender": "female", "Address": "Ballynevin, Co. Tipperary"}, {"Informant": "Thomas Prendergast", "Relation": "parent", "Gender": "male", "Address": "Ballynevin, Co. Tipperary"}, {"Language": "English"}]}, "5085281/5041090/5085293": {"title": "Sweat Houses", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0972, Page 268", "Page 268"], "url": "https://www.duchas.ie/en/cbes/5085281/5041090/5085293", "text": "\n35.36. Sweat Houses. Not known here. The nearest one is at Derrylin in Co. Fermanagh.\n", "school_info": "School: Belturbet (B)", "metadata": [{"Location:": "Belturbet, Co. Cavan", "Teacher:": "\nS. Mc Govern\n"}, {"Language": "English"}]}, "5009022/4978197/5116017": {"title": "Severe Weather", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0719, Page 127", "Page 127"], "url": "https://www.duchas.ie/en/cbes/5009022/4978197/5116017", "text": "\nThe big storm occurred on the 6th Oct in the year 1891. The storm blew down 3,000 trees in the Phoenix Park Dublin and many more through the country. Telephone lines were all knocked down roads were blocked with falling trees. Stacks of oats and hay were blown away.\n", "school_info": "School: Tullistown", "metadata": [{"Location:": "Tullystown, Co. Westmeath", "Teacher:": "\nMrs. Sheridan\n"}, {"Collector": "Maureen O' Reilly", "Gender": "female", "Address": "Togher, Co. Westmeath"}, {"Informant": "James O' Reilly", "Relation": "grandparent", "Gender": "male", "Address": "Togher, Co. Westmeath"}, {"Language": "English"}]}, "4921591/4882454/5138731": {"title": "Historical Connection", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0287, Page 114", "Page 114"], "url": "https://www.duchas.ie/en/cbes/4921591/4882454/5138731", "text": "\nDunlough Bay has also a historical connection. In 1796 one of the ships of the Hoche Expedition,, which Wolfe Tone procured from the French Government was wrecked near Dunlough Bay, off the Mizen Head. There were 1100 men on board, but only five survived. They succeeded in reaching Barley Cove Strand; two miles east of Dunlough Bay in safety. This even is recorded in the following poem entitled the Mizen Head\n\n\n\nOne evening all for pleasure's sake I rambled o'er the hillsListening to the small birds singing,And the murmuring of the rills.The setting sun had filled the sky all in a rosy red.When I strayed for recreation out to the Mizen Head.The view that there had met my eyes Was a rare one to be seen.Her lofty cloud-capped mountainsWas bedecked in nature green.\n(continues on next page)\n", "school_info": "School: Cruachán, An Sciobairín", "metadata": [{"Location:": "Crookhaven, Co. Cork", "Teacher:": "\nSaidhbhín Ní Bhoidbléir\n"}, {"Language": "English"}]}, "4921591/4882491/5138786": {"title": "Historical Tradition", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0287, Page 151", "Page 151"], "url": "https://www.duchas.ie/en/cbes/4921591/4882491/5138786", "text": "\nHistorical TraditionThere is a coat on the north side of Crookhaven called coisin Franncac During the war of 1715 between France and England there was a French warship and an English warship fighting off Kinsale. The English warship was winning. The French warship ran before the English one and took shelter in Crookhaven harbour. There were many men dead on board. The captain landed on that coast and ordered the men to be buried in a field near it After that it was called Coisin Franncac.When Wolf Tone was sailing from France with aa troop ship of guns and soldiers in 1796 one of the ships was wrecked in a place called Dunlough Bay about eight miles from Crookhaven\n", "school_info": "School: Cruachán, An Sciobairín", "metadata": [{"Location:": "Crookhaven, Co. Cork", "Teacher:": "\nSaidhbhín Ní Bhoidbléir\n"}, {"Collector": "Jeremiah Mahony", "Gender": "male", "Address": "Crookhaven, Co. Cork"}, {"Informant": "Mr John Downing", "Gender": "male", "Age": "72", "Address": "Mallavoge, Co. Cork"}, {"Language": "English"}]}, "4921588/4882276/5146883": {"title": "Historical Traditions", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0286, Page 067", "Page 067"], "url": "https://www.duchas.ie/en/cbes/4921588/4882276/5146883", "text": "\nIn this district there stand the ruins of two of the many towers built by the English in 1796.  One of these is situated in the townland of Foiberg.  It is built on a high hillock overlooking Bantry Bay and Dunmanus Bay.  There is the form of a old wall and the pillars of gates around it.  In front of the ruin a huge stone marks a grave in which a soldier is buried.     At that time the soldiers were removed from one tower to another after the space of a few months.  The soldiers from this tower had to go to Bantry when the removal took place.  On one of these occasions the soldiers were marching to Bantry.  Near Ahakista they met a boy driving cattle.  They passed on but had gone only about one hundred yards when the boy   began to shout.  The soldiers instantly turned round and shot the youth.  T When the French fleet came into Bantry Bay and were dispersed by storms one of the ships the \"Patiente\" went down outside of Turreen which is at the western end of this point.     The Fianna are also connected with this district. The highest hill in this peninsula is Suide Fionn.  On this hill Fionn Mac Cumhall and his army are said to have camped.  Forts built by the natives of this locality at the time of the Danes tell us that this district is connected with the Danes.  These forts were erected by the people so as to safe-guard themselves from the onslaughts of the Invaders.                         Patrick Barry                             Letter, Kilcrohane                                   Bantry. Co. Cork\n", "school_info": "School: Ceann Caorach, Cill Crócháin", "metadata": [{"Location:": "Caher, Co. Cork", "Teacher:": "\nCaitlín Ní Riain\n"}, {"Collector": "Patrick Barry", "Gender": "male", "Address": "Letter East, Co. Cork"}, {"Language": "English"}]}, "4921917/4910846/5166044": {"title": "A Story of the Barryscourt Castle", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0395, Page 160", "Page 160"], "url": "https://www.duchas.ie/en/cbes/4921917/4910846/5166044", "text": "\n(continued from previous page)\nfound the skeleton of the Boy they knew then that the place would not be haunted anymore.\n\n\n\nMrs A. Tiernan Aged 80 Sean TiernanSituated at the Western end of the Curragh Camp in the County Kildare is an old rath called \"Gibbet Rath”. It received its name from a great massacre held there years ago.The English invited the people of the neighbouring places to go to a meeting which was being held at the rath in order to make terms of peace and to lay down their arms. All the Irish people suspecting no danger came there. When they were all inside the rath and had laid down their arms the English soldiers turned on them and killed most of them on the spot. The people who escaped turned towards the north but they were followed by their English opponents and at a valley about half a mile from the rath about three hundred more were killed, and that valley has been since called by the people of the locality “The Murdering Hollow”.At the time of the Anglo Irish war 1819 the name Gibbeth rath camp was painted over one of the camps which was kept for Internment but when the English officers heard of how the rath got its name the word “Gibbet” was painted over and it was called “Rath Camp”.\n", "school_info": "School: Scoil na mBráthar, Mainistir na Corann", "metadata": [{"Location:": "Midleton, Co. Cork", "Teacher:": "\nAn Br. Ó Hoistín\n"}, {"Collector": "Sean Tiernan", "Gender": "male"}, {"Informant": "Mrs A. Tiernan", "Gender": "female", "Age": "80"}, {"Language": "English"}]}, "4921917/4910847/5166046": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0395, Page 161", "Page 161"], "url": "https://www.duchas.ie/en/cbes/4921917/4910847/5166046", "text": "\nTold by Mrs Wilkison Aged 63 years John AhernRoughly speaking it is about 71 years since the night of the rising 1867. A Fenian by the name of Daly who lived in St. Mary’s rd. Midleton was shot in Castlemartyr soon after the rising. William O Brien of Mallow was head of the land league. There was a new bridge built on the new road near Middleton and they brought Mr. Dillon to (christed) cristen it. He broke a bottle of whiskey on the bridge and then they called it Dillons bridge. They marched to the fair green wearing green sashes and there they raised their flags.William O Brien was escorted by the Military and in Midleton Court House his trial was held. He was sentenced to 6 months hard labour. And this finished the land league in Midleton.\n", "school_info": "School: Scoil na mBráthar, Mainistir na Corann", "metadata": [{"Location:": "Midleton, Co. Cork", "Teacher:": "\nAn Br. Ó Hoistín\n"}, {"Collector": "John Ahern", "Gender": "male"}, {"Informant": "Mrs Wilkison", "Gender": "female", "Age": "63"}, {"Language": "English"}]}, "4921918/4910857/5166055": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0395, Page 205", "Page 205"], "url": "https://www.duchas.ie/en/cbes/4921918/4910857/5166055", "text": "\n(continued from previous page)\nof a Crucifix to be seen still. This wall is overgrown with ivy. There is a cellar in the old wing of Ballinacurra House, and even in daylight, one has to bring a light in to see anything. It is said that the monks of old kept wine and valuables here. There is a passage leading from the house to one of the fields, probably an escape in time of danger.Above information supplied by Madge Connor who got it from her sister, & by Kathleen Lear, who got it from her father Mr H. O'Sullivan, Ballinacurra, Midleton.\n\n\n\nThe following information was supplied by Eileen O'Keeffe, the Mill Road Midleton, who got it from her Aunt. The Aunt was told the tale by her mother: - In the Famine years, there was situated at the top of the Mill Road, a row of sheds. Into these sheds, all the poor people of the town were put. It is told that a priest used come + feed them. & that the people were dying of starvation. As the same time a ship full of Indian meal was sent to the starving Irish, but, the English sunk it outside Cove Harbour. Most of the unfortunate people died.\n(continues on next page)\n", "school_info": "School: Clochar na Toirbhirte, Mainistir na Corann", "metadata": [{"Location:": "Midleton, Co. Cork", "Teacher:": "\nAn tSr. Seosamh\n"}, {"Collector": "Kitty Mc Carthy", "Gender": "female", "Address": "Ballinacurra, Co. Cork"}, {"Informant": "Eileen O' Keeffe", "Gender": "female", "Address": "Midleton, Co. Cork"}, {"Informant": "Jer Looney", "Gender": "male", "Address": "Ballinacurra, Co. Cork"}, {"Language": "English"}]}, "5235093/5234997/5235371": {"title": "Famine Times", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1128, Page 092", "Page 092"], "url": "https://www.duchas.ie/en/cbes/5235093/5234997/5235371", "text": "\nThe old people still tell stories of the great famine days of eighteen forty six and seven when the poor people died of starvation by the roadside.The poor country. People at the time of the famine had not any food, but potatoes and milk. Their bread was made from grated potatoes and was called \"stampy\". The tea they always used was peppermint tea.Peppermint tea was made from the peppermint plant try pulling and seasoning it. It was then boiled in the kettle and strained, and the liquid drank. Adjoining every house long ago was a very small field, in which grew the peppermint. In the corner of the garden at home there is some peppermint still growing there. Sometimes if it was plentiful, milk was put into the tea.During the famine even the black potatoes were grated. For years \"stampy\" was the chief meal of the ordinary people and also oatmeal grown. The cause of the famine was the disease and failure of the potato crop. The blight\n(continues on next page)\n", "school_info": "School: Gleann", "metadata": [{"Location:": "Glan, Co. Cork", "Teacher:": "\nname not given\n"}, {"Language": "English"}]}}