{"4427841/4349443/4440542": {"title": "Old Trades - Basket-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0096, Page 731", "Page 731"], "url": "https://www.duchas.ie/en/cbes/4427841/4349443/4440542", "text": "\n(continued from previous page)\n-ets for all the people in the village.  The way the people used to pay him for the baskets was by giving him a big bundle of rods.He used to make baskets also for Michael Noone Milltown.  Then Michael would sell the baskets to the people.  John bunningham sold them at one shill and three pence to Michael Noone.  He would bring him back about six or eight baskets every Friday night.  He is dead with the past twenty four years.  May the lord have mercy on his soul.  There is no one living as well able to make baskets as he was.Writen by Thomas Rattingan. Larrownwrlawr.Material from Thomas Rattingan. LarrownwrlawrAged 56 years\n\n\n\nNail making was a great trade long ago.  I was done in many places.  There was a nail maker living in Ballindine about thirty years ago.  He had a small house for himself for working in.  His name was Myles Walsh.\n(continues on next page)\n", "school_info": "School: Baile an Daingin (B)", "metadata": [{"Location:": "Ballindine, Co. Mayo", "Teacher:": "\nSéamus P. Ó Gríobhtha\n"}, {"Collector": "Patrick Kelly", "Gender": "male", "Address": "Lisduff, Co. Mayo"}, {"Informant": "Nora Mc Hugh", "Gender": "female", "Age": "48", "Address": "Carrowmore, Co. Mayo"}, {"Language": "English"}]}, "4428104/4378225/4444670": {"title": "Nail-Makers", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0638, Page 216", "Page 216"], "url": "https://www.duchas.ie/en/cbes/4428104/4378225/4444670", "text": "\nThere were many nailers in West Street, Tallow, about sixty years ago.  Mr. J Driscoll was the principal nailmaker.  He made these nails up to the year 1877.  These were made with a hammer, steel and sometimes wire.  They were good nails and some of them are still to be seen.  About the year 1800 these ceased to exist.\n", "school_info": "School: Tulach an Iarainn", "metadata": [{"Location:": "Tallow, Co. Waterford", "Teacher:": "\nEibhlín Ní Dhubhshláinge\n"}, {"Collector": "Patricia Beecher", "Gender": "female", "Address": "Tallow, Co. Waterford"}, {"Informant": "Mr J. M. Beecher", "Relation": "unknown", "Gender": "male", "Age": "50", "Address": "Tallow, Co. Waterford"}, {"Language": "English"}]}, "4428104/4378226/4444675": {"title": "Nail-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0638, Page 217", "Page 217"], "url": "https://www.duchas.ie/en/cbes/4428104/4378226/4444675", "text": "\nNail-making was carried on in Tallow up to about fifty years ago. The advent of machinery made it uneconomic to make nails by hand.The nailer worked in a shop very much like a blacksmith's forge. He had an anvil and bellows but hose were much smaller than those used by the blacksmith.He was a nimble and active worker and it was quite a treat to see him turn out the nails. he usually kept from six to ten pieces of iron in the fire at one time and if he were not quick, some of them might get burned. The iron he worked was called 'rod-iron' and was about a quarter inch in section and cut into lengths of from three to six feet. Heavy sledging was not necessary but swiftness and accuracy with his light hammer was essential if his work was to be profitable. He made nails of all sizes from a tiny brad to a spike eight or nine inches long. He made them with heads and without them and it was\n(continues on next page)\n", "school_info": "School: Tulach an Iarainn", "metadata": [{"Location:": "Tallow, Co. Waterford", "Teacher:": "\nEibhlín Ní Dhubhshláinge\n"}, {"Collector": "Brigid Conway", "Gender": "female", "Address": "Tallow, Co. Waterford"}, {"Informant": "Mr M. Conway", "Relation": "unknown", "Gender": "male", "Age": "60", "Address": "Tallow, Co. Waterford"}, {"Language": "English"}]}, "4427891/4354879/4446495": {"title": "Coopering", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0108, Page 294", "Page 294"], "url": "https://www.duchas.ie/en/cbes/4427891/4354879/4446495", "text": "\nBryne of Eden was the best Cooper in Knock.  He made churns.  They were made out of oak.  The churn cost from 7 to 12 shillings.  He also made tubs and keelers.  Keelers were for skimming milk.\n\n\n\nThe nearest nail maker to here was in Kiltimagh.  He had a little forge.  He got special thin iron.  He was very quick making them.  He had a sharp little\n(continues on next page)\n", "school_info": "School: An Cnoc (B.)", "metadata": [{"Location:": "Knock, Co. Mayo", "Teacher:": "\nTomás Ó Riain\n"}, {"Collector": "Eamon Curry", "Gender": "male"}, {"Informant": "Joseph Curry", "Gender": "male", "Age": "53", "Address": "Lecarrow, Co. Mayo"}, {"Language": "English"}]}, "4427877/4353327/4449289": {"title": "Shirts", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0105, Page 247", "Page 247"], "url": "https://www.duchas.ie/en/cbes/4427877/4353327/4449289", "text": "\n(continued from previous page)\nThe shirts in these days lasted seven to ten years.\n\n\n\nAll hats worn by men were tall-hats. A man left his measure with Michael Heron Ballinrobe. He lived in the corner house where Mr. Bernard Joyce. Co. C., lives now. The hats were manufactured and made in Manulla near Balla Co. Mayo.\n\n\n\nMasons.There was a mason in every village.\n\n\n\nThere were two carpenters in Roundfort: Michael Costello and Myles Deasy. They used to make wooden plows and have them on show for sale every Sunday\n\n\n\nNails were made in Hollymount by a nailor, named Thomas Dwane He lived where Thomas Connor is living now. He made nails from the backs of old scythes. He used to wear a paper cap when working. The shoe-maker in Ballinrobe, Brian Hynes, used to call for the nails used in men's shoes. They were very heavy nails.\n\n\n\nMartin and Paddy Hill, were brothers\n(continues on next page)\n", "school_info": "School: Scoil N. Comáin, Hollymount", "metadata": [{"Location:": "Hollymount Demesne, Co. Mayo", "Teacher:": "\nDonncha Ó Riain\n"}, {"Collector": "Donnchadh Ó Riain", "Gender": "male", "Occupation": "múinteoir", "Address": "Rahard, Co. Mayo"}, {"Informant": "John Merrick", "Gender": "male", "Age": "85", "Occupation": "farmer", "Address": "Hollymount Demesne, Co. Mayo"}, {"Language": "English"}]}, "4428272/4390511/4454408": {"title": "Nail-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1032, Page 220", "Page 220"], "url": "https://www.duchas.ie/en/cbes/4428272/4390511/4454408", "text": "\nTomas Cullins was a nail maker. He had a forge in cow market lane Ballintra. He gathered all the old scythes and took the backs of them and put them into the fire to heat and when they were heated he beat them out on the anvil. Nails were made in this way.\n\n\n\nThe scutching of flax was carried on in three mills in the Ballintra district. Two of these ceased work fifty or fifty – five years ago and the last mill, at Moneymore, some fifteen or sixteen years ago. One of the first was at Augha – dullagh and a great many hands were employed including women.First the ground was ploughed and flax seed sown. Then it was harrowed with a harrow drawn by one or two horses, and rolled with a stone roller. Then it was left for a few months until it had grown up. When the time came to pull it a number of men and women were collected to pull it. It was placed in a large dam called a “lint steep.” It was covered with stones and sods to keep it under water. It was then left for a few weeks. When taken out of the water, it was spread on a field to dry and bleach. When dry it was tied up in sheaves. After some time it was built in stacks and during the winter was\n(continues on next page)\n", "school_info": "School: Baile Mac Rabhartaigh", "metadata": [{"Location:": "Ballymagrorty, Co. Donegal", "Teacher:": "\nMícheál Ó Fiannaidhe\n"}, {"Informant": "Patrick Mc Guiney", "Gender": "male", "Age": "79", "Address": "Ballynacarrick, Co. Donegal"}, {"Language": "English"}]}, "4466564/4361717/4466660": {"title": "Déanamh Cliabh", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0125, Page 282", "Page 282"], "url": "https://www.duchas.ie/en/cbes/4466564/4361717/4466660", "text": "\n(continued from previous page)\nwith a string so that they wont leave their places.   Then they put two rods the width of their four fingers betwee them on both side of the creel and the same on the two ends.   Then they have to put rods between them to weave in and out between them to make the creel.Mo mhathar [?] d' Nóra Ní Gallchobhair a d'inns seo dom é rugadh agus togadh i Curley in aici Attymchugh i bparóiste Déal  EasaDéanam Tairngí\n\n\n\nIn Callow there lived\n(continues on next page)\n", "school_info": "School: Naomh Eoin, Béal Easa", "metadata": [{"Location:": "Foxford, Co. Mayo", "Teacher:": "\nOidí sa Chlochar\n"}, {"Collector": "Consí Nic Aodha", "Gender": "female", "Address": "Foxford, Co. Mayo"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "female", "Address": "Rinbrack, Co. Mayo"}, {"Language": "English"}]}, "4466564/4361718/4466661": {"title": "Déanamh Tairní", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0125, Page 283", "Page 283"], "url": "https://www.duchas.ie/en/cbes/4466564/4361718/4466661", "text": "\n(continued from previous page)\nan old man whose name was Mr. McKenna and they called him the old nailer. He used to make pigrings out of steel. He used to make nails of iron by putting them into the fire and hammering them. Then he would go round the country selling them.\n\n\n\nJames Brodrick who lived in Foxford used to make nails. He used to buy rod - iron. He had a bench and a bellows attached to it. Any one who wanted a strong nail or a\n(continues on next page)\n", "school_info": "School: Naomh Eoin, Béal Easa", "metadata": [{"Location:": "Foxford, Co. Mayo", "Teacher:": "\nOidí sa Chlochar\n"}, {"Collector": "Eilis Ní Thighearnán", "Gender": "female", "Address": "Foxford, Co. Mayo"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "male", "Address": "Foxford, Co. Mayo"}, {"Language": "English"}]}, "4428041/4371594/4474491": {"title": "Forges", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0144, Page 411", "Page 411"], "url": "https://www.duchas.ie/en/cbes/4428041/4371594/4474491", "text": "\n(continued from previous page)\nThe forge that was in Ball-na-leck was owned by John Scalnan. He used to shoe horses, weld tyers, make fancy gates, ploughs, scuffles, fire tongs, crooks, Iron railings, cranes, shoe wheels, and turn the blades of scythes.\n\n\n\nLong ago there used not be as much nails coming from the shops, as there is now. The blacksmiths used to make the most of the nails. There were three blacksmiths in our district, that could make nails. Their names were Michael Collins, Forge Village, James Collins, Foghill, Mikey Collins,\n(continues on next page)\n", "school_info": "School: Teampall Mhuire", "metadata": [{"Location:": "Carbad Beg, Co. Mayo", "Teacher:": "\nEithne, Bean Uí Mhaonghaille\n"}, {"Collector": "Kathleen Mc Hale", "Gender": "female", "Address": "Tooreen, Co. Mayo"}, {"Informant": "Thomas Collins", "Relation": "not a relative", "Gender": "male", "Address": "Carrowmore, Co. Mayo"}, {"Language": "English"}]}, "4428028/4369759/4476365": {"title": "Old Trades and Customs - Rush Candles", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0140, Page 515", "Page 515"], "url": "https://www.duchas.ie/en/cbes/4428028/4369759/4476365", "text": "\nIn olden times, people made candles out of rushes. First they got a rush and peeled all the green of it, except a little. Then they put the rush in grease or butter. Then they left the rush in the grease for a while, and when it was fit for lighting the people took the candle out of the grease.\n\n\n\nIn days gone by, the Blacksmith made all kinds of nails. First of all he made a fire and put a large piece of iron in it. When the iron was red, the blacksmith took\n(continues on next page)\n", "school_info": "School: Cillín", "metadata": [{"Location:": "Killeen, Co. Mayo", "Teacher:": "\nPádraic Ó Hubáin\n"}, {"Collector": "Children of Killeen National School "}, {"Informant": "James Mc Hale", "Gender": "male", "Address": "Muingrevagh, Co. Mayo"}, {"Language": "English"}]}, "4427808/4346018/4505994": {"title": "Old Trades - Coopers", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0089, Page 503", "Page 503"], "url": "https://www.duchas.ie/en/cbes/4427808/4346018/4505994", "text": "\n(continued from previous page)\ngone by they used to make ordinary dash churns like we have now-a-days. There were several coopers in Castlebar, and they all used to make tubs and churns and barrells but Cooper O'Conner was the most important of them.\n\n\n\nAbout 10 or 15 years ago there lived a family of McGraels in New-Antrim Street, Castlebar who used to make nails, the nails that times were made out of iron the same as now-a-days.\n\n\n\nA good many long years ago in the time of my Grandfather, there used to be no fishing only teeming\n(continues on next page)\n", "school_info": "School: N. Peadair, Caisleán an Bharraigh", "metadata": [{"Location:": "Carrowbrinoge, Co. Mayo", "Teacher:": "\nSéamus Ó Coigligh\n"}, {"Collector": "Michael Moran", "Gender": "male", "Address": "Carrowbrinoge, Co. Mayo"}, {"Informant": "Miss Annie Moran", "Gender": "female", "Address": "Carrowbrinoge, Co. Mayo"}, {"Language": "English"}]}, "4427831/4348334/4511557": {"title": "The Nailers", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0094, Page 460", "Page 460"], "url": "https://www.duchas.ie/en/cbes/4427831/4348334/4511557", "text": "\nThe NailersWithin view of the school for, on the south side is a fine shop built about 25 years ago. Having business in this shop a short time ago, I heard the owner remarking that certain goods were in the \"nailers\" and becoming interested I sought information. The following was narratid by Michael Moaran at present residing at Roslahaw about a mile away from \"The Nailers\"Do you see that small housen just at the fable of the big shop? me father told me about two strappen fellows who lived and worked there in his time. Well they med nails of the whole place and Castlebar as well. They had wire about as round as a kitten pin, but stronger and wit a soart of a mowld. They put one end of the wire in the fire, till it was red, then stuck it into the mowld and when it come out, it had a point on it. The wire was cut now and put into another little\n(continues on next page)\n", "school_info": "School: Belcarra (C.)", "metadata": [{"Location:": "Ballycarra, Co. Mayo", "Teacher:": "\nMary T. Moran\n"}, {"Collector": "Annie Kate Conway", "Gender": "female"}, {"Informant": "Michael Moran", "Gender": "female", "Age": "87", "Address": "Roslahan Upper, Co. Mayo"}, {"Language": "English"}]}, "4493761/4417710/4531276": {"title": "Old Crafts - Rope-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1112, Page 339", "Page 339"], "url": "https://www.duchas.ie/en/cbes/4493761/4417710/4531276", "text": "\n(continued from previous page)\nstill. But the ropes for their houses were made from thin \"spiles\" of bog fir twisted together and also from horse-hair twisted with a home made twister.Given by Wm. Mc. Laughlin, (age 84) Carva, Linsfort, Buncranna, Donegal.\n\n\n\nCreels and potato-baskets are still made here from fine sally-rods boiled in a large pot, skinned and woven together. Dan McAliney, Hillside and James Bradley, Glebe, Desertegney make baskets for anyone that gives them an order.\n\n\n\nPaddy Doherty, who lived in Milltown over 60 years ago made spades, graips and implements for the farmers.\n\n\n\nThe black-smiths in Desertgney, who were Willy Smith from Nailer's Row, Neil McLaughlin from Glebe, John O'Donnell from Park Avenue and George Doherty from Keelogs, made their own nails\n(continues on next page)\n", "school_info": "School: St Egney's (C.), Buncrana", "metadata": [{"Location:": "Buncrana, Co. Donegal", "Teacher:": "\nEllen Daly\n"}, {"Informant": "Neil Mc Laughlin", "Gender": "male", "Age": "68", "Address": "Glebe, Co. Donegal"}, {"Language": "English"}]}, "4602701/4596744/4630137": {"title": "Folklore - Old Crafts - Nail-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0081, Page 018", "Page 018"], "url": "https://www.duchas.ie/en/cbes/4602701/4596744/4630137", "text": "\nThere was a nail maker in Mount-Bellew called Tom Fury. He made his living by making nails as he was a nail-maker by trade. He had a small anvil, a bellows, a hammer and a coal fire on the hearth. He used rod iron for making the nails. He worked two pieces of this iron at the same time. While he was working with one piece the other piece was heating. Therefore he lost no time. There iis an old saying which is repeated to busy people \"You are as busy as a nailer\". Tom Fury had a nail cutter and when the iron was red he got the cutter and cut a piece off. Then he pointed the nail and cut it to the required length. He had a box under the cutter and the nails dropped into it. The nails were sold by the pound and the bigger the nail was the dearer the\n(continues on next page)\n", "school_info": "School: Maigh Locha (Buachaillí)", "metadata": [{"Location:": "Moylough, Co. Galway", "Teacher:": "\nMuiris Ó Héigeartaigh\n"}, {"Collector": "T. O' Connor"}, {"Informant": "Michale Scarry", "Gender": "female", "Age": "78", "Address": "Moylough, Co. Galway"}, {"Language": "English"}]}, "4605937/4603890/4644043": {"title": "Local Crafts - Nail-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0204, Page 181", "Page 181"], "url": "https://www.duchas.ie/en/cbes/4605937/4603890/4644043", "text": "\nIn the village of Drumkeerin, Co. Leitrim, about forty five (45) years ago shoe-nails were made by two brothers - natives of the village. Petie McHugh and Pat. Petie died about ten years ago (1928) and was always known as Petie the Nailer. His daughter Maggie carries on a grocery business in the home place presently. This is how shoe nails were made.An iron nail rod was bought (it being just as thick as the stem of the nail. The rod was reddened in a culm fire (like the forge fire). One end was hammered into a sharp point on a small anvil. A nail length was then cut off by a cutter. This was placed in a nail mould. A few strokes of the hammer flattened a top on the nail. This completed the making. It was put into a porringer capable of holding 1 1/2 pints of water) to fill a porringer was supposed to be a good day's work and it brought the nailer 2/6 wages. The only nails made were ones for heavy boots.\n", "school_info": "School: Shivdillagh", "metadata": [{"Location:": "Shivdelagh, Co. Leitrim", "Teacher:": "\nThomas Byrne\n"}, {"Collector": "Thomas Byrne", "Gender": "male", "Address": "Liscuillew Lower, Co. Leitrim"}, {"Informant": "John Cullen", "Gender": "male", "Address": "Moneenatieve, Co. Leitrim"}, {"Language": "English"}]}, "4605940/4604231/4644102": {"title": "Old Crafts", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0205, Page 128", "Page 128"], "url": "https://www.duchas.ie/en/cbes/4605940/4604231/4644102", "text": "\n(continued from previous page)\na they often were used to show light on the kitchen. They are not used now in my district.\n\n\n\nNail-making is not carried on now.  About twenty-five years ago there were two nail-makers in this district.  Their names were Peter McHugh and his brother John.  They made the nails from iron.  They had a small anvil.  They made a lot of nails.  Boot-makers bought the nails and shop-keepers also bought the nails.\n", "school_info": "School: Gortnasilla", "metadata": [{"Location:": "Gortnasillagh East, Co. Leitrim", "Teacher:": "\nThomas Mc Loughlin\n"}, {"Collector": "Kevin O Donnell", "Gender": "male", "Address": "Lugmeeltan, Co. Leitrim"}, {"Informant": "John Slevin", "Gender": "male", "Age": "70", "Address": "Lugmeeltan, Co. Leitrim"}, {"Language": "English"}]}, "4613711/4611216/4644263": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0405, Page 034", "Page 034"], "url": "https://www.duchas.ie/en/cbes/4613711/4611216/4644263", "text": "\n(continued from previous page)\nEvery cloud has a silver lining. Keep your face to the sunshine and the shadow will fall behind. The longest way round is the shortest way home. Too much kindness kills the cat.\n\n\n\nMichael Shine in Direen used make nails, he is dead about thirty years. Patrick Finucane in Tarbert used make ploughs and he is dead about fifty years. My grandfather used make cleeves for carrying potatoes and skees to strain\n(continues on next page)\n", "school_info": "School: Cill Beathach", "metadata": [{"Location:": "Kilbaha Middle, Co. Kerry", "Teacher:": "\nTomás Ó Ceallacháin\n"}, {"Collector": "Bridget Kennelly", "Gender": "female", "Address": "Kilbaha Middle, Co. Kerry"}, {"Informant": "Timothy Kennelly", "Relation": "parent", "Gender": "male", "Address": "Kilbaha Middle, Co. Kerry"}, {"Language": "English"}]}, "4605956/4605690/4644434": {"title": "Crafts - Nail-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0208, Page 283", "Page 283"], "url": "https://www.duchas.ie/en/cbes/4605956/4605690/4644434", "text": "\nMy father told me of a nailer named Bill Mc Grath who lived in M wihaun about 40 years ago. My grandfather often sent to him for boot nails. He used to give six score to the set, one score of these were made specifically for toes of boots, the outer end was made wider than the other. Each set cost 8 pence. The nailer heated the rod iron, made the thong first then placed it in a shape and beat on the head. He had his own heating apparatus, bellows and anvil and an also a cutter for the iron.\n", "school_info": "School: Drumkeelanmore", "metadata": [{"Location:": "Drumkeelan More, Co. Leitrim", "Teacher:": "\nMary Mc Rann\n"}, {"Collector": "Mary Ellen Whelan", "Address": "Drumgorman, Co. Leitrim"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "male", "Address": "Drumgorman, Co. Leitrim"}, {"Language": "English"}]}, "4613718/4612196/4644909": {"title": "Local Crafts - Nail-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0406, Page 454", "Page 454"], "url": "https://www.duchas.ie/en/cbes/4613718/4612196/4644909", "text": "\nAnother craft was nail-making by hand. Tom Fetten in Abbeyfeale used to make all kinds of nails, and the nail maker in Listowel was Morris. A small forge, a bellows, a hammer and an anvil were necessary. It was very hard work. The rod iron had to be heated in the fire and while he was making one nail, the other was heating, so the work had to be done very quickly to keep both going.\n", "school_info": "School: Islandanny", "metadata": [{"Location:": "Rea, Co. Kerry", "Teacher:": "\nMáire, Bean Uí Chatháin\n"}, {"Collector": "U. O Connor", "Age": "12"}, {"Informant": "J. O Connor", "Address": "Rathoran, Co. Kerry"}, {"Language": "English"}]}, "4605938/4604101/4649991": {"title": "Old Roads", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0204, Page 391", "Page 391"], "url": "https://www.duchas.ie/en/cbes/4605938/4604101/4649991", "text": "\nLong ago the road which goes from Tullinarogue to Cloonmone was only a small path.  In the Famine days it was opened up by the Government as relief works for the people of this district.  At John Pattersons of Corry there was a boiler where every one got a little Indian porridge daily.  This helped to keep the people of this district alive.  All roads at this time were straight.  The road which goes out on the new road in Kilmore would go out on the new road at Cloonmore only the the Government could not afford to give enough money to cut the hill.  This road is 220yds long.\n\n\n\nThe nailers long ago made all sorts of nails.  They first got a long rod of iron and put the rod into the fire.  When the iron was red hot they cut off the nails and put a head on each.  Then they dropped it into a vessel of water.  Their anvils were small but much like a blacksmith's anivil.  Their bellows were also much smaller than an blacksmith's bellow.  The best nailer in this district was Peter McHugh, Drumkeerin.  He could make a nail in a minute.  James Clarkin, Lonagh was another good nailer.\n", "school_info": "School: Kilmore", "metadata": [{"Location:": "Kilmore, Co. Leitrim", "Teacher:": "\nEilís, Bean Uí Cheallaigh\n"}, {"Collector": "Tessie Mc Loughlin", "Gender": "female", "Address": "Killadiskert, Co. Leitrim"}, {"Informant": "Francis Mc Loughlin", "Gender": "male", "Address": "Killadiskert, Co. Leitrim"}, {"Language": "English"}]}, "4605946/4604780/4651666": {"title": "Old Crafts - Thatching", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0206, Page 278", "Page 278"], "url": "https://www.duchas.ie/en/cbes/4605946/4604780/4651666", "text": "\n(continued from previous page)\nat the top of the house.  Then he puts a \"rigging\" on the top of the house. He puts more straw on teh rigging. Then he puts \"scolbs\"  in the rigging.  He goes down off the house and he changes the ladder and puts up another stroke.(Anthony Cornyn from his father, Peter Cornyn of Tullynaha, parish of Ballinaglera.)\n\n\n\nAt one time they used to smelt iron which was brought from Sliabh an Iarainn to the townland of Druminalass. They used to have charcoal (that is, burned wood) for smelting the iron.  They used to carry the iron on horses to the lake shore (Lough Allen). It was conveyed in flat-bottomed boats to the foundry on the other side of the lake to make articles of iron.(Michael Flynn from his father, Michael Flynn of Carntulla).\n\n\n\nRope-making:Two people are required to make a rope. One of them gets a “twister” and the other gets some “spratty” hay. A few grains of hay are twisted round the end of the twister and one begins to twist while the other keeps “spinning” the hay and they continue in this way until the rope is made.(Brighid Mc Partlan from her father, John Mc Partlan of Aughrim).\n\n\n\nThe people used to make nails long ago. They used to have a little bellows and an anvil.  They used to get a piece of iron called a nail-rod.  They used to make a fire and they used to put the nail-rod into it. Then they used to blow the bellows\n(continues on next page)\n", "school_info": "School: Sliabh na Cille", "metadata": [{"Location:": "Slievenakilla, Co. Leitrim", "Teacher:": "\nPeadar Mac Fhlannchadha\n"}, {"Collector": "Margaret Mc Gourty", "Gender": "female", "Address": "Slievenakilla, Co. Leitrim"}, {"Collector": "Cáit Mc Grail", "Gender": "female", "Address": "Slievenakilla, Co. Leitrim"}, {"Informant": "James Mc Gourty", "Relation": "grandparent", "Gender": "male", "Address": "Slievenakilla, Co. Leitrim"}, {"Informant": "Francis Mc Grail", "Relation": "parent", "Gender": "male", "Address": "Slievenakilla, Co. Leitrim"}, {"Language": "English"}]}, "4649707/4649110/4652224": {"title": "Nail-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0215, Page 142", "Page 142"], "url": "https://www.duchas.ie/en/cbes/4649707/4649110/4652224", "text": "\nAbout thirty years ago there lived in Cloone an old nailer. This man made nails all his life. He supplied every carpenter round that side of the country. This man used to live in a very small house. It was about the size of a hen house. Nearly everyone called to him for nails because he was supposed to sell cheaper and if a neighbour came in, he would not charge him. How this man made these nails was, first he got a rod of iron and he would cut a nail's length from it. Then he had a little machine with a hole in it. He would hammer the piece of iron into it so that the nail wold be formed. Then the nail would be as tight as if it were welded into it. Then he would loosen a nut and the nail would fall out made and all. This man's was name was Pat McGrale and he had a son named James. Pat died about 1870. James started this game too, but he did not follow it up. This kind of nails was made before the new make of nails was available.\n\n\n\nA good few years ago, before any threshing mills were in the country a lot of people made flales for the purpose of threshing their corn. I have heard specially of a man who used to make flales for sail.\n(continues on next page)\n", "school_info": "School: Mohill (2)", "metadata": [{"Location:": "Mohill, Co. Leitrim", "Teacher:": "\nÉamonn Bairéad\n"}, {"Collector": "John H. Mee", "Gender": "male", "Address": "Drumboher, Co. Leitrim"}, {"Informant": "James Mee", "Gender": "male", "Age": "56", "Address": "Drumboher, Co. Leitrim"}, {"Language": "English"}]}, "4658463/4658090/4661048": {"title": "The Famine", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0229, Page 132", "Page 132"], "url": "https://www.duchas.ie/en/cbes/4658463/4658090/4661048", "text": "\n(continued from previous page)\nwe shall inevitably find that they have been written by town dwellers, by those who escaped early from the rigours of farm life or by those who spend a few days lazing in sentimental somnolence during the lovely days of summer.But the flight of trades.\n\n\n\nThe nailer - factory production, the quog and Blakely's Protector finished him 30 years ago. His work was often the side line of the local blacksmith. He sold in quantities in dozens and in two sizes. His nails were good. I remember as a boy often visiting the nailers at work behind Ben Goss's in the town of Cootehill.The phrase as \"lucky as a nailer\" always recalls those six little men working like frenzy at six open windows. Six fires, six little anvils and it took six strokes to make a nail!!They are gone long ago and even the little law house where they worked has long since disappeared.Their trade was picturesque but hard. Each stroke was punctuated with a nod and a grunt.\n", "school_info": "School: Druim Míleadh", "metadata": [{"Location:": "Drumeela, Co. Leitrim", "Teacher:": "\nAilbeard Mac an Ríogh\n"}, {"Collector": "Albert King", "Gender": "male"}, {"Language": "English"}]}, "4658464/4658156/4661339": {"title": "Soap-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0229, Page 197", "Page 197"], "url": "https://www.duchas.ie/en/cbes/4658464/4658156/4661339", "text": "\nIn this district still, soap is made.  When pigs etc are killed the the intestines, as waste guts, stomach etc. are kept boiled cooled & fat taken off the top of the liquid.  Then fat later on dissolved and mixed with melted caustic soda.  Proportion 6 1/2 lbs of fat to 1 lb of caustic soda dissolved in three pints of cold water.  Both fat & caustic soda should be mixed when luke warm.  Poured into a vessel -- as a trough -- allowed to cool & cut in squares.\n\n\n\nMany local nailors still exist in this district -- Some 10 or 12 years ago they earned their living by making nails.  Now they are not required as few people get home made boots from local shoe-makers.  I remember being sent for nails & to watch the operation.  The nailor put the rod of iron in a hole on something like an anvil beat a head on it pulled it out again & cut off the nail, required length.  We called them Mick & John the Nailor.  I never knew any sir name for them & the cross-roads they lived at is still known  as the Nailor's Cross-roads.\n(continues on next page)\n", "school_info": "School: Gortermone", "metadata": [{"Location:": "Gortermone, Co. Leitrim", "Teacher:": "\nMrs A. O' Reilly\n"}, {"Collector": "Annie O Reilly", "Gender": "female"}, {"Language": "English"}]}, "4658448/4656861/4662123": {"title": "Nail-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0225, Page 324", "Page 324"], "url": "https://www.duchas.ie/en/cbes/4658448/4656861/4662123", "text": "\nThere were six nailers in the Parish long ago. I will give you their names and places where they worked.Peter McTague and John McTague were two brothers one of whom had his won workshop where McAvinue's electric house is now. John had his where McGlynn, the saddler, has his shop. Later John built his own house in Church St. Mrs Farrell now lives in it. John had his workshop in his own yard there.His son Patrick now in New York, remodelled the house in 1933.Frank Flynn worked where James Flynn had the draper's shop in St. Bridget Street. He had always an assistant.Conor Grant worked in the Pound Lane as you go over to Turbitts.Bartley Gordon worked where James McCafferty is living in Cannabo.later when Bartley got poor he worked with John McTague in Church Street.\n(continues on next page)\n", "school_info": "School: Béal an Átha Móir (B.)", "metadata": [{"Location:": "Ballinamore, Co. Leitrim", "Teacher:": "\nSeán Ó Heslin\n"}, {"Collector": "Barney Mc Partlan", "Gender": "male"}, {"Informant": "Cormac Mc Partlan", "Gender": "male", "Age": "62", "Address": "Ballinamore, Co. Leitrim"}, {"Language": "English"}]}, "4605948/4605068/4666614": {"title": "Old Crafts - Dyeing", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0206, Page 665", "Page 665"], "url": "https://www.duchas.ie/en/cbes/4605948/4605068/4666614", "text": "\nGet the tops of briars and boil them logwood and coppress in water. Strain off the liquid. This liquid dyes woollen goods black.\n\n\n\nNails.The present postman's Grandfather manufactured nails. He had a forge fully equipped for the purpose. He always put seven irons in the fire and when each iron rod became hot he cut it into nails quickly. The forge was attached to the dwelling.\n\n\n\nA hackler was a man who prepared flax for spinning. When the flax was taken out of the dam he spread it on the ground to dry. After it was dried it was scutched. The scutcher used a scutching stool and a scutching handle. The stool was three feet high and\n(continues on next page)\n", "school_info": "School: Hollymount", "metadata": [{"Location:": "Cleighran Beg, Co. Leitrim", "Teacher:": "\nPhilip Carrigan\n"}, {"Informant": "James M. Mc Grael", "Gender": "male", "Address": "Cornaguillagh, Co. Leitrim"}, {"Language": "English"}]}, "4672103/4670488/4672694": {"title": "Old Crafts - A Brewery", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0168, Page 116", "Page 116"], "url": "https://www.duchas.ie/en/cbes/4672103/4670488/4672694", "text": "\n(continued from previous page)\nBallymeeney Dromore West Co. Sligo. The house in which it was is now owned by Davenport. The owner of the brewery was either Stenson Ormsby or Raig. Beer was made in this brewery.\n\n\n\nPaddy Kelly, grandfather to Anne McGee Dromore West lived about 50 years ago in the house where she now resides. He was a famous smith. He used to make everything in the line of iron gates, cranes, spades. He came from Mayo.\n\n\n\nThere lived in Easkey Co. Sligo a\n(continues on next page)\n", "school_info": "School: Gort na Mara (Seafield)", "metadata": [{"Location:": "Donaghintraine, Co. Sligo", "Teacher:": "\nBean Uí Ghathaigh\n"}, {"Informant": "Miss B. Kivlehan", "Gender": "female", "Age": "89", "Occupation": "teacher", "Address": "Carrowmably, Co. Sligo"}, {"Language": "English"}]}, "4605949/4605133/4673032": {"title": "Old Crafts", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0207, Page 056", "Page 056"], "url": "https://www.duchas.ie/en/cbes/4605949/4605133/4673032", "text": "\n(continued from previous page)\nMaking of Creels.The creels were made something similar to the baskets but the rods were not boiled or peeled. Sally rods were only required and those rods were plated and woven together.Peter Moran took those baskets and creels to the fairs and markets and sold them at a price of one or two shillings.\n\n\n\nWilliam McGrath a native of Mohill but residing at Drumshanbo was the principal man for making nails in this district.This man was commonly known as the \"nailer.\"\n(continues on next page)\n", "school_info": "School: Drumshanbo (C.)", "metadata": [{"Location:": "Drumshanbo, Co. Leitrim", "Teacher:": "\nMargaret Flynn\n"}, {"Collector": "Phyllis Sissons", "Gender": "female"}, {"Informant": "Patrick Allen", "Gender": "male", "Address": "Drumshanbo, Co. Leitrim"}, {"Language": "English"}]}, "4678393/4676043/4683353": {"title": "Déanamh Tairní", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0421, Page 449", "Page 449"], "url": "https://www.duchas.ie/en/cbes/4678393/4676043/4683353", "text": "\n449Déanamh Tairngí  Bhí beirt fhear na chómhnaidh i Sráid Glas sa Daingean tamall ó shin.  Beirt dreothar do beadh iad.  Sé an tainm a bhí ortha ná Tomás agus Séamus Ó Máirtín.  Bhí dhá thigín beag aca ar thaobh na sráide.  Bhí cínn tuighe ar na tighte san.  Bhíodar na chómhnaidhe san áit go bfhuil Diarmuid Gúild anois.  Bhí an beirt aca ag déanamh tairngí ar feadh i bfad.  Bhíodar dhá dhéanamh as Slat Iarann a bhí le fáil aca ón t-Sualann.  Ní raibh aon ceann ar na tairngí ac saghas guala.  Ní thaghadh aon meirg ar na tairngí san.  Bhí dhá fuinneoigh ins na tighte aca agus nuair a thaghadh aoinne ag ceannach tairngí uatha shínidís amach iad tríd an fhuinneóigh cuacha.\n(continues on next page)\n", "school_info": "School: Na Gleannta", "metadata": [{"Location:": "Glin South, Co. Kerry", "Teacher:": "\nSs. Ó Conchabhair\n"}, {"Collector": "Pádraig de Londra", "Gender": "male", "Address": "Knockavrogeen West, Co. Kerry"}, {"Informant": "Séamus Ó Cuinn", "Gender": "male", "Age": "70", "Occupation": "iascaire", "Address": "The Wood, Co. Kerry"}, {"Language": "Irish"}]}, "4701727/4696638/4744560": {"title": "Old Crafts - Lime-Kilns", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0179, Page 361", "Page 361"], "url": "https://www.duchas.ie/en/cbes/4701727/4696638/4744560", "text": "\n(continued from previous page)\n[-]\n\n\n\nNail makingSome hundred years ago in the townland of Drumacool there lived a nail-maker about one hundred yards from where my house is situated. He lived in a hollow on my Grandfathers land along the side of a brae and that brae is called the Nailor's brae. Behind his little hut he had a kind of forge in which he made the nails of rod iron, the nails he made were something similar to the horse nails we use now. He cut the rod into equal bits, put\n(continues on next page)\n", "school_info": "School: An Gleann", "metadata": [{"Location:": "Glen, Co. Sligo", "Teacher:": "\nProinnsias Ó Ciaráin\n"}, {"Collector": "Enda Horan", "Gender": "male", "Address": "Drummacool, Co. Sligo"}, {"Informant": "Mrs Mc Keon", "Gender": "female", "Age": "70", "Address": "Drummacool, Co. Sligo"}, {"Language": "English"}]}, "4701727/4696642/4744569": {"title": "Old Crafts - Wood-Work", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0179, Page 365", "Page 365"], "url": "https://www.duchas.ie/en/cbes/4701727/4696642/4744569", "text": "\n(continued from previous page)\nof a churn with two handles on it on which they hung on asses.\n\n\n\nThere lived a nail maker about a hundred yards the Sligo side of Conway's Cross. He lived on Patrick McKeon's land along the main Sligo Ballyfarnon road. He lived on the side of a brae and it is still known as the nailors brae. This nailor was a spy and every place the people were making poteen he went there and unless he got as much as he was able to drink he would report them to the revenue.\n(continues on next page)\n", "school_info": "School: An Gleann", "metadata": [{"Location:": "Glen, Co. Sligo", "Teacher:": "\nProinnsias Ó Ciaráin\n"}, {"Collector": "Paddy Currid", "Gender": "male", "Address": "Ummeryroe, Co. Sligo"}, {"Informant": "Paul Keany", "Gender": "male", "Age": "80", "Address": "Ummeryroe, Co. Sligo"}, {"Language": "English"}]}, "4742135/4739233/4760424": {"title": "Na Súgáin", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0477, Page 149", "Page 149"], "url": "https://www.duchas.ie/en/cbes/4742135/4739233/4760424", "text": "", "school_info": "School: Achadh Tiobraid", "metadata": [{"Location:": "Aghatubrid, Co. Kerry", "Teacher:": "\nTomás Ó Muircheartaigh\n"}, {"Language": "Irish"}]}, "4706345/4704472/4779102": {"title": "Old Crafts - Chair Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0444, Page 229", "Page 229"], "url": "https://www.duchas.ie/en/cbes/4706345/4704472/4779102", "text": "\n(continued from previous page)\nsame purpose, a place for smoothing the wood and a wooden mallet for driving the rings.\n\n\n\nEach smith made the horse shoe mails for shoeing the horses that came to his forge. Other nails were made by Redmond Roche in Castleisland. This man was the great grandfather of the present James Roche owner of the farm in Maglass, Gortatlea. He was the only nail maker known in this district, and he bought the iron for the purpose in Tralee.\n", "school_info": "School: Nuadhchongbháil (Nohoval)", "metadata": [{"Location:": "Scart, Co. Kerry", "Teacher:": "\nSiobhán, Bean Uí Riada\n"}, {"Informant": "Pat Lacy", "Gender": "male", "Age": "75", "Occupation": "farmer", "Address": "Coolnadead, Co. Kerry"}, {"Language": "English"}]}, "4758489/4748138/4780653": {"title": "Nail-Making in Pilltown", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0842, Page 233", "Page 233"], "url": "https://www.duchas.ie/en/cbes/4758489/4748138/4780653", "text": "\n[-]\n(continues on next page)\n", "school_info": "School: Piltown (B.)", "metadata": [{"Location:": "Pilltown, Co. Kilkenny", "Teacher:": "\nPeadar Ó Maolchaoin\n"}, {"Collector": "Cecil Roche", "Gender": "male", "Age": "13", "Address": "Pilltown, Co. Kilkenny"}, {"Informant": "Simon Tobin", "Gender": "male", "Age": "78", "Occupation": "farmer", "Address": "Tibberaghny, Co. Kilkenny"}, {"Language": "English"}]}, "4770019/4767206/4784752": {"title": "Nail Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0831, Page 010", "Page 010"], "url": "https://www.duchas.ie/en/cbes/4770019/4767206/4784752", "text": "\nI heard about Nail Making from Agnes Brennan. She has a little farm. She was born in Ballinakill. She spent her life in Ballinakill. She saw her brother working at Nail Making. Nail Making was carried on about forty years ago. She was about thirty years of age at that time. She was living in Chapel Street Ballinakill Laoighis. I wrote the story in this book on the 2nd December 1937.James L. FitzpatrickBallinakill\n(continues on next page)\n", "school_info": "School: Ballinakill (B.)", "metadata": [{"Location:": "Ballinakill, Co. Laois", "Teacher:": "\nWilliam Hande\n"}, {"Collector": "James L. Fitzpatrick", "Gender": "male", "Address": "Ballinakill, Co. Laois"}, {"Informant": "Agnes Brennan", "Gender": "female", "Address": "Ballinakill, Co. Laois"}, {"Language": "English"}]}, "4770022/4767425/4785885": {"title": "On Making of Handmade Nails in Olden Times", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0831, Page 228", "Page 228"], "url": "https://www.duchas.ie/en/cbes/4770022/4767425/4785885", "text": "\nOn making of hand made nails in olden times.I have been making enquiries from my friends and neighbours how nails were made in these parts. I was told it was a trade in itself. The man that the nails was called the (Nailer, such a man existed about the year (1850) in the townsland of Garryglass two miles from Timahoe on the ABbeyville road His name was Robert Tobin. He made all the different sizes of nails that was then in use. He bought the iron in fine rods and then hammered it out into nails on a solid block of (iron called the (Hardie) an article corresponding to the Black Smith's anvil of the present day. I believe the nails were bought by all carpenters of the Surrounding country for miles around. The nails that he made are in existence to this day. They can be seen in the making of the Church door at Timahoe The Tobin's home is long since levelled to the ground but some of his descendants are living today at Portlaoighise.\n", "school_info": "School: Timahoe", "metadata": [{"Location:": "Timahoe, Co. Laois", "Teacher:": "\nR. O' Byrne\n"}, {"Collector": "Statia Norton", "Gender": "female", "Address": "Ballintlea Lower, Co. Laois"}, {"Language": "English"}]}, "4723848/4718447/4814514": {"title": "Old Crafts - Nail-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0943, Page 036", "Page 036"], "url": "https://www.duchas.ie/en/cbes/4723848/4718447/4814514", "text": "\nUp to about thirty years ago there were people called 'nailers' in every district, who made all the nails that were used. They made different sizes of nails for soling shoes, nails for horse shoes and different kinds of nails for use in wood. These nails were all cut from wires of different thicknesses and each nail had to be pointed and a broad head formed it. It was very tedious work. A man used to live in Tullyharnett who was known by the nickname Tommie the nailer. His father used to make nails for this locality.\n\n\n\nThe men who made wheels were called wheel wrights. The wheels were made of wood. The fan bellows long ago were all made of wood and were made by the wheel wright. The wheels for carts and barrows were made of wood just as they are nowadays. The wheel wright made the wooden parts of the tops, which boys spun and the nailer put the nail in them. The old spin wheels were made and kept in order by the wheel maker. In later years when the old spin wheels went out of order it was very hard to get them repaired for the wheel wrights were all dead.\n", "school_info": "School: Drumakill", "metadata": [{"Location:": "Drumakill, Co. Monaghan", "Teacher:": "\nFlorence Harrison\n"}, {"Collector": "Jane Wilson", "Gender": "female"}, {"Language": "English"}]}, "4798707/4791969/4924181": {"title": "Nail-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0254, Page 078", "Page 078"], "url": "https://www.duchas.ie/en/cbes/4798707/4791969/4924181", "text": "\nLong ago in this district when nails were not sold in any of the local shops, the people got the smith to make nails whenever they needed them, and of whatever length they required them.  The local blacksmith made the nails from iron.First an iron bar was heated so that it could be moulded into any shape required.  The smith then shaped the iron into long thin bars.  At the end of the anvil there is an iron rod standing upright having a sharp edged horizontal piece attached known as a \"cutter\".  On this the bar of iron was placed, and struck and cut with a sledge, as far from the end of\n(continues on next page)\n", "school_info": "School: Scrabagh", "metadata": [{"Location:": "Scrabbagh, Co. Roscommon", "Teacher:": "\nMrs Rose Ffrench\n"}, {"Collector": "Michael Greene", "Gender": "male"}, {"Language": "English"}]}, "4769981/4763844/4926765": {"title": "Making Nails", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0782, Page 050", "Page 050"], "url": "https://www.duchas.ie/en/cbes/4769981/4763844/4926765", "text": "\nThe people who lived long a go when they were making nails they got a piece of wire. Then they redened the wire and shaped it out like a nail. They hammered the wire and put a round top on the wire and at the end of the nails they filled the edges on the nail.\n", "school_info": "School: Athy (Christian Bros.)", "metadata": [{"Location:": "Athy, Co. Kildare", "Teacher:": "\nBr. Ó Fiacha\n"}, {"Language": "English"}]}, "4798710/4792350/4927224": {"title": "Rope-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0255, Page 053", "Page 053"], "url": "https://www.duchas.ie/en/cbes/4798710/4792350/4927224", "text": "\n(continued from previous page)\nit in balls. Then the ropes were made by twisting the threads and the bark of ash trees together so as to make the ropes stiff and strong.This man did a good trade, because his work was liked by everyone, and all the people bought his ropes.\n\n\n\nThere was a simple industry known as nail-making carried on in the townland of Lavagh some fifty years ago.  The man who made these nails was named Harvey and he carried on his work in a house - a barn now - at the crossroads convenient to Carnadoe Creamery.  The nails were made from a long thin bar of iron called a nail-rod.  He used to put this rod into the fire and make it red hot, then with a tongs carry it to the\n(continues on next page)\n", "school_info": "School: An Carraigín", "metadata": [{"Location:": "Carrigeen, Co. Roscommon", "Teacher:": "\nBean Mhic Oireachtaigh\n"}, {"Language": "English"}]}, "4742089/4734863/4928146": {"title": "Déanamh Tairní", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0466, Page 092", "Page 092"], "url": "https://www.duchas.ie/en/cbes/4742089/4734863/4928146", "text": "", "school_info": "School: Doirín Darach", "metadata": [{"Location:": "Derreendarragh, Co. Kerry", "Teacher:": "\nMáire, Bean Uí Chathbhuaidh\n"}, {"Collector": "Brighid Ní Chathasaigh", "Gender": "female", "Address": "Gortacloghane, Co. Kerry"}, {"Informant": "Máire Bean Uí Chathasaigh", "Gender": "female", "Address": "Gortacloghane, Co. Kerry"}, {"Language": "Irish"}]}, "4798729/4794079/4928414": {"title": "Nail-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0261, Page 105", "Page 105"], "url": "https://www.duchas.ie/en/cbes/4798729/4794079/4928414", "text": "", "school_info": "School: Drumatemple (B.)", "metadata": [{"Location:": "Drumatemple, Co. Roscommon", "Teacher:": "\nMichael Quinn\n"}, {"Collector": "Michael O' Neill", "Gender": "male", "Address": "Ballymoe, Co. Galway"}, {"Language": "English"}]}, "4758588/4756993/4935559": {"title": "Gate-Maker", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0933, Page 024", "Page 024"], "url": "https://www.duchas.ie/en/cbes/4758588/4756993/4935559", "text": "\n(continued from previous page)\nis a great wooden-gate maker.  He can make one gate in a day.\n\n\n\nJames Callan who lived in Gorteen, Inniskeen, Co. Louth, was a great nail-maker, he could make thirty nails in one day.\n\n\n\nOwen Clark, who lived in Knockbridge, Co. Louth was a great plough-maker.  He could make a plough in two days.\n\n\n\nThomas Toal, Corthil, Knockbride, Co. Louth who is now dead, was a famous basket-\n(continues on next page)\n", "school_info": "School: Inniskeen", "metadata": [{"Location:": "Inishkeen, Co. Monaghan", "Teacher:": "\nLouis A. Duffy\n"}, {"Informant": "James Hamill", "Gender": "male", "Address": "Gorteen, Co. Louth"}, {"Language": "English"}]}, "4758588/4757000/4935603": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0933, Page 031", "Page 031"], "url": "https://www.duchas.ie/en/cbes/4758588/4757000/4935603", "text": "\nAbout sixty years ago there was a man named Thomas Kerr, Drumnagrella, Inniskeen, Co. Monaghan. He was a famous old thatcher.\n\n\n\nAbout forty years ago, theere was a man named Patrick Carroll, Drumass, Inniskeen, Co. Monaghan. He was an old wheel maker.\n\n\n\nAbout fifteen years ago, there was a man named John Connor, Kednamincha, Inniskeen, Co. Monaghan, who in former times could make nails.\n\n\n\nMy Grandfather whose name was, Edward Deery, Crrickakelly, Inniskeen, Co. Monaghan, was a great walker. He and Peter Finegan, Gortin, Co. Louth. Both had their minds made up to go to a fair in Shercock. Both had fourteen miles to go. Each brought cattle and returned home, that night, after completing that\n(continues on next page)\n", "school_info": "School: Inniskeen", "metadata": [{"Location:": "Inishkeen, Co. Monaghan", "Teacher:": "\nLouis A. Duffy\n"}, {"Language": "English"}]}, "4758588/4757015/4935674": {"title": "Nail-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0933, Page 046", "Page 046"], "url": "https://www.duchas.ie/en/cbes/4758588/4757015/4935674", "text": "\nPeter Hanratty of Lannet, Inniskeen, Co. Monaghan, was famed as a nail maker. He could make thirty - six nails in a day.\n\n\n\nPatrick Meegan of Drumcatten, Inniskeen, Co. Monaghan, was a famous rope maker, he could make quite good ones.\n\n\n\nAbout seventy years ago, the playground attached to this school was used as a bleaching green. The flax was grown and cured in the surrounding fields. It was then woven into coarse linen, and spread out to bleach. Patrick Fitzpatrick of Candlefort, Inniskeen, Co. Monaghan, was my informant.\n", "school_info": "School: Inniskeen", "metadata": [{"Location:": "Inishkeen, Co. Monaghan", "Teacher:": "\nLouis A. Duffy\n"}, {"Language": "English"}]}, "4758588/4757016/4935692": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0933, Page 047", "Page 047"], "url": "https://www.duchas.ie/en/cbes/4758588/4757016/4935692", "text": "\nAbout twenty years ago, there was a man named James Mc Gahan, who lived at Lannett, Inniskeen, Co. Monaghan who could make tallow candles. He also could make baskets.\n\n\n\nThere was a man, about thirty years ago named James Mc Carroll, Candlefort, Inniskeen, Co. Monaghan. He used to make spades, gates, and ploughs.\n\n\n\nAbout sixty years ago, there was a man named Thomas Kerr, Drumnagrella, Inniskeen, Co. Monaghan. He was an old wheel maker.\n\n\n\nAbout fifteen years ago, there was a man named John Connor, Kednamincha, Inniskeen, Co. Monaghan, who in former times could make nails.\n", "school_info": "School: Inniskeen", "metadata": [{"Location:": "Inishkeen, Co. Monaghan", "Teacher:": "\nLouis A. Duffy\n"}, {"Language": "English"}]}, "4758588/4757017/4935706": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0933, Page 048", "Page 048"], "url": "https://www.duchas.ie/en/cbes/4758588/4757017/4935706", "text": "\nJohn Byrne, Channonrock, Co. Louth, makes ploughs, gates, spades of iron.\n\n\n\nJames Richartson, Greenroad Co. Louth, could make candles out of rushes.\n\n\n\nJohn Byrne, Toomes, Co. Louth, could make baskets from sally - rods.\n\n\n\nPeter Brodigan, Louth, Co. Louth, could make soap.\n\n\n\nOwen Cassidy, Ardee, Co. Louth, could make ropes.\n\n\n\nFrank Kelly, Mullacrew, Co. Louth, could make barrells and churns.\n\n\n\nJohn Byrne, Channonrock, Co. Louth, makes nails, at the present time.\n", "school_info": "School: Inniskeen", "metadata": [{"Location:": "Inishkeen, Co. Monaghan", "Teacher:": "\nLouis A. Duffy\n"}, {"Language": "English"}]}, "4758588/4757019/4935721": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0933, Page 050", "Page 050"], "url": "https://www.duchas.ie/en/cbes/4758588/4757019/4935721", "text": "\nAbout fifteen years ago, there was a man named John Connor, Kednamincha, Inniskeen, Co. Monaghan, who in former times could make nails.\n\n\n\nLaurence Toal, of Lannet, Inniskeen, Co. Monaghan, is famous for his basket - making. He can make baskets and creels as good as bought ones. About twenty or thirty years ago, he used to sell them to the neighbours.\n\n\n\nJames Keenan, of Rassan, Inniskeen, Co. Monaghan, could make very good nails. He used to make all sorts of nails.\n\n\n\nMatt Grimes, of\n(continues on next page)\n", "school_info": "School: Inniskeen", "metadata": [{"Location:": "Inishkeen, Co. Monaghan", "Teacher:": "\nLouis A. Duffy\n"}, {"Language": "English"}]}, "4758588/4757019/4935723": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0933, Page 050", "Page 050"], "url": "https://www.duchas.ie/en/cbes/4758588/4757019/4935723", "text": "\nAbout fifteen years ago, there was a man named John Connor, Kednamincha, Inniskeen, Co. Monaghan, who in former times could make nails.\n\n\n\nLaurence Toal, of Lannet, Inniskeen, Co. Monaghan, is famous for his basket - making. He can make baskets and creels as good as bought ones. About twenty or thirty years ago, he used to sell them to the neighbours.\n\n\n\nJames Keenan, of Rassan, Inniskeen, Co. Monaghan, could make very good nails. He used to make all sorts of nails.\n\n\n\nMatt Grimes, of\n(continues on next page)\n", "school_info": "School: Inniskeen", "metadata": [{"Location:": "Inishkeen, Co. Monaghan", "Teacher:": "\nLouis A. Duffy\n"}, {"Language": "English"}]}, "4758588/4757021/4935733": {"title": "Rope-Maker", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0933, Page 052", "Page 052"], "url": "https://www.duchas.ie/en/cbes/4758588/4757021/4935733", "text": "\n(continued from previous page)\na day.\n\n\n\nJames Salmon, of Donaghmoyne, Co. Monaghan, was a great nail - maker. He could also make gates, and ploughs.\n\n\n\nHugh Reilly, Gorteen, Inniskeen, Co. Monaghan, was famed as a candle maker. He used to make them from tallow, resin, and rushes. He could make very good ones.\n\n\n\nAbout thirty years ago there lived a man named Michael Meegan of Drummond, Inniskeen, Co. Monaghan. He was known as a famous old thatcher. He used to thatch for all neighbours arond. The work he would do, would last for many years afterwards.\n", "school_info": "School: Inniskeen", "metadata": [{"Location:": "Inishkeen, Co. Monaghan", "Teacher:": "\nLouis A. Duffy\n"}, {"Language": "English"}]}, "4758588/4757024/4935747": {"title": "Nail-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0933, Page 055", "Page 055"], "url": "https://www.duchas.ie/en/cbes/4758588/4757024/4935747", "text": "\nFrank Martin, Corcreaghy, a Blacksmith could make nails with nail rods, and also could make spades, gates and ploughs.\n\n\n\nDan Kelly, Artherstown is a good wheel maker.\n\n\n\nTom Matthews, Mullacrew, is a good basket maker. He makes them with \"sally\" rods.\n\n\n\nJohn Carroll, Priorstate, Co. Louth, is a good thatcher.\n\n\n\nPatrick Rochfort,\n(continues on next page)\n", "school_info": "School: Inniskeen", "metadata": [{"Location:": "Inishkeen, Co. Monaghan", "Teacher:": "\nLouis A. Duffy\n"}, {"Language": "English"}]}, "4758588/4757029/4935781": {"title": "Spade-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0933, Page 060", "Page 060"], "url": "https://www.duchas.ie/en/cbes/4758588/4757029/4935781", "text": "\nPatrick Meegan, Treagh, Inniskeen, Co. Monaghan. He was famous for spade making. He could make twelve spades in one day.\n\n\n\nJames Mc alroy, Topriss, Inniskeen, Co. Monaghan. He was famous for wheel making. He could make four wheels in one day.\n\n\n\nPeter Ward who lived in Channonrock, Co. Louth, could make any class of nails.\n\n\n\nJoe Coleman, Dundalk, Co. Louth, was a great man for Tanning leather.\n", "school_info": "School: Inniskeen", "metadata": [{"Location:": "Inishkeen, Co. Monaghan", "Teacher:": "\nLouis A. Duffy\n"}, {"Language": "English"}]}, "4723835/4717445/4939109": {"title": "Limekiln", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0940, Page 074", "Page 074"], "url": "https://www.duchas.ie/en/cbes/4723835/4717445/4939109", "text": "\nLong ago many of the people had lime kilns built into a field near their home. It was built of stones and clay. There was a hole on top on which they put in the raw lime. There was a hole on the bottom of it on which the took out the lime when the large stones was burned fine. There was a also an arch built on the bottom of it on which they put in the fire. When they had it burned the threw it out on the fields and scattered it. At that time they had the lime, not much manure and they put lime on the ground instead.\n\n\n\nThe nailer around this district was Peter Macanall who lived in Ballytrain. He had five or six nailrods and he put them into a fire. When the tops of them were red he took them out one by one and stuck them in a mold of lead. Then he beat the tops of them until there was a point on them. He made nails some one inch and a half and others three inch. He did the same until the were burned.\n", "school_info": "School: Corracharra", "metadata": [{"Location:": "Corracharra, Co. Monaghan", "Teacher:": "\nBrian Mac Aodha\n"}, {"Language": "English"}]}, "4922195/4859813/4939460": {"title": "Local Trades", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0550, Page 021", "Page 021"], "url": "https://www.duchas.ie/en/cbes/4922195/4859813/4939460", "text": "\nAbout forty years ago there was lime made in nearly every farm place.  There is an old limekill on our farm where lime was made. The lime was made by putting turf in first and then stones and then \"collen\" and it was put fire to.\n\n\n\nThe old way of separating the grain from the straw was done by a flail and on a windy day the hull ( the shell of the grain) is taken from the grain by the wind. The corn was crushed by dropping the grain between two flat stones and it was made into flour.\n\n\n\nUp to fifty years ago, a flail was used for threshing the corn. It consisted of two sticks joined end to end by a twine. One was held in the hand while with the other the corn was threshed.\n\n\n\nThe making of nails was also common fifty years ago. The wire was heated, cut and pointed.\n\n\n\nTinsmiths and coopers worked in the town some fifty years ago.\n", "school_info": "School: Scoil na mBráthair, An Teampall Mór", "metadata": [{"Location:": "Templemore, Co. Tipperary", "Teacher:": "\nAn Br. Ó Laoghaire\n"}, {"Language": "English"}]}, "4723844/4718058/4941890": {"title": "Linen Weaving", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0942, Page 051", "Page 051"], "url": "https://www.duchas.ie/en/cbes/4723844/4718058/4941890", "text": "\n(continued from previous page)\nDrumacrib in the Parish Mucknoe in Co Managhan in the house where Mr Wm Martin now lives\n\n\n\nNails were made from long thin iron rods called nail rods. The iron was reddened in the fire and then cut into lengths and pointed. Swing ploughs fire cranes and gates were made at the forge. Hide was got from the butcher and tanned. It was soaked in hot lime for a couple of days and then the hair came out and it was rubbed with oil. This leather was soaked in water and then it was used for a \"tug\" for a flail which was made for fastening two thick sticks together with this tug. The flail was used for threshing corn. Buckets and creels were made with sallow willow rods. The strong rods were cut down the middle then bent into shape. Then the lighter rods were woven in and out.\n", "school_info": "School: Lorg an Iarla", "metadata": [{"Location:": "Lurganearly, Co. Monaghan", "Teacher:": "\nE. Ní Choilldubh\n"}, {"Collector": "W. Blackwood", "Gender": "male", "Address": "Altnamackan"}, {"Informant": "Mr G. Blackwood", "Gender": "male", "Age": "58", "Address": "Altnamackan"}, {"Language": "English"}]}, "4922010/4918018/4941973": {"title": "Old Crafts - Soap and Candles", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0501, Page 018", "Page 018"], "url": "https://www.duchas.ie/en/cbes/4922010/4918018/4941973", "text": "\nSoap and candles were made in the town of Rathkeale long ago by a man named Mr. Shanagan who lived in the main street near where the Munster and Leinster bank ist built today. The candles were made of fat of the cow and were sold in packages of three lbs and six lbs. The making began about the year 1868 and lasted until the year 1883 and the boilers are still in existence in Mr Shanaghans back yard.\n\n\n\nNails were made in the town of Rathkeale about one hundred years ago by a man named Mr. Hayes. He made the nails out of steel wire which he put into the fire to redden then the pointed them and the nails were made. He lived at the Crosslane near where the peoples bakery is built today. The remains of his house is still to be seen and there is an old woman living in it by the name of Mrs. Kirby.\n(continues on next page)\n", "school_info": "School: Ráth gCaola (B.)", "metadata": [{"Location:": "Rathkeale, Co. Limerick", "Teacher:": "\nSeán Ó Coindealbháin\n"}, {"Language": "English"}]}, "4922010/4918020/4941978": {"title": "Old Crafts - Candle-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0501, Page 020", "Page 020"], "url": "https://www.duchas.ie/en/cbes/4922010/4918020/4941978", "text": "\n(continued from previous page)\nplan and they bought suet and melted it. Then they would get a piece of card and dip it in the suet three or four times and then the candle would be made. The candle would only last an hour also there would be a terrible smell off the candle when it would be burning. The candles were made at the stall by my uncles mothers and she used to call them halfpenny dips. She used to sell them in packages of three lbs. The stall is occupied by Uncle Bert.\n\n\n\nDenis Moran lived in Well Lane Rath. He used to make nails. He used to put a piece of iron into the fire and when it would be read, he would take it out and make a nail of it. Mr. Hennessy lived in Altavilla Newbridge. He used to weave. He used to make blankets, rugs, flannels and frieze.\n", "school_info": "School: Ráth gCaola (B.)", "metadata": [{"Location:": "Rathkeale, Co. Limerick", "Teacher:": "\nSeán Ó Coindealbháin\n"}, {"Collector": "Brian Connell", "Gender": "male"}, {"Language": "English"}]}, "4723846/4718250/4942975": {"title": "Quilt-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0942, Page 270", "Page 270"], "url": "https://www.duchas.ie/en/cbes/4723846/4718250/4942975", "text": "\n(continued from previous page)\nthe came into use in our homes. They were made with pieces of cloth all of different colours. The dark coloured pieces were put together and the light colour pieces were put together in very pretty patterns. Quilts can be made in different ways. Flax is spun into white linen and this is put over the beds.\n\n\n\nLong ago the black smiths used to make all the nails for the people out of pieces of iron which they had left over. But now-a-days the nails are made out of strong wire in a nail factory. When he is making the nails out he warms the iron in the fire. Then he gets it on the anvil and hammers until he has it in the shape of a nail.\n", "school_info": "School: Mc Kelvey's Grove", "metadata": [{"Location:": "Loughbrattoge, Co. Monaghan", "Teacher:": "\nEva Campbell\n"}, {"Collector": "Albert Smyth", "Gender": "male", "Age": "13", "Address": "Drollagh, Co. Monaghan"}, {"Language": "English"}]}, "4922085/4850861/4943245": {"title": "Old Crafts - Candle-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0520, Page 159", "Page 159"], "url": "https://www.duchas.ie/en/cbes/4922085/4850861/4943245", "text": "\n(continued from previous page)\npoured into the model until full.   It was then left to cool for four or five hours, and then one nail was pulled out from the top, and the candle was drawn out gently.\n\n\n\nIn olden times there were no factories for making nails.  There were man people in Cappamore who used make nails then.   William Conroy, and Oliver Davern were two nail makers in Cappamore Co Limerick.  Barony of Owneybeg.  But both of them are dead about 40 years.  They had small forges. The nail wire was bought and cut up into whatever length the nails should be.  Then the bits of wire were put into a fire until they would be red hot.  They were brought out then and the tops pointed\n(continues on next page)\n", "school_info": "School: Cappamore (B.)", "metadata": [{"Location:": "Cappamore, Co. Limerick", "Teacher:": "\nJames McCarthy\n"}, {"Language": "English"}]}, "4922029/4920091/4948794": {"title": "Nail Manufacture", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0506, Page 024", "Page 024"], "url": "https://www.duchas.ie/en/cbes/4922029/4920091/4948794", "text": "\nNail Manufacture.Most of the blacksmiths and nailors in this district had the family name of Fennel.  There was a famous Fennel in Patrickswell.  The ruins of the house where he dwelt can be seen opposite the police barracks in patrickswell.  He had the reputation of making fine easy running ploughs.  Charcoal prepared steel was imported from Sweden for this purpose.Nailors made nails for the carpenters and also for the bootmakers. The nailor bought nail rod as the piece of iron was called, from which nails were cut and about four blows of the hammer were needed to form a nail from the piece cut from the nail rod.There were many nailors in Adare and of course they lost their living when machine nails were made.In the teachers residence Of Adare national school.  Role no. 8926, the floors in the upstairs rooms are held together with home made nails very probably manufactured by the Fennel family of Adare.\n", "school_info": "School: Áth Dara (C.)", "metadata": [{"Location:": "Adare, Co. Limerick", "Teacher:": "\nMáire Boardman\n"}, {"Language": "English"}]}, "4758506/4749734/4952463": {"title": "Nail-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0847, Page 038", "Page 038"], "url": "https://www.duchas.ie/en/cbes/4758506/4749734/4952463", "text": "\nLong ago no farmer would buy a pound of nails. At that time nails were made from iron-ore, which was obtainable in a few places. It was boiled, and the iron was separated fron the iron-ore. There were certain men called nail-makers. They would make nails from the iron.\n\n\n\nOnce upon a time the people of the Rower never bought whips. They used to kill old horses, and skin them. Then they used tan the hide. When they had the hide well tanned they used to boil it, and hang it up for a while. Then after some time they would take it down, and twist it into shape. When that was done, they would cut an ash plant, and tie the tanned hide around it with wax-end, which would keep it firm and strong. For the lash they would nail another strip of tanned hide to the handle. This was a great trade amongst the people of the Rower\n(continues on next page)\n", "school_info": "School: The Rower (B.), Inistioge", "metadata": [{"Location:": "The Rower, Co. Kilkenny", "Teacher:": "\nRisteárd Ó Cuirrín\n"}, {"Collector": "Martin Ryan", "Gender": "male", "Address": "Coolhill, Co. Kilkenny"}, {"Informant": "Mrs Ryan", "Gender": "female", "Age": "60", "Address": "Coolhill, Co. Kilkenny"}, {"Language": "English"}]}, "4758509/4750201/4953223": {"title": "Old Crafts - Nail-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0848, Page 040", "Page 040"], "url": "https://www.duchas.ie/en/cbes/4758509/4750201/4953223", "text": "\nSome forty or fifty years ago there lived in the village of Ballyhale a family named Doyle who for some generations had carried on the nail making trade My father says that when he was a little boy the trade was nearly gone for the shops had then begun to stock the nails made in the factory. Still one of the brothers was often at work and my Daddy says he often watched them Charlie it was who did the work at the trade and James got odd jobs around & did the housekeeping. They lived where Jack OShea has his petrol & motor supplies now. The house was very small and it was at one side of the kitchen they worked. There was a hob there like the\n(continues on next page)\n", "school_info": "School: Ballyhale", "metadata": [{"Location:": "Ballyhale, Co. Kilkenny", "Teacher:": "\nEibhlín Ní Shúilleabháin\n"}, {"Collector": "Brigid Walsh", "Gender": "female", "Address": "Ballyhale, Co. Kilkenny"}, {"Informant": "Michael Walsh", "Relation": "parent", "Gender": "male", "Address": "Ballyhale, Co. Kilkenny"}, {"Language": "English"}]}, "4758507/4749912/4953314": {"title": "Burning of Lime", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0847, Page 215", "Page 215"], "url": "https://www.duchas.ie/en/cbes/4758507/4749912/4953314", "text": "\n(continued from previous page)\ncinders would destroy the lime, but ashes of colmn mixed nicely through it and was scarcely noticed. The lime stone took twenty-four hours to burn but once the fire was burning brightly it required no further attention. Young people spend many a pleasant hour sitting around the kiln fire singing songs and telling stories.\n\n\n\nAt the present time nails are made by machinery, but in olden days they were made by hand. The men that made them were called nailers, and they were just as numerous in Ireland as other tradesmen. The best iron for the purpose of making nails was said to come from Sweden. An iron rod 1/8 of an inch square was suitable for nearly all nails. These rods were sold in all hard ware shops. The tools a nailers required were, chizel, hammer, anvil and small\n(continues on next page)\n", "school_info": "School: The Rower (C.), Inistioge", "metadata": [{"Location:": "The Rower, Co. Kilkenny", "Teacher:": "\nLabhaoise Nic Liam\n"}, {"Language": "English"}]}, "4770004/4766083/4956670": {"title": "Coach Building", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0828, Page 149", "Page 149"], "url": "https://www.duchas.ie/en/cbes/4770004/4766083/4956670", "text": "\n(continued from previous page)\nBergin, Ballycoolid were wheel makers about twenty or twenty five years ago. Coaching was also carried on by Kirwans of Rathdowney, and Matt Turbey, Errill. There was also wheel making carried on in Rathdowney by James Fogarty, who died about 1917 twenty years ago. James Dollard also made wheels, he died about 1935.\n\n\n\nThere was a nail Factory in Rathdowney carried on by Ned and Micheal Fanning, this Factory was adjoining the old National School Rathdowney, now the C.Y.M.S Hall. A man whose name was Lacey Galmoy used to make nails. They were made from iron. Then they were put on an anvil and beaten out with a hammer.Barney Mc Guire, Pound St. Michael Fanning, High St. Edward Carthy, Moore St, Sam Fry, Moore St. Rathdowney used to make nails up to about 1887.\n", "school_info": "School: St John of God Convent, Rathdowney", "metadata": [{"Location:": "Rathdowney, Co. Laois", "Teacher:": "\nThe Sisters\n"}, {"Language": "English"}]}, "4922108/4852813/5009818": {"title": "Homemade Starch", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0527, Page 065", "Page 065"], "url": "https://www.duchas.ie/en/cbes/4922108/4852813/5009818", "text": "\n(continued from previous page)\nallowed to remain undisturbed, until all the starch was extracted. Leaving a deposit of starch at the bottom of the vessel.  The starch before being applied to articles was dissolved in hot water.Recorded from Mrs. FoleyClounanna, Patrickswell,Co. Limerick.\n\n\n\nBefore Matches Came Into Use.Before matches came into use, the people of this district lighted their fires and pipes by means of a flint light.  First a piece of brown paper would be steeped or soaked in washing soda.  Then a very hard stone, called flint, would be procured.  Then the flint would be struck with a steel rod.  This would cause a spark, which would ignite the touch paper. Then it would be ready for use.Recorded from Wm. McNamara,Lisaleen,Patrickswell,Co. Limerick.\n\n\n\nMaking of Nails.In former times, the people of this locality made their own nails and staples. Slender iron rods were procured.  These rods were called rod irons.  Then they were thoroughly heated in a big fire.  When the iron was red, it was placed on an anvil.  This anvil was specially used for nail making, and was not as big or as heavy as the anvil we see at the forges.The iron would be then hammered into\n(continues on next page)\n", "school_info": "School: Lurga, Patrick's Well", "metadata": [{"Location:": "Kilcolman, Co. Limerick", "Teacher:": "\nMáire, Bean Uí Bhroin\n"}, {"Informant": "Mrs Foley", "Gender": "female", "Address": "Cloonanna, Co. Limerick"}, {"Language": "English"}]}, "4742033/4729727/5010488": {"title": "Old Crafts - Nail-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0868, Page 010", "Page 010"], "url": "https://www.duchas.ie/en/cbes/4742033/4729727/5010488", "text": "\nThe nailers in Ballyragget were numerous and busy in years gone by. Pat and Dan Coogan, Mathew Loughman, John Lacey and Richard Keenan were the principal ones.The rod iron had first to be heated. They they had special tools for cutting them and for shaping the heads on the nails.Local shoe makers were suppllied and nails were sold also in the city of Kilkenny. The trade is not carried on at present.\n", "school_info": "School: Ballyragget Convent", "metadata": [{"Location:": "Ballyragget, Co. Kilkenny", "Teacher:": "\n-\n"}, {"Collector": "Maura Cleere", "Gender": "female"}, {"Informant": "Mr T. Dowling", "Gender": "male", "Age": "65", "Address": "Ballyragget, Co. Kilkenny"}, {"Language": "English"}]}, "4770010/4766628/5013485": {"title": "Nail-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0829, Page 264", "Page 264"], "url": "https://www.duchas.ie/en/cbes/4770010/4766628/5013485", "text": "\nNail MakingAbout fifty years ago there was a nailer's shop in the village of Borris-in-Ossory. Nearly all the supply of nails for this district were made in it.The nails were made in a forge. The instruments that were used were an anvil, a bellows, a hob, and moulds. The anvil consisted of a stake and a hardy. The nails were shaped on the stake. The stake of the anvil was only about two an a half inches broad, and five inches long. The nails were cut on the hardy. The anvil was not near as big as a blacksmith's anvil. The bellows was not a very big one either.There was an iron instrument beside the anvil called the horse. All the tools were left on the horse. When the nailer wanted any tool all he had to do is put his hand on the horse and get it.The nails were made with an instrument called a mould. There were several moulds, one mould for every sort of a nail.The iron used for making the nails was bought in the hardware shops. There were carpentry nails, boot nails, and slating nails made.\n(continues on next page)\n", "school_info": "School: Naomh Coinneach, Borris-in-Ossory", "metadata": [{"Location:": "Borris-in-Ossory, Co. Laois", "Teacher:": "\nR. Ó Caoimh\n"}, {"Collector": "Michael Meagher", "Gender": "male"}, {"Informant": "Thomas Hogan", "Gender": "male", "Age": "62", "Occupation": "labourer", "Address": "Borris-in-Ossory, Co. Laois"}, {"Language": "English"}]}, "4770002/4765859/5013670": {"title": "The Nailer's Shop", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0827, Page 326", "Page 326"], "url": "https://www.duchas.ie/en/cbes/4770002/4765859/5013670", "text": "\nAbout 70 years ago there was an old nailer's shop in the north side of the town where Joseph O'Brien lives now.My Grandfather told me that he saw the two old Fanning's working there and they made all sorts of nails.  But after a while they gave it up because it was not paying them.\n(continues on next page)\n", "school_info": "School: Rathdowney (B.)", "metadata": [{"Location:": "Rathdowney, Co. Laois", "Teacher:": "\nPeter Hegarty\n"}, {"Collector": "William Whelan", "Gender": "male", "Address": "Rathdowney, Co. Laois"}, {"Informant": "Mrs Leahy", "Gender": "female", "Age": "83", "Address": "Rathdowney, Co. Laois"}, {"Language": "English"}]}, "4770002/4765909/5013825": {"title": "Nailer's Shop", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0827, Page 376", "Page 376"], "url": "https://www.duchas.ie/en/cbes/4770002/4765909/5013825", "text": "\nA long time ago a man named Fanning started a nailers shop on the east end of the Square on the north side of the street. They made nails for a long time until thirty years ago they started to make them by machinery. Then Mr Fanning died and Mr J O'Brien bought the shop and built a house there. This story was told to me by a very old woman named Mrs Leahy of the Square Rathdowney who is about 80 years and she remembers them to be\n(continues on next page)\n", "school_info": "School: Rathdowney (B.)", "metadata": [{"Location:": "Rathdowney, Co. Laois", "Teacher:": "\nPeter Hegarty\n"}, {"Collector": "Liam Quinn", "Gender": "male", "Address": "Rathdowney, Co. Laois"}, {"Language": "English"}]}, "4922176/4858394/5018386": {"title": "Nail-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0544, Page 183", "Page 183"], "url": "https://www.duchas.ie/en/cbes/4922176/4858394/5018386", "text": "\nIn the olden times when they had no machines for making nails, there were in each district a few men who made them. The people who made them got rod-iron and heated it. They had a special kind of hammer and every time they hit the iron it made a nail. The Ryans were the nail-makers in Borrisoleigh and were called \"The Ryan Nailers.\" None of them remain.\n", "school_info": "School: Borrisoleigh", "metadata": [{"Location:": "Borrisoleigh, Co. Tipperary", "Teacher:": "\nname not given\n"}, {"Collector": "Austin Kearney", "Gender": "male", "Address": "Borrisoleigh, Co. Tipperary"}, {"Informant": "Mrs Kearney", "Gender": "female", "Age": "50", "Address": "Upper Main Street, Co. Tipperary"}, {"Language": "English"}]}, "4922236/4863067/5020745": {"title": "Making of Nails", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0560, Page 286", "Page 286"], "url": "https://www.duchas.ie/en/cbes/4922236/4863067/5020745", "text": "\nAbout fifty years ago Nailers used to go round to forges bringing with them their own small anvils. A \"fire-helper\" used to work with them to keep the irons hot A bar of Swedish iron, 1/4\" square was used for making nails. Four irons were put into the fire at a time. The reddest was first pulled out and hammered quickly to point it. The nails were afterwards finally pointed. Maddens of Mullinahone were formerly Nailers.\n", "school_info": "School: Mullinahone (C.)", "metadata": [{"Location:": "Mullinahone, Co. Tipperary", "Teacher:": "\nMáire Ní Shéaghdha\n"}, {"Collector": "Mary Josephine Tobin", "Gender": "female", "Address": "Mullinahone, Co. Tipperary"}, {"Informant": "Timothy Tobin", "Relation": "parent", "Gender": "male", "Age": "45", "Occupation": "shopkeeper", "Address": "Mullinahone, Co. Tipperary"}, {"Language": "English"}]}, "4922309/4869010/5022909": {"title": "Old Crafts - Nail Maker", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0582, Page 220", "Page 220"], "url": "https://www.duchas.ie/en/cbes/4922309/4869010/5022909", "text": "\nOld CraftsNail Maker.There were nails made in Ballagh by Duryers about sixty years ago.Basket Making.Basket Making was carried on in every house in Bishopswood about fifty year ago. Thady Carey was a professional at this work.Candle Making (about 100 year ago)Jermiah O Dwyer of Bishopswood was a noted candle maker, also a man by the name of Mullins who lived in Cashel.\n\n\n\nLocal HeroesA Stron ManMichael Buckley, Cappawhite, was a very strong man. He could lift a cwt weight with one hand and he could throw it over a wall about eleven feet, He could walk a long distance with one cwt weight in each hand.\n", "school_info": "School: Coill an Easbuig (Bishopswood), Dundroma", "metadata": [{"Location:": "Bishopswood, Co. Tipperary", "Teacher:": "\nMícheál Mac Cárthaigh\n"}, {"Collector": "Josephine Ryan", "Gender": "female", "Address": "Bishopswood, Co. Tipperary"}, {"Informant": "Mrs D. Ryan", "Gender": "female", "Address": "Bishopswood, Co. Tipperary"}, {"Language": "English"}]}, "4922239/4863389/5052262": {"title": "Old Crafts - Basket-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0562, Page 081", "Page 081"], "url": "https://www.duchas.ie/en/cbes/4922239/4863389/5052262", "text": "\n(continued from previous page)\nIn former times people in the district made their living by basket making.\n", "school_info": "School: Mághthobair (Mohober), Dúrlas Éile", "metadata": [{"Location:": "Mohober, Co. Tipperary", "Teacher:": "\nMáirtín Ó Mathghamhna\n"}, {"Collector": "Angie Noonan", "Gender": "female", "Address": "Knockulty, Co. Tipperary"}, {"Informant": "Mr Walter Mc Cormack", "Gender": "male", "Age": "72", "Address": "Knockulty, Co. Tipperary"}, {"Language": "English"}]}, "4922284/4867243/5054495": {"title": "Nail-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0577, Page 077", "Page 077"], "url": "https://www.duchas.ie/en/cbes/4922284/4867243/5054495", "text": "\nNail making was carried on to some extent in former days. The descendants of the nail makers live locally and are appropriately nicknamed the nailer. This man's grandfather supplied nails in bulk and for many years to farmers and others in the locality.\n\n\n\nThatching was also done locally - we have families still nicknamed the thatcher\" and in a few houses they still jealously find the \"garsún\" on little straw bundles  which holds the scallops\n", "school_info": "School: Ballinahinch", "metadata": [{"Location:": "Ballynahinch, Co. Tipperary", "Teacher:": "\nMiss E. Merrick\n"}, {"Language": "English"}]}, "5008877/4963013/5080398": {"title": "Collon Sawmills", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0677, Page 101", "Page 101"], "url": "https://www.duchas.ie/en/cbes/5008877/4963013/5080398", "text": "\n(continued from previous page)\nMr Rea worked the saw mills for three years and when he had all the wood he could get out of the demesne gone he went away and sold the sawmills.All that is left to show us that sawmills were in Collon is a huge heap of sawdust, and the bare place where the trees were cut down.\n\n\n\nCollon Nail-makingAbout seventy years ago nail-making was carried on in Collon.The instruments the man who made them were an anvil, a vice and a nail rod which is a rod that is measured according to the length of the nail which is being made. When a nail was being made he cut it to the right length and sharpened it at one end.  Then he put it in a vice and hammered a head on it.This nail-maker did a fairly good trade\n(continues on next page)\n", "school_info": "School: Collon (Erasmus Smith)", "metadata": [{"Location:": "Collon, Co. Louth", "Teacher:": "\nE. Ní Earchadha\n"}, {"Informant": "Mr Emerson", "Gender": "male", "Address": "Collon, Co. Louth"}, {"Language": "English"}]}, "5008856/4961284/5082689": {"title": "Another Travelling Man - Paddy Peadar Thornton", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0671, Page 068", "Page 068"], "url": "https://www.duchas.ie/en/cbes/5008856/4961284/5082689", "text": "\n(continued from previous page)\nDoctor's in CB.Ham on one occassion. The Doctor and his wife were out no one was inside but the maid. She said she would let Paddy wait for his penny. Paddy after knocking a few times said, What do you mean? Do you think I hae nothing to do but wait for you here all day.Another story about him was that he missed his usual visit one week at the stationmaster's (Mr Hall, C.B.Ham). Mr Hall came out and gave him a penny. He looked at the penny and said :- I think you're forgetting that I didn't call last week\n\n\n\n30th June 1938CraftsNailersTold by Aaron McKennaC.B.HamThere were nails made in C.B.Ham up to the Great war and\n(continues on next page)\n", "school_info": "School: Stabannon, Castlebellingham", "metadata": [{"Location:": "Stabannan, Co. Louth", "Teacher:": "\nE. Mac Oisín\n"}, {"Informant": "Aaron Mc Kenna", "Gender": "male", "Age": "71", "Occupation": "seller", "Address": "Castlebellingham, Co. Louth"}, {"Language": "English"}]}, "4922387/4876552/5083261": {"title": "Flannel Industry in Sráid na Cathrach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0622, Page 260", "Page 260"], "url": "https://www.duchas.ie/en/cbes/4922387/4876552/5083261", "text": "\n(continued from previous page)\nWhen dyed it was also made into many other things.\n\n\n\nAbout forty years ago a man named Mick Steele lived in the Ennis Road Miltown Malbay.His trade was nail-making.He had a small little forge near the house and there he used to make the nails.This is how he used to make the nails.At first he used to put a length of steel wire into the fire and when it was red he would take it out.Then he would lay it on the anvil and cut off a piece equivalent to the length of a nail.Then he would put the piece of steel wire in the fire again and redden it.\n(continues on next page)\n", "school_info": "School: Sráid na Cathrach (B.)", "metadata": [{"Location:": "Milltown Malbay, Co. Clare", "Teacher:": "\nPádraig Ó Briain\n"}, {"Collector": "Arthur Mc Kenzie", "Gender": "male"}, {"Informant": "Alick Mc Kenzie", "Relation": "grandparent", "Gender": "male", "Age": "69"}, {"Language": "English"}]}, "5084100/5040688/5084376": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0971, Page 023", "Page 023"], "url": "https://www.duchas.ie/en/cbes/5084100/5040688/5084376", "text": "\nThere was a nailer's shop in town of Belturbet.It was carried on by Mr. Allen and his sons. They lived in Chapel Road.First he put a piece of iron in the fire. When it was red they cut it into the length required. Then they hit one end top make a point and the other to make a head. Mr. John Kennedy, Belturbet is a noted thatcher.\n", "school_info": "School: Staghall", "metadata": [{"Location:": "Staghall, Co. Cavan", "Teacher:": "\nG. Mc Govern\n"}, {"Collector": "Fergus Mc Govern", "Gender": "male", "Address": "Kilconny, Co. Cavan"}, {"Language": "English"}]}, "5083770/5039598/5084473": {"title": "Nail-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0967, Page 297", "Page 297"], "url": "https://www.duchas.ie/en/cbes/5083770/5039598/5084473", "text": "\nIn this town nails were made by a man named McCollock. He had his forge where the old school was in Church Street, He used to make them from an iron rod and sell them for ninepence per Ib.\n\n\n\nMargaret Fee used to spin wool and sell it. She had a little house for spinning it in. That was about ninety years ago.John Ross Knockadoose used to make soap and sell it. One of his daughters can make it yet.\n", "school_info": "School: Ballyconnell (B.)", "metadata": [{"Location:": "Ballyconnell, Co. Cavan", "Teacher:": "\nJames Mulligan\n"}, {"Informant": "Mr P. Carberry", "Gender": "male", "Address": "Snugborough, Co. Cavan"}, {"Language": "English"}]}, "5044809/5040642/5086405": {"title": "Old Crafts - Nail-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0970, Page 230", "Page 230"], "url": "https://www.duchas.ie/en/cbes/5044809/5040642/5086405", "text": "\nNail making was rarely carried out in this district. Any of it, that was carried on, was in forges. Nails were made from thin bars of iron, which were spun out to the thickness of ordinary wire, and cut the required length. Then it was put into the fire, and hardened. The heads were hammered on, and they were also pointed.Mr. Francis Allen, Station Road, Belturbet, was a nail maker, but he is dead now. He used to go out through the country selling them.\n\n\n\nFishing was carried on by the people. They mostly fished along the shore, because they had no boats. They fished for pikes and perches. Sometimes, they used nets or baskets to catch them. The  baits they used were worms, grubs, and sometimes frogs. The lines they used were fine ropes or wire. They used the fish for food. When they wanted to preserve them, they salted them,\n(continues on next page)\n", "school_info": "School: Drumkerl", "metadata": [{"Location:": "Drumkerril, Co. Cavan", "Teacher:": "\nMl. Mac Aoidh\n"}, {"Collector": "Philip Flood", "Gender": "male"}, {"Language": "English"}]}, "5070753/5059815/5092480": {"title": "Dyeing", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0990, Page 032", "Page 032"], "url": "https://www.duchas.ie/en/cbes/5070753/5059815/5092480", "text": "\n(continued from previous page)\nyears of the Great war, when continental dyes could not be obtained, home made dyes. One such dye was made by boiling the tops of young ash-tree \"shoots\". I am unaware what colour of dye this gave.\n\n\n\nNails though not made locally were made in Cavan town up to circ. 1880. The grandfather of the present Mr. B. Whelan, General merchant, Cavan was a nailer. The nailer used ling thin rods of iron. A number of these were kept constantly in the forge-fire. When red-hot a rod was withdrawn and pushed into a hole the depth of which corresponded to the length of nail required. The nail was then cut off a short piece longer than the required nail and with a few deft blows of the nailer's hammer the head was fashioned and the end sharpened, the whole taking only a matter of seconds. The busiest man to be seen working in those days was the nailer -  \"As busy as a nailer\". Blacksmiths also made their own supply of nails.\n\n\n\nUp to forty years ago loys were used extensively, though now they are not to be seen. The farmer shouldered his loy about 8 a.m. and without a meal went to his field and began digging. At 10 a.m. he ate his breakfast and returned to the field for the day.\n(continues on next page)\n", "school_info": "School: Drom an Mhadaidh", "metadata": [{"Location:": "Drumavaddy, Co. Cavan", "Teacher:": "\nS. Ó Murchadha\n"}, {"Language": "English"}]}, "5070791/5064151/5095664": {"title": "Old Crafts - Fire Cranes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1001, Page 058", "Page 058"], "url": "https://www.duchas.ie/en/cbes/5070791/5064151/5095664", "text": "\n(continued from previous page)\nThey have been making them for eight generations and there were eight Matthews in succession.\n\n\n\nPat, John and Thomas Reynolds were nail makers. John had his forge in a shed now owned by Micheal Reilly. The dust of the fire is to be seen on one of the walls yet. They had another forge in a shed now owned by Patrick Hopkins. They made sole nails, and carpenter's nails. A long nail called a nailrod was first put in the fire until it was red. Then it was taken out and hammered on the anvil to make a round edge on it. Next it is cut at whatever length was needed. Then the other end was put down in the anvil and a head was put on it. Next it was shot back out of (anvil) the hole that was in the anvil and it fell into a box.\n", "school_info": "School: Virginia (B)", "metadata": [{"Location:": "Virginia, Co. Cavan", "Teacher:": "\nE. Ó Raghallaigh\n"}, {"Collector": "Matthias O' Reilly", "Gender": "male", "Address": "Virginia, Co. Cavan"}, {"Informant": "Francis King", "Gender": "male", "Age": "48", "Address": "Deerpark, Co. Cavan"}, {"Language": "English"}]}, "5070805/5065891/5096415": {"title": "Composition - Old Crafts - Building and Nail-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1006, Page 048", "Page 048"], "url": "https://www.duchas.ie/en/cbes/5070805/5065891/5096415", "text": "\nPhil Smight's grandfather of Carnalynch was a well known mason and famous for \"drawing the smoke\", he was called \"Neil a Clabar\" as he often built houses with a sort of blue or yellow clay known as \"clabar\" in the  place of sand and lime. Pat Clarke of Beagh is called \"Pat the nailer\" because his father and grandfather were nailers by trade.\n\n\n\nIt is an usual custom for all marriages to take place before shrove Tuesday, after shrove Tuesday no marriages take place for seven weeks. June, the month of roses is held to be the luckiest month at all, but if you cannot be married in summer, November and December\n(continues on next page)\n", "school_info": "School: Carrickgorman", "metadata": [{"Location:": "Carrickgorman, Co. Cavan", "Teacher:": "\nM. Fleming\n"}, {"Collector": "James Cullen", "Gender": "male", "Address": "Togher, Co. Cavan"}, {"Informant": "Michael Traynor", "Gender": "male", "Age": "50", "Address": "Togher, Co. Cavan"}, {"Language": "English"}]}, "5070814/5066767/5097209": {"title": "Rope-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1009, Page 101", "Page 101"], "url": "https://www.duchas.ie/en/cbes/5070814/5066767/5097209", "text": "\n(continued from previous page)\nrake others with a twister.\n\n\n\nNails are made out of wire. They are filed and tops and heads put on them.\n\n\n\nwhip is made out of a cane covered with canvas and three ferrules on it a platted strap out of the top and a whang on the end of it.Whips long ago were made with rushes. They would tie a hand-full of rushes with another rush.\n", "school_info": "School: Corlea", "metadata": [{"Location:": "Corlea, Co. Cavan", "Teacher:": "\nT. Ó Mearáin\n"}, {"Collector": "Brigid Finegan", "Gender": "female", "Address": "Corlea, Co. Cavan"}, {"Informant": "Patrick Finegan", "Gender": "male", "Age": "65", "Address": "Corlea, Co. Cavan"}, {"Language": "English"}]}, "5009165/4993368/5103531": {"title": "The Nailer", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0758, Page 104", "Page 104"], "url": "https://www.duchas.ie/en/cbes/5009165/4993368/5103531", "text": "\nBetween Ballinamuck and Mohill at a place called the Nailers cross roads there lived a Nailer. He used to make nails for boots for both men and women. He used to charge sixpence for a set of nails for a man's pair of boots and four pence for a woman's set he used to count the nails. He used to buy the nail rod in Mohill every week and he used to get 9 or 10 pieces of nail rod 6 ft long and carry it home on his shoulders. That was 6 miles and he used to get some one with a cart to carry a stone of coal that was for making nails. He had a hearth and a bellows\n(continues on next page)\n", "school_info": "School: Gaigue (B.), Ballinamuck", "metadata": [{"Location:": "Gaigue, Co. Longford", "Teacher:": "\nPeter Duignan\n"}, {"Collector": "John Duffy", "Gender": "male", "Address": "Lettergonnell, Co. Longford"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "female", "Address": "Lettergonnell, Co. Longford"}, {"Language": "English"}]}, "5009203/4997389/5104103": {"title": "The Nail Industry", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0768, Page 048", "Page 048"], "url": "https://www.duchas.ie/en/cbes/5009203/4997389/5104103", "text": "\nThis is a very old industry which is still carried on in Longford by a man named Mc Cullagh who has a forge in Killashee St. His father died recently, Dan Reynolds Gt. Water St., (Kelly) and a Mr Kelly were all \"nailers\" which was the \"nickname\" given to men who made nails. The tools which he used were as follows - An anvil, a bellows, a fire, a hammer and the iron which was called the \"nail-rod\". The nailer made his nails in this way. He heated the \"nail-rod\" and then beat it into shape with the hammer and he broke off the \"nail-rod\" he had heated.\n", "school_info": "School: St Michael's, Longford", "metadata": [{"Location:": "Longford, Co. Longford", "Teacher:": "\nCathal Mac Maitiú\n"}, {"Collector": "J. Cooney", "Address": "Longford, Co. Longford"}, {"Informant": "Mr J. Murray", "Gender": "male", "Address": "Longford, Co. Longford"}, {"Language": "English"}]}, "5009174/4994280/5104491": {"title": "Nailers", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0760, Page 418", "Page 418"], "url": "https://www.duchas.ie/en/cbes/5009174/4994280/5104491", "text": "\nThere was a nailer named Gilronan who worked at Moyne and there was another named John Lord working at the trade in the adjoining townland of Fyhorak at the county  bridge between Longford and Cavan. The bridge is still called Lord's Bridge.     The nailer had a very busy time. He had no rest during working hours. The iron from which he made the nails was a very light round bar called \"nail-rod\". He cut the bar into lengths of about two feet and he put about six of those lengths into the fire together. When he took out one, he made three nails with the heat before putting it back into the fire again, then to took out the next rod and again made three nails & so on until he had taken out the six pieces then the first rod was ready again. (a nailer who was not able to make three nails with one heat was not counted a good tradesman)    At that time Carpenters used very little nails. They used wooden \"dowels\" instead so the nails most commonly made by the nailer were horse-shoeing nails.\n(continues on next page)\n", "school_info": "School: Leggah, Moyne", "metadata": [{"Location:": "Leggagh, Co. Longford", "Teacher:": "\nFrancis Gallagher\n"}, {"Collector": "Francis Gallagher", "Gender": "male", "Occupation": "teacher"}, {"Informant": "Mick Smyth", "Gender": "male", "Address": "Moyne, Co. Longford"}, {"Language": "English"}]}, "5008918/4966575/5106919": {"title": "Nailers' Forges", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0688, Page 008", "Page 008"], "url": "https://www.duchas.ie/en/cbes/5008918/4966575/5106919", "text": "\nNailers' ForgesWriter      Katie SherryClass           VIAge             14 yearsPatrick Keane on the road above the school and ____ Nolan next where the butcher's shop is now carried on the Business of Nailers.Lime was burned in Kilns in several places one Kiln in ruins at Lagore in the Lime Kiln, field.  There was also an old building, locally Known as the Pigeon House. in the field above the school which was probably a lime Kiln McGuley's carried on baking this was when Mrs Costello has the shop now and also did Gargan's in the room in which the Post-Office is now.  Shoemaking was also a great trade in the\n(continues on next page)\n", "school_info": "School: Ratoath", "metadata": [{"Location:": "Ratoath, Co. Meath", "Teacher:": "\nSeán S. Ó Ceallaigh\n"}, {"Collector": "Katie Sherry", "Gender": "female", "Age": "14"}, {"Language": "English"}]}, "5009049/4980982/5116304": {"title": "Old Crafts -  Dyes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0727, Page 039", "Page 039"], "url": "https://www.duchas.ie/en/cbes/5009049/4980982/5116304", "text": "\nGreen dye. Tops of the ash were cut off and put into water for three days with some weight to bruise down the sticks. At the of this time the sticks were taken away and green dye is left behind. Then clothes were steeped in it. Puce dye. The roots of a weed called Crow-foot were got, hot water poured on them and left in a hot place for three weeks. Then the roots are taken away and the dye is left behind.\n\n\n\nThere is a man named Mat Moyal who lives in the village of Rathwire in the parish of Killucan and he still has the craft of making nails. He gets wire, cuts it into little pieces, then he hammers them into  squares and last of all he makes them round. When he has done he points them.\n", "school_info": "School: Raharney (B.)", "metadata": [{"Location:": "Raharney, Co. Westmeath", "Teacher:": "\nS. Ó Conmhidhe\n"}, {"Language": "English"}]}, "5009047/4980917/5116985": {"title": "Old Crafts - Nail-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0726, Page 329", "Page 329"], "url": "https://www.duchas.ie/en/cbes/5009047/4980917/5116985", "text": "\nIn the house where Patrick Briody of Killpatrick now lives, I heard my Aunt say that a nailer made nails there. He had nail-rods about a half-inch thick, he reddened those and cut a nail out the length required. He put the nails into a mold to put a point on them. He sold boot-nails at 2 and a half d a 100. John Milady was his name and the crossroads is known as Milady's crossroads.\n", "school_info": "School: Johnstown", "metadata": [{"Location:": "Johnstown, Co. Westmeath", "Teacher:": "\nMrs Doherty\n"}, {"Collector": "Ciaran O' Farrell", "Gender": "male", "Age": "12", "Address": "Rickardstown, Co. Westmeath"}, {"Language": "English"}]}, "5009044/4980333/5118442": {"title": "Local Industries - Nail-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0725, Page 0326", "Page 0326"], "url": "https://www.duchas.ie/en/cbes/5009044/4980333/5118442", "text": "\nThere was an old industry in Clonmellon long ago, it was the making of nails, they were made by people of the name of Legates. They used to make them of a nail rod, a fire, and a light anvil.They used to make the nails and put them in a sack according to the weight, and sell them in the shops. They used to have contracts with big shops.While making these nails, they used to wear white paper caps and big black aprons.The last one of the Legates named Patrick Legate died about thirty years ago. Treasa De Bhond, Baile Nua\n", "school_info": "School: Cloran", "metadata": [{"Location:": "Cloran and Corcullentry, Co. Westmeath", "Teacher:": "\nSíle Flynn\n"}, {"Collector": "Treasa De Bhond", "Gender": "female", "Address": "Newtown, Co. Westmeath"}, {"Informant": "Mr John Bond", "Gender": "male", "Address": "Newtown, Co. Westmeath"}, {"Language": "English"}]}, "5009062/4982564/5119394": {"title": "Old Crafts", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0731, Page 121", "Page 121"], "url": "https://www.duchas.ie/en/cbes/5009062/4982564/5119394", "text": "\n(continued from previous page)\nhopper or box at the top and the handle was turned and the stones turned and the oats dribbled down between the stones and was ground into meal.  It would be sifted with an oatmeal seive then and the seeds were separated from the meal.  Joe Quinn Clonfad has two stones still that were used for that purpose - quern stones - they were called.The meal was made into bread and stirabout and the seeds into flummery.They used to strain the flummery with a straw strainer - a wisp of straw.\n\n\n\nJohny Gee and Joe Gee used to make nails in Tyrrellspass in Mick Killian's old house below Johny Hynses.They had a forge and a belows\n(continues on next page)\n", "school_info": "School: Dalystown", "metadata": [{"Location:": "Dalystown, Co. Westmeath", "Teacher:": "\nKathleen Grehan\n"}, {"Language": "English"}]}, "5009063/4982583/5119466": {"title": "Things Made Locally - Linen", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0731, Page 140", "Page 140"], "url": "https://www.duchas.ie/en/cbes/5009063/4982583/5119466", "text": "\n(continued from previous page)\ngrowing on his father's farm at Gneeve Beg in Castletown G. He helped to put it in a bog hole to steep and covered it with bog scraws & he and his brother went with it to a Scutching mill near Streamstown owned by John McCuttin a North man about 60 years ago.\n\n\n\nTwo doors from where Anne Clery's Boreen now is there lived two men named Gee, nailers by trade, about 40 years ago. They made the nails out of long iron (15 or 16ft) called nail rods they sold them to their customers. Little boys used to buy tops from them also at 3d. These men made both top and spoke. They also made boot nails & called them hob-nails. They made the crosses on the chapel gate.\n\n\n\nDown in my husband's land is a field known as the Brick yard. They used to dig holes and throw up the clay. The then turned this clay & threw water on it. This they called \"tempering\" it. Little bottom-less moulds, brick shaped\n(continues on next page)\n", "school_info": "School: Tyrrellspass (2)", "metadata": [{"Location:": "Tyrrellspass, Co. Westmeath", "Teacher:": "\nMrs Payne\n"}, {"Collector": "Elizabeth Payne", "Gender": "female", "Occupation": "teacher"}, {"Language": "English"}]}, "5009059/4982235/5119847": {"title": "Old Crafts - Nail Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0730, Page 396", "Page 396"], "url": "https://www.duchas.ie/en/cbes/5009059/4982235/5119847", "text": "\nNail-making.The local blacksmith made the horse-shoe nails with the hammer on the anvil. He converted worn old spades into long rods from which he hammered the nails into shape from the red-hot iron. When old spades were not available he often used old worn horse-shoes.Nail-makers had what was known as nail-rod, that is a piece of iron several feet long and about a quarter of an inch in width. This was heated and well-beaten and shaped on a small anvil. The required length was cut off by a sharp chisel, which was fixed on one end of the anvil then the shank was placed in a die and the head of the nail hammered into shape.The nail-makers sold the nails in Mullingar on the market-days. Nowadays the nails are bought in the hardware shops.\n", "school_info": "School: Knockaville", "metadata": [{"Location:": "Knockaville, Co. Westmeath", "Teacher:": "\nC. de Búrca\n"}, {"Language": "English"}]}, "5009088/4985419/5120834": {"title": "Old Crafts - Nail-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0738, Page 044", "Page 044"], "url": "https://www.duchas.ie/en/cbes/5009088/4985419/5120834", "text": "\nThere used to be a man living beside where I live.  The people put a nick name on him and called him the Nailer Haford.  He used not make any nails.The men in olden times used to make their own nails.  They had a forge for making them.  First they get a piece of wire or a bit of iron.  They put the wire or iron in the fire until it got red then it was taken out and made round.  A top was beaten on it with a hammer.  Nowadays people buy their own nails but they were cheaper if made at home.\n", "school_info": "School: Balrath", "metadata": [{"Location:": "Balrath, Co. Westmeath", "Teacher:": "\nBean Uí Oirghiall\n"}, {"Collector": "Kathleen Moore", "Gender": "female", "Address": "Ballynacarrigy, Co. Westmeath"}, {"Language": "English"}]}, "5009111/4987823/5130103": {"title": "Old Craft, Nailer - Ballymore", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0743, Page 249", "Page 249"], "url": "https://www.duchas.ie/en/cbes/5009111/4987823/5130103", "text": "\nThere was a man living in Ballymore about fifty years ago by the name of Cornelius Knight.  He lived in a little mud-wall cabin between Casey's and Moran's in the west end of the village of Ballymore.  He used to make nails and stay up the whole night.During the day he would go around and sell them.  It is said that he often made four pounds of nails in the night.  He would make them with an anvil and a bit of wire.  He would beat the wire with a hammer and cut it to whatever length he would want it.   Then he would have a file and he would file a point on it.  Knight lived to the age of ninety-six.  He had a very large family and many of them are married in the parish.\n", "school_info": "School: Ballymore (B.)", "metadata": [{"Location:": "Ballymore, Co. Westmeath", "Teacher:": "\nP.J. Cooney\n"}, {"Collector": "Michael Hanevy", "Gender": "male", "Address": "Mullenmeehan, Co. Westmeath"}, {"Informant": "Peter Cornelly", "Gender": "male", "Age": "65", "Address": "Ballymore, Co. Westmeath"}, {"Language": "English"}]}, "5009332/5007694/5131428": {"title": "Nail-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0899, Page 208", "Page 208"], "url": "https://www.duchas.ie/en/cbes/5009332/5007694/5131428", "text": "\nAmong the Industries of old candle-making and nailmaking are the only two that I have any knowledge of in this district.There were two nail-makers in this district. One of them John O'Neill can easily be remembered by the people of this village.He lived beside Mrs. Larkin. To manufacture nails a thin rod of iron was needed. It was placed in the fire.When it was red it was taken out and shaped into different kinds of nails for example, two, three, four, and six inch nails.The nails were shaped with an anvil not half as big as the smith's anvil. The nails usually made were brogue nails and those nails were far better than the nails nowadays. The people could hardly wear out a set of them.\n", "school_info": "School: Cluain Róiste", "metadata": [{"Location:": "Clonroche, Co. Wexford", "Teacher:": "\nPádraig S. Ó Dubhghaill\n"}, {"Informant": "James Maguire", "Gender": "male", "Age": "70", "Address": "Clonroche, Co. Wexford"}, {"Language": "English"}]}, "5009292/5005072/5133023": {"title": "Nail-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0889, Page 170", "Page 170"], "url": "https://www.duchas.ie/en/cbes/5009292/5005072/5133023", "text": "\nNail Making1.  Robert Morris and others2.  Ballycanew3.  Now dead. Others still live who knew the nailers4.  Shopkeeper and farmer5.  Ballycanew,  Ballycanew6.  Mr. Bass, Ballycanew, farmer still lives.  He also knew the nailersHe is the gentleman who owned one of the tanneries in BallyCanew years ago.Nail-making was carried on in Ballycanew up to about 45 years ago, in three houses and each employed a few hands.  The nails were used locally.  The last to give up this occupation was a man named Patchell whose grandson lived in Dublin up to a few years ago and was engaged as Turf Commission agent.  I do not know if he still lives but if so he should be about 52 or 53.  I do not know if any other descendant lives.\n(continues on next page)\n", "school_info": "School: Ballycanew (Mixed)", "metadata": [{"Location:": "Ballycanew, Co. Wexford", "Teacher:": "\nConchubhar Ua Maoláin\n"}, {"Informant": "Robert Morris", "Gender": "male", "Occupation": "shopkeeper", "Address": "Ballycanew, Co. Wexford"}, {"Language": "English"}]}, "5044711/5033489/5135426": {"title": "An Old Craft - Nail-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0914, Page 053", "Page 053"], "url": "https://www.duchas.ie/en/cbes/5044711/5033489/5135426", "text": "\nMy father, who is an old man told me that longago a man named James Walsh was a great nail maker lived in Boherboy a mile south of Dunlavin. His main occupation was making nails. He used to make two and six inch nails for woodwork, and for shoeing horses.He had a certain way for cutting out the shape of the nails. Then he would put the nails into the fire and hammer a flat head on it. He used to make square thin nails with long pointed tops on them for woodwork. When he had the nails finished he would put them into a big iron pot until he would get sale for them.\n", "school_info": "School: Dunlavin (B.)", "metadata": [{"Location:": "Dunlavin, Co. Wicklow", "Teacher:": "\nMícheál Ó Gogáin\n"}, {"Collector": "Christopher O' Toole", "Gender": "male", "Address": "Rathbawn, Co. Wicklow"}, {"Informant": "Mr J. Toole", "Gender": "male", "Age": "69", "Address": "Rathbawn, Co. Wicklow"}, {"Language": "English"}]}, "5044601/5025104/5141128": {"title": "Nail-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0807, Page 437", "Page 437"], "url": "https://www.duchas.ie/en/cbes/5044601/5025104/5141128", "text": "\nMara was the name of people that made nails in the olden days.Hw was a grandfather to the Maras [Tom Mara Church St Clara] that are living in Clara now.A man named Peter Flattery used to go to them to buy nails because his father was a shoemaker and he would have to work with nails.\n", "school_info": "School: Clara (2)", "metadata": [{"Location:": "Clara, Co. Offaly", "Teacher:": "\nBean Mhic Thomáis\n"}, {"Collector": "John Whitehead", "Gender": "male", "Address": "Erry (Maryborough), Co. Offaly"}, {"Language": "English"}]}, "4921600/4883500/5149387": {"title": "Candle-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0289, Page 304", "Page 304"], "url": "https://www.duchas.ie/en/cbes/4921600/4883500/5149387", "text": "\n(continued from previous page)\nof the mould by supporting it with a stick across the centre of the mouth of it. The wick was made by platting three linnen threads together. When all was fized they filled the mould with the melted lard out of the pipe of a tea pot. They let it set for a day or two, and then they heated the mould to the fire, and the candle slipped out. The only difference that were in those candles was that they were a yellower colour than the candles that are selling now.\n\n\n\nThere wasn't any nails made in Ireland long ago, and so the smiths of the locality made them themselves. The man who made them for this district was Mac Donell. He had a small forge in Schull, near where Mr Whitley lives now. He had a number of different shapes, one for horse shoe nails\n(continues on next page)\n", "school_info": "School: Lubhghortán (Lowertown), Scoil Mhuire", "metadata": [{"Location:": "Lowertown, Co. Cork", "Teacher:": "\nMáire, Bean Uí Mhathúna\n"}, {"Collector": "Annie Donovan", "Gender": "female"}, {"Informant": "Mrs John Donovan", "Gender": "female", "Age": "88", "Address": "Gunpoint, Co. Cork"}, {"Language": "English"}]}, "4921642/4887269/5152790": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0313, Page 122", "Page 122"], "url": "https://www.duchas.ie/en/cbes/4921642/4887269/5152790", "text": "\nNails were made in Timoleague by William Allman, father of George Allman who taught in Courtmacsherry school. He made them of wrought iron(pronounced rod-iron). He made all sorts of nails - for boots, boats, carpenters, machines. He used a small anvil with a hole in it and used to work very quickly. This is over 60 years ago. T. Holland says they bought nails as 4d or 8d lengths.\n\n\n\nThere was a midwife in Timoleague Mrs. Foley's sister(Mrs. O'Leary). She used to collect the urine from the houses where she was attending to women and carry it to Timoleague. They used it on the flannel for washing the grease out of the flannel and for thickening it. They called this work of thickening \"tucking\".\n", "school_info": "School: Boireann", "metadata": [{"Location:": "Burren, Co. Cork", "Teacher:": "\nEibhlín Ní Bhriain\n"}, {"Informant": "Timothy Holland", "Gender": "male", "Age": "61", "Address": "Clooncalla More, Co. Cork"}, {"Language": "English"}]}, "4921698/4891055/5162358": {"title": "A Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0326, Page 190", "Page 190"], "url": "https://www.duchas.ie/en/cbes/4921698/4891055/5162358", "text": "\n(continued from previous page)\nin this parish.  The tobairin Dearg is said to a be in the farm of Mrs. O'Donoghue, Church Cross.\n\n\n\nThere is only one nailer in this district now.  The man's name is Sullivan and makes nails at the bottom of Sleaveen Road, Macroom.  He is a very fast worker and he makes a couple of thousand nails in the day.  He sells them to shopkeepers, smiths or any others who need them.  He always has a little red fire of coke.  With every shoke of the hammer he used to turn his head to one side then to the other and he would keep doing that all day long from morning till night.  I think the Macroom nailer gave up making nails some time ago too so that there is no nailer there now.\n\n\n\nPannier-making was also an olden trade.  At first strong twigs were put standing in a circle in the ground.  Then the weak twigs were woven in and out between the stronger upstanding ones.  The bottom used to be made separately from the pannier in a different way.  Patsy Sullivan of Ardeen used to make them and sell loads of them\n(continues on next page)\n", "school_info": "School: Gurrane (B.)", "metadata": [{"Location:": "Clondrohid, Co. Cork", "Teacher:": "\nSeán Ó Loingsigh\n"}, {"Language": "English"}]}, "5162177/5161195/5162505": {"title": "Old Crafts - Candle-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0960, Page 206", "Page 206"], "url": "https://www.duchas.ie/en/cbes/5162177/5161195/5162505", "text": "\n(a) Some resin was melted in a pot caled a \"cam\" [?] Pieces of calico about six inches long were cut and twisted to be used for wicks. These were dipped into the \"cam\" and held at both ends by bits of sticks so that when one of the sticks was twisted the resin was wound around the cloth. This was done a couple of times till the candles were thick enough and they were left to dry.(b) Rushes were pulled and the green skin was taken off them. Some butter or lard was melted and the rushes were dipped in it. Then they were hung up to harden and dry.\n\n\n\nA nailer worked in a place like a forge. He would always have three or four nail-rods in the fire at the one time. He would take out the reddest one first and hammer a point on it. Then he would cut off the length he wanted and he would\n(continues on next page)\n", "school_info": "School: An t-Éadan Mór", "metadata": [{"Location:": "Edenmore, Co. Monaghan", "Teacher:": "\nS. Mac Philib\n"}, {"Collector": "John Joe Mc Kenna", "Gender": "male", "Address": "Ardnasallem, Co. Monaghan"}, {"Informant": "Mr Owen Smyth", "Gender": "male", "Age": "40", "Address": "Ardnasallem, Co. Monaghan"}, {"Language": "English"}]}, "4921914/4900178/5168490": {"title": "Old Crafts - Nail-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0394, Page 154", "Page 154"], "url": "https://www.duchas.ie/en/cbes/4921914/4900178/5168490", "text": "\nJames Fleming, nick-named the \"Titler,\" was a nailer and he lived in River Street.He reddened the rod iron which he bought in Cork. Then with a mould he made the head on it. He sold the nails at the fairs and markets which were held here long ago.Omitted:- He put the red hot iron on the anvil and by striking it with a hammer he made the points.\n", "school_info": "School: Cluain Uamha (C.)", "metadata": [{"Location:": "Cloyne, Co. Cork", "Teacher:": "\nE. Geeleher\n"}, {"Collector": "Annie Doolin", "Gender": "female", "Address": "Ballymaloe More, Co. Cork"}, {"Informant": "James Doolin", "Gender": "male", "Address": "Ballymaloe More, Co. Cork"}, {"Language": "English"}]}, "4811666/4810733/5170480": {"title": "Nailoring", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0342, Page 276", "Page 276"], "url": "https://www.duchas.ie/en/cbes/4811666/4810733/5170480", "text": "\nNailoring.Not so many years ago there were twenty nailors in the town, now there is none: the last died a year or two ago, and had not worked for several years.Hobnails \"crabbed heads\" were principally made.The rod-iron was imported.Disposal.The hobnails were sold to local shoemakers or to those in neighbouring towns. Millstreet, 13 miles north, was the last place where the hobnails used to be sold.\n", "school_info": "School: Maghcromtha (B.)", "metadata": [{"Location:": "Macroom, Co. Cork", "Teacher:": "\nPádraig Ó Deasmhumhna\n"}, {"Informant": "James Kelly", "Gender": "male", "Age": "62", "Address": "Masseytown, Co. Cork"}, {"Language": "English"}]}, "5162111/5155218/5170589": {"title": "Local Crafts - How Nails Were Made", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0535, Page 292", "Page 292"], "url": "https://www.duchas.ie/en/cbes/5162111/5155218/5170589", "text": "\n1.  Information received from:-  a. Mr. John Harty, Castle St.b. Mr Simon Spearman  Ormond St.To whom Told:-   Patricia McGrath  Kenyon St & M. Spearman Ormond St.Nails were made from Rod iron the best Swedish in fact these nails are in most of the old Nenagh houses and even to-day unbreakable.  The nails include hob nails for soles of boots, nails for timber work, slating and various purposes.William Hegarty of Pound Street Nenagh, had a nail factory in Pound Street up to four years ago.He used to make them with his hands.1  He got the raw iron.3  He heated it in the fire2  He cut it into small lengths4  He drew it out with his hammar until he had a specified nail made.\n", "school_info": "School: Clochar na Trócaire, Nenagh", "metadata": [{"Location:": "Nenagh, Co. Tipperary", "Teacher:": "\nAn tSr. Seanán\n"}, {"Collector": "Patricia Mc Grath", "Gender": "female", "Address": "Kenyon Street, Co. Tipperary"}, {"Collector": "Maureen Spearman", "Gender": "female", "Age": "13", "Address": "Ormond Street, Co. Tipperary"}, {"Informant": "Mr John Harty", "Gender": "male", "Address": "Pearse Street, Co. Tipperary"}, {"Informant": "Mr Simon Spearman", "Gender": "male", "Address": "Ormond Street, Co. Tipperary"}, {"Language": "English"}]}, "4921794/4907742/5179157": {"title": "Nail-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0367, Page 098", "Page 098"], "url": "https://www.duchas.ie/en/cbes/4921794/4907742/5179157", "text": "\nThere were two men able to make nails in Liscarroll.  Their names were Thomas Leahy and Jeremiah Sullivan  Thomas Leahy was making them where Canty's shop is now and Jeremiah Sullivan was making them where Mrs Linehan's house is now.  They used make nails and sell them to the people and the smiths.  A nailer's shop was like a small forge.  The nailer used long bars of iron which were very thin. These were called \"rod-iron\" from their shape. These he put in the fire and hammered them to nails.  These nails were in great demand by the local shoemakers and blacksmiths.  The nailers died about 45 years ago and the trade died with them.\n", "school_info": "School: Lios Uí Chearbhaill (B.), Malla", "metadata": [{"Location:": "Liscarroll, Co. Cork", "Teacher:": "\nConchobhar Ó Murchadha\n"}, {"Collector": "Christopher Flynn", "Gender": "male", "Address": "Liscarroll, Co. Cork"}, {"Informant": "Mrs O' Flynn", "Gender": "female", "Age": "58", "Address": "Liscarroll, Co. Cork"}, {"Language": "English"}]}, "4921895/4899300/5182447": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0390, Page 262", "Page 262"], "url": "https://www.duchas.ie/en/cbes/4921895/4899300/5182447", "text": "\nThe Cooney brothers Mick and Billy were nailers in Carrigaline.   Their father and grandfather carried on the same business in the same shop.   They made iron nails and did great business having to supply the requirements of the neighbouring districts. The machine made wire nail then came into favour and the iron nail trade began to decline.   They finished with the iron nail making in 1903.\n", "school_info": "School: Ringaskiddy (Mixed)", "metadata": [{"Location:": "Ringaskiddy, Co. Cork", "Teacher:": "\nPádraig Mac Suibhne\n"}, {"Collector": "Frank Mc Sweeney", "Gender": "male"}, {"Informant": "Margaret Connor", "Gender": "female", "Age": "84", "Occupation": "shopkeeper", "Address": "Carrigaline, Co. Cork"}, {"Language": "English"}]}, "4921897/4899399/5183943": {"title": "Nail-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0391, Page 070", "Page 070"], "url": "https://www.duchas.ie/en/cbes/4921897/4899399/5183943", "text": "\nLong ago the men of Carrigaline used to make nails. They first put bars of iron into the fire until they were red; they then took them out and made them into what ever shapes they wanted.\n\n\n\nIn Carrigaline the earth at each side of the bridge in the middle of the village is different. At the Kinsale side it is brown stone and at the Cork side it is lime stone. From the lime stone lime is made.    Long ago there were a great number of lime kilns in Carrigaline, but the remains are only now to be seen.    One was situated on the farm land of Mr Johnson; there was a big chimney on the top through which the lime stone were put in and a fire was lighted\n(continues on next page)\n", "school_info": "School: Clochar na Toirbhirte, Bun an tSábhairne, Corcaigh", "metadata": [{"Location:": "Crosshaven, Co. Cork", "Teacher:": "\nAn tSr. Caitríona\n"}, {"Collector": "Miss Angela O' Mahony", "Gender": "female", "Age": "14", "Occupation": "pupil", "Address": "Carrigaline, Co. Cork"}, {"Informant": "Miss M. O' Connor", "Gender": "female", "Age": "circa 80", "Address": "Carrigaline, Co. Cork"}, {"Language": "English"}]}, "5162184/5161948/5191053": {"title": "Trades and Occupations", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1018, Page 143", "Page 143"], "url": "https://www.duchas.ie/en/cbes/5162184/5161948/5191053", "text": "\nLeather - Tanning was carried on in this town Cootehill by a family named Cooney up to seventy years agoThe hide was first \"curried\". This was done by placing the hide in a tank of lime and water, until the hair was burned off. Then the \"curried\" hide was placed in the tan-hole and left there until it was sufficiently \"tanned\"  Then when it was \"tanned\" it was taken out and \"dressed\"\n\n\n\nNails were made here until about 20 years ago. They were made out of a fine rod of iron called \"nail-rod\".This was heated until red-hot. Then it was hammered to shape on an anvil called a \"stake\". Then it was put into a mould and hammered until a head was made on it.\n\n\n\nCandles were made here until 75 years ago. A large amount of fat was melted and poured into a mould and\n(continues on next page)\n", "school_info": "School: Cootehill (B)", "metadata": [{"Location:": "Cootehill, Co. Cavan", "Teacher:": "\nW. Healy\n"}, {"Informant": "Mr T. Mc Brien", "Gender": "male", "Address": "Cootehill, Co. Cavan"}, {"Informant": "M. Lynch", "Address": "Cootehill, Co. Cavan"}, {"Language": "English"}]}, "5162179/5161379/5191090": {"title": "Nail-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1015, Page 074", "Page 074"], "url": "https://www.duchas.ie/en/cbes/5162179/5161379/5191090", "text": "\nNail making was carried on in the next townland to up to thirty years ago by a family named Clarke called the \"Nailors.The place where they made the nails is still to be had. They made different kinds and lengths of nails, but the most common kind was slating nails and nails for boots.The method for making nails were as follows:- First the nail rod was cut into convenient lengths which were placed in the fire. When each rod was heated it was taken out of the fire and pointed and cut to the right length. The point was put into a mould while still hot the head was shaped with a hammer. It is now finished and dropped into a tin of water to cool. The nailed was a very\n(continues on next page)\n", "school_info": "School: Tunnyduff", "metadata": [{"Location:": "Tonyduff, Co. Cavan", "Teacher:": "\nMicheál Ó Cathaláin\n"}, {"Collector": "Bernard Smyth", "Gender": "male", "Address": "Cordoagh, Co. Cavan"}, {"Informant": "Philip Smyth", "Gender": "male", "Address": "Cordoagh, Co. Cavan"}, {"Language": "English"}]}, "5177612/5173171/5193009": {"title": "Nail-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0588, Page 179", "Page 179"], "url": "https://www.duchas.ie/en/cbes/5177612/5173171/5193009", "text": "\nNail-makingIt's  more than 60 years ago since a man named Clarke who lived in a small house situated on the side of the present Catholic Church in Whitegate made nails.He used thin bits of iron rods about a quarter of an inch square. He put some of these in the fire until they were white with heat. He then by means of a chisel and a hammer cut them into small pieces each the length of a nail. He had a piece of iron a foot in length and two inches in width, at the end of which was hole. He pointed the small pieces & then put the pointed end through the hole and hammered a head to it. This is how nails were made long ago.NB the above was got from Denis O'Brien, Kilkittaun, Whitegate.He heard foregoing from his mother - deceased.\n", "school_info": "School: Lakyle, Whitegate", "metadata": [{"Location:": "Lakyle, Co. Clare", "Teacher:": "\nJohn Davis\n"}, {"Informant": "Denis O' Brien", "Gender": "male", "Address": "Kilkittaun, Co. Clare"}, {"Language": "English"}]}, "4921805/4908812/5195974": {"title": "Con Duggan - Nailer", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0369, Page 401", "Page 401"], "url": "https://www.duchas.ie/en/cbes/4921805/4908812/5195974", "text": "\nCon Duggan was a Nailer by trade He worked int he village of Ballyclough and he lived in different places int he village from time to time and ended his life in the house where Miss Burke has her shop now. He had a little forge down at the end of the village for a long time and afterwards he had his forge at the corner of the shed when Phil Moloney had a stone cutter;s shop. This shed or shop was at the back of a house which has recently been built by Den OKeefe Creamery Manager. Con Duggan used to buy the iron from which the nails were maid in Mallow and he also got a good deal of his raw material by going out at night and stealing wire from the neighbouring fences. He made several types of nails for carpenters. Some of these were called \"Invisible Nails\" and were used in ceiling boards. He made boot nails for all the boot makers around the district including my grandfather. He made big nails for mensstrong boots and he called the \"Pavers\" He made a smaller\n(continues on next page)\n", "school_info": "School: Baile na gCloch", "metadata": [{"Location:": "Ballyclogh, Co. Cork", "Teacher:": "\nSeán Ó Héaluighthe\n"}, {"Collector": "Norah Walsh", "Gender": "female", "Address": "Ballyclogh, Co. Cork"}, {"Informant": "John Walsh", "Relation": "grandparent", "Gender": "male", "Age": "83", "Occupation": "shoemaker", "Address": "Ballyclogh, Co. Cork"}, {"Language": "English"}]}, "4921805/4908815/5195977": {"title": "Con Duggan - Nailer", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0369, Page 404", "Page 404"], "url": "https://www.duchas.ie/en/cbes/4921805/4908815/5195977", "text": "\nCon Duggan lived in Ballyclough. He had an anvil a hammer and he used to make nails out of wire He was an old man with a bit of a beard. He had a leather on his left thumb for holding the nails when he would be making them. He was a noted cardplayer Sometimes when he would be playing cards his wife would hold a looking glass behind the other people's back so that he could see his opponents cards to win the game. A great saying he had was \"if I had the wit of Lord Byrne I would make nails without iron\". The kind of nails he used to make were square one's. He used to sell a great amount of them for he was the only nailer around the place. He used to sell the nails to Mr Walsh for nailing the boots.\n", "school_info": "School: Baile na gCloch", "metadata": [{"Location:": "Ballyclogh, Co. Cork", "Teacher:": "\nSeán Ó Héaluighthe\n"}, {"Collector": "Abina Sheehan", "Gender": "female"}, {"Informant": "John Sheehan", "Relation": "parent", "Gender": "male", "Address": "Ballyclogh, Co. Cork"}, {"Language": "English"}]}, "4921807/4908997/5196955": {"title": "Making of Nails", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0369, Page 660", "Page 660"], "url": "https://www.duchas.ie/en/cbes/4921807/4908997/5196955", "text": "\nThis old craft was once in existence in a house Castle View Mallow. This house is at present occupied by a Mr. Hurley. The nails were handmade and it is said that Mr. Nolan, the nailer often made a hundred nails per day.This industry was also carried on by Jones Bros. Bridge Street a short distance from the aforesaid site. There is now no trace of these industries.\n", "school_info": "School: Clochar na Trócaire, Malla", "metadata": [{"Location:": "Mallow, Co. Cork", "Teacher:": "\nNa Siúracha\n"}, {"Informant": "Michael Dunlea", "Gender": "male", "Address": "Quartertown Lower, Co. Cork"}, {"Language": "English"}]}, "5177649/5176604/5202020": {"title": "Seancheardanna - Thatching", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0598, Page 047", "Page 047"], "url": "https://www.duchas.ie/en/cbes/5177649/5176604/5202020", "text": "\n(continued from previous page)\n& thus the butt is up,In thatching an old house the same operations are performed except that there no sewing.Thatches - back 50 - 80 yrs ago, Jos. Quinn of Woodcock Hill. Also Michl. Moran.At present Tim Mc Inerney (now 77 yrs) Derra, Meelick.(69 yrs) Mike Meara, Boston, \".63 \" Mike Mc Mahon, Moreen, \".Jos. White, Lower Meelick.\n\n\n\nMick Brawn, the first smith already mentioned, made his own horse-nails.He bought a bar of rod-iron. This had a square section, of dimensions sufficient to make head of mail. He reddened\n(continues on next page)\n", "school_info": "School: Meelick (B.)", "metadata": [{"Location:": "Meelick, Co. Clare", "Teacher:": "\nEoghan Ó Néill\n"}, {"Language": "English"}]}, "5260466/5255709/5267152": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0618C, Page 10_012", "Page 10_012"], "url": "https://www.duchas.ie/en/cbes/5260466/5255709/5267152", "text": "", "school_info": "School: Ballinalacken / Baile na Leacain", "metadata": [{"Location:": "Cloghaun, Co. Clare", "Teacher:": "\nPádraic S. Ó Cathail\n"}, {"Collector": "Peadar Mac Cunsaídin", "Gender": "male"}, {"Language": "Irish"}]}}