{"4428270/4390332/4435946": {"title": "A Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1032, Page 042", "Page 042"], "url": "https://www.duchas.ie/en/cbes/4428270/4390332/4435946", "text": "\nLong ago some people were supposed to have the power to change themselves into animals such as hares so that they could take away the butter and milk from their neighbours. One day there was a woman churning milk and while doing so she heard a noise outside. Out she went and saw a hare on the street, so going into the house she got the gun and shot the hare on the leg. Next day she went into her neighbours house and saw that the woman was quite lame and unable to walk.From that day out she knew that it was this woman who had taken her butter as she was a witch who could, when she pleased, turn herself into a hare.\n", "school_info": "School: Shannagh", "metadata": [{"Location:": "Shannagh, Co. Donegal", "Teacher:": "\nJ. Hutchman\n"}, {"Collector": "Kathleen Harron", "Gender": "female", "Age": "13"}, {"Informant": "Mr Joe Harron", "Relation": "relative (other than parent or grandparent)", "Gender": "male", "Age": "74", "Address": "Shannagh, Co. Donegal"}, {"Language": "English"}]}, "4427835/4348773/4436249": {"title": "A Folktale of Belcarra", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0095, Page 397", "Page 397"], "url": "https://www.duchas.ie/en/cbes/4427835/4348773/4436249", "text": "\nThere once lived a man named John Murphy alone Belcarra who had a son who was very fond of shooting wild ducks.One evening they were cutting oals when the son saw two wild ducks lying in a field next to them.So he went in to the house for his gun to shoot them.He cam eout and was about to shoot the ducks when the barrell of the gun bursted and put the grains in to hi seyes and he fell to the ground.When his fahter saw him lying on the ground he thougth he was dead but ran and found\n(continues on next page)\n", "school_info": "School: Manulla (Cailíní)", "metadata": [{"Location:": "Manulla, Co. Mayo", "Teacher:": "\nMáire Bairéad\n"}, {"Collector": "Francie Foye", "Gender": "male", "Address": "Knockmore Eighter, Co. Mayo"}, {"Informant": "Martin Clarke", "Gender": "male", "Age": "55", "Address": "Knockmore Eighter, Co. Mayo"}, {"Language": "English"}]}, "4428328/4396031/4460820": {"title": "Scéal 3 - Bean na Draíochta", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1047, Page 9", "Page 9"], "url": "https://www.duchas.ie/en/cbes/4428328/4396031/4460820", "text": "\nFad ó shoin bhí fear i Málainnbhig agus lá amhain chuaidh sé suas na Chethromóig [?] ag baint mónadh. Nuair a thainig ám-díneardha chuir bean a tíghe a ingean suas lé na chuid. Is bráchan a bhí leithí agus bhí sé istigh i gcopan. Bhí aibhleóg léithí fosda lé na phíopa dheárgadh. Dfág sí an aibhleóg i n-uachtar an bhachta agus thug sí an bráchan síos fhad leis an ait a rabh sé ag obair.Nuair a bhí chuid deánta aige chuaidh sé suas fhad leis an aibhleóig lé na phíopa dheárgadh.Chuaidh a n-ingean síos fhad lé poll uisge leis an chopan a níghe. Bhí bád mór amuigh ar an fhairrge agus arsa sise, “A áthair thiocfadh liomas an bhád sin a thabhairt isteach ar na carraigeachaibh sin shíos.” Lé sin thoisigh sí ag tabhairt thart is ag tabhairt thart an copan ar an pholl agus thoisigh na tonnaí ag bualadh in-agaidh an bhaid agus a chuir isteach ar na carraigeachaibh.“Stad de sin agus sábhal an bhád,” arsan t-athair. Thóg sí an copan agus shocruigh an fhairrge.“Cé d’fóghluim sin duit? arsa seisean. “Mhó mhathair,’ arsan cailín Bhal! gabh ‘bhaile thusa, arsa seisean, ‘soir do mhathair.”Chuaidh, acht ní fhachtas eisean ó’n lá sin go dtín lá indiú.\n", "school_info": "School: Sliabh Liag", "metadata": [{"Location:": "Meenavean, Co. Donegal", "Teacher:": "\nCaitlín Nic An tSaoir\n"}, {"Collector": "Éamonn Ua Gadhra", "Gender": "male"}, {"Informant": "Cait Ní Gadhra", "Relation": "grandparent", "Gender": "female", "Age": "90", "Address": "Meenavaghran, Co. Donegal"}, {"Language": "Irish"}]}, "4428279/4391207/4463821": {"title": "Scéal Fíor", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1034, Page 319", "Page 319"], "url": "https://www.duchas.ie/en/cbes/4428279/4391207/4463821", "text": "\nBhí  bean na comhnuidhe i nGuala dubhi bfad o shoin darb ainm Grainne . Bhí  muintir an toighe ar sibhal ag áirneal agus ni rabh duine ar bigh sa teach ach e i féin agus páiste a bhi sa  chliabhán.    Nuair a d'amarc Gráinne thart cé chonnaic sí ach a deirfear a bhi marbh, agus ag spreadhadh éadaigh gil ar lorg cosa na pearcaidh ar an urlar.                        Labhair Grainne in ainm  Dé leithe agus labhair sise le Grainne . Dubhairt si go rabh sí fá shuaimhneach ach luach dhá phunta olna a bhi aici le  tabhairt do Eamonn Ruadh agus dubhairt sí nach mbhead an phaiste a bhí sa clíaban an fada beo, agus ní rabh.\n", "school_info": "School: Cineal Conaill", "metadata": [{"Location:": "Garvagh, Co. Donegal", "Teacher:": "\nAntoin Ó Dochartaigh\n"}, {"Collector": "Peigí Ní Creag", "Gender": "female", "Address": "Cornaveagh, Co. Donegal"}, {"Informant": "Maigread Ní Creag", "Relation": "parent", "Gender": "female", "Age": "38", "Address": "Cornaveagh, Co. Donegal"}, {"Language": "Irish"}]}, "4428034/4370824/4475171": {"title": "Folk Tales - The King and His Sons", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0142, Page 55", "Page 55"], "url": "https://www.duchas.ie/en/cbes/4428034/4370824/4475171", "text": "", "school_info": "School: Eanach Mór", "metadata": [{"Location:": "Annagh More, Co. Mayo", "Teacher:": "\nMártain Ó Braonáin\n"}, {"Collector": "Mártain Ó Braonáin", "Gender": "male"}, {"Language": "Irish"}]}, "4428034/4370826/4475172": {"title": "Baint Feasa as Cnámh Slinneáin an Ghiorria", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0142, Page 57", "Page 57"], "url": "https://www.duchas.ie/en/cbes/4428034/4370826/4475172", "text": "\nThe seanachaidhe told me another story which I cannot give word for word but which was to this effect. The soldiers came to a certain house searching for Fr Sweeney. They had made a careful search but without avail and were about to leave the house, when one soldier took a hay fork and made a drive at some hay on a loft in the end of the house. On seeing this an old woman in the corner cried out \"Oh a mhuire they have the poor priest killed\" The soldiers then knew that the priest was on the loft and came back again. They found him and brought him away.It is a very bad sign to meet with a dead fish when you are going anywhere. The mor-\n(continues on next page)\n", "school_info": "School: Eanach Mór", "metadata": [{"Location:": "Annagh More, Co. Mayo", "Teacher:": "\nMártain Ó Braonáin\n"}, {"Collector": "Mártain Ó Braonáin", "Gender": "male"}, {"Language": "English"}]}, "4428259/4389222/4477321": {"title": "Tales of Long Ago", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1029, Page 218", "Page 218"], "url": "https://www.duchas.ie/en/cbes/4428259/4389222/4477321", "text": "\nI was a small boy when I heard the following story and I do not remember who told it to me. Long ago when witches and wizards lived there dwelt in this parish an old woman who was supposed to have dealings with the “wild fellow” (the devil). It was said that strange noises were heard in the little cottage in which this woman lived all alone. She always had money to pay for everything she bought and no one knew where she got it Stories were told about her, everybody shunned and she came to be known as “the one with the evil eye”. She was so much feared that mothers would tell their stubborn children if they were not good they would tell the “one with the evil eye” about them. This threat had always the desired effect on the children as they were that much afraid of her that they would pull the bedclothes o[fv]er their heads it night in case she would see them through her evil eye.One time a man, who was the father\n(continues on next page)\n", "school_info": "School: Gort na Carraige (Rockfield)", "metadata": [{"Location:": "Knocknashangan, Co. Donegal", "Teacher:": "\nNóra Nic Aodhagáin\n"}, {"Collector": "Marty Keegan", "Gender": "male", "Address": "Templenew, Co. Donegal"}, {"Language": "English"}]}, "4428304/4393088/4477860": {"title": "Witchcraft", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1039, Page 266", "Page 266"], "url": "https://www.duchas.ie/en/cbes/4428304/4393088/4477860", "text": "\nThis is the power of influencing the natural course of events. One day a long time ago the people of Killybegs conregated to-gether down on the street to watch a strange phenomenon. They were looking at a hen going along the street and she pulling a log after her. At this time the people believed in the Black Art. As they were looking at the strange happening a man came down from the hill behind the town with a creel on his back full of grass for his cow and it happened that there was a four leaved shamrock in the midst of the grass. When he came down on the street he went over to someone and asked what were they looking at. They said \"Do you not see the hen pulling the log after her?\" \"Not at all\" he said, \"you see that it is only a straw\" It is said that by the shamrocks he had in the creel he could see it plainly and that there was a wizard among the crowd that made the straw (log) appear to their eyes as a log.\n", "school_info": "School: Niall Mór", "metadata": [{"Location:": "Killybegs, Co. Donegal", "Teacher:": "\nB. Mac Niallghuis\n"}, {"Collector": "Moira Molloy", "Gender": "female", "Address": "Killybegs, Co. Donegal"}, {"Informant": "Mr Molloy", "Gender": "male", "Address": "Killybegs, Co. Donegal"}, {"Language": "English"}]}, "4428304/4393089/4477862": {"title": "Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1039, Page 267", "Page 267"], "url": "https://www.duchas.ie/en/cbes/4428304/4393089/4477862", "text": "\nStory ;- Their was an old woman living in Bridge Street Killybegs up until a few years ago when her death took place and she used to tell this story very often about her father. She said that one day her father was in the bog and he found a large pair of white Rosery Beads. She said that he took them home and kept them for a long time until on day while his mother was alone a small man came in to her and asked if she had any Rosery Beads to get fixed and she gave him the white ones to get fixed. She noticed that he put on beads the same kind of the ones that was on the Rosery Beads (on) in place of ones that was lost and when he had them fixed he thanked her and went away. When he went away they made inquiries (if) in the neighbourhood about and it is said that nobody even seen him and then they told Bishop that was in Killybegs giving Comfirmation and when he saw the beads he said that the beads were of the time of St Columcille and it is believed that he must have lost them and that it was St Columcille himself that came to the house to fix the beads. This happened in at Glencolumcille\n(continues on next page)\n", "school_info": "School: Niall Mór", "metadata": [{"Location:": "Killybegs, Co. Donegal", "Teacher:": "\nB. Mac Niallghuis\n"}, {"Collector": "Moira Molloy", "Gender": "female", "Address": "Killybegs, Co. Donegal"}, {"Informant": "Mrs Molloy", "Gender": "female", "Address": "Killybegs, Co. Donegal"}, {"Language": "English"}]}, "4428311/4393707/4479399": {"title": "The Witches' Cows", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1041, Page 271", "Page 271"], "url": "https://www.duchas.ie/en/cbes/4428311/4393707/4479399", "text": "\nIn my grandfather's old home, they used to keep several cows. During the night, the cows would be milked. My grandfather sat up, night after night, to catch the thief and although he could see no one around, the cows would have no milk in the morning. Every night, he carried his gun with him, but one particular night he loaded it, not with the usual change, but with sixpences. While watching, as usual a hare came into the cow shed and he fired, wounding it in the leg. It ran away limping but next morning, the cows had their usual supply of milk.Next day, it became known that a neighbour woman lay in her home with a broken leg. On investigation, it was found that traces of blood marked the way from where the hare had been shot to the house, where the woman lay with the broken leg. It was the poor unfortunate woman who had turned herself into a hare, who had been milking the cows.\n", "school_info": "School: Árd an Rátha (M.)", "metadata": [{"Location:": "Ardara, Co. Donegal", "Teacher:": "\nSinéad, Bean Uí Ghibhín\n"}, {"Informant": "Andrew Adair", "Gender": "male", "Age": "85", "Address": "Shanaghan, Co. Donegal"}, {"Language": "English"}]}, "4428332/4396463/4481753": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1048, Page 99", "Page 99"], "url": "https://www.duchas.ie/en/cbes/4428332/4396463/4481753", "text": "\nThe following story was told by Annie Campbell aged about 42 years who heard it from her father Patrick Campbell Hilltown Ardara aged 80 when he died. He heard the story from his parents about 60 years ago.There was a boy one time down in Loughrous Point and his body was covered with evil. One night a beggar man came to the house for lodging. He asked them if there was anything wrong in the house and he was told that there was a boy there who had \"the evil\". The beggarman said that he would make a cure for him in the morning. He said there were 18 kinds of evil. In the morning he went out and he got eighteen different kinds of herbs and he made 18 plasters of oatmeal and fresh butter and he put an herb into each plaster. He said that nine plasters would do but that he would make the eighteen. Then he asked for a piece of silver and he was given a sixpence. He said that this money would have to be put into ground that never was worked and never would be worked, so he went out above the house and buried the money between rocks. He said that so long as the money was not found the boy would be free from the evil. The money was never got and the boy never took \"the evil\" again.\n", "school_info": "School: An Tulach Mór", "metadata": [{"Location:": "Tully More, Co. Donegal", "Teacher:": "\nMáire, Bean Uí Bhrisleáin\n"}, {"Collector": "Theresa Higgins", "Gender": "female", "Age": "13", "Address": "Tully More, Co. Donegal"}, {"Informant": "Annie Campbell", "Gender": "female", "Age": "42", "Address": "Ardara, Co. Donegal"}, {"Informant": "Patrick Campbell", "Relation": "parent", "Gender": "male", "Age": "80", "Address": "Ardara, Co. Donegal"}, {"Language": "English"}]}, "4428333/4396194/4485017": {"title": "The Human Hare", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1048, Page 234", "Page 234"], "url": "https://www.duchas.ie/en/cbes/4428333/4396194/4485017", "text": "\nLong ago there lived a woman in the glen and she was suspected of being able to work magic. She used to go and take the milk from the neighbours cows. One day there were men hunting in the glen which is locally known as Bonyglen and they saw a woman. She turned herself into a hare and she ran towards a house in the glen. They shot her in the leg and it began to bleed. They followed the track of the blood until they reached a house. They went in and the saw a woman putting a bandage on her leg and they knew she was Ann Browne.1. Told by Peggy Moore, Loughfad, Clooney.2. Got from her father, James Moore, age 34 bliadhna3. 10.1.35\n", "school_info": "School: Scoil Dhalláin Forgaill", "metadata": [{"Location:": "Kilclooney Beg, Co. Donegal", "Teacher:": "\nS. Ó Baoighill\n"}, {"Collector": "Peggy Moore", "Gender": "female", "Address": "Loughfad, Co. Donegal"}, {"Informant": "James Moore", "Relation": "parent", "Gender": "male", "Age": "54", "Address": "Loughfad, Co. Donegal"}, {"Language": "English"}]}, "4428354/4398780/4487559": {"title": "The Power of Blinking", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1054, Page 410", "Page 410"], "url": "https://www.duchas.ie/en/cbes/4428354/4398780/4487559", "text": "\n410 The Power of BlinkingIt was commonly believed among the old people that this was the way a person got the power of blinking. (making use of the evil eye.)If a child was fed on the mother's breast and then weaned off and put back again it was believed the child had the power to blink. In order to prevent this the grandmother would take away the child until it would be properly weaned off and then there was no fear that it would be put on again. Nábla Nic AmhlaidhéRobertson N.S. Lettermacaward\n", "school_info": "School: Leitir Mhic an Bhaird (Robertson)", "metadata": [{"Location:": "Lettermacaward, Co. Donegal", "Teacher:": "\nNábla Nic Amhlaidhe\n"}, {"Collector": "Nábla Nic Amhlaidhé", "Gender": "female", "Occupation": "múinteoir"}, {"Language": "English"}]}, "4428376/4401530/4491981": {"title": "An Sagart Mór Ó Domhnaill as Ceann Caslach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1062, Page 99", "Page 99"], "url": "https://www.duchas.ie/en/cbes/4428376/4401530/4491981", "text": "", "school_info": "School: An Clochán Liath (Dungloe)", "metadata": [{"Location:": "Dunglow, Co. Donegal", "Teacher:": "\nDoiminic Ó Ceallaigh\n"}, {"Informant": "Pádraig Ó Dubhthaigh", "Gender": "male", "Age": "80", "Occupation": "feirmeoir", "Address": "Meenamanragh, Co. Donegal"}, {"Language": "Irish"}]}, "4428336/4396495/4499610": {"title": "Scéal Eile fá Oíche Bealtaine", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1049, Page 126", "Page 126"], "url": "https://www.duchas.ie/en/cbes/4428336/4396495/4499610", "text": "\nBhí fear i Mín na Coilleadh san t-sean am darb ainm Éaomonn Ó Cianaigh, agus bhí sé ag teacht abhaile an mhaidin seo. Bhí breacadh an lae ann. Ní raibh bróga ar bith air agus bhí sé ag siubhal ar an fhear ghlas ar thaobh an bhealaigh mhóir. De thairbhe sin ní raibh fuaim ar bith aige.Bhí sé ag teacht faoin fáithche ar an bhóthar idir Mín a'Bhealaigh agus Árd a'Rátha nuair a chonnaic sé fear ruimhe ar an rod. Bhí rópa cocaoin ag an fhear seo agus bhí sé ag tarraingt an rópa ar an driucht ar thaobh an bhóthair. San am ceudna bhí sé ag cainnt leis féin agus a radh \"uilig damsa\" \"uilig damsa\" do lean Éamonn é agus eisean a' radh \"an leath damsa\" \"an leath damhsa\"Ní fhaca an fear eile é ar chor ar bith agus i ndiaidh tamaill,\n(continues on next page)\n", "school_info": "School: Mín an Bhealaigh", "metadata": [{"Location:": "Meenavally, Co. Donegal", "Teacher:": "\nPádraig Mac Niallghuis\n"}, {"Informant": "Sean Ó Cíanaigh", "Gender": "male", "Age": "60", "Occupation": "feirmeoir", "Address": "Meenakillew, Co. Donegal"}, {"Language": "Irish"}]}, "4493633/4405862/4518369": {"title": "Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1075, Page 304", "Page 304"], "url": "https://www.duchas.ie/en/cbes/4493633/4405862/4518369", "text": "\nOnce upon a time there lived one hundred fishermen in Bruckless Bay. It was in the beginning of springtime when one day the fishermen began to get ready their boats before they would go out to fish. They were singing and telling stories when, one of them heard a banshee. \"Stop your singing\" says one of them. Do you not hear the banshee?Then they stopped and blessed themselves. Then they went out in their boats and it was very calm at first but, then, it grew very stormy and so stormy that the poor fishermen were all drowned. At that time there was an old witch going about who had come over from Scotland begging. The fishermen were very good to her and gave her all they could. But, when at length she grew bold the fishermen met and decided to give her nothing else. At this she grew angry and the night of the disaster she went up to a little cottage on the mountain where there was nobody in but a little girl. Her mother was away. Near midnight the had told the little girl to get her a basin of water and to put a bowl in it. Then she\n(continues on next page)\n", "school_info": "School: Más an Easa (C.)", "metadata": [{"Location:": "Masiness, Co. Donegal", "Teacher:": "\nMáire Ní Cholchuin\n"}, {"Collector": "Meave Mc Fadden", "Gender": "female"}, {"Informant": "Madge Mc Fadden", "Gender": "female", "Age": "50", "Address": "Ards, Co. Donegal"}, {"Language": "English"}]}, "4493649/4407634/4518496": {"title": "Droichead na bPíopaire", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1080, Page 312", "Page 312"], "url": "https://www.duchas.ie/en/cbes/4493649/4407634/4518496", "text": "", "school_info": "School: Rosguill & Doe Branch I.N.T.O.", "metadata": [{"Location:": "Rosguill, Co. Donegal", "Teacher:": "\nT. Mc Ginley\n"}, {"Collector": "Máire Nic Eiteagáin", "Gender": "female", "Address": "Glenree, Co. Donegal"}, {"Language": "Irish"}]}, "4493672/4409635/4519117": {"title": "Sally Carr (A Witch)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1087, Page 010", "Page 010"], "url": "https://www.duchas.ie/en/cbes/4493672/4409635/4519117", "text": "\nGortmacall is a townland about a half a mile west of Milford. In this place there lived a local witch called Sally Carr, three hundred years ago. She did a good many evil deeds in the district. No matter how much people churned they could never get any butter because it was said that Sally took it from the churn, She took\n(continues on next page)\n", "school_info": "School: Baile na nGalloglach (Milford)", "metadata": [{"Location:": "Millford, Co. Donegal", "Teacher:": "\nTadhg Ó Súilleabháin\n"}, {"Informant": "Denis Sweeney", "Gender": "male", "Age": "73", "Address": "Millford, Co. Donegal"}, {"Language": "English"}]}, "4493673/4409738/4520411": {"title": "Sally Carr", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1087, Page 113", "Page 113"], "url": "https://www.duchas.ie/en/cbes/4493673/4409738/4520411", "text": "\nOnce upon a time there lived a woman in Gortmacall called Sally Carr. She had the power of a with and could milk the tether and she could also turn herself into the form of a hare. This woman had always milk and butter yet she never kept animals. The neighbours were all discontented because they thought she was getting the milk from their cows.One day two men from Milford went to shoot rabbits. On their way they saw this hare and they fired but missed it. They saw it again and fired but missed. After trying a few times they said they would ho home and melt some silver and make a bullet.They melted the silver and went out again this time they saw the hare and shot it. They hit the hare in the leg. The hare ran till it came to Sally's house. The hare jumped through Sally's window and when they came to the house they knocked at the door.Sally told them to come in and when they went in she was in bed with\n(continues on next page)\n", "school_info": "School: Milford", "metadata": [{"Location:": "Millford, Co. Donegal", "Teacher:": "\nJames Mc Veigh\n"}, {"Collector": "Iris Diver", "Gender": "female", "Address": "Millford, Co. Donegal"}, {"Informant": "James Diver", "Gender": "male", "Age": "45", "Address": "Millford, Co. Donegal"}, {"Language": "English"}]}, "4493673/4409740/4520412": {"title": "Sally Carr", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1087, Page 115", "Page 115"], "url": "https://www.duchas.ie/en/cbes/4493673/4409740/4520412", "text": "\nAbout forty or fifty years ago there lived a witch in Gortmacall called Sally Carr. One day a farmer went ou tto milk his cows and when he went out to the byre there was a large hare sitting behind the cows. This hare was not like the ordinary hare it was a black one. When this hare saw the man it ran away. He milked the cows bu the noticed they did not give as much milk this night as they did any other night.The farmer came to a conclusion that it must have been a witch which was in the byre. He knew it took silver to shoot a witch so he broke up a sixpence and loaded the gun. Next night he went out to the byre again and there was the hare sitting behind the cows. It again ran away but he fired and hit it. He saw some blood in the direction it ran so he followed through hedges and over burns until he came to the end of the trail. The blood was lying at Sally's door so he went in. Here he found Sally in bed with a sore leg.\n", "school_info": "School: Milford", "metadata": [{"Location:": "Millford, Co. Donegal", "Teacher:": "\nJames Mc Veigh\n"}, {"Collector": "Iris Diver", "Gender": "female", "Address": "Millford, Co. Donegal"}, {"Language": "English"}]}, "4493731/4415145/4528570": {"title": "Dreams", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1104, Page 80", "Page 80"], "url": "https://www.duchas.ie/en/cbes/4493731/4415145/4528570", "text": "\n1. If you dream about blood you will be sure to get money. 2.  If you dream about crying you will be laughing.3. It's unlucky to dream about geese.4.  If you dream about a rabbit or hare it is an unlucky journey.5.  If you dream of driving cattle you will make money.6.  If you dream of drinking clear water means peace and happiness.7.  If you dream about nursing a baby it is bad luck.8.  If you dream about birds you will go a journey.9. If a girl dreams about a bride, she will be rich, but a widow early.10.  If you dream about chocolate you will have an enjoyable and peaceful life. 11.  If you dream about crying you will hear good news. 12.  If you dream about a funeral it is a near death of a dear one. 13.  If you dream of dispute you will soon quarrel with a friend or sweetheart.\n", "school_info": "School: Ráth Séideóg", "metadata": [{"Location:": "Rashedoge, Co. Donegal", "Teacher:": "\nBrighid Ní Dhomhnaill\n"}, {"Language": "English"}]}, "4493731/4415146/4528571": {"title": "Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1104, Page 81", "Page 81"], "url": "https://www.duchas.ie/en/cbes/4493731/4415146/4528571", "text": "\nThere was a boy named Paddy lived in Ireland. He had a good donkey, he thought if he would bring the donkey to Scotland that he would get a good price for it. As he was going up the street in Glasgow a great big Scotch man put his head out of a window and asked what are the donkeys going now \"Paddy  Paddy\" said a great big one like you would fetch a good price.\n\n\n\nWhen you see the new moon you should say. I see the new moon And the new moon see's meGod bless the new moonAnd God bless me\n\n\n\nWhat ever you have in your hand when you see the new moon first; you will have plenty of that before the next new moon comes.\n", "school_info": "School: Ráth Séideóg", "metadata": [{"Location:": "Rashedoge, Co. Donegal", "Teacher:": "\nBrighid Ní Dhomhnaill\n"}, {"Language": "English"}]}, "4493731/4415146/4528572": {"title": "Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1104, Page 81", "Page 81"], "url": "https://www.duchas.ie/en/cbes/4493731/4415146/4528572", "text": "\nThere was a boy named Paddy lived in Ireland. He had a good donkey, he thought if he would bring the donkey to Scotland that he would get a good price for it. As he was going up the street in Glasgow a great big Scotch man put his head out of a window and asked what are the donkeys going now \"Paddy  Paddy\" said a great big one like you would fetch a good price.\n\n\n\nWhen you see the new moon you should say. I see the new moon And the new moon see's meGod bless the new moonAnd God bless me\n\n\n\nWhat ever you have in your hand when you see the new moon first; you will have plenty of that before the next new moon comes.\n", "school_info": "School: Ráth Séideóg", "metadata": [{"Location:": "Rashedoge, Co. Donegal", "Teacher:": "\nBrighid Ní Dhomhnaill\n"}, {"Language": "English"}]}, "4493731/4415146/4528573": {"title": "Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1104, Page 81", "Page 81"], "url": "https://www.duchas.ie/en/cbes/4493731/4415146/4528573", "text": "\nThere was a boy named Paddy lived in Ireland. He had a good donkey, he thought if he would bring the donkey to Scotland that he would get a good price for it. As he was going up the street in Glasgow a great big Scotch man put his head out of a window and asked what are the donkeys going now \"Paddy  Paddy\" said a great big one like you would fetch a good price.\n\n\n\nWhen you see the new moon you should say. I see the new moon And the new moon see's meGod bless the new moonAnd God bless me\n\n\n\nWhat ever you have in your hand when you see the new moon first; you will have plenty of that before the next new moon comes.\n", "school_info": "School: Ráth Séideóg", "metadata": [{"Location:": "Rashedoge, Co. Donegal", "Teacher:": "\nBrighid Ní Dhomhnaill\n"}, {"Language": "English"}]}, "4493731/4415147/4528574": {"title": "Guesses", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1104, Page 82", "Page 82"], "url": "https://www.duchas.ie/en/cbes/4493731/4415147/4528574", "text": "\nIts long and its narrow and its not very wide it wears a green border on every side. A road. As round as an apple as deep as a cup and all the men in Derry couldn't lift it up.  A well.Why does a cow look over the hill?Because she cannot see through it. What was a \"foot\" last night?Twelve inches.Four feet up and four feet downsoft in the middle and hard all roundA bed.They cut my hair and shaved my face and left me in a naked place.A peat.Round the house and peeps in every hole and never touches the house. The Sun.As I went up the heathry hill I met a row of bullocks they were all tick tacket and all yellow backed.A swarm of bees.\n", "school_info": "School: Ráth Séideóg", "metadata": [{"Location:": "Rashedoge, Co. Donegal", "Teacher:": "\nBrighid Ní Dhomhnaill\n"}, {"Language": "English"}]}, "4493731/4415149/4528577": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1104, Page 84", "Page 84"], "url": "https://www.duchas.ie/en/cbes/4493731/4415149/4528577", "text": "\nColm Cille prophecied that there would be a Battle fought in a field called (Droulin) which is in Drimacanoo and that the Mill-wheel was to turn three times with blood. This battle was supposed to be a a part of the battle of Scaraiff Hollis.\n\n\n\nThere is a story told that a man was digging in a hill and he found a pot of gold. He saw another man coming towards him so he closed the hole again until the man would go away. But when the man did go the other came back to see about the gold but he never saw it again. This gold supposed to be found by a red haired man sometime in the future.\n\n\n\nThere is a man the name of James Harkin living in Tullyhullion. He has found a number of stone instruments in his moss. While a number of men were cutting turf in Paddy Sams moss they found a dead man's body rolled up in flannel. But once they took the body out it crumbled away to dust.\n", "school_info": "School: Ráth Séideóg", "metadata": [{"Location:": "Rashedoge, Co. Donegal", "Teacher:": "\nBrighid Ní Dhomhnaill\n"}, {"Language": "English"}]}, "4493731/4415149/4528578": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1104, Page 84", "Page 84"], "url": "https://www.duchas.ie/en/cbes/4493731/4415149/4528578", "text": "\nColm Cille prophecied that there would be a Battle fought in a field called (Droulin) which is in Drimacanoo and that the Mill-wheel was to turn three times with blood. This battle was supposed to be a a part of the battle of Scaraiff Hollis.\n\n\n\nThere is a story told that a man was digging in a hill and he found a pot of gold. He saw another man coming towards him so he closed the hole again until the man would go away. But when the man did go the other came back to see about the gold but he never saw it again. This gold supposed to be found by a red haired man sometime in the future.\n\n\n\nThere is a man the name of James Harkin living in Tullyhullion. He has found a number of stone instruments in his moss. While a number of men were cutting turf in Paddy Sams moss they found a dead man's body rolled up in flannel. But once they took the body out it crumbled away to dust.\n", "school_info": "School: Ráth Séideóg", "metadata": [{"Location:": "Rashedoge, Co. Donegal", "Teacher:": "\nBrighid Ní Dhomhnaill\n"}, {"Language": "English"}]}, "4493731/4415149/4528579": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1104, Page 84", "Page 84"], "url": "https://www.duchas.ie/en/cbes/4493731/4415149/4528579", "text": "\nColm Cille prophecied that there would be a Battle fought in a field called (Droulin) which is in Drimacanoo and that the Mill-wheel was to turn three times with blood. This battle was supposed to be a a part of the battle of Scaraiff Hollis.\n\n\n\nThere is a story told that a man was digging in a hill and he found a pot of gold. He saw another man coming towards him so he closed the hole again until the man would go away. But when the man did go the other came back to see about the gold but he never saw it again. This gold supposed to be found by a red haired man sometime in the future.\n\n\n\nThere is a man the name of James Harkin living in Tullyhullion. He has found a number of stone instruments in his moss. While a number of men were cutting turf in Paddy Sams moss they found a dead man's body rolled up in flannel. But once they took the body out it crumbled away to dust.\n", "school_info": "School: Ráth Séideóg", "metadata": [{"Location:": "Rashedoge, Co. Donegal", "Teacher:": "\nBrighid Ní Dhomhnaill\n"}, {"Language": "English"}]}, "4493731/4415150/4528580": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1104, Page 85", "Page 85"], "url": "https://www.duchas.ie/en/cbes/4493731/4415150/4528580", "text": "\nAnother time while men were cutting turf in a hill called \"Greagory\" they discovered a crock of butter.\n\n\n\nThere is a rock in Glenkeeragh called the \"Altar lea\" where Mass was said in the Penal Days.\n\n\n\nIf a cat washes her face it is said to be a sign of rain. If a pot cracks it is the sign that a stranger is coming to the house.\n\n\n\nBanshee's wail is a crying which follows some families of people.Lights follow other families of people before a death occurs.\n\n\n\nThere was a man in Fahykeen found a bell while scattering clay in his field. It is supposed to be a beautiful Mass Bell.\n\n\n\nMany years ago in the townland of Prucklish Co Donegal an old lady was walking in a field. Suddenly a little baby appeared to her and spoke.It told her it was an angel from\n(continues on next page)\n", "school_info": "School: Ráth Séideóg", "metadata": [{"Location:": "Rashedoge, Co. Donegal", "Teacher:": "\nBrighid Ní Dhomhnaill\n"}, {"Language": "English"}]}, "4493731/4415150/4528583": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1104, Page 85", "Page 85"], "url": "https://www.duchas.ie/en/cbes/4493731/4415150/4528583", "text": "\nAnother time while men were cutting turf in a hill called \"Greagory\" they discovered a crock of butter.\n\n\n\nThere is a rock in Glenkeeragh called the \"Altar lea\" where Mass was said in the Penal Days.\n\n\n\nIf a cat washes her face it is said to be a sign of rain. If a pot cracks it is the sign that a stranger is coming to the house.\n\n\n\nBanshee's wail is a crying which follows some families of people.Lights follow other families of people before a death occurs.\n\n\n\nThere was a man in Fahykeen found a bell while scattering clay in his field. It is supposed to be a beautiful Mass Bell.\n\n\n\nMany years ago in the townland of Prucklish Co Donegal an old lady was walking in a field. Suddenly a little baby appeared to her and spoke.It told her it was an angel from\n(continues on next page)\n", "school_info": "School: Ráth Séideóg", "metadata": [{"Location:": "Rashedoge, Co. Donegal", "Teacher:": "\nBrighid Ní Dhomhnaill\n"}, {"Language": "English"}]}, "4493731/4415150/4528584": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1104, Page 85", "Page 85"], "url": "https://www.duchas.ie/en/cbes/4493731/4415150/4528584", "text": "\nAnother time while men were cutting turf in a hill called \"Greagory\" they discovered a crock of butter.\n\n\n\nThere is a rock in Glenkeeragh called the \"Altar lea\" where Mass was said in the Penal Days.\n\n\n\nIf a cat washes her face it is said to be a sign of rain. If a pot cracks it is the sign that a stranger is coming to the house.\n\n\n\nBanshee's wail is a crying which follows some families of people.Lights follow other families of people before a death occurs.\n\n\n\nThere was a man in Fahykeen found a bell while scattering clay in his field. It is supposed to be a beautiful Mass Bell.\n\n\n\nMany years ago in the townland of Prucklish Co Donegal an old lady was walking in a field. Suddenly a little baby appeared to her and spoke.It told her it was an angel from\n(continues on next page)\n", "school_info": "School: Ráth Séideóg", "metadata": [{"Location:": "Rashedoge, Co. Donegal", "Teacher:": "\nBrighid Ní Dhomhnaill\n"}, {"Language": "English"}]}, "4493731/4415150/4528587": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1104, Page 85", "Page 85"], "url": "https://www.duchas.ie/en/cbes/4493731/4415150/4528587", "text": "\nAnother time while men were cutting turf in a hill called \"Greagory\" they discovered a crock of butter.\n\n\n\nThere is a rock in Glenkeeragh called the \"Altar lea\" where Mass was said in the Penal Days.\n\n\n\nIf a cat washes her face it is said to be a sign of rain. If a pot cracks it is the sign that a stranger is coming to the house.\n\n\n\nBanshee's wail is a crying which follows some families of people.Lights follow other families of people before a death occurs.\n\n\n\nThere was a man in Fahykeen found a bell while scattering clay in his field. It is supposed to be a beautiful Mass Bell.\n\n\n\nMany years ago in the townland of Prucklish Co Donegal an old lady was walking in a field. Suddenly a little baby appeared to her and spoke.It told her it was an angel from\n(continues on next page)\n", "school_info": "School: Ráth Séideóg", "metadata": [{"Location:": "Rashedoge, Co. Donegal", "Teacher:": "\nBrighid Ní Dhomhnaill\n"}, {"Language": "English"}]}, "4493731/4415150/4528588": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1104, Page 85", "Page 85"], "url": "https://www.duchas.ie/en/cbes/4493731/4415150/4528588", "text": "\nAnother time while men were cutting turf in a hill called \"Greagory\" they discovered a crock of butter.\n\n\n\nThere is a rock in Glenkeeragh called the \"Altar lea\" where Mass was said in the Penal Days.\n\n\n\nIf a cat washes her face it is said to be a sign of rain. If a pot cracks it is the sign that a stranger is coming to the house.\n\n\n\nBanshee's wail is a crying which follows some families of people.Lights follow other families of people before a death occurs.\n\n\n\nThere was a man in Fahykeen found a bell while scattering clay in his field. It is supposed to be a beautiful Mass Bell.\n\n\n\nMany years ago in the townland of Prucklish Co Donegal an old lady was walking in a field. Suddenly a little baby appeared to her and spoke.It told her it was an angel from\n(continues on next page)\n", "school_info": "School: Ráth Séideóg", "metadata": [{"Location:": "Rashedoge, Co. Donegal", "Teacher:": "\nBrighid Ní Dhomhnaill\n"}, {"Language": "English"}]}, "4493731/4415152/4528591": {"title": "Holy Wells", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1104, Page 87", "Page 87"], "url": "https://www.duchas.ie/en/cbes/4493731/4415152/4528591", "text": "\nThere is a holy well in Cnoc a Tighe.\" There is one in Conwall and if you are angry and wash your hands in it, the anger will leave you. There is Doon well and also an old well in Templedouglas that was closed up. The time it was open there was a public house near, and when the men were coming from the \"turas\" they would get drink. So, when the Bishop heard he ordered it to be closed.\n\n\n\n1. When donkeys bray more than usual.2. Hens are restless and uneasy.3. The moon has a ring around it.4. Dogs and cats lie before the fire.5. Ducks quack louder and oftener thn usual.6. Frogs croak loudly.7. The crows gather to one end of the field.\n(continues on next page)\n", "school_info": "School: Ráth Séideóg", "metadata": [{"Location:": "Rashedoge, Co. Donegal", "Teacher:": "\nBrighid Ní Dhomhnaill\n"}, {"Collector": "Nora Kelly", "Gender": "female", "Age": "13", "Address": "Foxhall, Co. Donegal"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "female", "Address": "Foxhall, Co. Donegal"}, {"Language": "English"}]}, "4493731/4415152/4528592": {"title": "Holy Wells", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1104, Page 87", "Page 87"], "url": "https://www.duchas.ie/en/cbes/4493731/4415152/4528592", "text": "\nThere is a holy well in Cnoc a Tighe.\" There is one in Conwall and if you are angry and wash your hands in it, the anger will leave you. There is Doon well and also an old well in Templedouglas that was closed up. The time it was open there was a public house near, and when the men were coming from the \"turas\" they would get drink. So, when the Bishop heard he ordered it to be closed.\n\n\n\n1. When donkeys bray more than usual.2. Hens are restless and uneasy.3. The moon has a ring around it.4. Dogs and cats lie before the fire.5. Ducks quack louder and oftener thn usual.6. Frogs croak loudly.7. The crows gather to one end of the field.\n(continues on next page)\n", "school_info": "School: Ráth Séideóg", "metadata": [{"Location:": "Rashedoge, Co. Donegal", "Teacher:": "\nBrighid Ní Dhomhnaill\n"}, {"Collector": "Nora Kelly", "Gender": "female", "Age": "13", "Address": "Foxhall, Co. Donegal"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "female", "Address": "Foxhall, Co. Donegal"}, {"Language": "English"}]}, "4493731/4415153/4528593": {"title": "Signs of Weather", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1104, Page 88", "Page 88"], "url": "https://www.duchas.ie/en/cbes/4493731/4415153/4528593", "text": "\n(continued from previous page)\n8. Soot falls down the chimney.9. Some kinds of flowers close up.10. Seagulls are to be seen flying about.11. Swallows fly very low.12. The smoke of chimneys blow down to the ground. When there is going to be good weather.1. The moon is very clear.2. The smoke goes up in a straight line.3. Bats are about late in the evening. When it is going to be cold.1. Robins come near the doors.2. The fire burns very bright.\n\n\n\nIt is unlucky to hit a beast with an \"elder\" stick. It is unlucky for a girl to stumble on entering her home after being married. It is lucky to loose money, but unlucky to find it. It is unlucky to meet a red-haired when going on a journey. It is lucky to find iron and to have a horseshoe\n(continues on next page)\n", "school_info": "School: Ráth Séideóg", "metadata": [{"Location:": "Rashedoge, Co. Donegal", "Teacher:": "\nBrighid Ní Dhomhnaill\n"}, {"Collector": "Nora Kelly", "Gender": "female", "Age": "13", "Address": "Foxhall, Co. Donegal"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "female", "Address": "Foxhall, Co. Donegal"}, {"Language": "English"}]}, "4493731/4415154/4528595": {"title": "Unlucky and Lucky Things", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1104, Page 89", "Page 89"], "url": "https://www.duchas.ie/en/cbes/4493731/4415154/4528595", "text": "\n(continued from previous page)\nin the house. It is unlucky to clean out the byre on a Friday. It is lucky if a real black cat comes to the house. It is unlucky to sweep the floor or throw out water after sunset.\n\n\n\nAbout half way between Tullyhullion and Glen Swilly Chapel, on the Cashelreagh hill there is a holly bush. At this bush mass was read long ago when the priests were being pursued. They read mass in places where they could see all around. This holly bush is up on the hill and if you were standing beside it you would see for miles around. The reason that they read mass in such a place was because they wouldnt be taken unawares by the enemy. Beside the bush is a little hollow, and several large stones are all about, There is one oblong flag with a very flat, level surface. This may be the one on which mass was read.\n", "school_info": "School: Ráth Séideóg", "metadata": [{"Location:": "Rashedoge, Co. Donegal", "Teacher:": "\nBrighid Ní Dhomhnaill\n"}, {"Collector": "Nora Kelly", "Gender": "female", "Age": "13", "Address": "Foxhall, Co. Donegal"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "female", "Address": "Foxhall, Co. Donegal"}, {"Language": "English"}]}, "4493732/4414900/4529037": {"title": "Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1104, Page 154", "Page 154"], "url": "https://www.duchas.ie/en/cbes/4493732/4414900/4529037", "text": "\nThere was a man from Glenswilly hired in the Lagan one time. His name was Paddy Jones. There was an old woman living in the house. This woman was a witch and every night after Paddy went to bed she said some words over him and turned him into a horse. She rode about on him all night an din the morning he had to pick the sand out of his hands. Paddy learned the words she was saying and one night he changed her into a horse. He went to the forge and got her shod. He came back before the morning and went to bed. When he rose he found the woman sitting at the fire with a horse shoe on every foot and one on every hand.\n", "school_info": "School: Trian Caol", "metadata": [{"Location:": "Treankeel, Co. Donegal", "Teacher:": "\nPeadar Mac Gaoithín\n"}, {"Collector": "Annie Mac Geehin", "Gender": "female"}, {"Informant": "John Mac Daid", "Gender": "male", "Address": "Tullyhonour, Co. Donegal"}, {"Language": "English"}]}, "4493771/4418702/4534270": {"title": "Old Hags", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1114, Page 265", "Page 265"], "url": "https://www.duchas.ie/en/cbes/4493771/4418702/4534270", "text": "\nIn Malin, Innishowen, once there lived a woman who was supposed to be able to \"blink\". Anything this woman set her heart on was no use afterwards. One day while she was on her way to the shop she met a man driving along to his byre a very nice heifer. She said to him, \"That's a very nice heifer\" and no sooner had she uttered the words when the animal broke away form the man, and started in the direction where the woman lived. The man followed as fast as he could, and on reaching the woman's house he found the heifer standing in her byre, and he could not remove her. He sent for the priest and he made the woman pray God's blessing on the animal, and no sooner was this done than the animal came away easily. This woman had only one old useless cow of her own\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire, Carn Domhnaigh", "metadata": [{"Location:": "Ballylosky, Co. Donegal", "Teacher:": "\nAn tSr. M. Beirín Ní Bhaoighill\n"}, {"Language": "English"}]}, "4493771/4418703/4534271": {"title": "Old Hags", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1114, Page 266", "Page 266"], "url": "https://www.duchas.ie/en/cbes/4493771/4418703/4534271", "text": "\n(continued from previous page)\nand still it was reported that she sold twenty pounds of butter each week the year round, while men in big ways could not spare two pounds per week.\n\n\n\nLong ago there were two neighbour women living in Moneydarragh, Culdaff. There was a man dead in the neighbourhood and the two women decided to go to the corpse house together. They said they would finish the work before they would go. One of the women went to milk the cows, but she was not long milking when a big black cat came into the byre. The woman chased her four times in succession but the cat came back again. She hit her on the head with a tin pan and then she ran away quickly. When she had the milking finished she went into the house and got ready to go to the corphouse. Then she went into the neighbour's house to see if the other\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire, Carn Domhnaigh", "metadata": [{"Location:": "Ballylosky, Co. Donegal", "Teacher:": "\nAn tSr. M. Beirín Ní Bhaoighill\n"}, {"Language": "English"}]}, "4493771/4418704/4534272": {"title": "Old Hags", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1114, Page 267", "Page 267"], "url": "https://www.duchas.ie/en/cbes/4493771/4418704/4534272", "text": "\n(continued from previous page)\nwoman was ready. But when she went in the woman was sitting at the fire with her head tied up and it was bleeding away so that she could not accompany her companion. It is thought that the woman changed herself into a black cat and came to steal the neighbour's milk.\n\n\n\nIn Gleneely, Culdaff there lived an old woman who thought that the witches were taking her butter. When she left the milk in crocks it was covered with cream, but when she started to churn she would have to churn from morning till night and would not get more than a quarter lb. of butter. So one day she told a neighbour about it and he told her to heat a horse-shoe and put it under the churn and tie a straw rope around it. She believed this and as long as she did this she had plenty of butter, but if she stopped it she would have no\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire, Carn Domhnaigh", "metadata": [{"Location:": "Ballylosky, Co. Donegal", "Teacher:": "\nAn tSr. M. Beirín Ní Bhaoighill\n"}, {"Language": "English"}]}, "4493771/4418705/4534273": {"title": "Old Hags", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1114, Page 268", "Page 268"], "url": "https://www.duchas.ie/en/cbes/4493771/4418705/4534273", "text": "\n(continued from previous page)\nbutter. She told the priest, and he blessed salt for her and told her not to believe in the witches. She used the salt and ever afterwards she had plenty of milk and butter.\n\n\n\nA poor old woman lived in Goorey in the County of Culdaff and a crowd of other women always came t her house to spin. The women of the house noticed from the time they began to come she never had any butter when she churned. She told her confessor what was happening and he told her to make the spinners say, \"God bless the milk,\" and she who did not say so was taking the best of the cow's milk away. The woman did as she was told and one of the\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire, Carn Domhnaigh", "metadata": [{"Location:": "Ballylosky, Co. Donegal", "Teacher:": "\nAn tSr. M. Beirín Ní Bhaoighill\n"}, {"Informant": "Mrs Susan Doherty", "Gender": "female", "Age": "42", "Address": "Cashel, Co. Donegal"}, {"Language": "English"}]}, "4493771/4418706/4534274": {"title": "Old Hags", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1114, Page 269", "Page 269"], "url": "https://www.duchas.ie/en/cbes/4493771/4418706/4534274", "text": "\n(continued from previous page)\nwomen said, \"May you have good butter\" but she would not say what she was told. When she was oblidged to say it she flew out the window in the form of a \"pigín\" and the priest said that she was a hag.\n\n\n\nSome time ago a woman was churning in this district and while she was doing so an old woman entered begging for alms. She received some money and then gave a helping hand at the churning. She stopped ten minutes and when she left the \"bean a' toighe\" noticed that no butter was appearing on the top of the milk. At that churning she got no butter and a few weeks later she still got none. Then she notified the priest. He came to the house and blessed her churn and in the next churning she got more butter than before.\n", "school_info": "School: Clochar na Trócaire, Carn Domhnaigh", "metadata": [{"Location:": "Ballylosky, Co. Donegal", "Teacher:": "\nAn tSr. M. Beirín Ní Bhaoighill\n"}, {"Language": "English"}]}, "4583308/4578394/4587817": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0050, Page 0156", "Page 0156"], "url": "https://www.duchas.ie/en/cbes/4583308/4578394/4587817", "text": "\nBiddy Early was in the fairies. She lived in a mud cabin on the road side between Feakle and Limerick. She was able to cure sick people. The priest of her parish said he would curse any person that he would curse any persons that would speak to her. She was married, and one evening her husband was coming u from a public house. There was a big cliff near the house and he jumped down our the top of the cliff and was not injured. They say it was Biddy Early that saved him.\n", "school_info": "School: Réidh Reamhar", "metadata": [{"Location:": "Reyrawer, Co. Galway", "Teacher:": "\nSeán A. Mac Fhloinn\n"}, {"Collector": "James Burke", "Gender": "male", "Address": "Derrykeel, Co. Galway"}, {"Informant": "John Burke", "Relation": "grandparent", "Gender": "male", "Age": "76"}, {"Language": "English"}]}, "4583308/4578395/4587825": {"title": "How Biddy Early Got Her Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0050, Page 0157", "Page 0157"], "url": "https://www.duchas.ie/en/cbes/4583308/4578395/4587825", "text": "\nOne day when Biddy Early was a young girl she was asked to mind the house for her next door neighbour. There was a young baby in the house. When the people of the house were gone the child rose up and said to Biddy Early not to tell anyone what she would do to day. The child was a fairy and she jumped out of the craddle and she went up on the loft and got a bottle and gave it to Biddy Early. The baby told her she could do magic things with the bottle and that there was a cure for (and) any disease in the (the) bottle. Their was a fiddle in the house also and the child got it and played the sweetest music she ever heard. It is said that that is how Biddy Early got her charms and that they were all in the bottle.\n", "school_info": "School: Réidh Reamhar", "metadata": [{"Location:": "Reyrawer, Co. Galway", "Teacher:": "\nSeán A. Mac Fhloinn\n"}, {"Collector": "Bernard Regan", "Gender": "male", "Address": "Gorteenboy, Co. Galway"}, {"Informant": "Mrs Henry", "Relation": "grandparent", "Gender": "female", "Address": "Gorteenboy, Co. Galway"}, {"Language": "English"}]}, "4583290/4576867/4588071": {"title": "Folklore", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0046, Page 0122", "Page 0122"], "url": "https://www.duchas.ie/en/cbes/4583290/4576867/4588071", "text": "\nAbout ninety years ago a child who had seven fingers on each hand was born in the village of Friaryland on the western slope of Mount Mary.The child's name was Mattie Mannion. Sometime after his birth a rumour spread far and wide that such a person was mentioned in old prophecy and that in the final battle for Irish Freedom he would hold up the enemies cavalry in a three corner field near the summit of Mary. It was also believed that he possessed supernatural power and that by merely catching a bridle of the leading horses the enemy would be powerless to advance any further. This legend spread to every part of Ireland and Mannion believed in it himself up to the time of his death which occurred about a dozen years ago.\n", "school_info": "School: An Cheapach", "metadata": [{"Location:": "Cappagh, Co. Galway", "Teacher:": "\nSeosamh G. Ó Cléirigh\n"}, {"Collector": "Seosamh G. Ó Cléirigh", "Gender": "male", "Occupation": "teacher", "Address": "Ballygar, Co. Galway"}, {"Informant": "Mrs Walsh", "Gender": "female", "Age": "60", "Address": "Cappagh, Co. Galway"}, {"Language": "English"}]}, "4583294/4577159/4592541": {"title": "Denis Kelly", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0046, Page 0414", "Page 0414"], "url": "https://www.duchas.ie/en/cbes/4583294/4577159/4592541", "text": "\n(continued from previous page)\n[-]\n\n\n\nAlmost a hundred years ago a child who had seven fingers on each hand was born in Fairfield on the western slope of Mount Mary. His name was Mattie Mannion. Shortly after his birth a story got about that such a person was mentioned in an old prophesy and that in the final battle for Irish freedom he would hold up the enemy cavalery in a three cornered field (John Lohan's field.)\n(continues on next page)\n", "school_info": "School: Páirc an Chuilinn (Hollygrove)", "metadata": [{"Location:": "Hollygrove, Co. Galway", "Teacher:": "\nPádhraic Mac Gleannáin\n"}, {"Collector": "Maggie Cunniffe", "Gender": "female", "Address": "Coalpits, Co. Galway"}, {"Language": "English"}]}, "4583351/4582104/4606313": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0059, Page 0541", "Page 0541"], "url": "https://www.duchas.ie/en/cbes/4583351/4582104/4606313", "text": "\nWilliam Burke, Skehana, Peterswell, Loughrea.One evening a man was coming home from a fair in Loughrea.  As he was walking along the road he saw a loaf of bread and he picked it up.  He picked it up and put it under his arm and he walked home.  When he had about three miles travelled he felt the loaf slipping from his arm so he put back his hand to lift it up.  He caught a head of a person instead of a loaf and the head said \"Leave me where you got me\".  The man had to walk back again and leave the loaf where he got it.  When he left it on the road it turned back into a loaf again.  It was not long until another man came and he picked up the loaf.  He brought it home and ate it and that day twelve months he died.One night a man was coming home from a wake.  When he came to a cross-roads he saw a little white woman standing on the road-side.  He left his hand on her shoulder and she disappeared from his sight.  When he went home he got a pain in his head.  He was that way for a month and at last some one told him to go to \"Biddy Early\".  The day after he went to Biddy's house.  He told her his story and she told him he had luck not to do any harm to the woman.  She gave him a bottle and she told him to drink its contents when he went home.  If he let the bottle fall it would be no good to him.  He started on his journey home and when he was about a quarter of a mile from his house the bottle fell.\n(continues on next page)\n", "school_info": "School: Tobar Pheadair", "metadata": [{"Location:": "Peterswell, Co. Galway", "Teacher:": "\nP.S. Ó Muireadhaigh\n"}, {"Informant": "William Burke", "Gender": "male", "Address": "Skehanagh, Co. Galway"}, {"Language": "English"}]}, "4583351/4582105/4606314": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0059, Page 0542", "Page 0542"], "url": "https://www.duchas.ie/en/cbes/4583351/4582105/4606314", "text": "\n(continued from previous page)\nfrom his pocket.  From that day until the day he died he had a pain in his hand.\n\n\n\nA crowd of tinkers named Donovans come to Rahealy about once every two months.  They are from Mayo.They sell many small articles such as tie pins, shirt studs, boot laces, tooth brushes, clothes brushes and tin cans.  It is in a big basket they carry all they have for sale.  They buy asses, horse hair, and feathers.  They beg alms and if they get them they say a prayer but if they are refused they curse.  The chief prayer they say when you give them anything is \"the Lord may bless you.\"There is an old fort in Coxtown which can be seen yet.  There are many big banks of clay around it.  In the middle there is a big hole going into the ground.It is said that it was made by the Irish when Cromwell was in Ireland so that when they saw Cromwell's soldiers coming they could hide in it.The people believe that if you could get into the end of it you would find old guns and swords.If you stood on the top of that fort you could see another one about a mile distant.\n", "school_info": "School: Tobar Pheadair", "metadata": [{"Location:": "Peterswell, Co. Galway", "Teacher:": "\nP.S. Ó Muireadhaigh\n"}, {"Informant": "Thomas Moloney", "Gender": "male", "Age": "63", "Address": "Rahaly, Co. Galway"}, {"Language": "English"}]}, "4602710/4597560/4631334": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0083, Page 032", "Page 032"], "url": "https://www.duchas.ie/en/cbes/4602710/4597560/4631334", "text": "\n15/3/38There lived in Larah a woman named Mary Fahy. She was 60 years of age and she could cure any kind of sickness. She is dead now. One day she was called to Fordes in Currafaireen to cure a cow that was sick and there was a girl sick in the same house also. When she came to the house she asked the people of the house which would they rather the cow to be cured or the girl to be cured, and the people said that they would rather the girl to be cured. Mary Fahy then milked the cow and gave the milk to the girl to drink. The girl was cured and the cow died a few days after that.\n", "school_info": "School: Druim an t-Seagail", "metadata": [{"Location:": "Ryehill Demesne, Co. Galway", "Teacher:": "\nMáire Ní Eimhirín, Seosamh P. Ó hUigín, Áine Ní Uigín\n"}, {"Collector": "Mary King", "Gender": "female", "Age": "14", "Address": "Corrafaireen, Co. Galway"}, {"Informant": "Michael Flaherty", "Gender": "male", "Age": "70", "Address": "Corrafaireen, Co. Galway"}, {"Language": "English"}]}, "4613717/4611898/4643830": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0406, Page 156", "Page 156"], "url": "https://www.duchas.ie/en/cbes/4613717/4611898/4643830", "text": "\nSome years ago there lived an old woman near the village of Athea. She lived in a small thatched house with her son, a tailor. She used turn herself into a magic hare by means of a cow's horn which she kept in the thatch. Her son was working with a tailor in Ruisca[?]. On one occasion the two tailors came to the old womans house. They were sleeping in a little room over the kitchen, and they could see all that was going on in the kitchen. About twelve o'clock the old woman went up on the table and took down the cow's horn and\n(continues on next page)\n", "school_info": "School: Cluain Meacan", "metadata": [{"Location:": "Cloonmackon, Co. Kerry", "Teacher:": "\nLiam Ó Catháin\n"}, {"Collector": "Peg Barry", "Gender": "female", "Address": "Derry, Co. Kerry"}, {"Informant": "Mary Hegarty", "Gender": "female", "Address": "Cloonmackon, Co. Kerry"}, {"Language": "English"}]}, "4613717/4612056/4644228": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0406, Page 314", "Page 314"], "url": "https://www.duchas.ie/en/cbes/4613717/4612056/4644228", "text": "\n(continued from previous page)\nthe fort. The other man said \"Did you get any money inside and the man said he got a big bag of money but that he would not give it to him. He ran off but when he arrived home that night he died.\n\n\n\nAt one time there were three tailors and an old woman living together in the hell road in a small house. At May Eve the three tailors worked very late. The old woman\n(continues on next page)\n", "school_info": "School: Cluain Meacan", "metadata": [{"Location:": "Cloonmackon, Co. Kerry", "Teacher:": "\nLiam Ó Catháin\n"}, {"Collector": "Tim Leahy", "Gender": "male", "Address": "Cloonmackon, Co. Kerry"}, {"Informant": "Brian Mulvihill", "Gender": "male", "Address": "Derry, Co. Kerry"}, {"Language": "English"}]}, "4613718/4612152/4644714": {"title": "Queer Characters", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0406, Page 410", "Page 410"], "url": "https://www.duchas.ie/en/cbes/4613718/4612152/4644714", "text": "\nIn olden times there lived a man in the parish of Duagh named \"Cotter na gruaige\" who had the power of sending rats. He travelled around the parish riding on a white horse and put up at farm houses at night. Anything asked for he got it because they were afraid he would send them rats. A man named Morgan Sheeky who lived in Kilcara refused Cotter for a feed of oats for the horse but he said Morgan \"I will carry more than the feed of oats from you.\" Next morning when Morgan got up all the out house were swarmed with rats and they were eating the thatch of his dwelling house and any cat would interfere with them\n(continues on next page)\n", "school_info": "School: Islandanny", "metadata": [{"Location:": "Rea, Co. Kerry", "Teacher:": "\nMáire, Bean Uí Chatháin\n"}, {"Collector": "J. O Connor"}, {"Informant": "J. O Connor", "Gender": "male", "Address": "Rathoran, Co. Kerry"}, {"Language": "English"}]}, "4613718/4612229/4645041": {"title": "Queer Characters", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0406, Page 487", "Page 487"], "url": "https://www.duchas.ie/en/cbes/4613718/4612229/4645041", "text": "\nAbout fifty or sixty years ago there lived a woman named Mary Grogan who had a small house in Lacca Duagh. This woman lived alone and no body knew where she came from but she had terrible lot of pisogues and she harmed many of the neighbours. One thing she did was, as she was walking the road one day she went into a house named Keeffes and told the woman of the house that one of the neighbours would be making stampy that evening and also told her to put her hand outside the door at a certain time so she did and the stampy was put into her hand without ever seeing where it came from. After that\n(continues on next page)\n", "school_info": "School: Islandanny", "metadata": [{"Location:": "Rea, Co. Kerry", "Teacher:": "\nMáire, Bean Uí Chatháin\n"}, {"Collector": "Eileen Brosnan", "Gender": "female", "Address": "Shronebeirne, Co. Kerry"}, {"Language": "English"}]}, "4613718/4612231/4645045": {"title": "Queer Characters", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0406, Page 489", "Page 489"], "url": "https://www.duchas.ie/en/cbes/4613718/4612231/4645045", "text": "\nThere was a woman in this district who used put eggs into people's hay so that their cows would sling and if her cows were going against her she would put eggs into people's hay inorder that their cows would eat them with the hay. If they ate them they would sling and they would not have any milk for the year and her own cows would have plenty milk when she would be after doing that. Another time the same woman used get a cloth when her children used be sick and she would tell them to spit on the cloth and she would carry the cloth and give it to the children next door inorder they would take the\n(continues on next page)\n", "school_info": "School: Islandanny", "metadata": [{"Location:": "Rea, Co. Kerry", "Teacher:": "\nMáire, Bean Uí Chatháin\n"}, {"Collector": "Máire Lyons", "Gender": "female", "Address": "Pilgrimhill, Co. Kerry"}, {"Language": "English"}]}, "4644827/4612946/4650004": {"title": "Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0408, Page 085", "Page 085"], "url": "https://www.duchas.ie/en/cbes/4644827/4612946/4650004", "text": "\nLong ago when my Grandmother was a young girl there was some kind of charm or witchcraft worked by some old people. All the farmers at that time made their own butter as there were no creameries and some wicked people were able to take away by witchcraft their neighbour's butter. This was nearly always worked on May morning. Those old women would go out to their neighbours' cows before the sun rose on May morning and take a sheet with them and wave it over the cows and say some words. It happened on May day a young student was at a party all night at a friends house and was returning home just as the day dawned on May day. He spied an old woman up on a fence looking in at her neighbour's cows. She had a white sheet and she waved it over them (saying) saying at the same time, \"give half your butter to me.\" The student hid and she could not see him. He did not understand what she meant and when she said \"give half your butter to me he said after \"give\n(continues on next page)\n", "school_info": "School: An Drom Clochach (B.)", "metadata": [{"Location:": "Dromclogh, Co. Kerry", "Teacher:": "\nPártholán Ó Ruadhacháin\n"}, {"Collector": "Patt Mc Elligott", "Gender": "male", "Address": "Banemore, Co. Kerry"}, {"Informant": "John Mc Elligott", "Gender": "male", "Age": "50", "Address": "Banemore, Co. Kerry"}, {"Language": "English"}]}, "4678376/4673410/4678737": {"title": "An Old Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0417, Page 002", "Page 002"], "url": "https://www.duchas.ie/en/cbes/4678376/4673410/4678737", "text": "\nOnce upon a time there lived in this country-side a very poor family, that had to work hard to earn its daily bread. One night a travelling man came to their house, and begged for a night's shelter, but the woman of the house replied, that it was not her custom to keep any travellers. As the night was rainy and cold, she gave him lodging and a comfortable bed. When the stranger rose on the following morning, he told the woman to call all her sons together and kneel down around him, so that he may give them his blessing. The family since then has thrived and prospered and to-day their descendants are richest and wealthiest people in this locality.\n", "school_info": "School: Rathmorrel", "metadata": [{"Location:": "Rathmorrel, Co. Kerry", "Teacher:": "\nAnraoí Ó Conchobhair\n"}, {"Collector": "Gerald Lawlor", "Gender": "male", "Address": "Lisduff, Co. Kerry"}, {"Informant": "Mrs O Connor", "Gender": "female", "Age": "58", "Address": "Lisduff, Co. Kerry"}, {"Language": "English"}]}, "4666575/4663324/4687752": {"title": "A Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0401, Page 120", "Page 120"], "url": "https://www.duchas.ie/en/cbes/4666575/4663324/4687752", "text": "\nOne day three women went into a farmer's house.  The first one asked for a pot she was not long gone when the second woman came and asked for a griddle.  The woman of the house said she wanted to make bread.  But after a time she gave it to her, and told her to bring it back when she had finished.  She went away and the third woman came and asked for a kettle.  She asked her what she wanted them all for and she said she would bring them back soon.  She gave her the kettle and after five minutes the three women brought them back.  They said she was a lucky woman not to refuse them and they went away.\n", "school_info": "School: Lisselton (B.)", "metadata": [{"Location:": "Lisselton, Co. Kerry", "Teacher:": "\nLiam Brún\n"}, {"Collector": "Patrick King", "Gender": "male", "Address": "Ballydonohoe, Co. Clare"}, {"Language": "English"}]}, "4742078/4733363/4778191": {"title": "The Travelling Woman from Tipperary", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0461, Page 449", "Page 449"], "url": "https://www.duchas.ie/en/cbes/4742078/4733363/4778191", "text": "\nNo one knew her name. She stayed at Johnny Sheehan's house at Killowen, and when the son of the house was leaving to go to the farm at Greenane she told him the number of cows that were there - the that he'd find lying and the number standing and grazing. She also told him the number of eggs he'd find under such a coloured hen. I came to the field to see my cattle and he told me the story. He was after finding everything as the woman foretold. I told him not to come near the woman again. Some time later she called again at Rineys at Greenane and told them several stories about themselves and their neighbours and particularly about the neighbour that used not keep the water inside at night and that if she didn't she'd suffer. (The family referred to was Mrs Mahoney who lived at the Quay House and was untidy). She confided a part of the call to see Mrs Riney and gave her several hints regarding her butter. She used not have her full quantity of butter but afterwards she had the full amount.\n", "school_info": "School: Kenmare (B.)", "metadata": [{"Location:": "Kenmare, Co. Kerry", "Teacher:": "\nEoghan Ó Súilleabháin, Liam Mac Cuisín\n"}, {"Informant": "Jeremiah O Connor", "Gender": "male", "Age": "67", "Address": "Kenmare, Co. Kerry"}, {"Language": "English"}]}, "4742078/4733461/4779422": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0461, Page 547", "Page 547"], "url": "https://www.duchas.ie/en/cbes/4742078/4733461/4779422", "text": "\nA travelling woman used to stay at Pats Mick Sullivans. She was supposed to have knowledge. A neighbouring man Thade Buckley had no family. She gathered some herbs and told him to take them, and they only drove the poor man mad. He didn't live too long after.\n\n\n\nThere was a family that lived near Farrell's - I can't remember their names now. They had two babies in the cradle. Their mother used to feed them and look after them like any mother would. They had a tailor working in the house who didn't know any Irish. One day all the family were out and the tailor was on the table - one of the babies said to the other - \"An cuimhin leat m'aghaidh?\"\"Is cuimhin go maith agus m'aghaidh eile leis\".The tailor told the mother to get the cover of a pot and to heat it on the fire and to put them sitting on it. Whether she did or not they died soon after. They were some old lads.\n", "school_info": "School: Kenmare (B.)", "metadata": [{"Location:": "Kenmare, Co. Kerry", "Teacher:": "\nEoghan Ó Súilleabháin, Liam Mac Cuisín\n"}, {"Informant": "Mrs Mc Carthy", "Gender": "female"}, {"Language": "English"}]}, "4742078/4733461/4779456": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0461, Page 547", "Page 547"], "url": "https://www.duchas.ie/en/cbes/4742078/4733461/4779456", "text": "\nA travelling woman used to stay at Pats Mick Sullivans. She was supposed to have knowledge. A neighbouring man Thade Buckley had no family. She gathered some herbs and told him to take them, and they only drove the poor man mad. He didn't live too long after.\n\n\n\nThere was a family that lived near Farrell's - I can't remember their names now. They had two babies in the cradle. Their mother used to feed them and look after them like any mother would. They had a tailor working in the house who didn't know any Irish. One day all the family were out and the tailor was on the table - one of the babies said to the other - \"An cuimhin leat m'aghaidh?\"\"Is cuimhin go maith agus m'aghaidh eile leis\".The tailor told the mother to get the cover of a pot and to heat it on the fire and to put them sitting on it. Whether she did or not they died soon after. They were some old lads.\n", "school_info": "School: Kenmare (B.)", "metadata": [{"Location:": "Kenmare, Co. Kerry", "Teacher:": "\nEoghan Ó Súilleabháin, Liam Mac Cuisín\n"}, {"Informant": "Mrs Mc Carthy", "Gender": "female"}, {"Language": "English"}]}, "4742078/4733472/4779511": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0461, Page 558", "Page 558"], "url": "https://www.duchas.ie/en/cbes/4742078/4733472/4779511", "text": "\n(continued from previous page)\nthe flag of the door and can be seen today. It is said that the flag was removed and replaced but still the sign of the blood is there. Orpen's men were to take the head to Cork but something happened the horses or they refused to travel. It is thought that the priest's brother got the head back and buried it in his own grave.\n\n\n\nMrs Fitzgerald was my grandmother. She was 95 when she died. She used get up every day and sit near the fire but didn't go out for years before she died. One day I was at a funeral and after coming home she said to me - \"Denny were you at our grave to-day? There is someone buried in our grave.\" I said I was but I was not. The next time I went to a funeral I went to the grave immediately and sure enough there was a fresh grave - or burial in our grave. I told Den John & he told me to open the grave & find out whose was the coffin from the breastplate. We did so & found it was buried in mistake & should be in the grave next to ours.\n", "school_info": "School: Kenmare (B.)", "metadata": [{"Location:": "Kenmare, Co. Kerry", "Teacher:": "\nEoghan Ó Súilleabháin, Liam Mac Cuisín\n"}, {"Informant": "Denis D. O Sullivan", "Gender": "male"}, {"Language": "English"}]}, "4798665/4788385/4823355": {"title": "Local Happenings", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0238, Page 053", "Page 053"], "url": "https://www.duchas.ie/en/cbes/4798665/4788385/4823355", "text": "\n(continued from previous page)\nwhen people became efected by the disease they were removed to the cholera house.  The dead were put into canvass bags and buried.\n\n\n\nMany old people have remembrances of the storm of 1839 known as the night of the big wind.  Many houses were blown down or went on fire.  An old man now dead told me that he was returning from a wake in a neighbouring house during the storm.  He was accompanied by his brother who was blown over a hedge and received injuries from which he afterwards died.  Many people had to leave their homes and take shelter by walls and fences lest their houses would be blown down on top of them.\n\n\n\nOf Caldra convent the story is told that when the nuns came to settle there the chieftain of the place refused to give them anymore than a small portion of rocky ground.  The founder of the Convent asked for as much ground as her shawl would\n(continues on next page)\n", "school_info": "School: Mantua", "metadata": [{"Location:": "Mantua, Co. Roscommon", "Teacher:": "\nPádraig Ó Beirn\n"}, {"Informant": "Michael Cannon", "Gender": "male", "Age": "93", "Occupation": "farmer", "Address": "Kilmacumsy, Co. Roscommon"}, {"Language": "English"}]}, "4811581/4798890/4927670": {"title": "Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0260, Page 099", "Page 099"], "url": "https://www.duchas.ie/en/cbes/4811581/4798890/4927670", "text": "\nOne time a man had a great cow for milk.  This family came to live near him, a mother and a daughter.  In a few mornings he went to milk and he found the cow had no milk.  Then he began to notice that the family next door was selling a lot of butter.  He used to hear them churning in the morning.One morning he got up early to watch the cow.  He saw a clock creeping up the cow's elder and he knocked it down.  The next morning he went to watch the cow and he saw the clock again and he threw it down and scraped his foot along the ground on top of it.  When he was going home he met a woman and she had a black mark on her face and this woman was his neighbour.  She was walking like a bachach.  Next morning the cow had a good flow of milk and for a few mornings after.  Again she lost the milk and he found the clock again on the cow and he took it off and put it into a box.  Then he went to a wise man and he told him the story and asked what he would do with the clock.  The wise man said \"Burn him\".  He did so and the woman was never seen again and the cow had milk.\n", "school_info": "School: Radharc na Sionainne", "metadata": [{"Location:": "Clooncah, Co. Roscommon", "Teacher:": "\nNóirín Ní Uiginn\n"}, {"Informant": "Mrs L. English", "Gender": "female", "Age": "87", "Address": "Clooncah, Co. Roscommon"}, {"Language": "English"}]}, "4921567/4880357/4929980": {"title": "Women with Loose Heads", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0269, Page 139", "Page 139"], "url": "https://www.duchas.ie/en/cbes/4921567/4880357/4929980", "text": "\nWomen with loose heads.Patrick Keigbery still living was the quack or charm setter in this case. Women who were suffering from head-aches, dizziness in the head were believed to have a loose head period.The charm setter measured the head nine times, with a woollen thread -- saying certain prayers at the same time. This was repeated several times, on the same day of the week. The writer remembers seeing the charm being set by another charm-setter when a boy. The charm-setter usually got a piece of tobacco or some other present for his trouble.\n", "school_info": "School: Baile 'n tSléibhe (B.)", "metadata": [{"Location:": "Cornalee, Co. Roscommon", "Teacher:": "\nMáirtín Mac Conchradha\n"}, {"Language": "English"}]}, "4811604/4801068/4941572": {"title": "A Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0274, Page 287", "Page 287"], "url": "https://www.duchas.ie/en/cbes/4811604/4801068/4941572", "text": "\nA StoryThere lived in Lehanebeg a woman who carried a can of milk to the mines every day to sell.  One day Tom Spring and Dan Seer's grandfather met her.  Tom Spring said he could throw the can of milk off her head without touching it and the other man would not believe him and no sooner had he the words said than the can fell off her head and was spilled.   When Dan Seer's grand father saw this happen he asked her what was the value of the milk and paid her for it, and went his way.  Tom Spring was a free-mason.\n", "school_info": "School: An Chathair Mhór", "metadata": [{"Location:": "Knockroe Middle, Co. Cork", "Teacher:": "\nDonncha Ó Súilleabháin\n"}, {"Collector": "James Murphy", "Gender": "male", "Age": "11", "Address": "Knockroe Middle, Co. Cork"}, {"Informant": "Tim Sullivan", "Gender": "male", "Age": "76"}, {"Language": "English"}]}, "4921983/4915358/4943398": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0494, Page 059", "Page 059"], "url": "https://www.duchas.ie/en/cbes/4921983/4915358/4943398", "text": "\nLong ago there was a very old woman and it was believed that she was much given to piseóga. She had a dairy, and no person in the world was allowed to go into the dairy. The neighbours around bribed a young fellow to try and get into the dairy unknown to the women. One day, as she was leaving it, she forgot to lock the door and the boy ran in. The neighbours had told him to search her cream-tub. He did so, and he found a dead man's hand in the bottom of it. He ran out, taking the hand with him, and as he was just coming out of the dairy he met the woman. She left it to him but she cursed him. He took the hand to the neighbours and they put it into the fire, but it would not burn. The man of the house then brought in the pike and carried the hand to the river, and threw it in.\n", "school_info": "School: Cnoc Uí Choileáin, Mainistir na Féile", "metadata": [{"Location:": "Mountcollins, Co. Limerick", "Teacher:": "\nPádraig Ó Coileáin\n"}, {"Informant": "Mícéal O Maolchathaig", "Gender": "male", "Age": "57", "Address": "Knocknadiha, Co. Limerick"}, {"Language": "English"}]}, "4921983/4915371/4943441": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0494, Page 072", "Page 072"], "url": "https://www.duchas.ie/en/cbes/4921983/4915371/4943441", "text": "\nMary Ahern from Lurga was very sick one time and Joan Grogan went to the house where the girl was sick and went into the room to the girl. She told her to put on her clothes and her apron and then to go outside the door and hold out her apron. She did so and what should happen to fall into it but a piece of boiled bacon. Joan told her to eat it and she did and she became well and she lived to be an old woman.\n\n\n\nThere was a house in Duagh and the cattle were dying so they brought the priest to say mass in the house but they did not tell him that it was for the cattle. During the mass the clerk saw an old man and an old woman sitting near the fire and he knew that they were the father and mother of the man of the house and that they were dead for some years. After the mass was over he told the priest who said there should be no mass for cattle but for the dead people.\n", "school_info": "School: Cnoc Uí Choileáin, Mainistir na Féile", "metadata": [{"Location:": "Mountcollins, Co. Limerick", "Teacher:": "\nPádraig Ó Coileáin\n"}, {"Informant": "Andrew Cusack", "Gender": "male", "Address": "Crataloe West, Co. Limerick"}, {"Language": "English"}]}, "4921983/4915371/4943447": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0494, Page 072", "Page 072"], "url": "https://www.duchas.ie/en/cbes/4921983/4915371/4943447", "text": "\nMary Ahern from Lurga was very sick one time and Joan Grogan went to the house where the girl was sick and went into the room to the girl. She told her to put on her clothes and her apron and then to go outside the door and hold out her apron. She did so and what should happen to fall into it but a piece of boiled bacon. Joan told her to eat it and she did and she became well and she lived to be an old woman.\n\n\n\nThere was a house in Duagh and the cattle were dying so they brought the priest to say mass in the house but they did not tell him that it was for the cattle. During the mass the clerk saw an old man and an old woman sitting near the fire and he knew that they were the father and mother of the man of the house and that they were dead for some years. After the mass was over he told the priest who said there should be no mass for cattle but for the dead people.\n", "school_info": "School: Cnoc Uí Choileáin, Mainistir na Féile", "metadata": [{"Location:": "Mountcollins, Co. Limerick", "Teacher:": "\nPádraig Ó Coileáin\n"}, {"Collector": "D. Ward"}, {"Informant": "John P. Broderick", "Gender": "male", "Age": "70", "Address": "Ballagh, Co. Limerick"}, {"Language": "English"}]}, "4811606/4801210/4943546": {"title": "A Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0274, Page 429", "Page 429"], "url": "https://www.duchas.ie/en/cbes/4811606/4801210/4943546", "text": "\nLong ago a woman called Maire Ni Murchadha lived in this parish. This woman knew everything that happened during the night. She used be with the fairies all the time. The priest heard about it. He went to her, she told him that it was true and that she knew all about the fairies. The priest would not believe her. He was mad to her.One night the same priest was going on a journey to a sick person. It was late in the night. During the journey the priests hat used be taken off and it used be put on again. The next day or a few days afterwards, this woman came to him. She again told him that she was with the fairies and he would not believe her. She then\n(continues on next page)\n", "school_info": "School: An Chluain", "metadata": [{"Location:": "Cloan, Co. Cork", "Teacher:": "\nTadhg Ó Cearbhaill\n"}, {"Collector": "Máire Ní Murchadha", "Gender": "female", "Address": "Allihies, Co. Cork"}, {"Informant": "Seán Ó Murchadha", "Gender": "male", "Age": "85", "Occupation": "feirmeoir", "Address": "Allihies, Co. Cork"}, {"Language": "English"}]}, "4811606/4801211/4943547": {"title": "A Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0274, Page 430", "Page 430"], "url": "https://www.duchas.ie/en/cbes/4811606/4801211/4943547", "text": "\n(continued from previous page)\nasked him was he to such a place on such a night. He said he was. She then asked him was his hat taken off so many times and put on again. He said it was. She said it was herself used put it on, so he then believed her.\n\n\n\nOnce there was a married man living some place near this parish. This man's wife got sick. She was sick a long, long time and there was no improvement in her. He didn't know what to do. He tried many cures, but they all failed.One day Maire Ni Murchadha came to this house. She saw the woman sick. She told the man\n(continues on next page)\n", "school_info": "School: An Chluain", "metadata": [{"Location:": "Cloan, Co. Cork", "Teacher:": "\nTadhg Ó Cearbhaill\n"}, {"Collector": "Máire Ní Murchadha", "Gender": "female", "Address": "Allihies, Co. Cork"}, {"Informant": "Seán Ó Murchadha", "Gender": "male", "Age": "85", "Occupation": "feirmeoir", "Address": "Allihies, Co. Cork"}, {"Language": "English"}]}, "4921984/4915413/4943558": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0494, Page 113", "Page 113"], "url": "https://www.duchas.ie/en/cbes/4921984/4915413/4943558", "text": "\nA certain priest spoke off the altar about a woman named Joan Grogan and that she was in league with the Devil. When the people went home from Mass they told Joan about it.This night the priest was on a sick call and at a certain part of the road his horse shied, and would not go. When the priest arrived at the house of the sick person he was hardly there when the clock fell off the wall. He stayed at the house that night, and when he was going in the morning he met Joan. Joan saluted him, but the priest never returned the salute. Then Joan said to him, \"what did I ever do to you that you should speak off the altar about me. \"Do you remember last night at a certain part of the road, that your horse shied and it was I that carried the horse to the sick-person's house, and do you remember when the clock fell off the wall, it was I did that to let you know I was minding the sick person also.\"\n", "school_info": "School: Mainistir na Féile (B.)", "metadata": [{"Location:": "Abbeyfeale, Co. Limerick", "Teacher:": "\nS. Ó Háinlí\n"}, {"Informant": "Mrs Ryan", "Gender": "female", "Age": "circa 75", "Address": "Abbeyfeale, Co. Limerick"}, {"Language": "English"}]}, "4922074/4850173/4949317": {"title": "Pishogues", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0518, Page 126", "Page 126"], "url": "https://www.duchas.ie/en/cbes/4922074/4850173/4949317", "text": "\nSome people are supposed to be able to make pishogues. One day a man named Michael Conway was out ploughing. After a short time working he found some meat and bread nicely buttered. He said nothing until the night came. At about twelve o'clock he got up and prepared his gun.Then he went to his garden where he saw a hare. He shot her in the leg and put her into a coop, where he left her for nine days without food.]On the tenth day he let her go and the moment she came out of the coop she was changed into a woman.\n", "school_info": "School: Garrdha Dubhlios, Pálás Gréine", "metadata": [{"Location:": "Garrydoolis, Co. Limerick", "Teacher:": "\nSs. Ó Nuanáin\n"}, {"Collector": "Margaret Ryan", "Gender": "female"}, {"Informant": "Patrick Hanley", "Gender": "male", "Age": "50", "Address": "Ballynagreanagh, Co. Limerick"}, {"Language": "English"}]}, "4922052/4847876/4955748": {"title": "Peggy Aegars' (Eggers) Well", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0512, Page 083", "Page 083"], "url": "https://www.duchas.ie/en/cbes/4922052/4847876/4955748", "text": "\nThere is a beautiful well in Mr John McCarthy's land quite near his residence. The late George Powell, the last and only Protestant in the parish owned this place up to about ten years ago when he died. This well is the best in the locality, it is boiling up in the centre. It has never been known to go dry and the water is colder in summer than in winter.There was a fine speckled trout in the well about 50 years ago. He wasn't there many days (no one knows how he got there) when old Edward Powell marked him down for a feed. He spent days and days tring to catch the trout and at last succeeded. He took him home and prepared the pan for a fry. He gutted him but the trout became whole again and alive. At last he threw it on to the pan which was very hot but the pan cooled immediately. Then he laid the trout on the red coals but they quenched at once and water flowed around the fireplace. Getting alarmed he took the trout and replaced it in the well where it remained for years after but finally disappeared.Peggy Aegars lived some place in the\n(continues on next page)\n", "school_info": "School: Baile an Londraigh (B.)", "metadata": [{"Location:": "Ballylanders, Co. Limerick", "Teacher:": "\nSeán Ó Buachalla\n"}, {"Informant": "John Kenefick", "Gender": "male", "Address": "Curraghturk, Co. Limerick"}, {"Language": "English"}]}, "4922133/4855031/5010327": {"title": "Local Stories", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0533, Page 231", "Page 231"], "url": "https://www.duchas.ie/en/cbes/4922133/4855031/5010327", "text": "\nIn the townsland of Grange there is a hill called \"Grange Hill\". At the back of the hill there is a tree called \"O'Connell's Tree\". The reason why it is called that name is, in the time of Daniel O Connell when he was going around the country giving speeches on Home Rule, it it said that he came to Grange to give a speech. At this time there lived in Killyloughane a woman and her name I do not know but she planted a tree at the back of the hill in commemoration of the speech. The tree is there still and it is called \"O Connell's Tree\". There is also the ruins of two old castles in Grange. They are called the (hanging) \"Hanging Piers\". I asked some old people about them but I got no knowledge about them.\n\n\n\nOnce upon a time a man lived in some parish near Nenagh. He was a bully and was fighting with the people often. So the Parish Priest came to calm him down. But it was all no good and the man even thought to beat the Priest. So the Priest got angry and he said to the man that he would be \"buried alive\" and the man\n(continues on next page)\n", "school_info": "School: Cill Ruadháin", "metadata": [{"Location:": "Lisgarode, Co. Tipperary", "Teacher:": "\nLabhrás Ó Floinn\n"}, {"Collector": "Patrick Kennedy", "Gender": "male", "Address": "Killylaughnane, Co. Tipperary"}, {"Informant": "James Martin", "Gender": "male", "Age": "60", "Address": "Killylaughnane, Co. Tipperary"}, {"Language": "English"}]}, "4922133/4855031/5010338": {"title": "Local Stories", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0533, Page 231", "Page 231"], "url": "https://www.duchas.ie/en/cbes/4922133/4855031/5010338", "text": "\nIn the townsland of Grange there is a hill called \"Grange Hill\". At the back of the hill there is a tree called \"O'Connell's Tree\". The reason why it is called that name is, in the time of Daniel O Connell when he was going around the country giving speeches on Home Rule, it it said that he came to Grange to give a speech. At this time there lived in Killyloughane a woman and her name I do not know but she planted a tree at the back of the hill in commemoration of the speech. The tree is there still and it is called \"O Connell's Tree\". There is also the ruins of two old castles in Grange. They are called the (hanging) \"Hanging Piers\". I asked some old people about them but I got no knowledge about them.\n\n\n\nOnce upon a time a man lived in some parish near Nenagh. He was a bully and was fighting with the people often. So the Parish Priest came to calm him down. But it was all no good and the man even thought to beat the Priest. So the Priest got angry and he said to the man that he would be \"buried alive\" and the man\n(continues on next page)\n", "school_info": "School: Cill Ruadháin", "metadata": [{"Location:": "Lisgarode, Co. Tipperary", "Teacher:": "\nLabhrás Ó Floinn\n"}, {"Collector": "Patrick Kennedy", "Gender": "male", "Address": "Killylaughnane, Co. Tipperary"}, {"Informant": "James Martin", "Gender": "male", "Age": "60", "Address": "Grange Upper, Co. Tipperary"}, {"Language": "English"}]}, "4922222/4861983/5018654": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0557, Page 056", "Page 056"], "url": "https://www.duchas.ie/en/cbes/4922222/4861983/5018654", "text": "\nA few hundred years ago in an old tree in the churchyard in Newtown there was a bell and every night at midnight it used ring. At the time a school-master used be passing from St. Johnstown to Lismolin. One evening he took the bell home with him. Not long after all this family got sick, so he returned the bell and his family got well again but the bell never rang since.\n\n\n\nMany years ago there was an old man named Noonan living in Newtown. Himself and another man were going through a field one day where there were cattle. As they were going through the cattle the stranger started to curse them through his fingers but Noonan used say \"I cross it\". After some time the stranger got vexed and told him that he'd himself if he wouldn't stop crossing them. Noonan stopped and when they\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire, Dún Drongáin", "metadata": [{"Location:": "Drangan, Co. Tipperary", "Teacher:": "\nSiúracha na Trócaire\n"}, {"Informant": "Mr Hall", "Gender": "male", "Age": "60", "Address": "Kyle, Co. Tipperary"}, {"Language": "English"}]}, "4922223/4862093/5019239": {"title": "Folklore", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0557, Page 166", "Page 166"], "url": "https://www.duchas.ie/en/cbes/4922223/4862093/5019239", "text": "\nThere was a man in Newtown called Jimmy Noonan and one day he was walking through a field where there were a lot of cattle grazing and there was another man with him. The other man started cursing the cattle and each animal he used to curse Jimmy Noonan used to bless him. Soon the man put his finger to his eyes and was going to curse Jimmy Noonan but then he said he would curse him if he blessed any more of them. The man he was with cursed the rest of them. When Jimmy Noonan was coming back through the field again all the cattle that the other man cursed were dead and all the ones that were blessed were alive.\n", "school_info": "School: Dún Drongáin (B.)", "metadata": [{"Location:": "Drangan, Co. Tipperary", "Teacher:": "\nDiarmuid Ó Gormáin, Labhrás Ó Gormáín\n"}, {"Informant": "Gerard Hall", "Gender": "male", "Age": "57", "Address": "Kyle, Co. Tipperary"}, {"Language": "English"}]}, "4922231/4862794/5019334": {"title": "Witchcraft", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0560, Page 014", "Page 014"], "url": "https://www.duchas.ie/en/cbes/4922231/4862794/5019334", "text": "\nMy Grand-fathers name was William Morris. He lived in Glenaskough and had a family of eleven. Once when he had his potatoes sown, a woman came into his garden and put eggs in it. She had power from the devil When the people of the house were digging out the potatoes they found an egg in every corner of the garden, and no potatoes but rubbish could be found. The woman that did that had a wonderful crop herself. William Morris knew who did it but never told anybody.\n", "school_info": "School: Grangemocler (B.) Carrick-on-Suir", "metadata": [{"Location:": "Grangemockler, Co. Tipperary", "Teacher:": "\nGan ainm / Mícheál Ó Séaghdha\n"}, {"Collector": "William Morris", "Gender": "male", "Address": "Brenormore, Co. Tipperary"}, {"Informant": "William Morris", "Relation": "parent", "Gender": "male", "Age": "40", "Occupation": "road steward", "Address": "Brenormore, Co. Tipperary"}, {"Language": "English"}]}, "4922231/4862805/5019341": {"title": "Witchcraft", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0560, Page 025", "Page 025"], "url": "https://www.duchas.ie/en/cbes/4922231/4862805/5019341", "text": "\nLong ago there lived a man in Glendaskough. His name was Fox. For a long time he could make no butter even the churn would not turn. A stranger came into his house one evening, Mr Fox said \"I can't make any butter Sir.\" The stranger said \"I will make it for you.\" The strange man then went to Mr Fox's garden and took the sock from the timber plough and put it into the fire. When it was melted, he went to the churn and made the butter.\n", "school_info": "School: Grangemocler (B.) Carrick-on-Suir", "metadata": [{"Location:": "Grangemockler, Co. Tipperary", "Teacher:": "\nGan ainm / Mícheál Ó Séaghdha\n"}, {"Collector": "William Morris", "Gender": "male", "Address": "Brenormore, Co. Tipperary"}, {"Informant": "Mr John Shelly", "Gender": "male", "Age": "74", "Address": "Tullohea, Co. Tipperary"}, {"Language": "English"}]}, "4922223/4862180/5020488": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0557, Page 253", "Page 253"], "url": "https://www.duchas.ie/en/cbes/4922223/4862180/5020488", "text": "\nThere was a man by the name of Martin Costello living in Copnagrawn and he used to be able to do a lot of tricks. One day he was going down the Mullinahone road and a man came up the road with two dogs. They were talking for a while and the man with the dogs wanted to get a run for the dogs. So this man said \"there's a hare inside the ditch. The man went in to the field with the dogs and the hare jumped up out of the grass. When the dogs saw the hare they followed her and the two dogs got killed. It was found out after that Costello turned his handkerchief into a hare.\n", "school_info": "School: Dún Drongáin (B.)", "metadata": [{"Location:": "Drangan, Co. Tipperary", "Teacher:": "\nDiarmuid Ó Gormáin, Labhrás Ó Gormáín\n"}, {"Informant": "Thomas Horan", "Gender": "male", "Age": "60", "Address": "Knockuragh, Co. Tipperary"}, {"Language": "English"}]}, "4922223/4862181/5020489": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0557, Page 254", "Page 254"], "url": "https://www.duchas.ie/en/cbes/4922223/4862181/5020489", "text": "\nMartin Costello was going through a garden one day and there were two men cutting corn with hooks. Costello said to them \"Why are you working so hard\" the men said they had to do it. Then Costello said \"leave down the hooks and you'll see how it can make them work. The men left down their hooks and Costello said some words over them. Then the hooks began to cut the corn by their-selves and it was cut in a half an-hour. The men went home and told their employer they had it cut. The owner said they could not have it cut. He went down and saw that they had only a few swathes cut. Then they told their owner how it happened and they\n(continues on next page)\n", "school_info": "School: Dún Drongáin (B.)", "metadata": [{"Location:": "Drangan, Co. Tipperary", "Teacher:": "\nDiarmuid Ó Gormáin, Labhrás Ó Gormáín\n"}, {"Informant": "Thomas Horan", "Gender": "male", "Address": "Knockuragh, Co. Tipperary"}, {"Language": "English"}]}, "4922221/4861919/5020712": {"title": "Martin Costello", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0556, Page 372", "Page 372"], "url": "https://www.duchas.ie/en/cbes/4922221/4861919/5020712", "text": "\nA man named Martin Costello lived in Cappnagrane in olden times. This man was said to be able to do uncanny things. One day as he was passing by a field of corn, he saw two men cutting the corn with hooks. Costello said \"Why are you working so hard\" and the men said they had to do it. Then he said \"Go home, the corn is cut.\" The men looked at it and saw that his words were perfectly true, not a blade of corn remained standing. They went back to their employer and ordered their wages.\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire, Drangan", "metadata": [{"Location:": "Drangan, Co. Tipperary", "Teacher:": "\nAn tSr. M. Gráinne\n"}, {"Collector": "Mary Horan", "Gender": "female", "Address": "Knockuragh, Co. Tipperary"}, {"Informant": "Mr Thomas Horan", "Gender": "male", "Address": "Knockuragh, Co. Tipperary"}, {"Language": "English"}]}, "4922280/4866933/5051899": {"title": "A Legend", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0576, Page 233", "Page 233"], "url": "https://www.duchas.ie/en/cbes/4922280/4866933/5051899", "text": "\nA Legend            Near golden on the side of the road there is a large well. It is called Chadwick's Well. a legend is told about this well.              At one time it was at the other side of the road. How it came to be in the present spot is a strange story.  It is stated that at one time a passing woman rinsed some clothes in it. some time later the well is said to pass unseen to the other side of the road.             A stone cross still remains in the spot where it was at first. During the Civil War in Ireland this cross is said to have been taken for some unknown purpose.\n", "school_info": "School: Gabhailín (Golden), Cashel", "metadata": [{"Location:": "Golden, Co. Tipperary", "Teacher:": "\nTomás Mac Uidhir\n"}, {"Language": "English"}]}, "4922280/4866934/5051900": {"title": "A Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0576, Page 234", "Page 234"], "url": "https://www.duchas.ie/en/cbes/4922280/4866934/5051900", "text": "\nA Story                 About two miles from Golden there is a large mansion called Lisheen House. It is surrounded by large trees, their boughs drooping with age.                Long, long ago there lived in this mansion a very cruel man, named Sir. John Fitzgerald. He was known as \"The Flogger\".Children were brought to him to be chastised.                  On one of these occasions a woman told him that she was unable to chastise one of her children.                  \"Bring him to me\", said Sir John, \"And I'll chastise him in such a way as he won't forget\n(continues on next page)\n", "school_info": "School: Gabhailín (Golden), Cashel", "metadata": [{"Location:": "Golden, Co. Tipperary", "Teacher:": "\nTomás Mac Uidhir\n"}, {"Collector": "Patrick Egan", "Gender": "male", "Address": "Golden, Co. Tipperary"}, {"Informant": "Richard Egan", "Gender": "male", "Age": "20", "Address": "Golden, Co. Tipperary"}, {"Language": "English"}]}, "4922280/4866936/5051907": {"title": "A Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0576, Page 236", "Page 236"], "url": "https://www.duchas.ie/en/cbes/4922280/4866936/5051907", "text": "\nFeabhra 1 Adh la, 1938.A Story.Near Golden in a mansion there lived a man named Parson Whitty.He used go around collecting the tithes.One day while he was collecting these he was killed. It is stated that he was after leaving a farmhouse when he met a workman in a field. This man had no great esteem for Parson Whitty so he killed him with a stroke of a fork which he had at the time.He was arrested, but there was no proof as to his guilt and he was acquitted. The Parson is said to have been seen in the spot where he was murdered.Patrick Egan heard this story from his father Richard EganGolden.Aged 55 years\n", "school_info": "School: Gabhailín (Golden), Cashel", "metadata": [{"Location:": "Golden, Co. Tipperary", "Teacher:": "\nTomás Mac Uidhir\n"}, {"Collector": "Patrick Egan", "Gender": "male", "Address": "Golden, Co. Tipperary"}, {"Informant": "Richard Egan", "Relation": "parent", "Gender": "male", "Age": "55", "Address": "Golden, Co. Tipperary"}, {"Language": "English"}]}, "4922280/4866937/5051911": {"title": "The Hidden Treasure", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0576, Page 237", "Page 237"], "url": "https://www.duchas.ie/en/cbes/4922280/4866937/5051911", "text": "\nThe Hidden treasure.Near Ballinahinch there stands an old castle. It is said that gold is hidden in some part of it. How this came to be known by the people is a queer story.One dark, stormy night, about two years ago a man named Jack Walsh was coming from a fair, when, passing near the castle he heard a noise in the briars. He was frightened at first but soon regained courage and went to investigate.To his great surprise he saw a small, wizend looking man carrying a sack of gold. Before he had time to say a word the little man vanished. He was never seen there afterwards. Pat Egan heard this from his father Richard Egan    55   yearsGolden\n", "school_info": "School: Gabhailín (Golden), Cashel", "metadata": [{"Location:": "Golden, Co. Tipperary", "Teacher:": "\nTomás Mac Uidhir\n"}, {"Collector": "Patrick Egan", "Gender": "male", "Address": "Golden, Co. Tipperary"}, {"Informant": "Richard Egan", "Relation": "parent", "Gender": "male", "Age": "55", "Address": "Golden, Co. Tipperary"}, {"Language": "English"}]}, "4922280/4866938/5051932": {"title": "The Red Earl", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0576, Page 238", "Page 238"], "url": "https://www.duchas.ie/en/cbes/4922280/4866938/5051932", "text": "\nThe Red Earl.Quite close to where I live there is an old ruin called Athassel Abbey. There is an amazing story attached to it.At one time lived a man called \" The Red Earl\", who through some evil deed of his, a curse was laid on him and the prophecy was that he shlould die with the thirst. When the Earl heard this he said, impossible as the cellars were full of all class of drink and the River Suir flowing by side of the Abbey.Some time afterwards the Earl fell seriously ill and he called for a drink. The servants ran to the cellars but to their\n(continues on next page)\n", "school_info": "School: Gabhailín (Golden), Cashel", "metadata": [{"Location:": "Golden, Co. Tipperary", "Teacher:": "\nTomás Mac Uidhir\n"}, {"Collector": "Patrick O' Donnell", "Gender": "male", "Address": "Athasselabbey North, Co. Tipperary"}, {"Informant": "Mrs O Donnell", "Relation": "parent", "Gender": "female", "Age": "50", "Address": "Athasselabbey North, Co. Tipperary"}, {"Language": "English"}]}, "4922280/4866940/5051972": {"title": "The Shack", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0576, Page 240", "Page 240"], "url": "https://www.duchas.ie/en/cbes/4922280/4866940/5051972", "text": "\nThe Shack.About two miles on the north side of the village of Golden there are still to be seen the remains of an old castle which is commonly known as \"The Shack\".In this old castle there lived a man named Lord Fitzgerald. There lived near by a woman and her son who was always 'slinging' from school. The woman went for advice to the Lord and he told her to bring up her son that evening. When they arrived at the castle the woman was taken into a room where she was told to remain. when she was sent for she was taken\n(continues on next page)\n", "school_info": "School: Gabhailín (Golden), Cashel", "metadata": [{"Location:": "Golden, Co. Tipperary", "Teacher:": "\nTomás Mac Uidhir\n"}, {"Collector": "James O' Connell", "Gender": "male", "Address": "Golden, Co. Tipperary"}, {"Informant": "Mortimer O' Connell", "Relation": "relative (other than parent or grandparent)", "Gender": "male", "Age": "17", "Address": "Golden, Co. Tipperary"}, {"Language": "English"}]}, "4922358/4873916/5075367": {"title": "Local Story - The Caves of Kilcorney", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0614, Page 034", "Page 034"], "url": "https://www.duchas.ie/en/cbes/4922358/4873916/5075367", "text": "\nThere are a series of caves in the parish of Carron, stretching as far as Inchiquin. Groups of boys from time to time have gone there exploring, bringing with them papers and straw to scatter on the paths lest they lose their way. One group is said to have met a little old man who told them not to cross the river there or they would never return. The dog which accompanied them swam the river and was never seen again. Many years ago a young mare strayed in - and was later seen with a foal. This is the origin of the horses which used to come out at sunrise every morning to graze for about an hour and go back again. These were marvelous horses and anyone who could catch one could train him to do almost anything. He would bring a person safely through any danger. Maura Rua - a titled lady - also very cruel lived in Lemeneagh Castle. She had one trained and any person who offended her - she caused him to ride this horse which then galloped\n(continues on next page)\n", "school_info": "School: Boston, Tubber", "metadata": [{"Location:": "Boston, Co. Clare", "Teacher:": "\nThos. Noone\n"}, {"Collector": "Lina Cunningham", "Gender": "female", "Address": "Magheranraheen or Rockforest, Co. Clare"}, {"Informant": "James O' Connor", "Gender": "male", "Age": "78", "Address": "Boston, Co. Clare"}, {"Language": "English"}]}, "4922362/4874277/5075914": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0615, Page 023", "Page 023"], "url": "https://www.duchas.ie/en/cbes/4922362/4874277/5075914", "text": "\nThere was an old woman living in Feakle long ago her name was Biddy Early She was married three times and had no children. She was a witch and she could cure people. She could then tell you about the person you wanted to be cured, whether he would live or die. It was how she had a bottle and she would shake the bottle and look into it. She could tell you if you were rich or. The people that would go to her would have to bring her presents. She would not take any money.\n", "school_info": "School: Turlough, Béal an Chloga", "metadata": [{"Location:": "Turlough, Co. Clare", "Teacher:": "\nÁine, Bean Uí Éalaidhe\n"}, {"Collector": "Micheal Davenport", "Gender": "male"}, {"Informant": "Thomas Davenport", "Relation": "relative (other than parent or grandparent)", "Gender": "male", "Age": "55", "Address": "Ballyhehan, Co. Clare"}, {"Language": "English"}]}, "4922360/4874125/5078773": {"title": "The Doctor of Kilnaboy", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0614, Page 243", "Page 243"], "url": "https://www.duchas.ie/en/cbes/4922360/4874125/5078773", "text": "\n\"The Doctor of Kilnaboy\".There is a man living in Kilnaboy and he has power to cure liver complaints and also to cure cows that have swallowed raw potatoes. People have been known to come back from America to consult him. His entire predecessors possessed the same gift but this man (a blacksmith) was the only one who practised as a wise man.With his human patients the blacksmith's method was simple. He made the sufferer lie on the anvil and pretended to strike him with a sledge hammer. While doing this he says a prayer:- \"An tocht a bheith socair is scairt a bheith réidh, I n-ainm an Athar, an Mhac is an Spioraid Naomh\".This is done on three occasions, on two Mondays and a Thursday but in some cases once is sufficient. Local legends say that the gift was bestowed on his ancestor by St. Patrick whose horse cast a shoe near at hand.That man was also a blacksmith and he insisted on shoeing the horse freely and as a result of this all of that man's descendants have the\n(continues on next page)\n", "school_info": "School: Cora Finne (B.)", "metadata": [{"Location:": "Corrofin, Co. Clare", "Teacher:": "\nSeosamh Ó Cléirigh, Ss. Ó Cléirigh\n"}, {"Language": "English"}]}, "5009328/5007437/5134386": {"title": "Scéal", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0898, Page 104", "Page 104"], "url": "https://www.duchas.ie/en/cbes/5009328/5007437/5134386", "text": "\nLong ago there lived two men named John and Thomas in the district of Old Ross. One day they went on a visit to Dublin and they lodged in the same hotel. About 12'O clock that night John said to Thomas \"Your boy robbed my apple tree\". When they came home Thomas asked his boy \"if he had been in Johns orchard\", he said \"yes\". When John went home he got a nail and put it in the very place where the boy had put his foot when stepping up the tree. The boy felt a pain in his heel. He had that pain until he went and apologised to John. Then John took up the nail and the boys heel got alright, and he never got the pain again.\n(continues on next page)\n", "school_info": "School: Cushenstown", "metadata": [{"Location:": "Cushenstown, Co. Wexford", "Teacher:": "\nMicheál Mac Murchadha\n"}, {"Collector": "Sibéal de Rosford", "Gender": "female", "Address": "Ballynabola, Co. Wexford"}, {"Informant": "Líam Ó Dubhghaill", "Gender": "male", "Age": "68", "Address": "Ballynabola, Co. Wexford"}, {"Language": "English"}]}, "4798758/4795950/5150013": {"title": "Béaloideas", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0297, Page 115", "Page 115"], "url": "https://www.duchas.ie/en/cbes/4798758/4795950/5150013", "text": "\nThere was an old witch who could turn herself into any shape she wished. One day she was going through the country in the form of a cat. The hounds spied her and gave chase but she ran into a cabhlach. When the hounds came up she had turned herself back into the form of a woman so they had to go away.Soon after a man was passing by and saw her. She asked him to take her to the shoe-maker to get a pair of shoes. \" How do you expect me to carry you to the shoe-maker?\" he asked \" I'll manage that alright\", she said and explained to him telling him  that he was to put her in a bag. He did so and set out on the journey.Soon they happened to come near the hounds again. The hounds smelt the cat and began to bark and howl looking for her everywhere about. She gave him a pick of her claw through the bag. \"Mind me iongá-ín \" she said. \" There\", he said throwing her to the hounds, \"mind yourself now iongá-ín\".\n", "school_info": "School: Lios an Lothraigh, An Sciobairín", "metadata": [{"Location:": "Lissalohorig, Co. Cork", "Teacher:": "\nSeosamh Mac Domhnaill\n"}, {"Collector": "Donnchadh Mac Domhnaill", "Gender": "male"}, {"Language": "English"}]}, "4921643/4887381/5153548": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0313, Page 234", "Page 234"], "url": "https://www.duchas.ie/en/cbes/4921643/4887381/5153548", "text": "\nThere once lived an old woman named Máire Uí h-Ualacháin. She lived on top of a mountain near Knockavilla. People used to go to her to be cured. There was a woman and her daughter went out to hear singing. As the singing was drawing near the house, the little girl ran in because she was afraid. The mother stood near the door. Next-day both mother and daughter were ill. The father sent for Máire Uí h-Ualacháin When she arrived she told him that she could not cure the mother; that she would be dead before two days. The mother died and the daughter lived.\n", "school_info": "School: Raharoon, Droichead Banndan", "metadata": [{"Location:": "Ratharoon West, Co. Cork", "Teacher:": "\nMáiréad Ní Shúilleabháin\n"}, {"Collector": "Eileen Mc Carthy", "Gender": "female", "Address": "Tullyland, Co. Cork"}]}, "4798788/4798516/5166445": {"title": "Sites of Historic Interest", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0308, Page 105", "Page 105"], "url": "https://www.duchas.ie/en/cbes/4798788/4798516/5166445", "text": "\nSites of Historic Interest(a) Mass Rocks:-Only two to be seen in this district ,one in a field in Cahirmore about 2½ miles north of Ross, another is situated in a field in Benduff about 3 miles north west of the town.(b) Castles:- 1 Benduff Castle now known as Castle Salem. It was built by Catherine, daughter of the 8th Earl of Desmond. She was known as the \"Black Lady\", hence the name \"Bean Dub\", which according to the local tradition is the source of the name \"Benduff.\" Some people hold that \"beann dub\" i.e. \"black gable\" is the source of the name Benduff.Benduff Castle passed into the hands of Major Apollo, who re-named it Castle Salem. The new possessors erected a modern dwelling up against the old castle. Being Quakers, they made a grave-yard there for co-religionists.Legend of the Castle:- A family, by the name of Morris lived there, they owed large sums of money to various people. When any of these creditors came to ask for the money due to them, Mr. Morris on pretence of showing them the castle, took them into a room, where there was a trap-door through which they fell to their death. Ghosts haunt the castle\n", "school_info": "School: Clochar na Trócaire, Ros Ó gCairbre", "metadata": [{"Location:": "Ross Carbery, Co. Cork", "Teacher:": "\nAn tSr. Áilbe\n"}, {"Language": "English"}]}, "4798788/4798517/5166446": {"title": "Historic Ruins", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0308, Page 106", "Page 106"], "url": "https://www.duchas.ie/en/cbes/4798788/4798517/5166446", "text": "\nHistoric RuinsCopinger's CourtThe mansion of Copinger's Court was erected on the banks of the Rowry River, it is still imposing in its ruins. It was built by Sir Walter Copinger in the townland of Ballyverine. He belonged to family who were descendants of a Danish family of merchants which settled in Cork at an early period. One tradition is that Sir Walter was at one time valet to Sir Fineen O'Driscoll of Baltimore, another story says that he was a servant of Sir Walter Raleigh. There is no foundation for either of these tales.Sir Walter's first appearance in Carbery affairs was as a mortagee of the lands and castle of Cloghane. At all events Copinger's Court was built in the first half of the 17th century. It was the largest house in Carbery. It is said that Sir Walter intended to build a market town there and turn the Rowry into a canal.If tradition may be relied on, Sir Walter was a cruel despot, and fireside yarns are told of his dark deeds, executions and imprisonments. There is a local tradition that he died of an apoplectic fit brought on by passion as he was leaving church one Sunday.Downeen Castle believed to have been built by the O'Cowhigs on a rocky portion of land on the coast and separated from the mainland, so that there was no getting into it except over a drawbridge\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire, Ros Ó gCairbre", "metadata": [{"Location:": "Ross Carbery, Co. Cork", "Teacher:": "\nAn tSr. Áilbe\n"}, {"Language": "English"}]}, "4921629/4886240/5166652": {"title": "Moll Carroll", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0310, Page 052", "Page 052"], "url": "https://www.duchas.ie/en/cbes/4921629/4886240/5166652", "text": "\nAbout 70 years ago there lived in the village of Ballineen Co. Cork a very famous character called Moll Carroll. This woman was supposed to hold communication with the dead. It was usual for some of the credulous inhabitants to consult her as to where the departed were. When persons or cattle got sick she set Charms and made potions for them For all this she was well paid and she amassed a large amount of money. People dreaded her wrath for she was looked as a wizard. Needless to say her demands were never refused. The Priests of the parish of Enniskean frequently referred to her doings from the Altar and warned people against It was useless, because when she was able to tell people, whom she had scarcely met, family troubles and family secrets, and could describe furniture of houses she had never seen, it was firmly believed that she had supernatural power. On her death she acknowledged to the priest that all the information she possessed she obtained from a man called Dan Harts, who visited her secretly and got part of her earnings. He was a pedlar and travelled through the parish selling his wares.\n", "school_info": "School: Béal Átha Fhinghín", "metadata": [{"Location:": "Ballineen, Co. Cork", "Teacher:": "\nEibhlín, Bean Uí Dhéisigh\n"}, {"Language": "English"}]}, "4921629/4886242/5166662": {"title": "Máire Gaelach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0310, Page 053", "Page 053"], "url": "https://www.duchas.ie/en/cbes/4921629/4886242/5166662", "text": "\nAbout 1 1/2 miles from the village of Ballineen there is a bridge called the \"One-eye Bridge\", and about 80 years ago the spirit of a woman known locally as Máire Gaedhalac appeared from time to time.She attacked persons travelling on this road, after a certain time at night. When seen she always appeared to be bittling clothes.   The writer of this was told by his predecessor in the Ballineen school that her aunt and uncle left home one morning as they thought to journey to Clonakilty market. It was a moonlight night and they mistook the moon-light for dawn and set out much earlier than they should have done. There was no clock in the house to show time. On their journey they had to pass the One-Eye Bridge and when nearing the bridge they saw Máire on the bank of river bittling clothes. She came towards them and both were terrified. They made the Sign of the Cross and prayed for protection. Their prayers were heard for just as she came near a cock which was in the car crew and she disappeared. I forgot to mention that these people were taking fowl to be sold in Clonakilty.   A priest in the Desert Serges Parish banished her Before doing so he asked why she came back, and she said she suffered because she had murdered unbaptised babies.N.B. Desert Serges was a distinct parish then. It is now in Enniskean parish\n", "school_info": "School: Béal Átha Fhinghín", "metadata": [{"Location:": "Ballineen, Co. Cork", "Teacher:": "\nEibhlín, Bean Uí Dhéisigh\n"}, {"Language": "mixed"}]}, "4921756/4903917/5167005": {"title": "A Story - The Whisperer", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0356, Page 274", "Page 274"], "url": "https://www.duchas.ie/en/cbes/4921756/4903917/5167005", "text": "\nA Story \"The Whisperers\" There lived a branch of the O'Sullivan family in and about Mallow. The members of this family were called \"The Whisperers.\" They got this name from the fact the the eldest son in each family inherited a \"whisper\" by which he was able to tame the wildest and to all appearances the most untameable horses. All O'Sullivan had to do was to get into the stable in which was a wild horse and whisper into the horse's ear, immediately the horse would shiver, sweat would pour out thro' every pore of its body and at once the horse would become as docile as a lamb. There are numbers of stories told as to the prowess of the \"Whisperers\" . A fair used to be held in days June by  in a place called Dromagh about four miles to the north west of Banteer.On one occasin a man brought a horse to the fair to be sold. The horse was so unmanageable that the owner despaired of selling him. It so happened that one of the O'Sullivans who had the \"whisper\" was\n(continues on next page)\n", "school_info": "School: Coiscéim (C.), Átha Treasna", "metadata": [{"Location:": "Newmarket, Co. Cork", "Teacher:": "\nMáire Bean Uí Nialláin\n"}, {"Language": "English"}]}, "4921828/4909885/5183015": {"title": "The Mass", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0375, Page 151", "Page 151"], "url": "https://www.duchas.ie/en/cbes/4921828/4909885/5183015", "text": "\n(continued from previous page)\nmass well.\n\n\n\nLong ago near Fermoy, in a castle, lived a man with his wife and only son. A fortune-teller told the father that his son would be drowned. The father was in great trouble and took every care that the son should not be drowned. He built a high wall round the castle and thought that in this way the son would be safe from all water. One day as the workmen were mixing mortar in a tub the little boy fell into the tub unknown to the men and was suffocated.\n\n\n\nLong ago there was a farmer who had many cows. On several occasions,\n(continues on next page)\n", "school_info": "School: Graigue, Cill Dairbhe", "metadata": [{"Location:": "Graigue, Co. Cork", "Teacher:": "\nMícheál Ó Lionacháin\n"}, {"Collector": "Anna Caplice", "Gender": "female", "Address": "Graigue, Co. Cork"}, {"Informant": "Mr John Caplice", "Gender": "male", "Age": "52", "Address": "Graigue, Co. Cork"}, {"Language": "English"}]}, "4921829/4909952/5183169": {"title": "How Lisnagourneen got Its Name", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0375, Page 217", "Page 217"], "url": "https://www.duchas.ie/en/cbes/4921829/4909952/5183169", "text": "\nLong ago some men were levelling a field in [?] farm and they came on a door and they took it up and they found an opening.They went into it and they found three rooms and two flights of stairs.  It was left open for some time and all the people came to see it. But one day a calf went into it and he kept roaring all day.  Then someone went down for him and they failed to find any calf, but they saw a crowd of people.They got afraid and it was shut up and ever since it was called Lisnagoureen.\n", "school_info": "School: Scairt (B.), Cill Dairbhe", "metadata": [{"Location:": "Scart, Co. Cork", "Teacher:": "\nPádraig Ó Rinn\n"}, {"Collector": "Patricia Burke", "Gender": "female", "Age": "15"}, {"Informant": "Mr John Burke", "Gender": "male", "Age": "46", "Address": "Ballynahalisk, Co. Cork"}, {"Language": "English"}]}, "4921829/4909989/5183268": {"title": "A Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0375, Page 254", "Page 254"], "url": "https://www.duchas.ie/en/cbes/4921829/4909989/5183268", "text": "\n254A Story.Long ago there was a farmer who had a lot of cows. On several occasions when he or his family went to milk them they found some of the cows milked. The man wondered what was the cause of it. One day walking through the field where the cows were lying, He Saw a hare drinking one of the cows. Having with him a pair of hounds they persued the hare. Near by was a little house the window of which was opened. In through this the hare jumped, and as the hare did so one of the hounds caught the hare by the leg. Farmer ran after them. In coming to the house he opened the door and there he saw a woman on a chair bleeding from the leg. He then knew that this was the woman who was making pishogues. Margaret ShinnickAge 13 yrsMr David O'Keege OldcastletownKildonery, aged 74 yrs\n", "school_info": "School: Scairt (B.), Cill Dairbhe", "metadata": [{"Location:": "Scart, Co. Cork", "Teacher:": "\nPádraig Ó Rinn\n"}, {"Collector": "Margaret Shinnick", "Gender": "female", "Age": "13"}, {"Informant": "Mr David O' Keeffe", "Gender": "male", "Age": "74", "Address": "Oldcastletown, Co. Cork"}, {"Language": "English"}]}, "4921829/4910008/5183331": {"title": "The Fuel of Long Ago", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0375, Page 273", "Page 273"], "url": "https://www.duchas.ie/en/cbes/4921829/4910008/5183331", "text": "\nThe fuel that was used about eighty years ago was turf and bogdeal. Bogdeal was wood which grew in mountains and would light the candles.They had no matches long ago and they lit the fires with flint. In the Summer time all the neighbours would go to some bog to dig turf for the Winter. In about two days they would have enough dug.Then they would go to it after a few days and turn it. When it would be very dry they would bring it home and put it in stack for the winter. They people long ago never quenched the fires because it would be very hard to light the turf.\n\n\n\nThere was a man living in Farrahy about a hundred years ago. When he was three months old he spoke five words and at the age of seven months he was able to walk.When he was twelve years old he said to his father that he would\n(continues on next page)\n", "school_info": "School: Scairt (B.), Cill Dairbhe", "metadata": [{"Location:": "Scart, Co. Cork", "Teacher:": "\nPádraig Ó Rinn\n"}, {"Collector": "Mary Mac Donald", "Gender": "female", "Age": "13"}, {"Informant": "Mrs Mc Donald", "Gender": "female", "Age": "54", "Address": "Ballynoe, Co. Cork"}, {"Language": "English"}]}, "4921831/4910259/5183984": {"title": "Pishogues", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0375, Page 523", "Page 523"], "url": "https://www.duchas.ie/en/cbes/4921831/4910259/5183984", "text": "\nPishoguesLong ago people were very quick for making pishogues. They used  to work these spells on their neighbours if they wanted to harm them.The women used to change themselves into the form of animals and go through the country and destroy their neighbours’ crops. Tradition has it that there lived a woman in Knockanevin and she was a farmer’s wife. She used to make butter from the cow’s milk. After a while she could not make the cream become butter and it is believed that there was a craftswoman nearby and she used to\n(continues on next page)\n", "school_info": "School: Knockanevin", "metadata": [{"Location:": "Knockanevin, Co. Cork", "Teacher:": "\nSeán Ó Crosáin\n"}, {"Collector": "Christina Mc Grath", "Gender": "female", "Address": "Knockanevin, Co. Cork"}, {"Informant": "John Mc Grath", "Gender": "male", "Age": "65", "Occupation": "postman", "Address": "Knockanevin, Co. Cork"}, {"Language": "English"}]}, "4921685/4889843/5184441": {"title": "An Old Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0322, Page 234", "Page 234"], "url": "https://www.duchas.ie/en/cbes/4921685/4889843/5184441", "text": "\nThere was a witch in Kilcrea Abbey and she used to steal the bodies out of the graves in the abbey and the butter from the people She used to turn herself into a hare when the people would come after her. A neighbour told the priest and he put two twigs around the churn and she couldn't take the butter\n", "school_info": "School: Ballyheedy, Ballinhassig", "metadata": [{"Location:": "Ballyheedy, Co. Cork", "Teacher:": "\nSeán Ó Haonghusa\n"}, {"Language": "English"}]}, "4921814/4894989/5188805": {"title": "Stories", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0372, Page 030", "Page 030"], "url": "https://www.duchas.ie/en/cbes/4921814/4894989/5188805", "text": "\nINear Clydaville is a big earthen mound covered with trees called by all the people the Gisabo. On top of the mound are the ruins of a house.    The story goes that there was a very rich man living in the neighbourhood. He had some difference with a witch, and when his first child was born, she sent him word that every child born to him would be drowned. In order to circumvent the witch he caused a house to be built on the top of the Gisabo.    The nurse, and her charge lived in the house. One day while bathing the baby she was called out of the room, and when she returned the child was drowned in the bath.\n", "school_info": "School: Baile Caisleáin an Róistigh (B.)", "metadata": [{"Location:": "Castletownroche, Co. Cork", "Teacher:": "\nPádraig Ó Luineacháin\n"}, {"Language": "English"}]}, "4921814/4894998/5188824": {"title": "The Newmans - Dromore, Mallow", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0372, Page 039", "Page 039"], "url": "https://www.duchas.ie/en/cbes/4921814/4894998/5188824", "text": "\nMany years ago there lived a poor widow in the neighbourhood of Newberry, Mallow, who had an only son, a young boy. He stole some apples from the Newmans of Newberry Manor, and as a punishment Newman had him tied to the back shafts of a car, and flogged from Tullera Cross to Newberry Graveyard.    The widow knelt on the grass near the graveyard and cursed the Newmans. she put the Curse of the Crows on them, and also foretold that the Newman family would die out, and be without much land. Ever since crows have not built within Newberry Manor demesne, and the male members of the family are without heirs.    Sir John and Lady Newman (latter lately deceased) lost practically all their riches in the Wall St Crash recently. Newberry Manor is now a home for aged and infirm people and is called Nazareth home, and run by nuns.     It is said that grass has never grown since where the widow knelt to curse the Newmans.\n", "school_info": "School: Baile Caisleáin an Róistigh (B.)", "metadata": [{"Location:": "Castletownroche, Co. Cork", "Teacher:": "\nPádraig Ó Luineacháin\n"}, {"Collector": "Pádraig Ó Cuinneagáin", "Gender": "male", "Occupation": "príobhoide", "Address": "Castletownroche, Co. Cork"}, {"Informant": "Cornelius O' Flynn", "Gender": "male", "Age": "87", "Address": "Mallow, Co. Cork"}, {"Language": "English"}]}, "4921817/4895282/5190823": {"title": "Piseoga", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0372, Page 337", "Page 337"], "url": "https://www.duchas.ie/en/cbes/4921817/4895282/5190823", "text": "", "school_info": "School: Béal Átha Hubhla (B.)", "metadata": [{"Location:": "Ballyhooly, Co. Cork", "Teacher:": "\nDáithí Ó Murchadha\n"}, {"Collector": "Liam Ó Lombárd", "Gender": "male", "Age": "12", "Address": "Castleblagh, Co. Cork"}, {"Language": "Irish"}]}, "4921817/4895283/5190825": {"title": "Piseoga", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0372, Page 338", "Page 338"], "url": "https://www.duchas.ie/en/cbes/4921817/4895283/5190825", "text": "", "school_info": "School: Béal Átha Hubhla (B.)", "metadata": [{"Location:": "Ballyhooly, Co. Cork", "Teacher:": "\nDáithí Ó Murchadha\n"}, {"Collector": "Tomás Ó Conaill", "Gender": "male", "Age": "12", "Address": "Ballyhooly, Co. Cork"}, {"Informant": "Diarmuid Ó Murchadha", "Gender": "male", "Occupation": "múinteoir"}, {"Language": "Irish"}]}, "4921817/4895284/5190826": {"title": "Piseoga - Scéal Eile", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0372, Page 339", "Page 339"], "url": "https://www.duchas.ie/en/cbes/4921817/4895284/5190826", "text": "\nScéal eile - Fadó do bí sagart ag dul féin d'tuait cun Aifrinn do léigeam ideig  éigin.  Do bí sé go moc ar maidín Bealtaine nuair bí sé ag gabail an botair.  Do bí sé míle o'n deig nuair do connaic sé bean istig i bpáirc agus i measc na mbó le bata. Deiread an bean \"Leat an bainne a bead agat dómsa\" agus deiread an sagart \"an leat eile dómsa.  Mar sin do cuaid an bean ó buin go buin ag rad na b'focal céadna.  Do bí bó amáin ag an sagart.  Seactain in a diaid sin.  Maidin amáin do bí and cailín aimsire ag an sagart ag deanaim ime, agus nuair d'oscail sí an meaosr bí rí lán d'ím.  D'innis an cailín an scéal don sagart agus do cuaid sé go dtí an feirmeóir cun an sceal d'innsine dó.  Dubairt an feirmeóir nac raib aon ím aige an seactain sin. Tug an sagart a cuid féin tar trus go dtí an feirmeóiri.  Do léig an sagart Aifreann in san deig agus do cuir sé sin deire leis na piséoga.\n", "school_info": "School: Béal Átha Hubhla (B.)", "metadata": [{"Location:": "Ballyhooly, Co. Cork", "Teacher:": "\nDáithí Ó Murchadha\n"}, {"Collector": "Tomás Ó Conaill", "Gender": "male", "Age": "12", "Address": "Ballyhooly, Co. Cork"}, {"Language": "Irish"}]}, "5177641/5175666/5196887": {"title": "A Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0596, Page 101", "Page 101"], "url": "https://www.duchas.ie/en/cbes/5177641/5175666/5196887", "text": "\n(continued from previous page)\n101this was the exact time when his death took place several miles away.This story was told by Paddy Clune ,Quin,Co .Clare.\n\n\n\nPiseóga .V1 -38. There was a woman named Mary  Sheedy living in a little house in Rosroe, Sixmilebridge ,County Clare.Though she had only one cow which she grazed on the road-side .She had plenty of milk and butter the whole year round. She bore a very bad name of interfering with her neighbours' cows during the night when they were all asleep .One night Michael Quinlivan's workman stayed up to find out who was milking the cows .About twelve o'clock or so he saw a a woman approaching one of the cows and she began to milk her .he stole behind and caught her by the poll and great was his surprise when he found that it\n(continues on next page)\n", "school_info": "School: An Daingean, Cuinche", "metadata": [{"Location:": "Dangan, Co. Clare", "Teacher:": "\nStiofán Mac Clúin, Treasa Ní Chonmara\n"}, {"Informant": "Miss Mary Clune", "Gender": "female", "Address": "Quin, Co. Clare"}, {"Language": "English"}]}, "5177641/5175669/5196891": {"title": "Piseoga", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0596, Page 104", "Page 104"], "url": "https://www.duchas.ie/en/cbes/5177641/5175669/5196891", "text": "\n10410.V1 .'38. Piseóga.Some years ago in the parish of Clooney ,Quin,Co.Clare a number of poor landless people got some 'mock' ground from a neighbouring farmer .The field was divided into plots and each person got a plot for himself.The farmer supplied the manure and potatoes were planted in ridges.One of the plot holders used to spend every evening after his usual work doing something or other with his potatoes. One evening at dusk he sat down at the headland to take a smoke .He was surprised to see a man walking across the middle of the field and sticking down something in each plot. When the man had gone away and as he was curious to know what he was sticking down as he crossed the garden ,he went to find out for himself.After searching about for some time he at last found a short twig\n(continues on next page)\n", "school_info": "School: An Daingean, Cuinche", "metadata": [{"Location:": "Dangan, Co. Clare", "Teacher:": "\nStiofán Mac Clúin, Treasa Ní Chonmara\n"}, {"Informant": "John Scanlan", "Gender": "male", "Occupation": "postman", "Address": "Quin, Co. Clare"}, {"Language": "English"}]}, "5177641/5175671/5196903": {"title": "Piseoga", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0596, Page 106", "Page 106"], "url": "https://www.duchas.ie/en/cbes/5177641/5175671/5196903", "text": "\n10610-1-'38     Piseóga.There was a smith one time living in the parish of Feakle when i lived there with my poor father.God rest his soul.He also had a large farm of land .One day he had a mihil of men digging potatoes and when it came up to dinner time he was surprised his wife wasn't coming out to call them into the dinner.So he came in to see what was wrong.His wife was making a churn since they went out to the garden to have fresh butter for the dinner.He asked her hadn't she the churn made yet and she replied she couldn't make it.he moved up the churn from the fire and called in a young chap and gave him five shillings and told him to go to the shop for some butter for the men's dinner.When the dinner was over the man remained in the house brought down the churn again and went out to the forge\n(continues on next page)\n", "school_info": "School: An Daingean, Cuinche", "metadata": [{"Location:": "Dangan, Co. Clare", "Teacher:": "\nStiofán Mac Clúin, Treasa Ní Chonmara\n"}, {"Informant": "Mrs Bridget Shea", "Gender": "female", "Address": "Dangan, Co. Clare"}, {"Language": "English"}]}, "5162138/5157583/5202543": {"title": "Scéal", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0611, Page 322", "Page 322"], "url": "https://www.duchas.ie/en/cbes/5162138/5157583/5202543", "text": "", "school_info": "School: Leitir Uí Cheallaigh, Sráid na Cathrach", "metadata": [{"Location:": "Letterkelly, Co. Clare", "Teacher:": "\nSeosamh Devitt\n"}, {"Informant": "Aodh Mac Cúirtín", "Gender": "male", "Address": "Cloghaun Beg, Co. Clare"}, {"Language": "Irish"}]}}