{"4427866/4351939/4435375": {"title": "Caoineadh Chú Chulainn i Sruthar", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0102, Page 159", "Page 159"], "url": "https://www.duchas.ie/en/cbes/4427866/4351939/4435375", "text": "\nCaoineadh Cú Chulainn i SrutharNuair a bhí na trí cúigí buailte ag Cú Chulainn agus iad go léir faoi chois aige, dubhairt sé go dtabharfadh sé aghaidh ar Chúige Uladh. Bhí sluagh mór gaisgidheach in éinfeacht leis. Sul má d'fhág sé Cúige Laighean bhí a bhean ag súil le clann, agus thug sé fáinne dí, agus dubhairt sé leithi dá mba mac a bhéadh aice gan é a ligint as a h-amharc in áit ar bith, nó go mbéadh a mhéar i ndon an fáinne sin a líonadh, agus nuair a bhéadh, cead a chinn a thabhairt dó.Nuair a bhí sé in aois fiche bliadhan, bhí sé chomh mór le faitheach, agus rinne ladhair a láimhe an fáinne do líonadh. Agus é ag fás suas faoi chúram a mháthair, chuala sé tracht go minic ar na gníomhartha a rinne a athair, Cú Chulainn. Dubhairt sé nach stopfadh sé go deo go rachadh sé fá dhein a athar go bhfeicfeadh sé cén sórt fear a bhí ann. Thug sé leis sluagh mór eile gaisgidhe tréana, agus thug sé a ghaidh ar Chúige Uladh. Siar i Sruthar, ar theórann Co. Muigeo agus Conndae na Gaillimhe a casadh ar a chéile iad (Sluaighthe Ulaidh agus sluaighthe Laighin, sluaighthe Cú Chulainn agus sluaighthe a mhic.) Cuir an dá gaisgidheach mór cath ar a chéile, agus d'aithnigh an mac an tAthair, ach ní raibh aithne ag Cú Chulainn ar a mhac.\n(continues on next page)\n", "school_info": "School: Sruthar (C.)", "metadata": [{"Location:": "Shrule, Co. Mayo", "Teacher:": "\nBríd, Bean Uí Éanacháin\n"}, {"Collector": "Máire Ní Chatháin", "Gender": "female"}, {"Informant": "Miss Keane", "Relation": "unknown", "Gender": "female", "Address": "Kilcurriv Eighter, Co. Galway"}, {"Language": "Irish"}]}, "4428343/4397223/4485763": {"title": "An Scéal is Fearr dár hInsíodh ariamh", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1050, Page 398", "Page 398"], "url": "https://www.duchas.ie/en/cbes/4428343/4397223/4485763", "text": "\nAn Scéal is Feárr dar h-Innseadh ariamh.Bhí sin ann ibhfad oshoin agus ibhfad oshoin fhéin é. Nuair a bhí Cú Chulainn ar an tsaoghal seo ba ghnáthach leis a dhul fhad le gabha a bhí ins an áit achan trathnóna go dtí go bhfuigheadh sé a chlaidheamh agus a thuagh géaraighíste. Fhad agus bhíodh an gabha ag cur béil ina gléasaraidhe troda dó bhíodh Cú Chulainn ag innse sgéaltai do'n ghabha. Bhí an fhuath ag Cú Chulainn ar mhnáibh agus lá ar bith a mbíodh bean an ghabhann ag éisteacht ní innsigheadh an gaiscidheach sgéal ar bith.Trathnóna amháin ar sgór ar bith, ars Cú Chulainn: \"Amárach innseochaidh mé sgéal duit a chuirfeas clár ar do chluais. Níor h-innsigheadh sgéal ariamh i mbaile nó in áit cosamhail leis, agus níor innis mé\n(continues on next page)\n", "school_info": "School: Éadan Anfaidh", "metadata": [{"Location:": "Edenfinfreagh, Co. Donegal", "Teacher:": "\nGráinne Ní Éagrain\n"}, {"Collector": "Gráinne Ní Éagrain", "Gender": "female"}, {"Language": "Irish"}]}, "4498309/4384024/4498323": {"title": "Old Irish Tale", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0785, Page 60", "Page 60"], "url": "https://www.duchas.ie/en/cbes/4498309/4384024/4498323", "text": "\n(60)Old Irish Tale.(Skerries, Co. Dublin.)In Lusk long ago there was a house where travellers could stop overnight. Now it happened that one night Cuchulain was passing through the town and he stopped in this house for a week. The man who owned this house had five or six daughters. The youngest daughter was called Eamair, and at that time it was a rule that the eldest daughter or son got married first. Cuchulain, however fell in love with Eamair, and when he was going away he brought her with him and married her. Since then the rule was broken. Michael Hoey, Rathmooney, Lusk.\n", "school_info": "School: Skerries (St. Patrick's : Boys)", "metadata": [{"Location:": "Skerries, Co. Dublin", "Teacher:": "\nT. Mc Namee\n"}, {"Collector": "Michael Hoey", "Gender": "male", "Address": "Rathmooney, Co. Dublin"}, {"Language": "English"}]}, "4428188/4385091/4510197": {"title": "Bird-Lore", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0789, Page 48", "Page 48"], "url": "https://www.duchas.ie/en/cbes/4428188/4385091/4510197", "text": "\nBird LoreIn ireland the weather can be judged by the behaviour of birds, for instants when the swallow flies low it is a sign of rain because the midges fly low when it is going to rain.When the seagully comes in land it is a sign that it is going to be stormy because the seas are so rough they can not get food.When our saviour was on the cross the Robin tried to pull the thorns out of his head and a drop of blood fell on his breast and it is there ever since.When cuchulainn was fighting his enemies he received over a hundred wounds and (and) he tied himself to a stone so that his enemies thought he was alive but a bird lit on his shoulder and when his enemies saw they they knew he was dead. Then they cut off his head and played football with it.Written by : Joseph O'Reilly, SwordsTold by: Joseph O'Reily, Swords Senior\n", "school_info": "School: Swords (B.)", "metadata": [{"Location:": "Swords, Co. Dublin", "Teacher:": "\nA. Hamill\n"}, {"Collector": "Joseph O' Reilly", "Gender": "male", "Address": "Lissenhall Great, Co. Dublin"}, {"Informant": "Joseph O' Reilly", "Gender": "male", "Age": "63", "Address": "Lissenhall Great, Co. Dublin"}, {"Language": "English"}]}, "4428188/4384857/4510689": {"title": "My Home District", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0789, Page 119", "Page 119"], "url": "https://www.duchas.ie/en/cbes/4428188/4384857/4510689", "text": "\nMy Home - districtMy home-district is a townland called Balheary. It is in the parish if Donabate and in the barony of Nethercross. There are about 30 families in it.Farrell, Bell and Madden are the family names which are most common. Most of the houses have slated roofs. The oldest people in Balheary are Finlay's, Bells, and Mr. Bollard. About a mile from Balheary it is said that Emer, the wife of Cuchulain was born. Through the lowest part of the land runs a stream called the Broadmeadow. The land is low lying and fertile.Told by:- Patrick Scahill BalhearyWritten by:- Patrick Scahill Balheary\n", "school_info": "School: Swords (B.)", "metadata": [{"Location:": "Swords, Co. Dublin", "Teacher:": "\nA. Hamill\n"}, {"Collector": "Patrick Scahill", "Gender": "male", "Address": "Balheary, Co. Dublin"}, {"Informant": "Patrick Scahill", "Gender": "male", "Address": "Balheary, Co. Dublin"}, {"Language": "English"}, {"Location": "Balheary"}]}, "4493644/4407351/4515420": {"title": "Seanscéal - Níon an Rí", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1079, Page 61", "Page 61"], "url": "https://www.duchas.ie/en/cbes/4493644/4407351/4515420", "text": "\nDeir na sean daoine go rabh Cúchulainn  ins an chonndae seo ar fastodh ag feir a bhí in a chomhnuidhe i mbaile Dún na nGall. Chaith sé bliadhna ar fastodh ann, agus ag deireadh an ama sin d'imthigh sé leis na bhaile. Nuair a chuaidh sé na bhaile bhí lúghthair mhór ar a mháthair agus ar a athair agus ar na comharsanaigh roimhe.Rinne siad féasta mór dó, agus nuair a bí an féasta thart d'imthigh sé leis agus thug sé leis madadh beag a bhí aige, a fuair sé nuair a bhí sé i nDun na nGall, agus chuaidh sé suas\n(continues on next page)\n", "school_info": "School: Doire Chasáin", "metadata": [{"Location:": "Derrycassan, Co. Donegal", "Teacher:": "\nTomás Mac Fhionghaile\n"}, {"Collector": "Nóra Ní Ghallchobhair", "Gender": "female", "Address": "Ardbane, Co. Donegal"}, {"Informant": "Pádraig Ó Gallchobhair", "Gender": "male", "Age": "56", "Address": "Ardbane, Co. Donegal"}, {"Language": "Irish"}]}, "4493700/4412520/4526864": {"title": "Ag Dul go Toraigh dúinn", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1094, Page 585", "Page 585"], "url": "https://www.duchas.ie/en/cbes/4493700/4412520/4526864", "text": "\n(continued from previous page)\nbeannachtach nuair a mhothuigheamar a tosach ag bualadh an ghainimh.\n", "school_info": "School: An Árd Leathan", "metadata": [{"Location:": "Altlahan, Co. Donegal", "Teacher:": "\nPádraig Mac Ailin\n"}, {"Collector": "Róise Nic Néill", "Gender": "female"}, {"Language": "Irish"}]}, "4566077/4564848/4572691": {"title": "Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0029, Page 0209", "Page 0209"], "url": "https://www.duchas.ie/en/cbes/4566077/4564848/4572691", "text": "\nMy father, Martin Mannion, of Fairfield, about one mile north of Aughrim, told me this story.  He is aged about fifty two or three years.      Cuchulain and Ferdiad were two strong men that lived in Ireland long ago.  Those two men were married.  They were living a short distance away from each other.      Ferdiad's wife did not like Cuchulain at all.  She had some grudge or other against him.  She was continually asking her husband to give him a sound thrashing, but Ferdiad was afraid of Cuchulain.      At length and at last, he took courage and set out for his neighbour's house.  Cuchulain's wife saw Ferdiad coming.  She knew well that this man was able to beat her husband and he knew it too.      \"Here is Ferdiad coming.  I wonder what is he looking for.  I suppose he is looking for a fight.  That wife of his is a holy fright\" said Cuchulain's wife.  Cuchulain looked at the door, and at the window, and saw that there were no means of escape.      \"Here, jump into the cradle, and I'll put the clothes about you\" said his wife.  In he got, and made himself comfortable.  Now Cuchulain's\n(continues on next page)\n", "school_info": "School: Caitrín Naomhtha, Eachdhruim", "metadata": [{"Location:": "Aughrim, Co. Galway", "Teacher:": "\nPádraig Ó Ceocháin\n"}, {"Collector": "Bertie Mannion", "Gender": "male", "Address": "Fairfield, Co. Galway"}, {"Informant": "Martin Mannion", "Relation": "parent", "Gender": "male", "Age": "52 till 53", "Address": "Fairfield, Co. Galway"}, {"Language": "English"}]}, "4569043/4566370/4574322": {"title": "The Landlord", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0033, Page 0145", "Page 0145"], "url": "https://www.duchas.ie/en/cbes/4569043/4566370/4574322", "text": "\n(continued from previous page)\nthe landlords. During their reign Ireland and it's people suffered very much, but they bore it bravely to the end and now we have no landlords, or any such men and every improvement a man makes on his farm, it is for his own good.\n\n\n\nSean Sgéalta.Tá sgéal ag na daoine atá in a gconai gcomhnuidhe tart timcheall na h-áite seo faoi Choich Osgair. Deireann siad gur chaith Osgar cloch ó Chon mhaicne mara agus gur thuit an chloch san fhairrge in aice le tamhain. Is féidir an chloch sin a fheiceál fós agus tugtar cloch Ogair uirthí. Tá sgéal ag na daoine atá in a gcomhnuidhe thart timcheall na h-áite seo faoin chaoi a bhfuair Cúculainn a ainm. Deireann siad go bhfuair Conchubhar Mac Neasa agus sgata de laochraibh na Craobhruaidhe cuireadh go féasta ó Culann árd gabha illadh. Bhí Setanta le teacht in a ndiaidh go dtí an féasta. Bhí cú mór fíochmhar ag\n(continues on next page)\n", "school_info": "School: Garán", "metadata": [{"Location:": "Garraun, Co. Galway", "Teacher:": "\nSeán Breathnach, Domhnall Ua Ríoghbhardáin\n"}, {"Language": "Irish"}]}, "4613704/4610665/4626285": {"title": "Peil agus Iománaíocht", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0067, Page 421", "Page 421"], "url": "https://www.duchas.ie/en/cbes/4613704/4610665/4626285", "text": "\n(continued from previous page)\ncé'n duine a chuirfeadh níos fuide ná na daoine eile e.\n\n\n\nBa laoch tréan fíochmhar é Cú Culann. B'as Cúige Uladh é. Bhí sé ag troid uair i n-aghaidh Feirdiadh laoch as Connacht. Bhiodar ag troid ar feadh trí lá agus sa deire marbhuigheadh Feirdiadh. Bhí eagla an domhain ar námhbhaibh Cú Culann in a dhiaidh sin. Ní rachadh siad i bhfoisgeacht míle dhó le teann faithcíos. Sa deireadh nuair a d'airigh Cú Culann go raibh sé ag éirghe lag sheas sé i gcoinne cloiche agus fuair sé bás in a sheasamh. Bhí an námhadh ag ceapadh go raibh sé beo fós agus níor tháinig siad in aice leis go bhfacha siad na h-éanlaith in a seasamh ar a cheann. Bhí fíos aca annsin go raibh sé marbh. Tá marmar Cú Culann i mBaile Atha Cliath agus an pichtiur deire seo dá shaoghal atá le h-innseacht dúinn.Eibhlín Ní Laidhigh, Éiscir\n", "school_info": "School: Cill Ainbhthin", "metadata": [{"Location:": "Killannin, Co. Galway", "Teacher:": "\nAoife Bean Mhic Dhonnchadha\n"}, {"Collector": "Eibhlín Ní Laidhigh", "Gender": "female", "Address": "Rosscahill, Co. Galway"}, {"Informant": "Pádraigh Ó Laidhigh", "Gender": "male", "Address": "Rosscahill, Co. Galway"}, {"Language": "Irish"}]}, "4591085/4589071/4642368": {"title": "Scéal - Cú Chulainn", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0011, Page 333", "Page 333"], "url": "https://www.duchas.ie/en/cbes/4591085/4589071/4642368", "text": "\nSgéal CúchulainnAn duine  a  fuaireas an sgéal uaidh: Tomás Mac An Iomaire, Coilín, CárnaAois 60 blian. Ón a athair a fuair seisean an sgéal.Bhí ceannuidhe mála annseo fadó, agus  casadh in áit é a raibh rástaí capall.Bhí na caiple ag rith agus siad a bhí go h-an luath, agus an ceannaidhe in a sheasamh ag breathnú orra. Tháinig fear chomh fada leis, agus d'fhiafruigh dhe an bhfaca sé rian rud ar bith ba luaithe ná na capaill. Níor labhair an ceannaidhe focal, d'fiafruigh sé arís dhe é agus dheamhan freagair a bhfuair sé. \"Bhuel, mara bfreagra' tú mo cheist ars' an fear eile, bainfidh mé an ceann anuas dhíot\"\"Tá bean s'abhaile agam, adeir an ceannuidhe, agus tá mé cinnte go bhfuil sí cuile pioc chomh luath le do chuid capall\". \"Mara fíor dhuit é  sin adeir an fear eile beidh an ceann bainte díot a'm-sa roimh an am seo i mbárach. Gabh abhaile anois agus tabhair leat do bhean annseo go dtéighe sí ag rith leis na capaill go bhfeicfimíd cé aca is luaithe\"Chuaidh an ceannaidhe abhaile  agus dubhairt le'n a mhnaoi go raibh an geall seo curtha aige, agus go raibh sé chomh maith dí theacht go rithfeadh sí leis na capaill. Níor thaithn sin leis an mhnaoi in aon chor, agus dubhairt sí nac raibh sí ag  aireachtáil go maith. \"Má's mar sin é adeir an ceannaidhe tá sé chomh maith dhom dhul ar ais go mbainfear an ceann dhíom\" D'imigh sé leis, agus nuair a chonaic an bhean ag imeacht é, tar éis chomh dona is a bhí sí lean sí é, agus  chuadar beirt go dtí an áit a raibh rástaí na gcapall.Socruigheadh an bhean agus na caiple le dul ag rith. Bhí cupán óir ceaptha d'on céad marcach a bheadh istigh. Trí rása a bhí orra. Bhí an bhean istigh chun thosaigh\n(continues on next page)\n", "school_info": "School: An Clochar i gCárna", "metadata": [{"Location:": "Carna, Co. Galway", "Teacher:": "\nSiúracha na Trócaire\n"}, {"Informant": "Tomás Mac an Iomaire", "Gender": "male", "Age": "60", "Address": "Cuilleen, Co. Galway"}, {"Language": "Irish"}]}, "4591085/4589077/4661518": {"title": "Scéal - Cú Chulainn", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0011, Page 339", "Page 339"], "url": "https://www.duchas.ie/en/cbes/4591085/4589077/4661518", "text": "\n(continued from previous page)\nach bhreith ar an gclaidheamh, an buachaill a bhualadh d'iarraidh eile, an bhean a bhualadh de'n tríomhadh buille. D'fhág sé an triúr aca marbh, agus sheol leis arís ó thigh an ghabhann, agus ní raibh a fhioscé'n fhad a bheadhins an sgéal marach gur labhair bean an ghabhann.\n\n\n\nNí bhíonn an tréad caorach nach mbíonn caora cham ann.An rud a sgríobhann an púca léigheann sé féin é.Bean mic is máthair céile mar a bhéadh cat is luch in aghaidh a chéileIs don abhras an chéad snáth\n", "school_info": "School: An Clochar i gCárna", "metadata": [{"Location:": "Carna, Co. Galway", "Teacher:": "\nSiúracha na Trócaire\n"}, {"Language": "Irish"}]}, "4666598/4665591/4668644": {"title": "Sliabh Mis, Léim Chuchulainn, Gleann na Léime", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0412, Page 263", "Page 263"], "url": "https://www.duchas.ie/en/cbes/4666598/4665591/4668644", "text": "\nSliabh Mis\" is a few miles from Tralee. I was often near standing on top of it. Each year when I go on holidays to my Aunt's house, I go there. The house is very near \"Sliabh Mis\". It is about two thousand feet in height. I had a fine view of Tralee Bay, and most of the vale of Tralee, and Tralee town, and the neighbouring villages of Fenit, the Spa, Camp, and Castlemaine.Conor Mac Daire, one of the kings of Iarmuman, or North Munster lived on the top of \"Sliabh Mis\", long before the Christian era. He was once king of all Munster. His wife was Blanard. The remains of Conor Mac Daire's fort is still to be seen.It is related locally here that Conor Mac Daire was attacked in this fort by Cuculainn. Cuculainn was beaten and driven off by Conor Mac Daire. Next year Cuculainn came again to attack Conor Mac Daire. In the beginning, Cuculainn, and his followers, some of the Red Branch knights, were beaten off again, but when Conor Mac Daire went to sleep he was betrayed by hi wife Blanard, and Conor Mac Daire was defeated and slain.In this trip to \"Sliabh Mis\", Cuculainn passed by Kilflynn. Tradition says he came from the North through Clare and jumped the Shannon. There is a place in the Shannon called \"Léim Cuculainn\", that is Cuculainn's\n(continues on next page)\n", "school_info": "School: Kilflynn, Lic Snámha", "metadata": [{"Location:": "Kilflyn, Co. Kerry", "Teacher:": "\nTomás Ó Hallmhúráin\n"}, {"Language": "English"}]}, "4678409/4678155/4688705": {"title": "Béaloideas", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0426, Page 484", "Page 484"], "url": "https://www.duchas.ie/en/cbes/4678409/4678155/4688705", "text": "\nTá áit ar an dtaobh tuaidh de Loc Scáil i gcnoc Drom Abhaile n'a raibh Cuchulainn na comhnaidhe ann. Do bhí caislean ináirde ar bharr an cnuic agus do bhí regiment saighduiri in a seasamh ar faid an chnuic. B'é saighduiri iad na clocha móra fado ina seasam agus sgraitín mar caipín ortha. Nuai a féacfa suas ortha do tabarfa an leabhar gur bh'fearaibh iad. Tháinig fatach o ait eile agus thugh sé féin agus a Shaighduiri fútha. Ins an áit go nglaodtar Cromán chidhfeá an caisleán. Biodar ag troid ar feadh dá lá, agus Cuchulainn ag fághail an lámh uactair ar Chromán.Do bhí Croman á ullumhughadh féin chun imtheact la.Do caith Cuchulainn luiath ar Cromán,ach spuineog a chaith sé. Nuair a chonnaic Cromán cad a caitheadh ar d'aithin sé ná raibh a tuille luaidhe aige. Do lean Cromán do bheith ag caiteam agus do leag sé caislean Cuchulainn agus ta an fhothrach ann fós.Fuaradh an scéal so ó Mhuiris Ó Cinnéide, Cam Dubh. Tá sé 84 bliadna. Feirmeoir. Chaith a shaoghal ar fad i gCam Dubh. Chualaidh sé an scéal ó sheandaoine a bhí ar an mbaile le linn a óige. Bhíodar os cionn 70 bliadhain nuair a chualaidh sé iad. Sgriobhadh an scéal so an 8adh Mhárta 1938\n", "school_info": "School: Breac-Cluain (B.)", "metadata": [{"Location:": "Brackloon, Co. Kerry", "Teacher:": "\nPádraig Ó Séaghdha\n"}, {"Informant": "Muiris Ó Cinnéide", "Gender": "male", "Age": "84", "Occupation": "feirmeoir", "Address": "Coumduff, Co. Kerry"}, {"Language": "Irish"}]}, "4678409/4678172/4688757": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0426, Page 501", "Page 501"], "url": "https://www.duchas.ie/en/cbes/4678409/4678172/4688757", "text": "\nLong ago Cúrio Mac Daire went up to Ulster fighting. The King of Ulster went to Scotland taking a castle. Cúrió rold him he would chance it. He failed\n(continues on next page)\n", "school_info": "School: Breac-Cluain (B.)", "metadata": [{"Location:": "Brackloon, Co. Kerry", "Teacher:": "\nPádraig Ó Séaghdha\n"}, {"Informant": "Patrick Flahive", "Gender": "male", "Age": "55", "Occupation": "farmer", "Address": "Ballynane, Co. Kerry"}, {"Language": "English"}]}, "4678409/4678172/4688760": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0426, Page 501", "Page 501"], "url": "https://www.duchas.ie/en/cbes/4678409/4678172/4688760", "text": "\nLong ago Cúrio Mac Daire went up to Ulster fighting. The King of Ulster went to Scotland taking a castle. Cúrió rold him he would chance it. He failed\n(continues on next page)\n", "school_info": "School: Breac-Cluain (B.)", "metadata": [{"Location:": "Brackloon, Co. Kerry", "Teacher:": "\nPádraig Ó Séaghdha\n"}, {"Informant": "Patrick Flahive", "Gender": "male", "Age": "55", "Occupation": "farmer", "Address": "Ballynane, Co. Kerry"}, {"Language": "English"}]}, "4678409/4678172/4688770": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0426, Page 501", "Page 501"], "url": "https://www.duchas.ie/en/cbes/4678409/4678172/4688770", "text": "\nLong ago Cúrio Mac Daire went up to Ulster fighting. The King of Ulster went to Scotland taking a castle. Cúrió rold him he would chance it. He failed\n(continues on next page)\n", "school_info": "School: Breac-Cluain (B.)", "metadata": [{"Location:": "Brackloon, Co. Kerry", "Teacher:": "\nPádraig Ó Séaghdha\n"}, {"Informant": "Patrick Flahive", "Gender": "male", "Age": "55", "Occupation": "farmer", "Address": "Ballynane, Co. Kerry"}, {"Language": "English"}]}, "4678409/4678173/4688773": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0426, Page 502", "Page 502"], "url": "https://www.duchas.ie/en/cbes/4678409/4678173/4688773", "text": "\nLong ago a man lived in Inch named O'Shea. He had a fine horse. One day he was gathering seaweeds and he found a hood among the seaweeds. He went home then with his horse and the waves followed him. He galloped the horse and the waves were too quick for him. His horse got drowned and he escaped. A woman followed him to his house. She married him and they had two sons. One day O'Shea was cleaning a loft and he threw off the hood. She dressed the children and wenta way. She carried the hood with her. One of them joined the navy. There was a powerful man in the ship. One day he told O'Shea he would give him a great fright. He threw him out off the ship on the top of his head. He came into the ship again and threw the strong man out in the water. The strong man was drowned. The other man could pass through all the wate he liked.\n", "school_info": "School: Breac-Cluain (B.)", "metadata": [{"Location:": "Brackloon, Co. Kerry", "Teacher:": "\nPádraig Ó Séaghdha\n"}, {"Informant": "Patrick Flahive", "Gender": "male", "Age": "55", "Occupation": "farmer", "Address": "Gowlaneard, Co. Kerry"}, {"Language": "English"}]}, "4678410/4678337/4689205": {"title": "Scéal", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0426, Page 664", "Page 664"], "url": "https://www.duchas.ie/en/cbes/4678410/4678337/4689205", "text": "\nTa áit ar an dtaobh thuaidh de Loch Sgáil i gCnoc Drom-Abhaile 'na raibh Cuchulainn 'na chomhnaidhe ann.Do bhí caisleán ináirde ar bhárr an chnuic aige bhí \"Regiment\" saighdiúirí in a seasamh ar fhaid an chnuic. Sé bhí ins na saighdiúirí ná clocha mór fada na seasamh agus sgraitín mar caipín ortha. Nuair a fhéacfá suas ortha do thabharfá an leabhar gurbh fearaibh iad.Tháinig fathach ó áit eile agus chuir sé féin agus a shaighdúirí fútha ins an áit ar a glaodhtar Cromán. Ciafá an caisleán ó Chromán. Do chaith Cromán luaidhe suas go dtí Cuchulainn agus do bhí an bheirt fathach ag caitheamh ar feadh dhá lá agus bhí Cuchulainn ag faghail an lámh uachtair ar Cromán.Do bhí Cromán á ullamhughadh féin cun imtheacht leo. Do chaith Cuchulainn luaidhe do Cromán ach spiunóg a caith sé. Nuair a chonaic Cromán cad a chuaidh ag triall air d'aithin sé ná raibh a thuille luaidhe  aige. Do lean Cromán a beith caitheamh agus do leag sé caisleán Cuchulainn agus tá an fothrach ann fós.Siobhán Ní CinnéideFuaires an sgéal seo ó Muiris Ó Ceinnéide 86 bl.Cam-Dubh.\n", "school_info": "School: Breac-Cluain (C.)", "metadata": [{"Location:": "Brackloon, Co. Kerry", "Teacher:": "\nEibhlín, Bean Uí Néill\n"}, {"Collector": "Siobhán Ní Ceinnéide", "Gender": "female"}, {"Informant": "Muiris Ó Ceinnéide", "Gender": "male", "Age": "86", "Address": "Coumduff, Co. Kerry"}, {"Language": "Irish"}]}, "4678410/4678348/4689229": {"title": "Knockane", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0426, Page 675", "Page 675"], "url": "https://www.duchas.ie/en/cbes/4678410/4678348/4689229", "text": "\nKnockane is situated at the north west of Annascaul. The old people say that there was a grave yard in Knockane long ago. This grave yard was situated in the middle of the village. There are big stones and flags to be seen there still and on one of these stones there is a cross carved.\n\n\n\nTo the north of Coole there was a grave yard long ago, it was situated at the bottom of the hill. There are tomb stones with Ogham writing to be seen still. On one of those stones the letters L.B. are seen. Sometimes you can see this stone, but if you look for it you cannot find it even though you know where it is.\n\n\n\nOn the top of Dromavalla hill Cu Cullainn's castle was situated, and the old people say that gold is hidden there. People often tried to get the gold, but they did not succeed yet.\n", "school_info": "School: Breac-Cluain (C.)", "metadata": [{"Location:": "Brackloon, Co. Kerry", "Teacher:": "\nEibhlín, Bean Uí Néill\n"}, {"Collector": "Cáit Ní Dhuinnín", "Gender": "female"}, {"Informant": "Seán Ó Ceinnéide", "Gender": "male", "Age": "70", "Address": "Cool, Co. Kerry"}, {"Language": "English"}]}, "4678410/4678348/4689230": {"title": "Knockane", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0426, Page 675", "Page 675"], "url": "https://www.duchas.ie/en/cbes/4678410/4678348/4689230", "text": "\nKnockane is situated at the north west of Annascaul. The old people say that there was a grave yard in Knockane long ago. This grave yard was situated in the middle of the village. There are big stones and flags to be seen there still and on one of these stones there is a cross carved.\n\n\n\nTo the north of Coole there was a grave yard long ago, it was situated at the bottom of the hill. There are tomb stones with Ogham writing to be seen still. On one of those stones the letters L.B. are seen. Sometimes you can see this stone, but if you look for it you cannot find it even though you know where it is.\n\n\n\nOn the top of Dromavalla hill Cu Cullainn's castle was situated, and the old people say that gold is hidden there. People often tried to get the gold, but they did not succeed yet.\n", "school_info": "School: Breac-Cluain (C.)", "metadata": [{"Location:": "Brackloon, Co. Kerry", "Teacher:": "\nEibhlín, Bean Uí Néill\n"}, {"Collector": "Cáit Ní Dhuinnín", "Gender": "female"}, {"Informant": "Seán Ó Cheinnéide", "Gender": "male", "Age": "70", "Address": "Cool, Co. Kerry"}, {"Language": "English"}]}, "4678410/4678348/4689231": {"title": "Knockane", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0426, Page 675", "Page 675"], "url": "https://www.duchas.ie/en/cbes/4678410/4678348/4689231", "text": "\nKnockane is situated at the north west of Annascaul. The old people say that there was a grave yard in Knockane long ago. This grave yard was situated in the middle of the village. There are big stones and flags to be seen there still and on one of these stones there is a cross carved.\n\n\n\nTo the north of Coole there was a grave yard long ago, it was situated at the bottom of the hill. There are tomb stones with Ogham writing to be seen still. On one of those stones the letters L.B. are seen. Sometimes you can see this stone, but if you look for it you cannot find it even though you know where it is.\n\n\n\nOn the top of Dromavalla hill Cu Cullainn's castle was situated, and the old people say that gold is hidden there. People often tried to get the gold, but they did not succeed yet.\n", "school_info": "School: Breac-Cluain (C.)", "metadata": [{"Location:": "Brackloon, Co. Kerry", "Teacher:": "\nEibhlín, Bean Uí Néill\n"}, {"Collector": "Cáit Ní Dhuinnín", "Gender": "female"}, {"Language": "English"}, {"Location": "Brackloon"}]}, "4723827/4716855/4814360": {"title": "Old Irish Tales", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0937, Page 194", "Page 194"], "url": "https://www.duchas.ie/en/cbes/4723827/4716855/4814360", "text": "\nOn the top of a mountain named Mollyash there is a big stone supposed to have been thrown by a giant from Slieve Gullian to this mountain. It is also said that Cu-chulainn crossed this mountain on his way from Dundalk to Armagh. There is a \"Cairn\" on top of this same mountain and it is said that there is a Queen buried there.\n", "school_info": "School: Lios na gCraobh", "metadata": [{"Location:": "Lisnagreeve, Co. Monaghan", "Teacher:": "\nT. Ó Mórdha\n"}, {"Collector": "Mora Moore", "Gender": "female"}, {"Language": "English"}]}, "4742042/4730252/4951185": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0932, Page 120", "Page 120"], "url": "https://www.duchas.ie/en/cbes/4742042/4730252/4951185", "text": "\nNear Dundalk is an old ruin at Castletown where Cuchulainn was bron. After being idle a long time, the people began to explore it and saw a wise old rat running about. They saw him go into the ruins, carry out the full of his mouth of gold coins, leave them on the ground and sleep beside them. The people thought it a pity to lose the money and one day the soldiers took courage to watch the proceedings and stole the money. They got home, slept together and kept a great wolfhound in their bedroom. Next night started a great scraping at their door and soon at their window. The rat managed to get through the window and was attacked by the dog. A dreadful howling started up, the two men growing weak with fear. No matter how much the dog followed the rat, he could never touch him and at last the rat cleaned out the window and was never seen any more, and the two brave soldiers were very rich ever after.A Nic Aonguis\n", "school_info": "School: Céad na Mínseach", "metadata": [{"Location:": "Kednaminsha, Co. Monaghan", "Teacher:": "\nM. Nic Aodha\n"}, {"Informant": "A. Nic Aonguis", "Gender": "female"}, {"Language": "English"}]}, "4922058/4848291/4956343": {"title": "Local Place Names", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0513, Page 039", "Page 039"], "url": "https://www.duchas.ie/en/cbes/4922058/4848291/4956343", "text": "", "school_info": "School: Lowtown (B.), Galbally", "metadata": [{"Location:": "Galbally, Co. Limerick", "Teacher:": "\nPádraig Ó Ceallacháin\n"}, {"Collector": "Mícheál Ó Cuimín", "Gender": "male"}, {"Informant": "Mrs P. Fitzgerald", "Gender": "female", "Address": "Galbally, Co. Limerick"}, {"Language": "English"}, {"Location": "Ballycrana"}]}, "5008821/4958939/5071179": {"title": "Folklore", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0661, Page 103", "Page 103"], "url": "https://www.duchas.ie/en/cbes/5008821/4958939/5071179", "text": "\nFolkloreIreland in olden times had many fairies. Some of them were called the Celts, because they were small, and also because they were very old people.They live in forts. The Leprechaun is the shoemaker of the fairies and besides, he is their leader. If a person went into a fairy-fort he could hear the dull thud of the hammer on the shoe.\n\n\n\nThere is a large amount of ruins in Ireland, such as Cuchullain's mound. It is beleived that Cuchullain played there in childhood. Other historical places are at Faughart, where St. Brigid lived. Tara is also a place\n(continues on next page)\n", "school_info": "School: Dundalk (St. Nicholas Monastery)", "metadata": [{"Location:": "Dundalk, Co. Louth", "Teacher:": "\nBr. T. Ó Briain\n"}, {"Language": "English"}]}, "5008822/4959064/5072070": {"title": "Cuchulainn's Mount", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0661, Page 224", "Page 224"], "url": "https://www.duchas.ie/en/cbes/5008822/4959064/5072070", "text": "\nCuchulainn's MountThere is a cave in Cuchulainn mount and it is said that before Cuchulainn died he buried all his riches in that cave.Many people went into the cave to look for the treasure but nobody found it so it there yet for anybody who finds it.Told by:- Tom Kelly,St. Alphonsus VillasDundalkJames Ballantine\n", "school_info": "School: Naomh Maolmaodhóg, Dúndealgan", "metadata": [{"Location:": "Dundalk, Co. Louth", "Teacher:": "\nS. Ó Máirtín\n"}, {"Collector": "James Ballantine", "Gender": "male"}, {"Informant": "Tom Kelly", "Gender": "male", "Address": "Dundalk, Co. Louth"}, {"Language": "English"}]}, "5008834/4959597/5074097": {"title": "Local Ruins", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0664, Page 249", "Page 249"], "url": "https://www.duchas.ie/en/cbes/5008834/4959597/5074097", "text": "\nLocal Ruins.There are three or four old ruins in this district. In Barrleyfield theres one of an old mill. Long ago when it was in use meal was made in it from oats and wheat. There are six storeys in it, one is under the ground, and the other are built up high. There are about sixteen or eighteen small windows on the front wall, and one gablend is covered with ivy,There are ruins of an old chapel in Urney graveyard in Dungooley, and it is believed that it was one of St. Patrick'sIn \"Castletown Mount\" there are ruins of a castle where Cuchullian was crowned on it, and he was born just beside this \"Mount\", and it is built up on very high ground.Another ruined castle is situated in Castleroche, though there is not a big portion of it in ruins, long ago Lord Roche and his wife dwelt there. It is built up on very high ground.\n", "school_info": "School: Kilcurry, Dundalk", "metadata": [{"Location:": "Kilcurry, Co. Louth", "Teacher:": "\nP. Ó Conaill\n"}, {"Language": "English"}]}, "4922398/4877973/5076781": {"title": "The Enchanted Bull", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0625, Page 219", "Page 219"], "url": "https://www.duchas.ie/en/cbes/4922398/4877973/5076781", "text": "", "school_info": "School: Eanach, Sráid na Cathrach", "metadata": [{"Location:": "Annagh, Co. Clare", "Teacher:": "\nMáirtín Ó Críocháin\n"}, {"Collector": "Micheál Ó Loinghsigh", "Gender": "male", "Age": "14", "Occupation": "mac feirmeora", "Address": "Knockanalban, Co. Clare"}, {"Informant": "Tadhg Mac Mathghamhna", "Gender": "male", "Age": "76"}, {"Language": "English"}]}, "5008882/4963451/5077649": {"title": "Cú Chulainn's Pillar Stone", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0679, Page 075", "Page 075"], "url": "https://www.duchas.ie/en/cbes/5008882/4963451/5077649", "text": "\nCuchulainn's pillar stone.In a field, about two miles from Dundalk, and not far from Knockbridge, stands a pillar stone. We are told from local tradition that a giant died at this stone, and it is 'the; asserted that it is the death stone of Cuchulainn. The legend is that the hero having been fatally wounded would not give his enemies that satisfaction of seeing him fall, but bound himself by his girdle to a pillar stone and continued his last fight while life remained.Rita Allen, 58 Trinity Street DroghedaThe above was got from:-Mr. J. Allen (50)trinity Street, Drogheda\n", "school_info": "School: Pres. Convent, Drogheda", "metadata": [{"Location:": "Drogheda, Co. Louth", "Teacher:": "\nSr. M. Patrick\n"}, {"Collector": "Rita Allen", "Gender": "female", "Age": "58", "Address": "Trinity Street, Co. Louth"}, {"Informant": "Mr J. Allen", "Gender": "male", "Age": "50", "Address": "Trinity Street, Co. Louth"}, {"Language": "English"}]}, "4922385/4876441/5082362": {"title": "How Malbay Got its Name", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0622, Page 150", "Page 150"], "url": "https://www.duchas.ie/en/cbes/4922385/4876441/5082362", "text": "\nMalbay is situated in the west coast of Clare. There is a place called Loop Head and there is a valley between the rocks. It is the most southern point of Clare.It happened that a girl  named Moll felt in love with a man named Cuchulain, but he did not like her. One day he ran away and she followed him and she overtook him at Loop Head. He jumped across one side of the ditch to the other and she tried to follow him, but as she was crossing she fell. As  she went down her head was struck against the rocks and she was killed. Her corpse reddened the sea to Malbay and that is why it is called Milltown Malbay ever since.\n", "school_info": "School: Sliabh na Lice, Sráid na Cathrach", "metadata": [{"Location:": "Slievenalicka, Co. Clare", "Teacher:": "\nSeán Ó Cionnfhaola\n"}, {"Collector": "Nan Connell", "Gender": "female", "Address": "Gortbrack, Co. Clare"}, {"Informant": "(name not given)", "Relation": "grandparent", "Gender": "female", "Age": "80"}, {"Language": "English"}]}, "5009142/4990865/5103379": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0751, Page 424", "Page 424"], "url": "https://www.duchas.ie/en/cbes/5009142/4990865/5103379", "text": "\nTá cnoc i n-aice le Baile Mathghamhna darb ainm Mullach Mhoirne. (Mullavornia)Shé mo thuairim gur tugadh an t-ainm sin air ó Chlan Móirne.Tá an cnoch seo maol agus ar a bhárr tá lorg coise móire. Tugtar \"Cos Con Culann\"  (Cú Chulainn) ar an bhall seo.\n\n\n\nTimcheall leath-mhile ar an dtaobh thoir-ó-dheas den cnoc luaidhte thuas tá uaimh (McCutcheon's Cave)Tá sí ar an taobh clé de Chanáil na Mídhe. Is éigin do dhuine lámhachán isteach innte. Is dócha go bhfuil bealach fé thalamh go sean-chaislean atá i gCaisleán Cor (Castle Cor) déanta ón uaimh seo. Tá an caisleán timcheall 200 péirse ón uaimh.Ní féidir liom aon sgéal d fhagháil ón duine is sinne san cheanntar.Ós rud é go bhfuil leath-chiorcaill de thulcánaibh curtha amach suas le 20 péirse ón uaimh, dar liom go raibh sean-caislean ann san sean-aimsear.\n", "school_info": "School: Clochar na Trócaire, Baile Mathúna", "metadata": [{"Location:": "Ballymahon, Co. Longford", "Teacher:": "\nSr. M. Clement\n"}, {"Language": "Irish"}]}, "5009142/4990865/5103383": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0751, Page 424", "Page 424"], "url": "https://www.duchas.ie/en/cbes/5009142/4990865/5103383", "text": "\nTá cnoc i n-aice le Baile Mathghamhna darb ainm Mullach Mhoirne. (Mullavornia)Shé mo thuairim gur tugadh an t-ainm sin air ó Chlan Móirne.Tá an cnoch seo maol agus ar a bhárr tá lorg coise móire. Tugtar \"Cos Con Culann\"  (Cú Chulainn) ar an bhall seo.\n\n\n\nTimcheall leath-mhile ar an dtaobh thoir-ó-dheas den cnoc luaidhte thuas tá uaimh (McCutcheon's Cave)Tá sí ar an taobh clé de Chanáil na Mídhe. Is éigin do dhuine lámhachán isteach innte. Is dócha go bhfuil bealach fé thalamh go sean-chaislean atá i gCaisleán Cor (Castle Cor) déanta ón uaimh seo. Tá an caisleán timcheall 200 péirse ón uaimh.Ní féidir liom aon sgéal d fhagháil ón duine is sinne san cheanntar.Ós rud é go bhfuil leath-chiorcaill de thulcánaibh curtha amach suas le 20 péirse ón uaimh, dar liom go raibh sean-caislean ann san sean-aimsear.\n", "school_info": "School: Clochar na Trócaire, Baile Mathúna", "metadata": [{"Location:": "Ballymahon, Co. Longford", "Teacher:": "\nSr. M. Clement\n"}, {"Language": "mixed"}]}, "5044574/5023503/5138935": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0801, Page 337", "Page 337"], "url": "https://www.duchas.ie/en/cbes/5044574/5023503/5138935", "text": "\nWritten by Gerard Hickey,Told to him by Patrick Hickey,Dunville,Rhode,Offaly.The following story relates to one of the Fenian warriors named Cu Chulainn. The people of this district challenged him for a game of hurley. The playing field of that time was in the property of Mr O'Toole Rathmoyle. When Cu Chulainn saw the ball they were going to hurl he laughed them to scorn. He was about to turn home when he saw a rock in a nearby field, he went towards it and hit it with his hurley. The natives nearly fainted when they saw the distance he drove above the rock. He came towards them hurling the rock before him. They were too, so amazed at the sight of Cu Chulainn hurling the rock that they were unable to speak. They stood as if rooted to the ground at the skillful way in which he handled the rock. Why do you stand like so, roared Cu Chulainn speaking to the amazed crowd of people. This roar terrified them more than ever. Cu Chulainn let out a yell of rage and said that he had been wasting his time in coming to hurl such a team. Even though the team was composed of fifteen of the best men of the district, Cu Chulainn left the field in a state of fury and left the dazed men behind him.\n", "school_info": "School: Ród (B.)", "metadata": [{"Location:": "Rhode, Co. Offaly", "Teacher:": "\nP. Ó Maoldomhnaigh\n"}, {"Collector": "Gerard Hickey", "Gender": "male"}, {"Informant": "Patrick Hickey", "Gender": "male", "Address": "Dunville, Co. Offaly"}, {"Language": "English"}]}, "5044574/5023505/5138948": {"title": "Old Stones", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0801, Page 339", "Page 339"], "url": "https://www.duchas.ie/en/cbes/5044574/5023505/5138948", "text": "\nIna  field in Ballyburley\" now occupied by \"Michael Hickey\" there stands a stone about two foot in height, I have been told by the owner's son that it was a piece of butter which Finn McCumhaill's sister was throwing to her sister in law from Carbury Hill to Croghan Hill where a threshing was going on. It is said to have alighted in Heiskey's [?] field where it turned into a stone but the finger prints are still to be seen on it.  There is also a stone in Joe McCabe's field. It is said to have been put there by two men who when digging a grave for an unknown corpse discovered it and after burying the corpse evicted it as a monument. This stone is said to have been there since the fourteenth century. It was first a lump of butter like the other but was not thrown from the same place. It is said to have been thrown from Cashel Hill by another sister of Finn McCumhaill. It is amazing how it at first was a piece of butter and now serves as a scratchpost for the cattle.\n", "school_info": "School: Ród (B.)", "metadata": [{"Location:": "Rhode, Co. Offaly", "Teacher:": "\nP. Ó Maoldomhnaigh\n"}, {"Collector": "Maurice O' Toole", "Gender": "male"}, {"Informant": "John O Toole", "Gender": "male", "Address": "Rhode, Co. Offaly"}, {"Language": "English"}]}, "4798765/4796297/5150695": {"title": "Cú Chulainn agus Conlaoch", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0298, Page 289", "Page 289"], "url": "https://www.duchas.ie/en/cbes/4798765/4796297/5150695", "text": "\n(continued from previous page)\nConnlaoch the brave and haughty, flushed for fameFrom Donn Sgathac's walls to Erin came,Came purposely to view her verdant coasts,And prove the valour of her warlike hosts.\"Welcome, oh martial youth of visage fairof brilliant armour + intrepid air,'Like adverse winds opposed thy wished-for wayAnd that thou hast been for some time astray.Now that thou comest from the spacious EastThe sweets of our salubrious isle to taste, Recount thy travels, give a full reviewOf those exploits from whence thy glories grew;\n", "school_info": "School: Bréan-tráigh (B.)", "metadata": [{"Location:": "Unionhall, Co. Cork", "Teacher:": "\nTomás Ó Donnabháin\n"}, {"Collector": "Tomás Ó Donnabháin", "Gender": "male"}, {"Language": "English"}]}, "4798765/4796296/5150938": {"title": "Nótaí Beaga ar Sheán Máistir Ó Coileán", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0298, Page 288", "Page 288"], "url": "https://www.duchas.ie/en/cbes/4798765/4796296/5150938", "text": "", "school_info": "School: Bréan-tráigh (B.)", "metadata": [{"Location:": "Unionhall, Co. Cork", "Teacher:": "\nTomás Ó Donnabháin\n"}, {"Collector": "Tomás Ó Donnabháin", "Gender": "male"}, {"Language": "Irish"}]}, "4921921/4900428/5164619": {"title": "Old Irish Tales", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0396, Page 129", "Page 129"], "url": "https://www.duchas.ie/en/cbes/4921921/4900428/5164619", "text": "\nOne day when Fionn Mac Cool was hunting with the Fianna a lady came up to them. Fionn asked her what was her name and She said she was the wife of a king named Tailc Mach Treóin. She said that he hunted her out of the palace. After a while they saw aman coming with a cat's head and a cat's tail on him. Then she told them that he was Tailch. He started fighting with the Fianna & after he killing a hundred men Oscaar felt sorry for what was killed. Oscar asked to be left go fighting against him. Fionn agreed and Oscar went. They fought for five days & five nights and at the end of the fifth day Oscar killed him.\n\n\n\nWhen Cuchulan and Ferdia were fighting Cuchulan's attendant saw them and he got his sword. Its name was Gae Bolga. On the sword there were a lot of edges on each side of it so that if it got stuck in any-one\n(continues on next page)\n", "school_info": "School: Baile na Martra (B.)", "metadata": [{"Location:": "Castlemartyr, Co. Cork", "Teacher:": "\nSeán de Barra\n"}, {"Collector": "Donal Cronin", "Gender": "male", "Address": "Garranejames, Co. Cork"}, {"Informant": "Mr Cronin", "Gender": "male", "Age": "45", "Occupation": "labourer", "Address": "Garranejames, Co. Cork"}, {"Language": "English"}]}, "5162147/5158755/5198165": {"title": "Cú Chulainn agus Mal", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0633, Page 294", "Page 294"], "url": "https://www.duchas.ie/en/cbes/5162147/5158755/5198165", "text": "\nWhen Cu Culainn lived he was plagued by a woman who wanted to marry him (named Mal). So tired of her attentions was he that he decided to flee but she followed him. At last they reached Loop Head and when Cu Culainn was about to rest he looked around and found her near at hand. Outside Loop-head there is an island and on to this Cu Culainn but Mal with another leap was at his heels. Cu Culainn then had to leap back again to the main-land a much more difficult jump but he succeeded. When Mal attempted the jump she failed, fell into the sea and was drowned. The sea was red with her blood. Where she jumped is still called Loophead, a bay in west Clare is called Mal Bay and the headland near where her body was found near Innistymon is called Hag's Head\n\n\n\nII. Martin Quealy says that when Cu Culainn landed on the rock a mermaid came up and ordered him to leave it or that he would be turned into a mermaid.III. Dan Murray says the strenuous flight and jumps sapped Cu Culainn's strength and he was never much use afterward. The spot on the cliff where Mal struck her head is still colored red.IV. When fleeing, Cu Culainn hid in a cabin under the ground with a door at either end. Someone told Mal and when she entered by one door he fled through the other.\n", "school_info": "School: Dún Átha, Carraig an Chabhaltaigh", "metadata": [{"Location:": "Doonaha, Co. Clare", "Teacher:": "\nEd J. Headtromóin\n"}, {"Collector": "Pat Keating", "Gender": "male", "Occupation": "teacher", "Address": "Kilbaha, Co. Clare"}, {"Language": "English"}]}, "5162147/5158755/5198168": {"title": "Cú Chulainn agus Mal", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0633, Page 294", "Page 294"], "url": "https://www.duchas.ie/en/cbes/5162147/5158755/5198168", "text": "\nWhen Cu Culainn lived he was plagued by a woman who wanted to marry him (named Mal). So tired of her attentions was he that he decided to flee but she followed him. At last they reached Loop Head and when Cu Culainn was about to rest he looked around and found her near at hand. Outside Loop-head there is an island and on to this Cu Culainn but Mal with another leap was at his heels. Cu Culainn then had to leap back again to the main-land a much more difficult jump but he succeeded. When Mal attempted the jump she failed, fell into the sea and was drowned. The sea was red with her blood. Where she jumped is still called Loophead, a bay in west Clare is called Mal Bay and the headland near where her body was found near Innistymon is called Hag's Head\n\n\n\nII. Martin Quealy says that when Cu Culainn landed on the rock a mermaid came up and ordered him to leave it or that he would be turned into a mermaid.III. Dan Murray says the strenuous flight and jumps sapped Cu Culainn's strength and he was never much use afterward. The spot on the cliff where Mal struck her head is still colored red.IV. When fleeing, Cu Culainn hid in a cabin under the ground with a door at either end. Someone told Mal and when she entered by one door he fled through the other.\n", "school_info": "School: Dún Átha, Carraig an Chabhaltaigh", "metadata": [{"Location:": "Doonaha, Co. Clare", "Teacher:": "\nEd J. Headtromóin\n"}, {"Collector": "Patsy Walshe", "Gender": "unknown"}, {"Language": "English"}]}}