{"4428089/4377459/4435055": {"title": "A Funny Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0636, Page 2", "Page 2"], "url": "https://www.duchas.ie/en/cbes/4428089/4377459/4435055", "text": "\nThere was once a woman who lived in Lismore. She was possessed by the devil, and they called her \"Petticoatloose,\" because one night while at a dance the petticoat fell off her. She used to live in the woods, and was the terror of the country-side. She used to pretend to be an old woman and asked the men who would be passing by on a horse for a drive. When she would go into the cart, steam used come out of the horse's legs and next morning the man or the horse would be dead.\n", "school_info": "School: Clochar na Toirbhirte, Lios Mór", "metadata": [{"Location:": "Lismore, Co. Waterford", "Teacher:": "\nAn tSr M. Cárthach\n"}, {"Collector": "Tess Tierney", "Gender": "female", "Address": "Lismore, Co. Waterford"}, {"Informant": "Mrs. M. O Donnell", "Relation": "grandparent", "Gender": "female", "Address": "Lismore, Co. Waterford"}, {"Language": "English"}]}, "4428095/4377905/4437216": {"title": "A Story of Petticoat Loose", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0637, Page 2", "Page 2"], "url": "https://www.duchas.ie/en/cbes/4428095/4377905/4437216", "text": "\nPetticoat Loose was seen long ago in the wood near Lismore glen. If anybody wanted to pass he would have to give her a lift. Nobody liked to give her a lift because there was nearly a ton weight in her left hand and the strain of the weight told on the horses of those who gave her a lift. Also if the person who was giving her a lift refused to drive on or attempted to look back she would crush him to death with her left hand.One night as Mr. O'Donnel's grandfather was going home on his horse she jumped up behind him. The weight began to tell on the horse so Mr. O'Donnell decided to get rid of her. He knew her power would be gone if she were in water so he decided to throw her in the glen. He drove the horse into the water and when she was not looking he unseated her and she fell in.She know she would have to be out of the water by two o'clock in the morning or her power would be gone forever. She intended to kill the man and horse when she got out\n(continues on next page)\n", "school_info": "School: Ceapach Chuinn (B.)", "metadata": [{"Location:": "Cappoquin, Co. Waterford", "Teacher:": "\nProinnsias Ó Laoghaire\n"}, {"Collector": "Thomas Conway", "Gender": "male"}, {"Informant": "William O' Donnell", "Relation": "unknown", "Gender": "male", "Age": "60", "Address": "Cappoquin, Co. Waterford"}, {"Language": "English"}]}, "4428095/4378079/4437218": {"title": "Scéal: Tadhg na Stiall", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0637, Page 4", "Page 4"], "url": "https://www.duchas.ie/en/cbes/4428095/4378079/4437218", "text": "\n(continued from previous page)\nthat when she was bringing the cows one evening she was taken away by fairies and another girl left instead. Next night Tadhg went to Bunmahon and stole two cattle from her father. When he was coming home he told all he met if they would see anyone looking for cattle to tell them that Tadhg from Glenribben stole them. Next day the man came looking for the cattle and he found out Tadhg. Tadhg brought him in and they feasted together. Then the girl went into the room where they were seated. Her father exclaimed \"but for my daughter is dead I would say this is her.\" He thought that the fairies had taken away his daughter for ever and that he could never see her again. Tadhg gave back the cattle to him. The man told Tadhg to keep his daughter and get married to her. Tadhg said, \"no, I am a robber and I might be hanged before a week\". The man thanked Tadhg for saving his daughter and he brought her home.\n\n\n\nOne day a priest was walking along the road saying his prayers out of a Prayer Book. He saw a woman coming towards him. He threw his\n(continues on next page)\n", "school_info": "School: Ceapach Chuinn (B.)", "metadata": [{"Location:": "Cappoquin, Co. Waterford", "Teacher:": "\nProinnsias Ó Laoghaire\n"}, {"Collector": "Patrick Moynihan", "Gender": "male"}, {"Informant": "George Mc Grath", "Relation": "unknown", "Gender": "male", "Address": "Lyre West, Co. Waterford"}, {"Language": "English"}]}, "4428095/4377860/4437237": {"title": "Petticoat Loose and the Priest", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0637, Page 16", "Page 16"], "url": "https://www.duchas.ie/en/cbes/4428095/4377860/4437237", "text": "\nThere was a carter named John Brown who was carting flour from Clogheen to Tallow. One night as John was coming from Clogheen with a big load of flour he met a priest and he took him in the cart. He went on for about a mile and he met an old woman. He asked her to sit in front  and she said \"no\". She sat on the back of the cart. He asked her again to sit in the front and not to be too heavy on the horse. She told him that if he would not mind himself she would drown him in Baylough. The priest jumped out of the cart and caught her. \"You know who you have?\" said she to the priest. \"Who?\" said the priest. \"You have Petticoat Loose\". The priest took out his prayer book and read some prayers over her. She went up in the air in a ball of fire and landed in the middle of Baylough.\n", "school_info": "School: Ceapach Chuinn (B.)", "metadata": [{"Location:": "Cappoquin, Co. Waterford", "Teacher:": "\nProinnsias Ó Laoghaire\n"}, {"Collector": "John Houlihan", "Gender": "male"}, {"Informant": "John Houlihan", "Relation": "parent", "Gender": "male", "Address": "Lyre West, Co. Waterford"}, {"Language": "English"}]}, "4428095/4377882/4437240": {"title": "Leigheasanna", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0637, Page 18", "Page 18"], "url": "https://www.duchas.ie/en/cbes/4428095/4377882/4437240", "text": "\n(continued from previous page)\nBoiled nettles will cure a cramp.\n\n\n\nOne night a man was coming home from Lismore where he had been to buy steel for his Spring Harrow. When he was coming down Shruc road he met a beautiful lady. The lady was Petticoat Loose in disguise. The man recognised her and he knew she was powerless and could not harm him while he had the steel. When he left the steel down by the roadside to have a rest she rushed at him to kill him but he grabbed up the steel and  she could not harm him. When he continued on his way she began darting in and out between his legs like the wind. When he reached his house she followed him to the door. He turned around and flourished the steel and\n(continues on next page)\n", "school_info": "School: Ceapach Chuinn (B.)", "metadata": [{"Location:": "Cappoquin, Co. Waterford", "Teacher:": "\nProinnsias Ó Laoghaire\n"}, {"Collector": "George Mc Grath", "Gender": "male"}, {"Informant": "Mc Grath", "Relation": "parent", "Gender": "male"}, {"Language": "English"}]}, "4428095/4377906/4437243": {"title": "Petticoat Loose", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0637, Page 20", "Page 20"], "url": "https://www.duchas.ie/en/cbes/4428095/4377906/4437243", "text": "\nOne night a carter was going home from work and he met Petticoat Loose. She asked him for a drive and he gave her a saucy answer. When he got home he ate his supper and bolted the door  and was just about to go into bed when he heard a rap at the window. He went to the window and opened it. Petticoat Loose was outside and she asked the man to shake hands. The man put out his hand and she whipped the arm off him.The poor man never saw his hand again.\n", "school_info": "School: Ceapach Chuinn (B.)", "metadata": [{"Location:": "Cappoquin, Co. Waterford", "Teacher:": "\nProinnsias Ó Laoghaire\n"}, {"Collector": "Patrick Moynihan", "Gender": "male"}, {"Informant": "(name not given)", "Relation": "parent"}, {"Language": "English"}]}, "4428095/4377994/4437259": {"title": "Na Tiarnaí Talún agus na Tionóntaithe", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0637, Page 28", "Page 28"], "url": "https://www.duchas.ie/en/cbes/4428095/4377994/4437259", "text": "\n(continued from previous page)\nhouses and shouted \"Take notice that Mr. Usher will be present in his office at 11 o'clock on - to collect his rents. You are requested to attend with the full amount of money\". The tenants used to be in fear and trembling of the landlord when they were not able to pay the full rent.\n\n\n\nWhen Petticoat Loose lived in her own home she used to beat her mother. Before her own child was baptised she killed it. She used to put water in the milk and sell it to the old people and she died drunk and that's what damned her. The print of her feet are still to be seen on a stone\n(continues on next page)\n", "school_info": "School: Ceapach Chuinn (B.)", "metadata": [{"Location:": "Cappoquin, Co. Waterford", "Teacher:": "\nProinnsias Ó Laoghaire\n"}, {"Collector": "James Moloney", "Gender": "male"}, {"Informant": "Michael O' Keefe", "Gender": "male"}, {"Language": "English"}]}, "4428095/4378039/4437267": {"title": "Scéal", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0637, Page 32", "Page 32"], "url": "https://www.duchas.ie/en/cbes/4428095/4378039/4437267", "text": "\nOne evening a man was coming from a forge. He had a soc and a coulter on his shoulder. Petticoat Loose met him on his way home. She followed him to his house. He did not take the soc nor coulter  off his shoulder all the way home. When he was inside his own door Petticoat Loose said \"It is well for you that you did not take that soc nor coulter off your shoulder for if you did I would have killed you.\n\n\n\nLong ago there lived in Cappoquin an old nurse. One night she was called to attend a dying woman. She got ready. She hired a coach and she told the driver to make the horses go as fast as they could. When they came to the Rock where Petticoat Loose lived, the horses went very slow.The driver asked the nurse what was wrong. Then the nurse\n(continues on next page)\n", "school_info": "School: Ceapach Chuinn (B.)", "metadata": [{"Location:": "Cappoquin, Co. Waterford", "Teacher:": "\nProinnsias Ó Laoghaire\n"}, {"Collector": "James Cullen", "Gender": "male", "Age": "1416756"}, {"Informant": "Mrs Kiely", "Relation": "unknown", "Gender": "female", "Address": "Cappoquin, Co. Waterford"}, {"Language": "English"}]}, "4428095/4378092/4437312": {"title": "Moll Dunlea and Father Sheehy", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0637, Page 51", "Page 51"], "url": "https://www.duchas.ie/en/cbes/4428095/4378092/4437312", "text": "\n(continued from previous page)\nbull in her own yard.\n\n\n\nAbout 150 years ago there lived in Colligan a rich farmer named Hannigan who had a daughter named Mary. Mary was a handsome girl but also a very very wicked one. Mary used to go to dances and remain out all night. One night at a dance her petticoat became loose and she said \"my petticoat is loose and I can not dance for a while\". Ever after she was called Petticoat Loose. She committed several wicked deeds during her life and died in drunkenness. For years she haunted the districts of Cappoquin and her own place and did a lot of harm in both places. One evening a man named Michael Connors from Coolagortwee in the district of Cappoquin was coming from the fair of Clogheen on a colt. At the Salmon Leap he sighted Petticoat Loose a short distance away from him. Mick jumped off\n(continues on next page)\n", "school_info": "School: Ceapach Chuinn (B.)", "metadata": [{"Location:": "Cappoquin, Co. Waterford", "Teacher:": "\nProinnsias Ó Laoghaire\n"}, {"Collector": "James Cullen", "Gender": "male"}, {"Informant": "Mrs Mary Kiely", "Relation": "unknown", "Gender": "female", "Age": "32", "Address": "Cappoquin, Co. Waterford"}, {"Language": "English"}]}, "4428095/4378124/4439925": {"title": "Petticoat Loose", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0637, Page 80", "Page 80"], "url": "https://www.duchas.ie/en/cbes/4428095/4378124/4439925", "text": "\nOne day a man was riding home by Shruc Wood when a woman jumped up behind him. After a while he began to notice the horse getting tired. He was wondering what was making the horse tired till she told him she was Petticoat Loose. He knew there was a ton weight in her left hand and that it was the weight that was tiring the horse.She threatened to crush him with her left hand if he wouldn't bring her where she told him. He dismounted and led\n(continues on next page)\n\n\n\n(continued from previous page)\nEarl sat on this stone and ever since it is known as \"Earl's Stone\".\n", "school_info": "School: Ceapach Chuinn (B.)", "metadata": [{"Location:": "Cappoquin, Co. Waterford", "Teacher:": "\nProinnsias Ó Laoghaire\n"}, {"Collector": "Thomas Conway", "Gender": "male"}, {"Informant": "Mr T. O' Donnell", "Relation": "unknown", "Gender": "male", "Age": "78", "Address": "Cappoquin, Co. Waterford"}, {"Language": "English"}]}, "4428095/4378137/4439943": {"title": "Na Ceisteanna a Chuireadh Petticoat Loose", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0637, Page 91A", "Page 91A"], "url": "https://www.duchas.ie/en/cbes/4428095/4378137/4439943", "text": "\nNa ceisteanna a chuireadh Petticoat LooseCoineall is coindleóir ann is cáil a leathrann sanCullean a bainfidí am Samhan as a chuirfidhe mar Ceann ar Tigh.An Cheist CheadnaMuillinn idir dhá ghleann beadh ag Scilliche Thall sa bhusDá ndeannfá d'áithnighe m-am ní bheidhfeá is Samhailt annsanNíl fhios agam cá bfuigfí an toirpín.\n", "school_info": "School: Ceapach Chuinn (B.)", "metadata": [{"Location:": "Cappoquin, Co. Waterford", "Teacher:": "\nProinnsias Ó Laoghaire\n"}, {"Collector": "Labhrás Ó Cadhla", "Gender": "male", "Age": "48", "Occupation": "múinteoir", "Address": "Cappoquin, Co. Waterford"}, {"Language": "Irish"}]}, "4428096/4377861/4439989": {"title": "The Keanes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0637, Page 160", "Page 160"], "url": "https://www.duchas.ie/en/cbes/4428096/4377861/4439989", "text": "\nSean a Totán was a famous Keane here (the Belmount Keanes). He went out to Belmount as he was Captain of the Yoemen.BATTLE OF Carbhats and the SeanbhestsModeligo emblems were seanbhestsToorneena emblems were carbhatsThey were very hot people. There was the Battle of the Seanabhests and  the Carabaths every year on the 1st of May. It was an old Irish Pagan custum they fought with sticks. If they got a cut they'd put a fist of moss to it, no such thing as doctoring and they were far better off than now. Sean Tótán burned all the houses in Modeligo to stop factions and that was the reason he was called Tótán. The Keanes bought Belmount from the Geraldines at Lismore for £750. They are always anxious that this would be known, so that they would not be\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire, Ceapach Chuinn", "metadata": [{"Location:": "Cappoquin, Co. Waterford", "Teacher:": "\nAn tSiúr M. Teresita\n"}, {"Language": "English"}]}, "4428097/4377877/4439993": {"title": "Petticoat Loose", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0637, Page 175", "Page 175"], "url": "https://www.duchas.ie/en/cbes/4428097/4377877/4439993", "text": "\nPetticoat Loose was a ghost which was to be seen in the Clogheen road every evening at nightfall and she used to do very much damage. It was supposed she was damned on account of beating her father and mother. She was supposed to be the heaviest woman that ever lived and wherever she would stand the print of her feet would remain after her. Her footprints are still to be seen at the Salmon Leap about a mile from Mt. Melleray and the prints of her fingers are to be found near Slady Castle in a place called Sleepy Rock. One night there was a man going to Clogheen for a load of salt and he met Petticoat Loose. She sat in with him in the car. Soon the horse began to bend under the weight of the ghost in the car and he refused to pull. Then she turned to the man and told him to take the string which was around his neck off, but the man did not, because he knew if he would take off the scapular she would have power to kill him. So he stayed arguing with\n(continues on next page)\n", "school_info": "School: Cnoc Melleray (B.), Ceapach Chuinn", "metadata": [{"Location:": "Cappoquin, Co. Waterford", "Teacher:": "\nSeán Ó Gormáin\n"}, {"Language": "English"}]}, "4428097/4377886/4439997": {"title": "Petticoat Loose", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0637, Page 183", "Page 183"], "url": "https://www.duchas.ie/en/cbes/4428097/4377886/4439997", "text": "\nPetticoat Loose was there about a hundred and thirty years ago. She was born and reared in Colligan and her right name was Mary Hannigan. She was called Petticoat Loose because one night she was at a dance and her apron fell off. Then the people of the place called her Petticoat Loose and ever since she bears that name.Her people had a small farm and they kept five or six cows. They used to sell the milk to the neighbouring farmers in the Summer. One day some poor people came to Petticoat Loose to buy some new milk. She told them to wait for a while and that she would be out after a few minutes to supply them with it. Then she got some water and mixed it with the milk and gave it to the poor people.One time a priest met her and asked her what damned her. She said to him that she had beaten her father and mother, but the priest said that did not damn her although it was bad work. Then\n(continues on next page)\n", "school_info": "School: Cnoc Melleray (B.), Ceapach Chuinn", "metadata": [{"Location:": "Cappoquin, Co. Waterford", "Teacher:": "\nSeán Ó Gormáin\n"}, {"Language": "English"}]}, "4428133/4380959/4459372": {"title": "Petticoat Loose - Scéal Eile uirthi", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0647, Page 15", "Page 15"], "url": "https://www.duchas.ie/en/cbes/4428133/4380959/4459372", "text": "\nBhí fear a bhain le Cúl na a-Dhalán teacht abhaile  oíche ó Carraig na nGabhar. Chonaic sé an bean ag rith go h-obann ina dhiaidh agus ba mhó na amhras cé bhí aige agus do chuir sé dhe comh mear agus bhí a chosa uaithi.Dhein sé ceann ar aghaidh ar an ngleann agus trasna na ngleanna leis. Bhí fhios aige cad a bhí á leanúint.Do luigh sí agus do bhéic sí agus do lean sí an taobh a bhí san ngleann nuair gur chuaidh sí go dtí Tosach na Gleanna agus fad is a bhí uain aici ar bhreith suas leis bhí sé sa bhaile istigh.Ní raibh aon deire leis an fothram a bhí ar fuaid na tighe.Bí í Petticoat Loose í agus bhí an dúiche go léir scanraithe aici ag an am céadna.\n", "school_info": "School: Affane, Ceapach Chuinn", "metadata": [{"Location:": "Affane Hunter, Co. Waterford", "Teacher:": "\nBríd Bean Uí Chonaill\n"}, {"Collector": "Brighid Ní Chonaill", "Gender": "female"}, {"Language": "Irish"}]}, "4428134/4381188/4459403": {"title": "Petticoat Loose", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0647, Page 42", "Page 42"], "url": "https://www.duchas.ie/en/cbes/4428134/4381188/4459403", "text": "\nBhí crenn i n-aice na scoile agus craann Petticoat Loose an ainm a bhí air.Deirtí go mbíodh bean  na suidhe fén gcrann agus gur bean gan maitheas í Petticoat loose an ainm a  bhí uirthi.     Deirtear go bhfuil sí anois ag comhaireamh na gainmhe san ',Sáile Dearg\" agus go mbheidh sí ann go deire an saoghal.\n", "school_info": "School: Mágh Dheilge, An Cheapach", "metadata": [{"Location:": "Modelligo, Co. Waterford", "Teacher:": "\nSéamus Ó Banáin\n"}, {"Collector": "Séamus Ó Banáin", "Gender": "male"}, {"Language": "Irish"}]}, "4428134/4381192/4459411": {"title": "Petticoat Loose agus an Sagart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0647, Page 46", "Page 46"], "url": "https://www.duchas.ie/en/cbes/4428134/4381192/4459411", "text": "\nPetticoat Loose Agus An Sagart.    Do bhíodh Petticoat Loose ar an mbóthar idir Caol na Seasc agus Cuilligeáin. Bhí sagart ag gábhailt an bóthar, oidhche ag dul ar glaodhach ola. Capaill diallaite a bhí aige, agus teanghmhuigh sé léite ar an mbothar. Shíl sí ná raibh dada le deunamh aici ach é mharbhú. Cuaidh sí de léim anáirde ar a chúl, ar an capaill; ach fuair sé an stóil a cur air fé bhfuair sí baint leis, agus chuir sé anuas arís é. Fear eile a bhí ag dul fé dhéin mná cabrach, agus buail sí leis. Bhí sí cun é mharbhú, ach d'iarr sé uirthi, ar Son Dia scaoileadh leis, agus thug sé Dia mar fídhne go  dtiochfadh sé tar n-ais cúche an oidhche a bhí i n-a ceann. Leig sí leis, agus d'imthigh sé; ach níor chas sé.\n", "school_info": "School: Mágh Dheilge, An Cheapach", "metadata": [{"Location:": "Modelligo, Co. Waterford", "Teacher:": "\nSéamus Ó Banáin\n"}, {"Collector": "Séamus Ó Banáin", "Gender": "male"}, {"Language": "Irish"}]}, "4428127/4380568/4460154": {"title": "Petticoat Loose", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0646, Page 127", "Page 127"], "url": "https://www.duchas.ie/en/cbes/4428127/4380568/4460154", "text": "\nPetticoat Loose was a bad woman. She used to beat her father and mother. There were two ton weight in her hand from beating them, She used to sit under a bush on the Clonmel road and everyone she used to see she used to ask them for a lift and if they would not she would kill them. One night she asked a man for a lift and he wondered when the horse stopped and would not go.He was in a lather of sweat and the man said there is something wrong with the horse. She jumped off and said \"it is well for you that you gave me a lift. It is not your horse but you and your horse as I am Petticoat Loose\". Do you know what damned her. She died in drink while Mass was celebrated. 'Twas not in Mass she died but in a public house. She used to kill and harm till the priest banished her into the Red Sea. \"I'll drown all the ships that will pass\". \"You will not\" said the priest \"because I will put you down to the very bottom making sugáns of the sand\"\n", "school_info": "School: Dún na Mainistreach (C.), Dúngarbhán", "metadata": [{"Location:": "Dungarvan, Co. Waterford", "Teacher:": "\nMáire, Bean Uí Chriostóir\n"}, {"Language": "English"}]}, "4428131/4380667/4460334": {"title": "Petticoat Loose", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0646, Page 213", "Page 213"], "url": "https://www.duchas.ie/en/cbes/4428131/4380667/4460334", "text": "\nRugadh Petticoat Loose i gCoilligeáin. Ó hAnnagan an ainm a bhí uirthi. Bhiodh sí ag rinnce agus oíche anháin thuit a cóta di agus sin é an cúis ar tugadh Petticoat Loose uirthi.Bhí buachaill aimsire ag obair sa tigh aici agus dhein sí suas leis an mbuachall. Cuimhníodar ar seift chun an fear a bhí pósta leí do báthadh. Lá amháin bhí tuillte san abhainn agus d'fhiafraigh an buachall ar fear an tighe dul síos go dtí an abhainn leis, mar go raibh bradán an-mhór ann. Chuaidh fear an tighe leis.Bhí sprong ag an mbuachaill chun teacht ar an bradán, mar dheadh. Siúl fear an tighe ar bruach na habhainn, tháinigh an buachall taobh thiar de agus caith sé isteach san abhainn é leis an sprong. Do stad carraig a bhí san abhainn é is bhí sé ag béicigh ar a dhícheall. Bhí an buachaill ag iarraidh é do chur amach arís. Tháinigh fear eile leo agus caith sé an\n(continues on next page)\n", "school_info": "School: Cill Bhriain, Béal na Molt", "metadata": [{"Location:": "Kilbryan Lower, Co. Waterford", "Teacher:": "\nTomás de Bhál\n"}, {"Collector": "Brigid Ní Dúnúrthaigh", "Gender": "female", "Age": "13", "Address": "Ballynakill, Co. Waterford"}, {"Informant": "Máire Tóibín", "Relation": "unknown", "Gender": "female", "Address": "Colligan Beg, Co. Waterford"}, {"Language": "Irish"}]}, "4428124/4380324/4461495": {"title": "Petticoat Loose", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0645, Page 059", "Page 059"], "url": "https://www.duchas.ie/en/cbes/4428124/4380324/4461495", "text": "\nSprid atá an-cháileamhail i nDúthaigh Déise iseadh \"Petticoat Loose\" agus is mó scéal in a taobh atá i mbéalaibh na sean-daoine.-------------------------------------------------Lá amháin do bhí fear ag teacht ó Aonach Chluain Meala. Do chas bean leis ar an mbóthar agus d'iafruigh sé dí cér fhaid a bhí sí ag dul. \"Nílim ag dul ró-fhada\" ar sise \"Suidh isteach mar sin\" ars an fear agus do shuidh. Ní fada ar an mbóthar iad nuair chonnaic an fear\n(continues on next page)\n", "school_info": "School: Clochar na Toirbhirte, Dúngarbhán", "metadata": [{"Location:": "Dungarvan, Co. Waterford", "Teacher:": "\nAn tSr. Proinseas\n"}, {"Collector": "Eilís de Bháil", "Gender": "female", "Address": "Dungarvan, Co. Waterford"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "male", "Age": "45"}, {"Language": "Irish"}]}, "4428124/4380326/4461499": {"title": "Petticoat Loose", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0645, Page 061", "Page 061"], "url": "https://www.duchas.ie/en/cbes/4428124/4380326/4461499", "text": "\nBhíodh 'Petticoat Loose' ag marbhú gach duine a tiocfach roimpi.Lá amháin sheas sí ós comhair sagairt chun é do mharbhú . Chuir seisean amach go dtI an Mhuir-Dearg í agus tá sí ann fós- a deirtear , agus i ag déanamh liathróidí den ghainimh.\n", "school_info": "School: Clochar na Toirbhirte, Dúngarbhán", "metadata": [{"Location:": "Dungarvan, Co. Waterford", "Teacher:": "\nAn tSr. Proinseas\n"}, {"Collector": "Eilís de Bháil", "Gender": "female", "Address": "Dungarvan, Co. Waterford"}, {"Informant": "Pádruig de Bháil", "Relation": "parent", "Gender": "male", "Age": "45"}, {"Language": "Irish"}]}, "4428124/4380327/4461500": {"title": "Petticoat Loose", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0645, Page 062", "Page 062"], "url": "https://www.duchas.ie/en/cbes/4428124/4380327/4461500", "text": "\nBhí bean ann fadó darbh ainm ‚Petticot Loose . Bhí sí in a comhnuidhe i mbaile an Chonaire. Lá amháin bhí sí ag siubhal ar bhruachaibh na h-Abhann Móire agus chonnaic si fear ag teacht úici . Dubhairt si leis an bhfear a chuid éidaigh a bhaint do.Do dhein an fear é . Annan dubhairt sí leis sesame san uisge agus bhí uaithi  an far do bhádhadh agus níor eirigh leí  é do bhádhadh  mar bhí scaplaí ar an bhfear . Bhí sí ana -mí -shásta annsan agus dubhairt se leis 'na rudaí a bhí ar a mhuinéal ' a bhaint de. Ní déanfad an fear é sin agus d'imthigh Petticoat Loose.\n", "school_info": "School: Clochar na Toirbhirte, Dúngarbhán", "metadata": [{"Location:": "Dungarvan, Co. Waterford", "Teacher:": "\nAn tSr. Proinseas\n"}, {"Collector": "Mairéad Ní Chorraidh", "Gender": "female"}, {"Informant": "Bean Uí Chorraidh", "Relation": "parent", "Gender": "female", "Age": "41", "Address": "Ballyneety, Co. Waterford"}, {"Language": "Irish"}]}, "4428124/4380328/4461504": {"title": "Petticoat Loose - Scéalta Eile ina Taobh", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0645, Page 063", "Page 063"], "url": "https://www.duchas.ie/en/cbes/4428124/4380328/4461504", "text": "\nBhí bean ann fadó agus is i gCuileagán a bhí cómhnuidhe uirri. Droch-bhean a bhí innti agus deirtear go mbíodh draoidheacht aici nuair ba mhaith leí é chur i bhfeidhm. Marbhuigheadh sí gach aoinne a thagadh an slighe roimpi. An mhaidin áirithe seo, bhí sagart paróiste Cill Ghobnait ag dul chun na \"Stations\" i dtig duine darbh ainm Tóibín. Tháinig an bhean so amach roimhe agus bhí sí ar tí rud éigin a rádh nuair a dubhairt an sagart - \"Téir anois go dtí an Muir Meaidh agus fan ann go dtí deire an tsaoghail ag déanamh súgáin de'n ghainimh\". D-imigh sí agus ó'n lá sin ní bhfaca aoinne í. Petticoat Loose a bhí ann.\n", "school_info": "School: Clochar na Toirbhirte, Dúngarbhán", "metadata": [{"Location:": "Dungarvan, Co. Waterford", "Teacher:": "\nAn tSr. Proinseas\n"}, {"Collector": "Seósaimhín Ní Dhuinneadha", "Gender": "female"}, {"Informant": "Bean de Faoite", "Relation": "grandparent", "Gender": "female", "Age": "75"}, {"Language": "Irish"}]}, "4460751/4377196/4461604": {"title": "Stories of Giants and Warriors", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0635, Page 211", "Page 211"], "url": "https://www.duchas.ie/en/cbes/4460751/4377196/4461604", "text": "\n(continued from previous page)\nthe sand - an impossible feat - she could return to her native parish of Colligan, Dungarvan.\n\n\n\nThere is a townland called Tooradoo. It is situated about three miles from Ballyduff. A giant lived there in former times.He built a house for himself\n(continues on next page)\n", "school_info": "School: Clochar na Toirbhirte", "metadata": [{"Location:": "Lismore, Co. Waterford", "Teacher:": "\nSr M. Gráinne\n"}, {"Collector": "Mary Quirke", "Gender": "female", "Address": "Ballyea West, Co. Waterford"}, {"Informant": "Mr Quirke", "Relation": "parent", "Gender": "male", "Address": "Ballyea West, Co. Waterford"}, {"Language": "English"}]}, "4428124/4380503/4461985": {"title": "Petticoat Loose arís", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0645, Page 238", "Page 238"], "url": "https://www.duchas.ie/en/cbes/4428124/4380503/4461985", "text": "\nLá amháin bhí fear darbh ainm dó Micheál Beag O' Ciaráin ag teacht abhaile ó Cluain Meala. In aice le Tuair an Fhíona a bhí sé nuair bhuail bean air ar an mbóthar. D'iarr sí air tiomáint sa cheárr do thabhairt dí mar go raibh bóthar fada le cur dí roimh oidhche. \"Suidh isteach mar sin\" ar seiseanléi agus do shuidh. Bhí fhios ag an bhfear go raibh an bean sin 'na comhnuidhe ináit éigin i gCuileagán agus bhí iongna air mar ní aistir fada é ó Tuair na Fhíona go Cuileagán. Níor labhair an\n(continues on next page)\n", "school_info": "School: Clochar na Toirbhirte, Dúngarbhán", "metadata": [{"Location:": "Dungarvan, Co. Waterford", "Teacher:": "\nAn tSr. Proinseas\n"}, {"Collector": "Cáit de Bháil", "Gender": "female", "Address": "Dungarvan, Co. Waterford"}, {"Informant": "Pádraig de Bháil", "Relation": "parent", "Gender": "male", "Age": "45", "Address": "Dungarvan, Co. Waterford"}, {"Language": "Irish"}]}, "4428124/4380528/4462001": {"title": "Petticoat Loose", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0645, Page 263", "Page 263"], "url": "https://www.duchas.ie/en/cbes/4428124/4380528/4462001", "text": "\nIns an loch imeasg na gCnoch ar a dtugtar Cnuic Mhaol Domhnaigh bhí comhnuidhe ar \"Petticoat Loose\". Aon oidhche amháin bhí fear ag teacht go Lios Mór le h-ualach coirce. Bhí sagart 'na teannta.Tháinig Petticoat Loose amach ar an mbóthar agus bhain sí geit as an gcapall gur thit sé marbh ar an mbóthar. Do chuir an sagart mallacht ar Petticoat Loose annsan. Bhí uirri dul go dtí an Muir Ruadh agus fanamhaint ann go mbeidh an mhuir follamh aici. Sé an gléas atá aici chun an mhuir d'fhollamhú má méuracán gan tón!Is cosamhail gur fada an lá go mbeidh Petticoat Loose le\n(continues on next page)\n", "school_info": "School: Clochar na Toirbhirte, Dúngarbhán", "metadata": [{"Location:": "Dungarvan, Co. Waterford", "Teacher:": "\nAn tSr. Proinseas\n"}, {"Collector": "Nóra Ní Briain", "Gender": "female", "Address": "Shandon, Co. Waterford"}, {"Informant": "(name not given)", "Relation": "not a relative"}, {"Language": "Irish"}]}, "4428121/4380197/4462105": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0644, Page 36", "Page 36"], "url": "https://www.duchas.ie/en/cbes/4428121/4380197/4462105", "text": "\nOnce upon a time there lived a widow who had a son in Africa in the war. The son wrote home to his mother and told her that he was making a shift for Ladysmith.This poor mother was simple. It was one of the neighbours who read the letter for her.\"An bhleagáird\" arsa sí, \"nuair a bhí sé sa bhaile ní cuirfeadh sé stitch dó féin agus anois tá sé ag déanamh 'shift' do Ladysmith. Cé hí Ladysmith, ní fhedair?\" arsa sí.\n\n\n\nWhat is the least valuable thing a person can have in their pocket?Ans. A holeWhat roof covers the most noisy tenant.Ans. The roof of your mouthWhen is an apple like a bellAns. When it is peeledWhat is the smallest room in the worldAns. A mushroomUnder the water and over the water and never touches the waterAns. The moonGot from: My mother 50 years\n\n\n\nOne day a man went to fight her. He had a hazel stick a holly stick and a blackthorn stick on her and still she did not go but she had to fly from the holly stick because it was blessed.\n", "school_info": "School: An Teampoll Geal, Ceapach Chuinn", "metadata": [{"Location:": "Whitechurch, Co. Waterford", "Teacher:": "\nLiam Ó Faoláin\n"}, {"Language": "English"}]}, "4428107/4378591/4466646": {"title": "Petticoat Lewis", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0640, Page 104", "Page 104"], "url": "https://www.duchas.ie/en/cbes/4428107/4378591/4466646", "text": "\nA famous character in the folklore of West Waterford and East Cork is Petticoat Lewis.The following is a story about her from Aglish, Cappoquin Co Waterford. Stories from other districts will follow.Story. One night two men went to a house to see Petticoat Lewis. They should wait till twelve oclock came and then she would appear. One man went home but the other man waited. When the man reached his own door he could not open it. Then he looked in the window and he saw Petticoat Lewis inside. She would not let him in. Then the man had to go to another house that night.\n", "school_info": "School: West Waterford Branch I.N.T.O", "metadata": [{"Location:": "Coshmore and Coshbride, Co. Waterford", "Teacher:": "\nJames Cashman\n"}, {"Collector": "James Cashman", "Gender": "male"}, {"Language": "English"}]}, "4428114/4379524/4467675": {"title": "Sprideanna", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0642, Page 297", "Page 297"], "url": "https://www.duchas.ie/en/cbes/4428114/4379524/4467675", "text": "\n(continued from previous page)\nchuadar ag lorg daoine chun an tigh a leagaint. Fuaradar beirt agus thosníodar ag leagaint an tigh.Ní rabhadar i bhfad a leagaint nuair a tháinigh eagla ortha agus chuadar a codladh agus níor eirigheadar ón lá sin go dtí an lá a fuaradar bás.\n\n\n\nBhí fear ag teacht abhaile ó Aonach Cluian Meala agus bhí capall agus cairt aige. Nuair a bhí sé tamall ar bhóthar chonaic séPetticoat Loose ar thaobh an bhóthair. Dúirt sé leí \"Suí isteach sa cairt\". Shuí sí isteach sa cairt agus tar éis tamaill ní raibh an capall in iúil ar siúl.Ansan dúirt Petticoat Loose go raibh cúig tonna meachain ar an gcapall agus ní raibh aon iongnadh go mbeadh sé cortha. Dúirt sí leis dul abhaile agus an capall a chur isteach sa stábla agus gan bheith amuigh déanach aon oíche eile.\n(continues on next page)\n", "school_info": "School: Maol an Chóirne, An Rinn", "metadata": [{"Location:": "Mweelahorna, Co. Waterford", "Teacher:": "\nPilib Ó Foghlú\n"}, {"Collector": "Siobhán Ní Lonáin", "Gender": "female", "Age": "13", "Address": "Knockanpower Lower, Co. Waterford"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "female", "Age": "43", "Address": "Knockanpower Lower, Co. Waterford"}, {"Language": "Irish"}]}, "4428114/4379546/4467840": {"title": "Petticoat Loose", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0642, Page 316", "Page 316"], "url": "https://www.duchas.ie/en/cbes/4428114/4379546/4467840", "text": "\nIns an áit ina rugadh Petticoat Loose bhí pósadh ann agus bhí ana-chuid daoine ann. Bhíodar go léir ag ithe is ag ól.Bhí Petticoat Loose amuigh ins an macha agus bhí sí ag béiceadh.Chuaidh fear amháin amach agud dúirt sé leis na daoine go raibh Petticoat Loose amuigh sa macha.Thug beirt fhear gloine fíona amach agus nuair a chuadar go dtí an áit ina raibh sí bhí sí ar an taobh eile den macha agus í ag gáire fútha.Níor dhein Petticoat Loose aon díoghbháil riamh ina Paróiste féin.\n\n\n\nBhí fear ann fadó agus bhí sí ina chónaí leis féin. Gach oíche chuaigh sé a codladh ar a naoi a chlog.An oíche seo d'airigh sé glór amuigh ins an macha. Chuaidh sé amach agus chonaic sé beirt fhear ag troid. Chuaidh sé go dtí an áit ina rabhadar ach bhíodar imithe.Chuaidh sé isteach agus d'airigh sé an glór arís. Tháinigh eagla air agus chuaidh sé a codladh. An maidean ina dhiaidh sin\n(continues on next page)\n", "school_info": "School: Maol an Chóirne, An Rinn", "metadata": [{"Location:": "Mweelahorna, Co. Waterford", "Teacher:": "\nPilib Ó Foghlú\n"}, {"Collector": "Cáit Ní Ghríobhtha", "Gender": "female", "Age": "14", "Address": "Knockanpower Lower, Co. Waterford"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "female", "Age": "43", "Address": "Knockanpower Lower, Co. Waterford"}, {"Language": "Irish"}]}, "4428114/4379556/4467877": {"title": "Sprid", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0642, Page 325", "Page 325"], "url": "https://www.duchas.ie/en/cbes/4428114/4379556/4467877", "text": "\n(continued from previous page)\na athair \"Imigh abhaile duit féin agus ná feicim ag gabháilt thar an áit seo arís tú\".Chas an fear thar-nais abhaile agus nuair a bhí sé gairid don tig thuit sé marbh.\n\n\n\nTá fear i Maoil an Chóirne agus nuair a bhí a dertháir ag fághailt bháis chuaidh sé amach sa ngáirdín.Bhí sé timpeall a dhá bhuile déag san oíche. Tar éis tamaillín chonaic sé an bean-sidhe  agus leig sí trí liúigh aisti.Tháinigh eagla air agus chuaidh sé isteach abhaile arís agus nuair a chuaidh sé isteach bhía dearbhráthair tar éis báis.\n\n\n\nDroch-bhean ba eadh Petticoat Loose.Lá amháin dúirt an sagart léi \"Chuirfidh mise amach sa bhfarraige\n(continues on next page)\n", "school_info": "School: Maol an Chóirne, An Rinn", "metadata": [{"Location:": "Mweelahorna, Co. Waterford", "Teacher:": "\nPilib Ó Foghlú\n"}, {"Collector": "Siobhán Ní Lonáin", "Gender": "female", "Age": "13", "Address": "Mweelahorna, Co. Waterford"}, {"Informant": "(name not given)", "Relation": "relative (other than parent or grandparent)", "Gender": "female", "Age": "60", "Address": "Ringville, Co. Waterford"}, {"Language": "Irish"}]}, "4428114/4379565/4467904": {"title": "Saibhreas", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0642, Page 333", "Page 333"], "url": "https://www.duchas.ie/en/cbes/4428114/4379565/4467904", "text": "\nBhí fear ann fadó agus ní thabharfadh sé aon rud do aon duine bocht a raghadh go dtí an doras. Do bhí an-chuid airgid aige agus ní raibh uaidh é a caitheamh. An lá san bhuail duine muinteara dó isteach go dtí na tigh agus dúirt sé leis gur daoine eile a bheadh ag baint sásamh as a gcuid airigid nuair a gheobhadh sé bás.Ón lá san amach aon duine a raghadh go dtí an doras gheobhadh sé alán bídh agus airgid uaidh agus ní raibh sé cineamhal ar an airgid as san amach.\n\n\n\nBhí bean ann uair amháin agus ba é an ainm a bhí uirre ná Petticoat Loose.Aon oíche amháin bhí fear ag teacht abhaile ón mbaile mór. Bhí capall agus cairt aige. Do stop an capall go h-obann agus chonaic sé bean na suidhe ar cloch éigint. Dúirt sé \"tar isteach sa cairt\", níor tháinigh sí isteach. Dúirt sé arís \"tar isteach\".D'imigh an capall agus chonaic sé\n(continues on next page)\n", "school_info": "School: Maol an Chóirne, An Rinn", "metadata": [{"Location:": "Mweelahorna, Co. Waterford", "Teacher:": "\nPilib Ó Foghlú\n"}, {"Collector": "Máire Ní Dhonnabháin", "Gender": "female", "Age": "13", "Address": "Knockanpower Lower, Co. Waterford"}, {"Informant": "Deaglán Ó Gríobhta", "Gender": "male", "Age": "56", "Address": "Knockanpower Lower, Co. Waterford"}, {"Language": "Irish"}]}, "4428107/4378606/4474553": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0640, Page 118", "Page 118"], "url": "https://www.duchas.ie/en/cbes/4428107/4378606/4474553", "text": "\n(continued from previous page)\nSin é an méid de'n scéal do fuaireas ach is féidie aithint gur bfuairiste cur leis agus bheith a rádh go dtí maidin ambáireac. Ní féidir le aon rud bheith chomh simplidhe ná é ach mar sin féin feach an méid beag eolas do thug bean go dtí an duine eile. B'sin é an brígh atá leis.\n\n\n\nThe name of Petticoat Lewis was a name to be feared and respected in the Youghal district. As to who she was it is hard to get definite details. The following were given me by Michael Walsh, Redforge, Youghal who is a native speaker and who mixed with several people in his younger days\n(continues on next page)\n", "school_info": "School: West Waterford Branch I.N.T.O", "metadata": [{"Location:": "Coshmore and Coshbride, Co. Waterford", "Teacher:": "\nJames Cashman\n"}, {"Collector": "James Cashman", "Gender": "male"}, {"Informant": "Michael Walsh", "Gender": "male", "Address": "Youghal, Co. Cork"}, {"Language": "English"}]}, "4428108/4378815/4484505": {"title": "Petticoat Loose", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0640, Page 318", "Page 318"], "url": "https://www.duchas.ie/en/cbes/4428108/4378815/4484505", "text": "\nPetticoat Loose was an evil spirit that was there long ago. She used go around doing harm to everyone. She used to kill horses and harm them.She could change herself into anything and make herself any weight she would like. When people would be coming home from town in the night with a horse and cart she used sit in with them and put such a weight on the horse that it could not move, and the following morning the horse would be dead.One night a man up in Kereen was going along the road riding a horse and suddenly she came and sat up behind him. They went a little distance and the horse stopped and could not go any farther. Then she came off and sat down on a stone and the sign is on the stone since the people up there call it 'Petticoat Loose's Stone'. The horse and the man went away and the\n(continues on next page)\n", "school_info": "School: Baile Uí Chorráin, Eóchaill", "metadata": [{"Location:": "Ballycurrane South, Co. Waterford", "Teacher:": "\nEibhlín, Bean Uí Háirdín\n"}, {"Collector": "Norah Healy"}, {"Language": "English"}]}, "4428086/4376675/4503112": {"title": "Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0634, Page 299", "Page 299"], "url": "https://www.duchas.ie/en/cbes/4428086/4376675/4503112", "text": "\nOnce upon a time there was a woman called Petticoat Loose. The reason she was so called was because one night when she was at a dance her Petticoat fell off her, and ever since she was called that name.All the people hated this girl because she was noted for telling lies and cursing. About twenty years after this the girl died and she descended into hell.Then God commanded her to come back to this world again and to lead a better life. She did. The people all around when they heard that she had come back to this world were very much afraid because they knew it was back for some torment she came.The people when they would be going to Cappoquin would usually bring a horse under them,Petticoat would be sitting upon a tree in or near Michael Walshe's inches. Every one who would pass along the road she would kill them with her hand.This day a man passed along the road riding on horseback and she was walking along the road. It was the custom\n(continues on next page)\n", "school_info": "School: Baile Dubh (2), (B.)", "metadata": [{"Location:": "Ballyduff, Co. Waterford", "Teacher:": "\nSeán Ó Murchadha\n"}, {"Collector": "Thomas Fennessy", "Gender": "male", "Address": "Coolishal, Co. Waterford"}, {"Informant": "Mr John Cullinane", "Gender": "male", "Address": "Lismore, Co. Waterford"}, {"Language": "English"}]}, "4428086/4376771/4504012": {"title": "Fairy Fort", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0634, Page 385", "Page 385"], "url": "https://www.duchas.ie/en/cbes/4428086/4376771/4504012", "text": "\nThere is a fairy fort in my district called Cunninghams liss. One day John Hannan was ploughing this field. Two grey-hounds came up through the ground. The fairies are supposed to have built it.Ghosts were seen up on a fence about a mile from my house. They were robed in white and they had black eyes. Some people say it was the people of the district with white sheets were there.About a mile and a half from my house Petticoat loose was in an old hold there. Anyone who went by the place after six oclock would be killed by her.\n", "school_info": "School: Baile Dubh (2), (B.)", "metadata": [{"Location:": "Ballyduff, Co. Waterford", "Teacher:": "\nSeán Ó Murchadha\n"}, {"Collector": "William Scanlon", "Gender": "male", "Address": "Knockcorragh, Co. Waterford"}, {"Informant": "Mrs Hallahan", "Gender": "female", "Address": "Knockcorragh, Co. Waterford"}, {"Language": "English"}]}, "4428084/4376676/4545089": {"title": "Hidden Treasure", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0634, Page 3", "Page 3"], "url": "https://www.duchas.ie/en/cbes/4428084/4376676/4545089", "text": "\n(continued from previous page)\n[-]\n\n\n\nThere was enchanted money buried in the Araglen ball alley in County Tipperary. It was hidden there by the fairies about two hundred years ago. There was an old woman minding it and she used to be smoking continuously. One day a smith had no tobacco and he badly needed a smoke.When he saw the old woman smoking he ran to her for some tobacco. She gave it to him and all the money that was hidden in the valley also.\n", "school_info": "School: Ballyheaffy (B.), Baile Dubh", "metadata": [{"Location:": "Ballyeafy, Co. Waterford", "Teacher:": "\nPádraig Ó Néill\n"}, {"Collector": "Thomas Brunnock", "Gender": "male", "Address": "Doon, Co. Tipperary"}, {"Informant": "Robert Martin", "Gender": "male", "Age": "81", "Address": "Doon, Co. Tipperary"}, {"Language": "English"}]}, "4428124/4380329/4546879": {"title": "Petticoat Loose - Scéalta Eile ina Taobh", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0645, Page 064", "Page 064"], "url": "https://www.duchas.ie/en/cbes/4428124/4380329/4546879", "text": "\nBhí fear ag dul ar thurus oidhche. Chas Petticoat Loose air. Bheannuigheadar dá chéile agus d'iarr an fear uirthí an raibh turus fada le déanamh aici. Dubhairt sí go raibh agus thug seisean slighe dhi ar mhuin an eic. Thángadar go dtí an V in gCo. Thiobraid Árainn agus ansin scar sí leis ach comhairligh sí dhó gan féuchaint taobh thiar dó ar an turus abhaile agus r bhfilleadh dhó gan an dorus d'oscailt mar go raibh sí chun duine éigin do mharbhú. Shrois sé a thigh féin agus dún sé an dous 'na dhiaidh. Tréis tamall chuala sé é. Maidin amáireach Bhí an capall marbh. Petticoat Loose a dhein an droch-ghníomh.\n\n\n\n[-]\n(continues on next page)\n", "school_info": "School: Clochar na Toirbhirte, Dúngarbhán", "metadata": [{"Location:": "Dungarvan, Co. Waterford", "Teacher:": "\nAn tSr. Proinseas\n"}, {"Collector": "Seósaimhín Ní Dhuinneadha", "Gender": "female"}, {"Informant": "Bean de Faoite", "Gender": "female", "Age": "75"}, {"Language": "Irish"}]}, "4428124/4380329/4546880": {"title": "Petticoat Loose - Scéalta Eile ina Taobh", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0645, Page 064", "Page 064"], "url": "https://www.duchas.ie/en/cbes/4428124/4380329/4546880", "text": "\nBhí fear ag dul ar thurus oidhche. Chas Petticoat Loose air. Bheannuigheadar dá chéile agus d'iarr an fear uirthí an raibh turus fada le déanamh aici. Dubhairt sí go raibh agus thug seisean slighe dhi ar mhuin an eic. Thángadar go dtí an V in gCo. Thiobraid Árainn agus ansin scar sí leis ach comhairligh sí dhó gan féuchaint taobh thiar dó ar an turus abhaile agus r bhfilleadh dhó gan an dorus d'oscailt mar go raibh sí chun duine éigin do mharbhú. Shrois sé a thigh féin agus dún sé an dous 'na dhiaidh. Tréis tamall chuala sé é. Maidin amáireach Bhí an capall marbh. Petticoat Loose a dhein an droch-ghníomh.\n\n\n\n[-]\n(continues on next page)\n", "school_info": "School: Clochar na Toirbhirte, Dúngarbhán", "metadata": [{"Location:": "Dungarvan, Co. Waterford", "Teacher:": "\nAn tSr. Proinseas\n"}, {"Collector": "Seósaimhín Ní Dhuinneadha", "Gender": "female"}, {"Informant": "Bean de Faoite", "Gender": "female", "Age": "75"}, {"Language": "Irish"}]}, "4758573/4755892/4922994": {"title": "The Last Palatine", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0865, Page 186", "Page 186"], "url": "https://www.duchas.ie/en/cbes/4758573/4755892/4922994", "text": "\n(continued from previous page)\nand for a long time they held themselves apart a peculiar people. Gradually they intermarried with their neighbours so that today a few German names here and there is all that remains of them.In one parish in North Kilkenny the Palatines had all been absorbed except one old couple.  The Rector called on them trying to persuade them to go the parish church. The old woman refused even to consider the matter. The Palatines were right, everybody else wrong. \"So I suppose\" said the Rector, laughing, \"that there are no Christians left in the world except David and Mrs Keppel\".\"That is so,\" said the old woman, \"and indeed\" she added after a pause, \"I'm none too sure o'Davy.\"\n\n\n\nPetticoat LooseMost folktales are of immemorial antiquity.  Thus the story of Petticoat Loose is simply the old Greek legend of Lamia localised.Petticoat Loose was a ghost whose special object was to murder carmen or carters of coal.  According to one version her original tempter from the paths of vertue was a carman\n(continues on next page)\n", "school_info": "School: Firoda", "metadata": [{"Location:": "Firoda Upper, Co. Kilkenny", "Teacher:": "\nDáithí Ó Meachair\n"}, {"Language": "English"}]}, "4921924/4900645/4933515": {"title": "Folklore", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0397, Page 002", "Page 002"], "url": "https://www.duchas.ie/en/cbes/4921924/4900645/4933515", "text": "\n(continued from previous page)\nhuman being to pass through.Leaving the remainder of his pigs in the charge of some other person, he passed through the opening, and followed on the passage finding in some places that it was narrow, and uneven, until at the end of about two hours journeying, he came to the other end, and found, to his amazement that he was at the familiar place called Ardah.This strange story circulated quickly, and has ever since, been transmitted from generation to generation and probably will be to the end of time.\n\n\n\nAbout three miles from my house is a high mountain. It is a wild and lonely region, and the country around is uninhabited, only for a few houses that are scattered here and there.At the foot of this mountain is a large cave and a strange story is connected with it. It so happened that at one time there lived in this cave a wicked woman named \"Petticoat Loose.\"\n(continues on next page)\n", "school_info": "School: Cill Condae", "metadata": [{"Location:": "Kilcounty, Co. Cork", "Teacher:": "\nBean Uí Ríoghbhardáin\n"}, {"Collector": "Kathleen Walsh", "Gender": "female", "Age": "15", "Address": "Ballyre, Co. Cork"}, {"Informant": "Mr T. Walsh", "Gender": "male", "Age": "62", "Address": "Ballyre, Co. Cork"}, {"Language": "English"}]}, "4922200/4860182/4945213": {"title": "Weather-Lore", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0551, Page 081", "Page 081"], "url": "https://www.duchas.ie/en/cbes/4922200/4860182/4945213", "text": "\n(continued from previous page)\nWhen the cat puts his tail to the fire it is the sign of bad weather.When the dog eats grass it is the sign of rain.When the seagulls come inland it is the sign of a storm.\n\n\n\nPetticoat Loose was a ghost that frequented the road from Cashel to Clonmel. She sometimes adopted the form of a woman of fabulous sine with a great flowing gown. Hence the name Petticoat Loose. At the other times she assumed the guise of monstrous animals. After night fall she was seen on the various roads in South and Mid Tipperary. Several people were terrified by her especially the farmers\n(continues on next page)\n", "school_info": "School: Loughmoe (C.), An Teampoll Mór", "metadata": [{"Location:": "Loughmoe, Co. Tipperary", "Teacher:": "\nCaitlín Ní Riain\n"}, {"Collector": "Peggy Ryan", "Gender": "female", "Address": "Loughmoe, Co. Tipperary"}, {"Informant": "Mr Barry", "Gender": "male", "Address": "Kilnaseer, Co. Tipperary"}, {"Language": "English"}]}, "4922136/4855589/4953606": {"title": "Petticoat Loose", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0534, Page 305", "Page 305"], "url": "https://www.duchas.ie/en/cbes/4922136/4855589/4953606", "text": "\nPetticoat Loose.Once upon a time there lived a woman named Petticoat Loose, the old people are able to tell many stories about her. One night an old man told me a story as follows.One night a man was going home from town and he had a ton weight on his car, when Petticoat Loose appeared to him. She stopped his car and got up and when she did the\n(continues on next page)\n", "school_info": "School: Aonach Urmhumhan, Clochar na Trócaire", "metadata": [{"Location:": "Nenagh, Co. Tipperary", "Teacher:": "\nAn tSr. Celestine\n"}, {"Collector": "Teresa Condon", "Gender": "female", "Age": "13"}, {"Informant": "Mr Thomas Cullen", "Gender": "male", "Age": "62", "Occupation": "county council worker", "Address": "Kenyon Street, Co. Tipperary"}, {"Language": "English"}]}, "4922048/4847411/4954881": {"title": "Petticoat Loose", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0511, Page 184", "Page 184"], "url": "https://www.duchas.ie/en/cbes/4922048/4847411/4954881", "text": "\nPetty coat Loose was a damned spirit who went around Ireland. She used kill people and when ever she got a drive in a car the horse would fall dead because she was tons in weight. There is a red patch in Ballylina road near Kilfinane and it is said that she killed a priest there. The Parish Priest of Kilfinane said that he would banish her into the sea but she said that she owuld turn the ships over. Then he said that he would banish her into the Red Sea where no ship would travel and she is there still draining the sea with a bottomless cup.\n", "school_info": "School: An Gleann Ruadh, Cill Fhíonáin", "metadata": [{"Location:": "Glenroe, Co. Limerick", "Teacher:": "\nMícheál Mac Conmidhe\n"}, {"Collector": "David Meade", "Gender": "male", "Address": "Glenroe, Co. Limerick"}, {"Language": "mixed"}]}, "4758524/4751675/5009413": {"title": "Petticoat Loose", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0852, Page 193", "Page 193"], "url": "https://www.duchas.ie/en/cbes/4758524/4751675/5009413", "text": "\nOne night a man coming from Waterford from his work, he had to pass by Fiddown as he was coming along she met a woman upon the road. He asked her to come into car. The woman got in. When she was in the man told the horse to go on to his surprise the horse was not able to move. Then the man turned to Petticoat Loose and asked her how the horse was not able to go, the woman said how could he when there was two ton weight upon the horse. She told him that it was well for him he asked her to get in, otherwise she might have killed him. She also gave him advice not to get up that night if he heard any noise that the man went to bed. After some time he heard a very great noise like thunder, the man did not get up as he was advised not to. The following morning the man got up and went out to his stable the horse was dead.\n", "school_info": "School: Bearna na Gaoithe (B.) Thomastown", "metadata": [{"Location:": "Windgap, Co. Kilkenny", "Teacher:": "\nSeán  Ó Haonghusa\n"}, {"Collector": "Patrick Grinsell", "Gender": "male", "Address": "Castlejohn, Co. Tipperary"}, {"Language": "English"}]}, "4922057/4848238/5010112": {"title": "Pettycoat Loose", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0512, Page 569", "Page 569"], "url": "https://www.duchas.ie/en/cbes/4922057/4848238/5010112", "text": "", "school_info": "School: Lowtown (C.), Galbally", "metadata": [{"Location:": "Lowe's Town, Co. Limerick", "Teacher:": "\nMáire, Bean Uí Néill\n"}, {"Informant": "Edmond Murphy", "Gender": "male"}, {"Language": "English"}]}, "4922064/4849160/5011256": {"title": "Petticoat Loose", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0514, Page 385", "Page 385"], "url": "https://www.duchas.ie/en/cbes/4922064/4849160/5011256", "text": "\n29. \"Petty-coat Loose\".Once upon a time there was a part of the road in the county Tipperary, which was haunted by a Ghost, called Petty Coat Loose. One night as a man was coming home town in a horse-cart she met him and asked him for a drive. He stopped the horse and she got up on the cart, but the horse would not go. The man coaxed him, but he would not go. \"Do not beat your horse, Sir, but go home and do not be out so late anymore\" said the ghost. The man went home and put up his horse. Next morning, when the man went out to the stable, the horse was dead.Told to John CleereBy Edmond CleereHospitalCo. Limerick.\n", "school_info": "School: Scoil na mBráthar, An t-Ósbuidéal", "metadata": [{"Location:": "Hospital, Co. Limerick", "Teacher:": "\nAn Br. S. Ó Hannracháin, Eamon Ó Grainséin\n"}, {"Collector": "John Cleere", "Gender": "male"}, {"Informant": "Edmond Cleere", "Gender": "male", "Address": "Hospital, Co. Limerick"}, {"Language": "English"}]}, "4922176/4858454/5018751": {"title": "Petticoat Loose", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0544, Page 243", "Page 243"], "url": "https://www.duchas.ie/en/cbes/4922176/4858454/5018751", "text": "\nIn the old times all the wheat from this district used to be taken to Clonmel to be sold.  It was a three day job to deliver it.  It used to be night when they'd be coming home.  The road between Holycross and Cashel was haunted by a spirit called Petticoat Loose.  She used to get up in the car and the horse would be stuck to the road with the weight that would be on him.It was going on for years until a priest banished her to the bottom of the sea to make sugans of the sand till the end of time.  She made a request, namely, that she be allowed to keep her finger over the water.  But he would not allow it.  Her reason 'tis said was that she could sink passing ships if allowed to do so.Told by Tobias Tynan, - (aged 25 years.)Rathmoyne,Borrisoleigh.James Connors,Mountkinane,Borrisoleigh.December 15, 1938.\n", "school_info": "School: Borrisoleigh", "metadata": [{"Location:": "Borrisoleigh, Co. Tipperary", "Teacher:": "\nname not given\n"}, {"Collector": "James Connors", "Gender": "male", "Address": "Moankeenane, Co. Tipperary"}, {"Informant": "Tobias Tynan", "Gender": "male", "Age": "25", "Address": "Rathmoy, Co. Tipperary"}, {"Language": "English"}]}, "4922223/4862158/5020415": {"title": "The Headless Coach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0557, Page 231", "Page 231"], "url": "https://www.duchas.ie/en/cbes/4922223/4862158/5020415", "text": "\n(continued from previous page)\nthe \"Headless Coach\"\n\n\n\nMy father told me a story about one of Cromwell's men I think Grey was his name & that horns grew on him before he died.  He lived where Mrs La Terriere is now living.\n\n\n\nLong ago a woman's spirit was going around. She was called Petticoat Loose. It is said that there was a certain bridge where she used to be and if anyone passed the bridge anyway late at night. It was going on for a long time until the Priest heard it. The Priest went to the place and he asked her what damned her. \"I used to give water in milk to the poor.\"\n(continues on next page)\n", "school_info": "School: Dún Drongáin (B.)", "metadata": [{"Location:": "Drangan, Co. Tipperary", "Teacher:": "\nDiarmuid Ó Gormáin, Labhrás Ó Gormáín\n"}, {"Informant": "James Gleeson", "Gender": "male", "Age": "40", "Address": "Drangan, Co. Tipperary"}, {"Language": "English"}]}, "4922223/4862158/5020416": {"title": "The Headless Coach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0557, Page 231", "Page 231"], "url": "https://www.duchas.ie/en/cbes/4922223/4862158/5020416", "text": "\n(continued from previous page)\nthe \"Headless Coach\"\n\n\n\nMy father told me a story about one of Cromwell's men I think Grey was his name & that horns grew on him before he died.  He lived where Mrs La Terriere is now living.\n\n\n\nLong ago a woman's spirit was going around. She was called Petticoat Loose. It is said that there was a certain bridge where she used to be and if anyone passed the bridge anyway late at night. It was going on for a long time until the Priest heard it. The Priest went to the place and he asked her what damned her. \"I used to give water in milk to the poor.\"\n(continues on next page)\n", "school_info": "School: Dún Drongáin (B.)", "metadata": [{"Location:": "Drangan, Co. Tipperary", "Teacher:": "\nDiarmuid Ó Gormáin, Labhrás Ó Gormáín\n"}, {"Informant": "James Gleeson", "Gender": "male", "Age": "40", "Address": "Drangan, Co. Tipperary"}, {"Language": "English"}]}, "4922279/4866857/5022735": {"title": "Stories - Petticoat Loose", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0576, Page 157", "Page 157"], "url": "https://www.duchas.ie/en/cbes/4922279/4866857/5022735", "text": "\nOnce upon a time there lived a wicked old woman named Petticoat Loose. She used to sell milk to the poor which was very much adulterated. She died and after several years the tale goes on to say that she came back to earth to do Penance for her sins. Being a wicked old woman she way laid several people and nearly frightened them to death. By prayers she was banished to a rock in the mountain known as Bay Lough, near mount millary, Co. Waterford. After that she was driven into the Red Sea to make balls of the sand before she would be released. In another tale it is said that the time she was walking this earth a man with a horse and cart was out rather late one night, she happened to be going his road. He asked her to take a seat not knowing who she was at the time. As soon as she got up on the cart the horse seemed to have got a terrible loud and the perspiration poured out through him. The man got frightened and ordered her to get down. She got down and told him that there was a ton weight in each of her arms.\n(continues on next page)\n", "school_info": "School: Lagganstown, New Inn", "metadata": [{"Location:": "Lagganstown Lower, Co. Tipperary", "Teacher:": "\nEoghan Mac Cárthaigh\n"}, {"Collector": "Molly Holden", "Gender": "female"}, {"Informant": "William Holden", "Gender": "male", "Age": "circa 50", "Address": "Cloghleigh, Co. Tipperary"}, {"Language": "English"}]}, "4922279/4866858/5022737": {"title": "Stories - Petticoat Loose", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0576, Page 158", "Page 158"], "url": "https://www.duchas.ie/en/cbes/4922279/4866858/5022737", "text": "\n(continued from previous page)\nShe challenged him to meet her in the same place on the following night to have a fair fight. The man being frightened told the priest on the following day. The priest and the man arrived ta the appointed place on the following night. The priest made a ring of holy water. She could not get near them while the holy water lasted. When it was out she hit with one finger and told him that she had him beaten. the fight was finished. the man was never the same after. He died a short time after that. She was driven into Bay Lough.\n\n\n\nPetticoat Loose had way laid several persons on the road near Bay lough. She had struck terror into the countryside. It happened that a number of guests were one night present at a wedding party. One of the party related the story to a Father X who was present. The priest asked the man to go with him to the place when they reached the place they saw her coming towards them in a terrible fury. The priest began to read from his breviery and the spirit began \"to set back\" before them. After he had been reading for\n(continues on next page)\n", "school_info": "School: Lagganstown, New Inn", "metadata": [{"Location:": "Lagganstown Lower, Co. Tipperary", "Teacher:": "\nEoghan Mac Cárthaigh\n"}, {"Informant": "Martin Hartigan", "Gender": "male", "Age": "73", "Address": "Knockgraffon, Co. Tipperary"}, {"Language": "English"}]}, "4922274/4866315/5052049": {"title": "Petticoat Loose", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0575, Page 009", "Page 009"], "url": "https://www.duchas.ie/en/cbes/4922274/4866315/5052049", "text": "\nMany years ago a bold and evil woman who went by the name of \"Petticoat Loose\" frequented the lonely road leading from the town of Clogheen, across the Knockmealdown, Mountains to Lismore and Cappoquin.Farmers from Co. Waterford and Co. Tipperary usually travelled to fairs and markets through this lonely mountain pass, very often at dead of night. It is told this woman halted cars, for the purpose of robbery.One story is, that she halted a car and got up on it and sat therein. The horse with all his strength was unable to pull, and refused to travel any further.In later years it is stated that a priest travelling the same road as Petticoat Loose met this evil woman, and by the intercession of the Almighty God banished her forever to the Red Sea.\n", "school_info": "School: An Bháinseach (C.)", "metadata": [{"Location:": "Bansha, Co. Tipperary", "Teacher:": "\nEibhlín, Bean Uí Mheiscill\n"}, {"Collector": "Nellie Butler", "Gender": "female", "Address": "Bansha, Co. Tipperary"}, {"Language": "English"}]}, "4922263/4865350/5054008": {"title": "Petticoat Loose", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0572, Page 116", "Page 116"], "url": "https://www.duchas.ie/en/cbes/4922263/4865350/5054008", "text": "\nPetticoat LooseThere was a kind of a damned soul called \"Petticoat Loose\" who was up on a tree near Modeligo all when the people used be coming from the fair, she used kill some of them except people who carried a crucifix or holy water or scapulars with them.One night a man came on horse back from Dungarvan and at a cross roads he met a man who told him that soon he would pass where \"Petticoat Loose\"was and that she would get up behind him and she was so heavy that the horse could not stir and he gave him a knife and told him to stick her with it then she would say \"Pull and draw again\" but not to draw the knife or she would kill him on the spur of the moment. So all happened as he was told. The knife remained stuck in her and she fell down off the horse dead and the man was very proud of his great deed.\n", "school_info": "School: Currach Chluana (Croughclooney)", "metadata": [{"Location:": "Curraghcloney, Co. Tipperary", "Teacher:": "\nMáire, Bean Uí Fhloinn\n"}, {"Informant": "Michael Phelan", "Gender": "male", "Age": "50", "Address": "Lacken, Co. Waterford"}, {"Language": "English"}]}, "4922294/4867738/5054194": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0579, Page 042", "Page 042"], "url": "https://www.duchas.ie/en/cbes/4922294/4867738/5054194", "text": "\nMany years ago there lived a woman in the Glen of Aherlow whose name was Petticoat Loose. She used to deliver milk to th epoor people of the district. One day she killed her own son and that same day she out water in th emilk she was delivering in order to get mor emoney. The parish priest found out what she had done and told her that she was damned and that putting water in the milk was worse than killing her son. After that she was put into the Red Sea to drain it with a cup without a bottom as an act of Penance.\n\n\n\nNot long ago there lived a man who had three sons.  The eldest of the three sons was a gambler and used to do nothing but gamble and cheat the people of their money and their belongings.  Not only in the day time used he gamble but also in the night and he used to say out nearly all the night.  His father could get no good out of him so himself and a few neighbours planned to frighten him.   Very late one dark night the boy was was going home.  On his way home he had to pass a graveyard and he was passing it his father dressed in a white (sheet) with a white sheet over him rose up\n(continues on next page)\n", "school_info": "School: Tiobraid Árann (B.)", "metadata": [{"Location:": "Tipperary, Co. Tipperary", "Teacher:": "\nMícheál Ó Floinn\n"}, {"Collector": "Paddy Withero", "Gender": "male", "Address": "Tipperary, Co. Tipperary"}, {"Informant": "Mrs Withero", "Gender": "female", "Address": "Tipperary, Co. Tipperary"}, {"Language": "English"}, {"Location": "Aherlow"}]}, "4922294/4867784/5054559": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0579, Page 088", "Page 088"], "url": "https://www.duchas.ie/en/cbes/4922294/4867784/5054559", "text": "\nIn years gone Pettie coat loose was supposed to be possessed by the Devil and that she was very strong and heavy. One day she was sitting on a ditch and a man passed with a side-car and she asked him for a lift and the man told her to sit up. When she sat up the horse began to stop. She told the mna to buy a new whip and to hit him with it and he would go. The man bought the new whip and the man sat up on the car and the horse would not go so he hit the horse and the horse made a dart and he skidid and the car tumbed over on top of the man and killed the horse and the man.\n\n\n\nLong time ago this man lived in a castle. He was a terrible protestant and did not like nuns or priests. He had every thing he wanted except a golf-links. There were a lot of fields around the castle and he went out one day looking for a nice field. He came to this nice level field and he saw that there was a nun buried there. He told the others\n(continues on next page)\n", "school_info": "School: Tiobraid Árann (B.)", "metadata": [{"Location:": "Tipperary, Co. Tipperary", "Teacher:": "\nMícheál Ó Floinn\n"}, {"Collector": "Patrick Daly", "Gender": "female", "Address": "Tipperary, Co. Tipperary"}, {"Informant": "Mrs Connell", "Gender": "female", "Address": "Tipperary, Co. Tipperary"}, {"Language": "English"}]}, "4922266/4865647/5055268": {"title": "Petticoat Luce", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0572, Page 410", "Page 410"], "url": "https://www.duchas.ie/en/cbes/4922266/4865647/5055268", "text": "\nPetticoat LucePettycoat Luce was a bad living woman. She killed her father and her mother and an unbaptised child. The Parish Priest of Clogheen gave her a penance to drain Bay Lough with a thimble. Some people from Clogheen went up to Bay Lough to make an outlet to let the water run out. When they were there they saw that Clogheen was on fire They ran down to save it . When they got down it was not on fire at all. One day a man was going on a horse and car to Cappoquin. Petticoat Luce sat up behind on the car. The man wondered why the horse was going so slow. He looked back and saw Pettioat Luce on the back of the car. It was said that she killed\n(continues on next page)\n", "school_info": "School: Gormanstown, Árd Fhíonáin", "metadata": [{"Location:": "Gormanstown, Co. Tipperary", "Teacher:": "\nPeadar de Mhóiréis\n"}, {"Collector": "Mary Clutterbuck", "Gender": "female", "Address": "Gormanstown, Co. Tipperary"}, {"Informant": "John Beston", "Gender": "male", "Address": "Ballybacon, Co. Tipperary"}, {"Language": "English"}]}, "4922268/4865918/5056082": {"title": "Petty Coat Lewis - Her Misdeeds - Her Penances", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0573, Page 043", "Page 043"], "url": "https://www.duchas.ie/en/cbes/4922268/4865918/5056082", "text": "\nPetty Coat Louis was a very bad woman. It is said that she was a damed soul. She used often make journeys from Cork to Dublin and from Mitchelstown to Clogheen. Once she came on by Skeheenarinky to Clogheen. She came on by the old road. She got a drive from a man she met on the way. The priest of the parish gave the man a pin to stick in her head and he would be safe. They were going along for a while and Petty fell asleep so the man stuck the pin in her head. After a long time the man looked behind and he did not see any trace of her. Once she met a man near Coolagarranroe and she got a drive from him. The horse began to sweat and did not pull the car. So the man began to whip the horse. After a long time the horse stood up. Then Petty came out and she told the man to lift her hand and the man could not. Petty said you see now why your horse could not pull. There was a ton weight in her hand.2.Petty coat Lewis often asked people for lifts and everybody was afraid of her. One night a man was to pass through that road. The priest gave him a\n(continues on next page)\n", "school_info": "School: Sceichín an Rince, Cloichín an Mhargaidh", "metadata": [{"Location:": "Skeheenaranky, Co. Tipperary", "Teacher:": "\nDómhnall Ua Cathasaigh\n"}, {"Informant": "William Neill", "Gender": "male", "Age": "64", "Address": "Skeheenaranky, Co. Tipperary"}, {"Informant": "Mary Walshe", "Gender": "female", "Age": "87", "Address": "Coolagarranroe, Co. Tipperary"}, {"Informant": "Patrick Williams", "Gender": "male", "Age": "60", "Address": "Doolis, Co. Tipperary"}, {"Language": "English"}]}, "4922268/4865922/5056085": {"title": "Petty Coat Lewis - Her Misdeeds - Her Penances", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0573, Page 047", "Page 047"], "url": "https://www.duchas.ie/en/cbes/4922268/4865922/5056085", "text": "\n(continued from previous page)\n(c)Petty Coat Loose drown a baby in the Knockmealdown mountains. One day she was going through the mountain and she got a lift from a man. She got the rein from the man when she came to Beal ac she flung the him in to Beal ac. The penance the priest gave her was to drain Beal ac with a timble. She could not drain it. She drown a great many people in Beal ac. She was a murderer. All the people was frightened of her.(d)A man gave her a lift one night. The horse frightened at some thing on the road\"If you wont drive on I will kill your self and the horse\" she said.The horse would not go and she kill them.{William Neill Skeneenarinky 64 yrs (Par. Ballyporeen)}\n\n\n\nVThere were a car man called Baoikeen 'caming' from Cashel to Cork. One night Petticoat Lewis met him at Burnscourt cross and sat up on his load and the horse was scarcely able to move for two miles of  the road, because there was a ton weight in her eight hand. She disappeared from the load at the end\n(continues on next page)\n", "school_info": "School: Sceichín an Rince, Cloichín an Mhargaidh", "metadata": [{"Location:": "Skeheenaranky, Co. Tipperary", "Teacher:": "\nDómhnall Ua Cathasaigh\n"}, {"Informant": "James Shealy", "Gender": "male", "Age": "79", "Address": "Coolagarranroe, Co. Tipperary"}, {"Language": "English"}]}, "4922268/4865923/5056095": {"title": "Petty Coat Lewis - Her Misdeeds - Her Penances", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0573, Page 048", "Page 048"], "url": "https://www.duchas.ie/en/cbes/4922268/4865923/5056095", "text": "\n(continued from previous page)\nof two miles. Then the horse moved away at ease. Then the man fell sick and after seven years he started carring again on the same road and he met her again and she laid her right hand down on him and killed him. St Patrick banished her into the Red Sea emptying it with bottomless bucket. Her life was ended then.{James Shealy Coolagarranroe, 79yrs. (Par. Ballyporeen}\n\n\n\nOne day a man from Ballyporeen was coming from Loismore. Passing Baellough a woman asked him for a lift. He gave it to her and from the time she sat in the horse refuse to go. He said to her that his horse was able to draw two ton weight every day. But she said there is more than two ton weight on him now, and it is well for you that you took me up or you or your horse would never pass Baellough to night. Next morning the horse was dead in the stable. Another man passing by the lough one night found he in the car with him. He pretended not to see her but when he got home he left the horse in the yard and ran in but she caught a harrow and threw it after him missing him by a few inches.{From Michael Leonard Sheheenarinky 87yrs (Par. Ballyporeen)}\n", "school_info": "School: Sceichín an Rince, Cloichín an Mhargaidh", "metadata": [{"Location:": "Skeheenaranky, Co. Tipperary", "Teacher:": "\nDómhnall Ua Cathasaigh\n"}, {"Informant": "Michael Leonard", "Gender": "male", "Age": "87", "Address": "Skeheenaranky, Co. Tipperary"}, {"Language": "English"}]}, "4922269/4866082/5071776": {"title": "Petty Coat Loose", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0573, Page 204", "Page 204"], "url": "https://www.duchas.ie/en/cbes/4922269/4866082/5071776", "text": "\nOne night a woman was coming home from a town. She met \"Pettycoat-Lewis\" on her way, she had a bag on her back. She asked the woman to bring the bag for her, she was not able to lift it. She opened it to try what was in it and it was empty. She asked Pettycoat-Lewis what was in it, and she said it was heavy on account of her sins.\n", "school_info": "School: Sceichín an Rince, Cloichín an Mhargaidh", "metadata": [{"Location:": "Skeheenaranky, Co. Tipperary", "Teacher:": "\nDomhnall Ua Cathasaigh\n"}, {"Informant": "Margaret Mc Grath", "Gender": "female", "Age": "45", "Address": "Skeheenaranky, Co. Tipperary"}, {"Language": "English"}]}, "4922273/4866299/5073831": {"title": "Petticoat Loose", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0573, Page 419", "Page 419"], "url": "https://www.duchas.ie/en/cbes/4922273/4866299/5073831", "text": "\nIn a cave near Bay Lough a [witch?] named Petticoat Loose had her home. She was a very wicked woman and did many terrible deeds. She had a certain dislike for any man named John. The Parish Priest in Clogheen at that time was named Father Shanahan. One day he travelled to Bay Lough to meet the witch. He asked her what she did that damned her. She said that she sold milk with water in it. He told her that that did not damn her. Then she said that she beat her parents and he said the same thing about that, then she told him that she killed an unbaptised child and he said that damned her.There are are many stories told relating her deeds. One day a man named John was riding on horse-back by that place. She suddenly jumped up on the horse behind him and was on the point of killing him when he drew a black-handle knife and stuck it in her arm. She smiled at him and said \"Draw and stick again\" but he did not because if he did it would be his ruination.  Almost immediately she fell dead at the horse's feet.\n(continues on next page)\n", "school_info": "School: Clogheen Convent", "metadata": [{"Location:": "Clogheen, Co. Tipperary", "Teacher:": "\nSr. Emmanuel Hearn\n"}, {"Language": "English"}]}, "5009011/4977060/5115665": {"title": "Petticoat Loose", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0715, Page 492", "Page 492"], "url": "https://www.duchas.ie/en/cbes/5009011/4977060/5115665", "text": "\nA story is told of a woman who was called by the name of Pettycoat-loose. She was seen crossing fields and vanish in a cloud of smoke and appear again in the form of a woman half a mile off. A man was about thirty miles away from his own home. After delivering a heavy load of corn, when he was coming home with his empty cart, he passed by a woman on the road whome he did not know. After he had passed her by he noticed his horse pulling very hard, and when he looked back he saw this strange woman sitting behind his cart. Neither the man or the woman spoke but by the time he had got another half a mile his horse was sweating very hard and under the harness was a white foam or froth, which the man said never happened before to the horse even when pulling loads of over a ton weight. This continued for another mile when\n(continues on next page)\n", "school_info": "School: Killallon", "metadata": [{"Location:": "Boherard, Co. Meath", "Teacher:": "\nStiophán Ó Scalaighe\n"}, {"Collector": "Mavis Rennehan", "Gender": "female", "Address": "Killallon, Co. Meath"}, {"Informant": "James Rennehan", "Gender": "male", "Address": "Killallon, Co. Meath"}, {"Language": "English"}]}, "4922170/4858144/5130491": {"title": "A Ghost Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0543, Page 169", "Page 169"], "url": "https://www.duchas.ie/en/cbes/4922170/4858144/5130491", "text": "\n(continued from previous page)\nthe hound met him in Moyallife.  They were not long together when a evil Ghost appeared to them.  The hound fought the Ghost and would not let him go near his master.  When they reached their home the hound fell down and died.  It is to be seen to day over the grave where the hound is buried, a large flat stone, on which the figure of the hound is cut on it.  It is said that Mattew Connoly would be killed that night, only for his faithful greyhound.\n\n\n\nThree hundred years ago Petticoat Loose lived in Ireland. She lived on the mountain of Slievenamon. She used to do an enormous amount of damage. On a flag stone beside the lake of Slievenamon the mark of her scissors, thimble, and stool, and where she sat are to be seen to day. One of her customs was to sit up on a horse and car and at that moment the horse would refuse to move. Finally the horse would die on the road under the car.  The parish priest who was in the vicinity where she was living could stand this no longer and he decided to put an end to her life. He banished her, and compelled her to live beneath the waters of the Irish Sea for seven years. When\n(continues on next page)\n", "school_info": "School: Baile Nua", "metadata": [{"Location:": "Newtown, Co. Tipperary", "Teacher:": "\nSéan Wixteed\n"}, {"Collector": "Phil Shanahan", "Gender": "male", "Age": "13", "Address": "Shanballyduff, Co. Tipperary"}, {"Informant": "William Shanahan", "Relation": "parent", "Gender": "male", "Address": "Shanballyduff, Co. Tipperary"}, {"Language": "English"}]}, "5009325/5007246/5134715": {"title": "Petticoat Loose", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0897, Page 175", "Page 175"], "url": "https://www.duchas.ie/en/cbes/5009325/5007246/5134715", "text": "\nA girl, who was known by the name of Petticoat Loose, killed her mother and father, and two children, one without Baptism.  She herself died soon afterwards, and on a certain spot, where she killed the people, she used to appear.One night a man was passing by on a horse and she appeared to him and he took her up on the horse, and the minute she mounted, the horse staggered.  The man remarked that he never noticed the horse stagger like that before.  She replied, \"the horse never carried such a weight before, for I carry many tons of sin.\"  The man then let her dismount and journeyed home.  In the morning he found the horse dead.  He mentioned the matter to a priest, who later visited\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire, Ros Mhic Treóin", "metadata": [{"Location:": "New Ross, Co. Wexford", "Teacher:": "\nSr M.R. Ní Mhaoldomhnaigh\n"}, {"Informant": "Mr T. Whelan", "Gender": "male", "Address": "Irishtown, Co. Wexford"}, {"Language": "English"}]}, "4921918/4910860/5166070": {"title": "Story of Rostellan Castle", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0395, Page 208", "Page 208"], "url": "https://www.duchas.ie/en/cbes/4921918/4910860/5166070", "text": "\n(continued from previous page)\non her loved son's grave. The graveyard was on the English Lord's land, and once a year he sent his men to clean it. About the time due for cleaning the graveyard, the poor woman went to the men, and asked them to be careful when they came to her son's grave, + not to break the Statue of St. Anthony. The men took no notice of her, and actually broke the statue. When the poor woman saw this, she got so angry that she cursed the place, + said that the crows wouldn't build their nests in Rostellan for a hundred years. Strange to relate, the crows haven't built their nests in Rostellan as far back as people can remember, until 1936, when they returned again. Rostellan castle is huge + has three hundred and sixty five windows. Kitty Mc Carthy got the above from Mr Wall, Ballinacurra\n\n\n\nRita Fitzgerald of Haymount got the full story from her mother, who in turn got the story from her mother. This story is told in the district of Ballynoe about a certain woman who was called \"Petticoat Loose.\"The priest of the parish got reason to believe that a number\n(continues on next page)\n", "school_info": "School: Clochar na Toirbhirte, Mainistir na Corann", "metadata": [{"Location:": "Midleton, Co. Cork", "Teacher:": "\nAn tSr. Seosamh\n"}, {"Collector": "Rita Fitzgerald", "Gender": "female", "Address": "Midleton, Co. Cork"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "female"}, {"Language": "English"}]}, "5162110/5155122/5168443": {"title": "Petticoat Loose", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0535, Page 163", "Page 163"], "url": "https://www.duchas.ie/en/cbes/5162110/5155122/5168443", "text": "\nOnce upon a time there lived a woman named Petticoat Loose, and the old people are able to tell many (mar) stories about her. The following story is connected with her.One night a man was going home from town and he had a ton weight on his car, when Petticoat Loose appeared to him. She stopped his car and got up. When she did so the horse would not move because one of her arms was a ton weight.When the man got home he went to the priest and he took him to the place. They shook holy water and she appeared to them outside when they shook the holy water. He asked her where she was, and she said that she was dammed. Then the priest asked her why\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire, Nenagh", "metadata": [{"Location:": "Nenagh, Co. Tipperary", "Teacher:": "\nAn tSr. Seanán\n"}, {"Collector": "Elenor Cullen", "Gender": "female", "Age": "13", "Address": "Kenyon Street, Co. Tipperary"}, {"Informant": "Mr T. Cullen", "Gender": "male", "Age": "62", "Occupation": "clerk", "Address": "Kenyon Street, Co. Tipperary"}, {"Language": "English"}]}, "5162154/5159325/5180643": {"title": "Our Holy Wells", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0656, Page 094", "Page 094"], "url": "https://www.duchas.ie/en/cbes/5162154/5159325/5180643", "text": "\n(continued from previous page)\ndried since, but a trout was never seen since.\n\n\n\nThere is a place called \"Bay Lough\" situated between Mount Mellerary and Clogheen, at the foot of the mountain overlooking a place called the \"V\". This is the new road from Clogheen to Mount Mellerry, but the old road from Clogheen to Mount Melleraray passed by the edge of \"Bay Lough,\" where several people having recourse to this road often met this bad and dangerous woman called\n(continues on next page)\n", "school_info": "School: Clochar na Toirbhirte, Cluain Meala", "metadata": [{"Location:": "Greenan, Co. Waterford", "Teacher:": "\nAn tSr. Treasa le Muire\n"}, {"Informant": "Mr Meaney", "Gender": "male", "Address": "Clonmel, Co. Tipperary"}, {"Language": "English"}]}, "5162156/5159512/5181297": {"title": "Scéalta Sprid", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0656, Page 281", "Page 281"], "url": "https://www.duchas.ie/en/cbes/5162156/5159512/5181297", "text": "\nScéalta Sprid1. Bhí sean duine in a parróiste seo tamall fada ó shoin agus d'fhan sé i dtigh comhursan go dtí an meadhon oidhche agus bhí míle nó níos mó le dul abhaile aige trés na pairceannaibh. Nuair a bhí sé leath slighe nó níos fearr d'airigh sé duine ag siubhal in a dhiaidh. Dhearc sé siar a chonnaic sé fear gan ceann agus ar an noimeat cuireadh ar bhárr a chinn é. D'eirigh sé agus theic sé. Níor chuaidh sé abhfad nuair a dhearc se siar arís agus leagadh arís é. Tháinig an sprid suas leis agus dubhairt sé leis gur mhaith an gnó go raibh a bhata collach aige.D'éirigh sé agus níor dhearc sé siar arís. Tháinig sé go dtí tigh agus ghlaoidh sé ag an doras é leigint isteach go gcuirfeadh sé spré in a phíopa. Leigeadh isteach é agus chuir sé spré in a phíopa, do chuaidh sé abhaile annsan agus ní fhaca se an sprid a thuille.\n\n\n\nBhí sprid an fadó a dtugaidís Petticoat Louise uirthí. Inghean óstéara ab' eadh í, deirtí gur tháinig sí ó cnoc Colligan in aice le Dúngarbhán.Bhí an duthaigh ag crioth roimpí. Bhí fear ag teacht abhaile ó Cluain Meala oidhche agus bhí capall agus trucaill Gaodhlach aige. Tháinig an sprid air agus d'iarr sé marcuidheacht air. Dubhairt sé leí suidhe isteach, ní raibh fhios aige gurb e an sprid a chuige é. Ba ghairid gur stad an capall agus dubhairt se leis an sprid gurb é\n(continues on next page)\n", "school_info": "School: Baile Nua, Baile Mhic Cairbre", "metadata": [{"Location:": "Clonanav, Co. Waterford", "Teacher:": "\nPádraig Ó Cearbhaill\n"}, {"Informant": "Ruaidhrí Ó Riain", "Gender": "male"}, {"Language": "Irish"}]}, "5162156/5159513/5181298": {"title": "Petticoat Loose", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0656, Page 282", "Page 282"], "url": "https://www.duchas.ie/en/cbes/5162156/5159513/5181298", "text": "\n(continued from previous page)\nan céad uair riamh a chonnaic se an capall ag stad. \"Ní h-aon iongantas do\" ars an sprid, \"mar tá tonna meadhchaint ins an láimh sí\", ag teasbáint a láimh deas do, \"ó bheith ag bualadh m'athar\".Bhí fhios ag an fear annsan gurb é an sprid a bhí ann agus strac sé leis é féin agus an capall go dtí gur thánadar go dtí gleanna a raibh uisce ann. Do sheasaigh sé amuigh i lár an uisce. Dubhairt an sprid annsan, \"Níor láir duit, ní raghfá abhaile beo anocht\". D'fhan sé annsan go dtí breacadh an lae go raibh an sprid imthighthe mar ní fuigheadh sí baint leis ins an uisce.Ruaidhrí Ó Riain.\n\n\n\nBhí Petticoat Louise ar an mbóthar idir Cloichín a' Mhargaidh agus Lios Mór ag an bealach in aice an locha.Do mharbhuigh sí an-chuid daoine ó an go h-am & ní leigfeadh eagla d'aoinne gabháil an bóthar sa deireadh. Tháinig sagart cun í a chur as an áit. Nuair a tháinig sí d'fiafruigh sé di cad a dhein sí an an tslighe a d'amnuigh í. Dubhairt sí leis go mbíodh sí ag bualadh a h-athar is a máthar. Dubhairt an sagar nár dhamnuigh san í.Dubhairt sí ann san go mbíodh sí ag cur uisce ins a mbainne a dhióladh sí leis na daoine bochta.\"Sin é a dhamuigh tusa\" ars an sagart agus\n(continues on next page)\n", "school_info": "School: Baile Nua, Baile Mhic Cairbre", "metadata": [{"Location:": "Clonanav, Co. Waterford", "Teacher:": "\nPádraig Ó Cearbhaill\n"}, {"Informant": "R. Ó Riain"}, {"Language": "Irish"}]}, "4921874/4897801/5184539": {"title": "A Funny Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0386, Page 103", "Page 103"], "url": "https://www.duchas.ie/en/cbes/4921874/4897801/5184539", "text": "\nTeller. -Tim HalloranBallynoe. Cobh.1.\tFinnaglassa – about 2 miles from Belvelly on main Road to Cobh. A beautiful lady comes down to teine ghlaise on a lovely white horse on certain nights. She has a bucket with no bottom. [One night a man was coming from Queens-town (Cobh) about 12 o-clock. Right opposite teine ghlaise on the road were a hearse and coffin without a driver.]She tries to fill it. One night a fisherman saw her and said “Sure you cannot fill that bucket.” She answered “I was a barmaid and I used not fill the pints at all so that was the Penance I got.”\n\n\n\nTim Halloran2. Petticoat LooseA woman lived once upon a time between Carrigtwohill and Midleton. She was called Petticoat Loose, and every person that passed by her house after dark used to fall dead. One day a priest went to see her to know could he do anything to prevent her from killing the people. She said no matter what he would do, she would still kill the people. He said he would banish her into the sea. She said she would sink all the ships passing. He said he would banish\n(continues on next page)\n", "school_info": "School: Fota Island, Belvelly, Cóbh", "metadata": [{"Location:": "Foaty, Co. Cork", "Teacher:": "\nPádraig Ó Coileáin\n"}, {"Informant": "Tim Halloran", "Gender": "male"}, {"Language": "English"}]}, "4921841/4895984/5184807": {"title": "Petticoat Loose", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0378, Page 121", "Page 121"], "url": "https://www.duchas.ie/en/cbes/4921841/4895984/5184807", "text": "\nNo. 64                        Page 121                                     8.6. '38Petticoat Loose is so called because she wears a big loose red petticoat.  She is supposed to be a damned soul who sometimes appears in Bay Lough Co. Tipperary.  She told a man that she was damned because she murdered a student.  She is seen sitting on a rock at the side of Bay Lough combing her beautiful golden hair.  She sings the most weird songs which terrify the hearers, most people are afraid to pass by the place at night.  When children are naughty their mothers threaten them with Petticoat Loose. A girl named Miss Dunne, Glenafolla, Co. Waterford told about the above mentioned fairy though she never saw her, she was often told Petticoat Loose would catch her when doing any mischief.\n", "school_info": "School: Clochar na Toirbhirte, Mainistir Fhearmuighe", "metadata": [{"Location:": "Fermoy, Co. Cork", "Teacher:": "\nNa Mná Rialta\n"}, {"Language": "English"}]}, "4921840/4895833/5184990": {"title": "The Story of the Magic Purse", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0377, Page 242", "Page 242"], "url": "https://www.duchas.ie/en/cbes/4921840/4895833/5184990", "text": "\n(continued from previous page)\nand scattered them on the floor. His wife was delighted gathering them up. A man in the neighbourhood heard about the purse and he wanted to claim it. He went to the poor man's house and told him that it was he that owned the purse. The poor man was sentenced to be hanged for stealing.When the day came and the hangman was putting the rope around the poor man's neck the latter said \"open purse, open purse.\" and two men came out and hanged the hangman.\n\n\n\nLong ago there lived in Ireland a wicket witch named Petticoat loose. This witch visited nearly all the main roads in the Munster and Leinster provinces.\n(continues on next page)\n", "school_info": "School: An Ghráinseach, Mainistir Fhearmuighe", "metadata": [{"Location:": "Grange West, Co. Cork", "Teacher:": "\nPádraig Ó Díomsaigh\n"}, {"Collector": "Jerry Coleman", "Gender": "male", "Address": "Garraunigerinagh, Co. Cork"}, {"Informant": "Patrick Coleman", "Gender": "male", "Age": "54", "Address": "Garraunigerinagh, Co. Cork"}, {"Language": "English"}]}, "5162129/5156482/5197324": {"title": "Petticoat Loose", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0574, Page 003", "Page 003"], "url": "https://www.duchas.ie/en/cbes/5162129/5156482/5197324", "text": "\nPetticoat LoosePetticoat Loose was a very wicked woman who had he home in a cave near Bay Lough. She had a certain dislike for any man named John and she did many wicked deeds to the people who passed that way.There are many stories connected with her. One day a man named John was riding on horseback beside her cave. She came out and jumped up on the horse behind him. But he stuck a black-handle knife in her hand She smiled at him and requested him to draw and stick again but he did not as he knew it would be his destruction if he did. Immediately she fell dead at\n(continues on next page)\n", "school_info": "School: Convent of Mercy, Clogheen", "metadata": [{"Location:": "Clogheen, Co. Tipperary", "Teacher:": "\nSr. M. Emmanuel Hearn\n"}, {"Collector": "Mary Fahy", "Gender": "female", "Address": "Carrigmore, Co. Tipperary"}, {"Informant": "Mrs P. Fahy", "Gender": "female", "Address": "Carrigmore, Co. Tipperary"}, {"Language": "English"}]}}