{"4428271/4390400/4438946": {"title": "Lucky and Unlucky Days", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1032, Page 110", "Page 110"], "url": "https://www.duchas.ie/en/cbes/4428271/4390400/4438946", "text": "\n(continued from previous page)\non Saturday because it is said that that day is unlucky. Some people say “Saturdays flit is a short sit.”\n\n\n\nBogbine a thick juicy plant found in marshy and boggy land is regarded as a valuable cure for blood troubles. In our parish even to this day it is gathered and boiled and bottled. Its taste is extremely bitter like cascars and it is a rather dark drink. During spring is the correct time to use it.\n", "school_info": "School: Lathaigh (Laghey)", "metadata": [{"Location:": "Laghy, Co. Donegal", "Teacher:": "\nProinsias Mac Pháidín\n"}, {"Collector": "Monica Connolly", "Gender": "female"}, {"Informant": "Mrs Connolly", "Gender": "female", "Age": "45"}, {"Language": "English"}]}, "4427895/4355591/4447857": {"title": "Cures - Warts", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0109, Page 591", "Page 591"], "url": "https://www.duchas.ie/en/cbes/4427895/4355591/4447857", "text": "\n(continued from previous page)\nwater which had been left on limestone for some days.Another cure for warts is to scrape the tops of them with a blunt knife and then rub castor oil on them.BoilsA good cure for boils is to mix soap and fine sugar and put it on them.Another good cure for boils is to rub sulphor ointment of them.The above information was given to me byPatrick Brennan, John Brennan, Tubrahan.\n\n\n\nBoilsA good cure for boils is to put hot gruel and a cloth so that the gruel won't fall off and it will\n(continues on next page)\n", "school_info": "School: Tulach Ruacháin", "metadata": [{"Location:": "Tulrohaun, Co. Mayo", "Teacher:": "\nMícheál de Bhaldraithe\n"}, {"Collector": "Patrick Caulfield", "Gender": "male"}, {"Informant": "Patrick Caulfield", "Gender": "male", "Address": "Culnacleha, Co. Mayo"}, {"Language": "English"}]}, "4427966/4361882/4466894": {"title": "Plasters", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0125, Page 430", "Page 430"], "url": "https://www.duchas.ie/en/cbes/4427966/4361882/4466894", "text": "\nThe cure for a headache long ago was to get the head measured by a certain man. At that time there was a certain man in each parish who could measure the head. The moment it was measured the head-ache was said to go. There is another cure for a headache that is to make a pillow from cammomile and to lie on that for a night and the heachache will go.\n\n\n\nCancer nowadays is quite a common disease and it is almost (incurneab) incurable by doctors.They cut it away but the roots remain there is a woman in Eniscrone named Miss Cowell and she has a white poultice and she claps it to the and draws it out from the roots.\n\n\n\nThe cure for boils is soap and sugar, but some soap finely and bruise the sugar finely into a powder with a hnife. Then mix thetwo together and put them on and to the boil, this will soon clean it. First white bread is but to the boil to ripen it and then the soap and sugar will draw it out. There is a plant named buglas and if this is boiled with oatmeal and put to the boil it will cure it.\n", "school_info": "School: Clún na Gaoithe", "metadata": [{"Location:": "Cloongee, Co. Mayo", "Teacher:": "\nPádraig Ó Héaráin\n"}, {"Informant": "Mrs Mary Dunleavy", "Relation": "unknown", "Gender": "female", "Address": "Ummoon, Co. Mayo"}, {"Language": "English"}]}, "4493627/4405045/4514348": {"title": "Cure for Persistant Diarrhoea in Children", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1073, Page 103", "Page 103"], "url": "https://www.duchas.ie/en/cbes/4493627/4405045/4514348", "text": "\nBoiled root of the briarUsed in the Carrick district near the River Lennon.\n\n\n\nRoasted root of a plant commonly found near rivers (Irish name means river parsnip) It is applied hot as a poultice.\n\n\n\nThe child goes three times under a donkey- always the same way.\n\n\n\nPrepare Irish ivy. (This is dangerous. About 20 years ago I saw an inquest here resulting from this cure)\n", "school_info": "School: Caológa (2)", "metadata": [{"Location:": "Keeloges, Co. Donegal", "Teacher:": "\nTadhg Ó Laoghaire\n"}, {"Language": "English"}]}, "4613712/4611431/4651408": {"title": "Local Cures", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0405, Page 249", "Page 249"], "url": "https://www.duchas.ie/en/cbes/4613712/4611431/4651408", "text": "\n(continued from previous page)\nGet a live frog and crack the bone of his leg into the tooth in which you have the pain and it will cure the pain of the tooth.\n\n\n\nBoils: -If you want to cure boils get a ivy leaf and boil it in a drop of water, and put it up to the boil. That would cure the boil.\n", "school_info": "School: Cnoc an Iubhair (B.)", "metadata": [{"Location:": "Kealid, Co. Kerry", "Teacher:": "\nPádraig Ó Ceallacháin\n"}, {"Collector": "Daniel Sweeney", "Gender": "male", "Age": "15"}, {"Informant": "William Drury", "Gender": "male", "Age": "67", "Occupation": "labourer", "Address": "Carhooearagh, Co. Kerry"}, {"Language": "English"}]}, "4658454/4657267/4662302": {"title": "Local Cures - Mumps", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0226, Page 484", "Page 484"], "url": "https://www.duchas.ie/en/cbes/4658454/4657267/4662302", "text": "\nMumps. Meet a man riding a white horse accidentally. Ask him for a cure and do whatever he tells you.James O'Rourke(86)\n\n\n\nPut an asses' head stall on the person afflicted. Lead him around the pig sty three times saying \" Pig O the mumps\" while doing it J. O'Rourke(86)\n\n\n\nTo take out thorn- Chew leaf put it on a piece of cloth lie arounf thorn.John Maxwell, Carrickmakeegan.\n\n\n\nCorn: Melt pieces of candle, melt it and pour parafin over it and put it on the corn. J. Maxwell\n\n\n\nGet a leaf of slánlus and boil it in a cup of water mix with butter and place it on cut.\n\n\n\nTo Draw Boils: Roast Slánlus leaf and apply- one side (the smooth) draws, the other side heals.\n", "school_info": "School: Kilmore", "metadata": [{"Location:": "Kilmore, Co. Leitrim", "Teacher:": "\nMáire, Bean Uí Shamhráin\n"}, {"Informant": "A. O' Reilly", "Address": "Castleterra, Co. Cavan"}, {"Language": "English"}]}, "4706354/4705321/4727749": {"title": "Cure for Craosghalar", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0446, Page 304", "Page 304"], "url": "https://www.duchas.ie/en/cbes/4706354/4705321/4727749", "text": "\n(continued from previous page)\nthe calf is cured, but if it does not come out the calf is uncurable.  It the knot comes out the calf gets up afer a while and runs about the place.\n\n\n\nGet a piece of meat and rub it to every wart and put the meat in a parcel and put brown paper outside and bind it with  a cord and put it in a path or road and when some person picks it up he takes the wart with them.\n", "school_info": "School: Réidh Ghlas", "metadata": [{"Location:": "Knockardtry, Co. Kerry", "Teacher:": "\nPártholán Ó Dálaigh\n"}, {"Collector": "Tim Donovan", "Gender": "male"}, {"Informant": "Denis Horan", "Gender": "male", "Age": "65"}, {"Language": "English"}]}, "4701685/4692570/4728073": {"title": "Local Cures - Erysipelas", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0161, Page 165", "Page 165"], "url": "https://www.duchas.ie/en/cbes/4701685/4692570/4728073", "text": "\nHerbs and unsalted butter. The are pounded togther till they become quite soft; then they are rubbed on the person who has the disease, and in two weeks it should disappear.\n\n\n\nTo keep a child from biting its nails, a piece of soot was put on them.\n\n\n\nBleeding cut: a) Cobweb placed on the cut (Gilmartin)b) Bogmoss placed on the cut (Mulvey)\n\n\n\nrub a docken on it\n\n\n\n(a) A meal of boiled onions.(b) Bread and hot water applied to the boil\n\n\n\nBread & boiling water put on as a poultice.\n\n\n\nBrain fever was cured by certain people who put an obligation on the patient to say certain prayers.The person who has the cure says certain prayers also. The person has to make three visits to the \"doctor\" who places a black silk\n(continues on next page)\n", "school_info": "School: Scoil na mBráthar Sligeach (Sráid na Céibhe)", "metadata": [{"Location:": "Quay Street, Co. Sligo", "Teacher:": "\nAn Br. Ó Cearbhaill\n"}, {"Collector": "Th. Lacey"}, {"Collector": "Dl. Gilmartin"}, {"Language": "English"}]}, "4706346/4704670/4779927": {"title": "Local Cures - The Man of the Grey Horse", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0444, Page 447", "Page 447"], "url": "https://www.duchas.ie/en/cbes/4706346/4704670/4779927", "text": "\nboiled in Milk and given to the child. If this remedy failed a question was put to \"the man of the grey horse\".The idea of this was that if any man riding a grey horse passed the way - the woman of the house should ask him \"What cure have you for chin-cough?\" and she carried out anything he advised to do.\n\n\n\nAccording to Peggy Dorgan (Gortnaleha,) *The cure for stopping bleeding was to put a dog leaf around the cut.*If a person had measles the cure was ferret's food or the milk or food left after a ferret.*For a toothache a frog was put into your mouth near the tooth, also a pipe was given to be smoked.* The 7th son of a family is supposed to be a doctor. A person born after the father's death is supposed to be able to cure whooping cough.Peggy Savage of Kilquane, Rathanny says:-*A dog leaf was burnt and the ashes was placed on a boil and all the bad blood was drawn out. My Grandmother told me that soap and sugar when heated together were used as poultices for boils to draw them.*Pepper was put into a tooth to cure toothache.* The 7th daughter of the 7th generation was supposed to be able to cure all diseases.* Yellow meal is put to a sprained ankle or sprained hand. Whiskey (hot) is subbed into a sprain as a cure.\n\n\n\nIf a person had measles the cure was ferret's food or the milk or food left after a ferret.\n\n\n\nFor a tooth-ache a frog was put into your mouth near the tooth, also a pipe was given to be smoked.\n\n\n\nThe 7th son of a family is supposed to be a doctor. A person born after it's father's death is supposed to be able to cure whooping cough\"\n\n\n\nPeggy Savage (of Kilquane Rathanny) says :- \"a dog leaf was burnt and the ashes was placed on a boil and all the bad blood was drawn out. My grand-mother told me that soap and sugar when heated together were used as poultices for boils - to draw them.\n\n\n\nPepper was put into a tooth to cure tooth-ache.The 7th daughter of the 7th generation was supposed to be able to cure all diseases.\n\n\n\nYellow meal is put to a sprained ankle or sprained hand.Whiskey hot is rubbed into a sprain as a cure.\n", "school_info": "School: O'Brennan, Baile Mhic Ealgóid, Tráighlí", "metadata": [{"Location:": "Tonreagh Lower, Co. Kerry", "Teacher:": "\nPádraig Ó Loingsigh\n"}, {"Collector": "Peggy Savage", "Gender": "female", "Address": "Kilquane, Co. Kerry"}, {"Language": "English"}]}, "4769972/4763383/4785055": {"title": "Boils", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0780, Page 242", "Page 242"], "url": "https://www.duchas.ie/en/cbes/4769972/4763383/4785055", "text": "\nBoils  Mix some salt sugar and a cabbage leaf and apply mixture to boil.\n\n\n\nWounds  An old cure for wounds is a weed called Bog Cotton which grows in the Bog. People had to use it long ago in the war to cure wounds.\n\n\n\nBlood Poison  There is a weed called \"Soldiers\" Plaintain. Squeeze the leaves of this plant in your hand and put the joice in the cut and it will be cured.\n\n\n\nSting of Nettles  Dock-leaf - saying Dockety, Dockety, take the sting of a nettle away.\n\n\n\nWhitlow  Rub it with a roasted potato.\n\n\n\nrub a roasted fig on it\n\n\n\napply some roasted salt in a black stocking\n\n\n\nsmoke off blessed turf is good.\n", "school_info": "School: Kilcullen (Convent)", "metadata": [{"Location:": "Kilcullen, Co. Kildare", "Teacher:": "\nNa Siúracha\n"}, {"Collector": "Patsy Dix", "Gender": "female"}, {"Language": "English"}]}, "4678387/4675043/4922717": {"title": "Tine Dhia", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0420, Page 139", "Page 139"], "url": "https://www.duchas.ie/en/cbes/4678387/4675043/4922717", "text": "\n(continued from previous page)\ndaoine. Sé an leigheas a bhíodh aca air, ná an té go mbeadh an galar air a ainm do scríobh tímcheall an phaiste.\n\n\n\nGalar Truaigh - Sin galar a thagann ar ainmhidhthe. Lomann siad ar dtúais agus bíonn siad ag dul chun deiridh. Dá n-aisteareochfaí iad raghaidís i bhfeabhas.\n\n\n\nGalar na gCos: B'in galar a thagadh ar bha agus bheithídhigh fadó. Sé an leigheas a bhíodh aca air ná na h-ainmhidhthe a thiomáint síos go dtí na portaidhthe ar feadh cúpla uair a chluig gach lá.\n\n\n\nNioscióidí: Leigheas ar nioscióidí iseadh meacain an dá habha a d'fhághail. Fásann an luibh sin ar bhancanna na n-abhann. Tá duilleóga beaga glasa air. Déintear í róstadh agus cuirtear leis na n-ioscióidí é nuair a bhíonn sé fuar.\n\n\n\nCraobh-adhbhar id shúil: Sé an leigheas atá ar sin ná fáinne óir d'fhághail agus fíoghar na croise\n(continues on next page)\n", "school_info": "School: Scoil N. Íde", "metadata": [{"Location:": "Marhin, Co. Kerry", "Teacher:": "\nÉamonn Ó Catháin\n"}, {"Language": "Irish"}]}, "4798710/4792319/4927096": {"title": "Cure For a Nose Bleed", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0255, Page 022", "Page 022"], "url": "https://www.duchas.ie/en/cbes/4798710/4792319/4927096", "text": "\nTie a black thread between the knuckle and the lower joints of the little finger of the left hand. Put on three hard knots (not counting the first knot) in the Name of The Father, Son and Holy Ghost. The blood stops instantly.\n\n\n\nBoil water grass or water cress as it is sometimes called. Strain and sweeten the liquid with sugar. Add more water and some spirits to preserve it. Take a 1/2 glassful fasting each morning.\n\n\n\nGet a turnip, wash it and boil it until it is quite soft. Make a poultice of it and apply the poultice to the boil as hot as possible. After about ten or\n(continues on next page)\n", "school_info": "School: An Carraigín", "metadata": [{"Location:": "Carrigeen, Co. Roscommon", "Teacher:": "\nBean Mhic Oireachtaigh\n"}, {"Language": "English"}]}, "4769976/4763661/4929037": {"title": "Ailments and Cures - Boils", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0781, Page 212", "Page 212"], "url": "https://www.duchas.ie/en/cbes/4769976/4763661/4929037", "text": "\nHow to draw them.Get a bottle. Boil a kettle and play the steam on the bottle. When the bottle is very hot take the kettle away and put the mouth of the bottle on the boil. When the bottle cools it will suck the corruption out of the boil. If the bottle will not come off heat it again. This will make it come off. I saw my Daddy doing this.\n\n\n\nIf you have a ringworm get a piece of tobacco and put it in your mouth and then take it out and the spit that is on the tobacco put on the ringworm. Do this three times a day for three days.\n", "school_info": "School: Skerries, Athy", "metadata": [{"Location:": "Skerries North, Co. Kildare", "Teacher:": "\nE. Tansey\n"}, {"Collector": "Edward Dempsey", "Gender": "male", "Address": "Kilmead, Co. Kildare"}, {"Language": "English"}]}, "4921939/4911632/4941389": {"title": "Another Charm-Cure", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0482, Page 072", "Page 072"], "url": "https://www.duchas.ie/en/cbes/4921939/4911632/4941389", "text": "\n(continued from previous page)\nhe can have no luck if he continues his cures.\n\n\n\nThe Cure Of The Worm-Boil.There is a man living in Knockfinisk, named Scanlan, who often practises, charm-cures, and advised others to use his cures.  He got his \"cures\" from the old people of Knocknagortna near Athea.  Where he lived before his marriage.A young man named Fitzgerald, one day showed him a little \"sore\" in his neck. Scanlan said it was a worm-boil, and that it could be easily cured, if his directions were follewed.  He told Fitzgerald to be the first up every morning for three successive mornings, and the last to leave the hearth for three nights.  As he sat by the fire when all had gone to bed, he should stick the tongs in the fire and say the following words:-\"The venom of the fire in the tongs.And the venom of the tongs in the boil\". That would banish the boil.  I did not hear if Fitzgerald carried out the \"cure\".\n", "school_info": "School: Cluain Leith Áird", "metadata": [{"Location:": "Glenbaun, Co. Limerick", "Teacher:": "\nMáirtín de Barra\n"}, {"Language": "English"}]}, "4922085/4850895/4946406": {"title": "Local Cures - Cure for Burns", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0520, Page 193", "Page 193"], "url": "https://www.duchas.ie/en/cbes/4922085/4850895/4946406", "text": "\n(continued from previous page)\nLocal Cures (Contd)If your leg is burned shake flour on the leg and it will never blister.  (Patrick Blackwell)If you get a burn of a nettle pluck a dog-leaf and wrap the dog leaf around it for a while (Joe Ryan)\n\n\n\nPut a grain of lime into your tooth and it will kill the nerve Put cold water into your mouth and keep it in until it gets hot then put a grain of lime into it. Mix salt and water together and take a sup of it and leave it in your mouth for a while and then spit it out.\n\n\n\nBathe it with hot water to clean it out and then put oil in it\n\n\n\nCure for BoilsWhen you get a boil get a piece of wax and warm it to the fire and stick it to the boil (Michael Keating)A cure for boils, is to get snails and bruise them together and then put the snails to the boils and it will cure them (Con Kemp)\n", "school_info": "School: Cappamore (B.)", "metadata": [{"Location:": "Cappamore, Co. Limerick", "Teacher:": "\nJames McCarthy\n"}, {"Collector": "Michael Keating", "Gender": "male"}, {"Collector": "Con Kemp", "Gender": "male"}, {"Language": "English"}]}, "4770004/4766044/4956482": {"title": "Cures in Olden Times - Boils", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0828, Page 110", "Page 110"], "url": "https://www.duchas.ie/en/cbes/4770004/4766044/4956482", "text": "\n1; For Boils Burgundy pitch was heated in a pot. When it was in a liquid state it was spread on a piece of corderoy and this was applied to the boil.2; Brown sugar and brown soap mixed together and rubbed on boils was a very good cure.3; Linseed meal and turpentine was also a very good cure.4; Steeped bian was also another good cure.5; Boils and abcessess are cured when a slice of fig has been boiled in milk and laid on the sore.6; Nettle water when applied cold to boils will be followed my a cure.7; Heated wax rubbed on boils is followed by a cure.\n\n\n\nA cure will follow if the patient goes to a pump and pumps the spring water down on the ankle.\n\n\n\nThe best known cure for gall-stones is regularly doses of Olive Oil.\n", "school_info": "School: St John of God Convent, Rathdowney", "metadata": [{"Location:": "Rathdowney, Co. Laois", "Teacher:": "\nThe Sisters\n"}, {"Language": "English"}]}, "4922139/4856039/5012319": {"title": "Boils", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0536, Page 248", "Page 248"], "url": "https://www.duchas.ie/en/cbes/4922139/4856039/5012319", "text": "\nTo draw matter from a boil, half fill a large neck bottle with water place the mouth of the bottle tightly to the boil and much of the matter is drawn into the bottlePlaster's for boil's are:- sugar and common soap.A poultice of bread and water.A mixture of bees wax and lard.Linseed meal poultice.\n\n\n\n1. 1 oz of yellow arsenic mixed with the white of an egg2. the juice of a wart weed3. make a hole in a dry cow dung fill it with water and wash the warts in it. 4,Rub the warts with the juice of a plant called the five sisters5. warts washed in the water that a blacksmith cools the iron in are supposed to be cured.\n", "school_info": "School: Ballinree, Nenagh", "metadata": [{"Location:": "Ballinree, Co. Tipperary", "Teacher:": "\nPatrick Ahern\n"}, {"Language": "English"}]}, "4922210/4860890/5016020": {"title": "Local Cures - Pain in Side", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0553, Page 236", "Page 236"], "url": "https://www.duchas.ie/en/cbes/4922210/4860890/5016020", "text": "\nPain in sideSpit on two flat stones, place them together and leave them at the foot of a stone wall.\n\n\n\nConsumptionPlace a quantity of the seeds of nettles in a saucepan, and over them pour two pints of boiling water. The saucepan should then be placed beside the fire to simmer until the liquid is reduced to one and a half pints. The liquid should then be poured through a strainer into a jug, and when cold is ready for use. A glassful should be taken three times a day after meals.\n\n\n\nBoilsA paste made of soot and pounded up sugar should be applied to the boil.\n\n\n\nKidney Disease(1) Boil house leek in water. Strain, and sweeten the juice with sugar. Drink a glassful twice a day. (2) Boil in new milk a plant called \"Burn-the-House\" which has a pink flower, strain and take a glassful twice a day.\n", "school_info": "School: Moycarkey, Thurles", "metadata": [{"Location:": "Moycarky, Co. Tipperary", "Teacher:": "\nMichael Myers\n"}, {"Language": "English"}]}, "4922184/4859024/5020431": {"title": "Cures", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0546, Page 223", "Page 223"], "url": "https://www.duchas.ie/en/cbes/4922184/4859024/5020431", "text": "\nCuresA cure for Whooping Cough is found by asking the first person you meet driving or riding a grey animal. \"What will cure this Whooping Cough - and whatever that person tells you to do be sure and do it and the cough ceases. [-]To cure a Headache people make the sign of the Cross on their forehead with vinegar.To cure Warts bathe them in forge water, that is the water in the trough in which the smith cools the hot iron.\n\n\n\nFor BoilsPat Taylor, now dead had this cure: Get some fresh robin-run-the-hedge- (a weed) boil in saucepan at night, pour into a bowl and let cool until morning - and drink some of it Another cure is to rub goats milk on the boils. Then boil the milk many times then let cool and the boils will soon disappear. Kathleen Kirwan KillaniganCastleinyFather:- James Kirwan.\n", "school_info": "School: Caisleán Aibhne (Castleiny)", "metadata": [{"Location:": "Castleleiny, Co. Tipperary", "Teacher:": "\nS. S. Ó Dúnaidhe\n"}, {"Collector": "Kathleen Kirwan", "Gender": "female"}, {"Informant": "James Kirwan", "Gender": "male", "Address": "Castleleiny, Co. Tipperary"}, {"Language": "English"}]}, "4922316/4869391/5052576": {"title": "Cures - Boils", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0584, Page 002", "Page 002"], "url": "https://www.duchas.ie/en/cbes/4922316/4869391/5052576", "text": "\nPour boiling water into a thick-necked bottle. When heated pour out water and immediately place mouth of bottle on palm of hand to keep hot air in. Apply the mouth of the bottle to the boil and the suction extracts the 'pus.'\n", "school_info": "School: Clonoulty", "metadata": [{"Location:": "Clonoulty, Co. Tipperary", "Teacher:": "\nTimothy Gleeson\n"}, {"Collector": "Bridget Ryan", "Gender": "female", "Address": "Gortnaskehy, Co. Tipperary"}, {"Informant": "Mr Andrew Moynihan", "Gender": "male", "Address": "Corbally, Co. Tipperary"}, {"Language": "English"}]}, "4922316/4869392/5052579": {"title": "Cures - Plaster for Boil", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0584, Page 003", "Page 003"], "url": "https://www.duchas.ie/en/cbes/4922316/4869392/5052579", "text": "\nPlaster for BoilCrush some table sugar by rolling a bottle on it. Mix this with a few thin slices of soap. Spread portion on piece of old linen sufficiently large to cover the boil. This extracts the 'pus'. Hannie RyanClonoulty HillGoolds CrossCo. TipperaryTo Ripen a Boil.Apply to the boil some freshly dropped cow dung. Hannie RyanClonoulty HillGooldscrossCo. TipperaryJohn RyanClonoulty HillGoolds CrossCo. Tipperary\n\n\n\nApply to the boil some freshly dropped cow dung.\n", "school_info": "School: Clonoulty", "metadata": [{"Location:": "Clonoulty, Co. Tipperary", "Teacher:": "\nTimothy Gleeson\n"}, {"Collector": "Hannie Ryan", "Gender": "female", "Address": "Clonoulty Hill, Co. Tipperary"}, {"Language": "English"}]}, "4922316/4869392/5052580": {"title": "Cures - Plaster for Boil", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0584, Page 003", "Page 003"], "url": "https://www.duchas.ie/en/cbes/4922316/4869392/5052580", "text": "\nPlaster for BoilCrush some table sugar by rolling a bottle on it. Mix this with a few thin slices of soap. Spread portion on piece of old linen sufficiently large to cover the boil. This extracts the 'pus'. Hannie RyanClonoulty HillGoolds CrossCo. TipperaryTo Ripen a Boil.Apply to the boil some freshly dropped cow dung. Hannie RyanClonoulty HillGooldscrossCo. TipperaryJohn RyanClonoulty HillGoolds CrossCo. Tipperary\n\n\n\nApply to the boil some freshly dropped cow dung.\n", "school_info": "School: Clonoulty", "metadata": [{"Location:": "Clonoulty, Co. Tipperary", "Teacher:": "\nTimothy Gleeson\n"}, {"Collector": "Hannie Ryan", "Gender": "female", "Address": "Clonoulty Hill, Co. Tipperary"}, {"Informant": "John Ryan", "Gender": "male", "Address": "Clonoulty Hill, Co. Tipperary"}, {"Language": "English"}]}, "4922271/4866155/5072095": {"title": "Cures - A Cold", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0573, Page 276", "Page 276"], "url": "https://www.duchas.ie/en/cbes/4922271/4866155/5072095", "text": "\nI heard a very good cure for a cold at home from my grandmother one wet night. The cure is to drink some dandelion. You should boil some dandelion and then drink some of it.The old people used to call it dandelion wine.\n\n\n\nI found out a cure for boils at home. This is the cure:- every morning and night you should get white bread and put it to the boil. You should make sure that the bread is hot. You must do this for a week or a fortnight. You will find that after a fortnight your boil will be cured.\n\n\n\nThis is the cure for wildfire. A certain family of the Cahill's in the parish of Cloghan can cure wildfire by putting a cut on their finger and by rubbing the blood round the wildfire. It will stop the disease from spreading and will cure it in a few days. My father told me this story a short time ago.\n\n\n\nI heard of a cure for warts. The following is the cure. By going to a garden and getting a weed called the milk weed.\n(continues on next page)\n", "school_info": "School: Ballyporeen", "metadata": [{"Location:": "Ballyporeen, Co. Tipperary", "Teacher:": "\nL. Ó Conchubhair\n"}, {"Collector": "Séamus de Bhál", "Gender": "male", "Address": "Lisfunshion, Co. Tipperary"}, {"Language": "English"}]}, "5008892/4964395/5081758": {"title": "Cures - To Cure a Sprain", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0682, Page 051", "Page 051"], "url": "https://www.duchas.ie/en/cbes/5008892/4964395/5081758", "text": "\nCuresTo cure a Sprain.Boil Marsh Mallow and Comfrey Root together.  Then strain, and bathe the sprain with the liquid.S. Fullam\n\n\n\nA cure for BoilsMix some sugar and soap together, pour some olive oil over the mixture and allow set.  Use as an ointment.Patrick Lennon (Scoláire)Got from: Mrs Bridget Lennon, (45)Sheephouse,Drogheda\n\n\n\nA Cure for a BlastAn ointment made up from the following herbs:Elder Leaves, Chicken Weed, Comfrey Root, Rag Weed, Spragon and Marl Weed.Patrick Lennon (Scoláire)Got from: Mrs Bridget Lennon (47)Sheephouse,Drogheda\n\n\n\nTo relieve a SprainHold the affected part under a spout or pump and let the cold water run on it. Patrick LennonGot from: Mrs Bridget Lennon (47)Sheephouse,Drogheda\n", "school_info": "School: Donore", "metadata": [{"Location:": "Donore, Co. Meath", "Teacher:": "\nMaighréad Nic Eóin\n"}, {"Collector": "Patrick Lennon", "Gender": "male"}, {"Informant": "Mrs Bridget Lennon", "Gender": "female", "Age": "45", "Address": "Sheephouse, Co. Meath"}, {"Language": "English"}]}, "5008892/4964396/5081768": {"title": "Cures - A Burn", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0682, Page 052", "Page 052"], "url": "https://www.duchas.ie/en/cbes/5008892/4964396/5081768", "text": "\nCuresA BurnPour some olive oil on the part burned, and cover to keep out the air.If olive oil cannot be had, cover the part burned with some bicarbonate of soda or flour. The dust of a  \"Bocken\" Barrow is a cure for a burn.  Take the dust from the \"Bocken\" Barrow and rub it on the burned part.Anna ReillyGot from: Mrs Josephine Reilly (38)Oldbridge,Drogheda\n\n\n\nBoilsCut up some soap and put it in a bowl.  Pour boiling water over it and add some sugar.  When cool it will be in a jelly.  Use as an ointmentAnna ReillyGot from: Patrick Craven (82)Oldbridge,Drogheda\n\n\n\nAnother cure for a BurnThe yellow flowers of the furze bush steeped in sweet oil.Anna ReillyGot from: Patrick Craven, (82)Oldbridge,Drogheda\n\n\n\nAnother cure for a BoilSome half-cooked stirabout used as a poultice is very good for boils.Anna ReillyGot from: Andrew Dromgoole, (80)Donore,Drogheda\n", "school_info": "School: Donore", "metadata": [{"Location:": "Donore, Co. Meath", "Teacher:": "\nMaighréad Nic Eóin\n"}, {"Collector": "Anna Reilly", "Gender": "female"}, {"Informant": "Patrick Craven", "Gender": "male", "Age": "82", "Address": "Oldbridge, Co. Meath"}, {"Language": "English"}]}, "5008892/4964396/5081775": {"title": "Cures - A Burn", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0682, Page 052", "Page 052"], "url": "https://www.duchas.ie/en/cbes/5008892/4964396/5081775", "text": "\nCuresA BurnPour some olive oil on the part burned, and cover to keep out the air.If olive oil cannot be had, cover the part burned with some bicarbonate of soda or flour. The dust of a  \"Bocken\" Barrow is a cure for a burn.  Take the dust from the \"Bocken\" Barrow and rub it on the burned part.Anna ReillyGot from: Mrs Josephine Reilly (38)Oldbridge,Drogheda\n\n\n\nBoilsCut up some soap and put it in a bowl.  Pour boiling water over it and add some sugar.  When cool it will be in a jelly.  Use as an ointmentAnna ReillyGot from: Patrick Craven (82)Oldbridge,Drogheda\n\n\n\nAnother cure for a BurnThe yellow flowers of the furze bush steeped in sweet oil.Anna ReillyGot from: Patrick Craven, (82)Oldbridge,Drogheda\n\n\n\nAnother cure for a BoilSome half-cooked stirabout used as a poultice is very good for boils.Anna ReillyGot from: Andrew Dromgoole, (80)Donore,Drogheda\n", "school_info": "School: Donore", "metadata": [{"Location:": "Donore, Co. Meath", "Teacher:": "\nMaighréad Nic Eóin\n"}, {"Collector": "Anna Reilly", "Gender": "female"}, {"Informant": "Andrew Drumgoole", "Gender": "male", "Age": "80", "Address": "Donore, Co. Meath"}, {"Language": "English"}]}, "5008960/4971082/5110480": {"title": "Toothache", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0700, Page 125", "Page 125"], "url": "https://www.duchas.ie/en/cbes/5008960/4971082/5110480", "text": "\n1. Pepper2. Mouthful of cold water3. Cotton wool in Jeyes Fluid4. Roast salt in sock - on jaw. P Blake.5. A mouthfull of strong tobacco.6. A shock of the pipe7. Milk of dandelion8. Mustard in tooth9. Iodine\n\n\n\nWool dipped in water that comes from the ash as it is burning in fire (Got from Joe Feeley Simonstown)\n\n\n\n1. Handful of young Elder leaves2. Unsalted butter3. Olive oil1. Get egg put hole in it leave out liquid. Peel off shell and just white skin remaining and boil2. When boil is ripe get bottle fill witer hot water, empty bottle and apply neck of bottle immediately to boil.3. Tobacco4. Capóg5. Shugar-soap & chalk melted6. Crán bay7. White skin inside shell of raw egg.\n", "school_info": "School: St Columba's Abbey, Navan", "metadata": [{"Location:": "Navan, Co. Meath", "Teacher:": "\nBr. Abban O' Donoghue\n"}, {"Informant": "G. Duignan"}, {"Language": "English"}]}, "5008962/4971269/5110996": {"title": "Thorn", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0700, Page 312", "Page 312"], "url": "https://www.duchas.ie/en/cbes/5008962/4971269/5110996", "text": "\nPut a piece of fat bacon over a thorn and it will help to extract it.\n\n\n\nSulphur and cream of tartar mixed with brown sugar or treacle is a good tonic to clear out children's blood in the spring time.\n\n\n\nA cold stone or cold hay applied to back of the neck helps to stop a bleeding nose.\n\n\n\nMix ground sugar and yellow soap together and apply to a boil or gathering. It will help to draw the matter out and clean it.\n\n\n\nA girl who is born after her father's death has the natural cure for the dirty mouth in young\n(continues on next page)\n", "school_info": "School: Flower Hill", "metadata": [{"Location:": "Flower Hill, Co. Meath", "Teacher:": "\nIsabel Mc Quade\n"}, {"Language": "English"}]}, "5008975/4972657/5112430": {"title": "Boils or Pimples", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0704, Page 433", "Page 433"], "url": "https://www.duchas.ie/en/cbes/5008975/4972657/5112430", "text": "\n56Anyone who has boils or pimples of any kind should eat one meal of nettles once a week for three weeks.  Pull a bunch of young nettles and boil them like cabbage.  If you do this you will never have boils or pimples.\n\n\n\n57There was a man called Kane who had the cure of kidney trouble.  He would get herbs called \"Early Spring\" and \"Cranis Bill\".  He would boil them, and mix the juice of them with new milk and then use it.\n", "school_info": "School: Kilskeer (C.)", "metadata": [{"Location:": "Kilskeer, Co. Meath", "Teacher:": "\nMáire, Bean Uí Fhithcheallaigh\n"}, {"Language": "English"}]}, "5009007/4976416/5115405": {"title": "Local Cures - A Cure for Boils", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0714, Page 221", "Page 221"], "url": "https://www.duchas.ie/en/cbes/5009007/4976416/5115405", "text": "\nGet Meachan Átha Abhann -  a parsnip-like herb found growing in the shallow water near the banks of streams. It has a root like a parsnip, and must be pulled fully out of the water. Clean it perfectly and wrap it in 4 cabbage leaves so that no portion of the root is visible. Roast this in the Gríosach for about two hours. The roasted root is next bruised very finely and mixed with butter, and clapped on top of the boil or boils.The person suffering from the boils must not be present when the roasted herb is taken from the Gríosach. The explanation given for this is that the worm which causes the boil would get the fumes of the roasted herb and would have moved away from the place where the boil is. The herb is supposed to kill the worm that causes the boil.Collected by Thomas Carty Rathkenny N.S. SlanefromMichael McKennaSallyparkNavan\n", "school_info": "School: Rathkenny", "metadata": [{"Location:": "Rathkenny, Co. Meath", "Teacher:": "\nTomás Mac Cárthaigh\n"}, {"Collector": "Thomas Carty", "Gender": "male", "Address": "Rathkenny, Co. Meath"}, {"Informant": "Michael Mc Kenna", "Gender": "male"}, {"Language": "mixed"}]}, "4922036/4921107/5116155": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0508, Page 61", "Page 61"], "url": "https://www.duchas.ie/en/cbes/4922036/4921107/5116155", "text": "\n(continued from previous page)\ntogether, will bring ill-luck to one of the children.  This belief was brought under my notice when one of my own hopefuls was being baptised.  A husband and wife, neighbours of ours, had been selected for \"standing\" for our arrival, but almost immediately before my being despatched to ask them to do so, it was recalled that the man had already stood for a child within the twelve month and so his sponsorship of our child, I was informed by the ladies who always determine the man's existence on such occasions, was not to be thought of.  I bowed to the inevitable, the ladies in question, and found another man to act.\n\n\n\nIf ever you have the misfortune to suffer from boils, a certain way to rid yourself, and quickly too of the trouble, is to take a drop of the juice of Robin-run-the-hedge for a number\n(continues on next page)\n", "school_info": "School: Cromadh (B.)", "metadata": [{"Location:": "Croom, Co. Limerick", "Teacher:": "\nDáithí Ó Ceanntabhail\n"}, {"Informant": "Mr P-", "Gender": "male", "Address": "Carrick, Co. Tipperary"}, {"Language": "English"}]}, "5009046/4980804/5116453": {"title": "Local Cures - Chin Cough", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0726, Page 216", "Page 216"], "url": "https://www.duchas.ie/en/cbes/5009046/4980804/5116453", "text": "\nThe local cure for Chincough is the patient visits a woman who does not change her name on marriage.  The cough is supposed to disappear when the bread is eaten.\n\n\n\nThe cure for ringworm is unsalted butter is rubbed on the part affected the person who makes the application tells the patient to say a prayer, a Hail Mary a couple of times and the sore gradually fades away.\n\n\n\nBoils and eruptions on skin WmeathA man by the name of Cassorley at present a Garderner working in Archesloun, a couple of miles to the west of Delvin is a renowned person as having the power to cure boils on similar eruptions swellings.  This man rubs the part to be cured with his hand says some prayer, also asks the patient to say a couple of short prayers such as \"Hail Mary\": a few times the person affected visits about three times on Monday, Thursday and Saturday.  After which the trouble disappears.  Seventh Son in the family.  The seventh son in the family is locally credited with the power to cure boils.  These boils may be caused by a scratch.\n(continues on next page)\n", "school_info": "School: Killough", "metadata": [{"Location:": "Killulagh, Co. Westmeath", "Teacher:": "\nMary Lynch\n"}, {"Collector": "Mary K. Lynch", "Gender": "female"}, {"Language": "English"}]}, "5044582/5023896/5140654": {"title": "Local Cures - Piles", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0803, Page 215", "Page 215"], "url": "https://www.duchas.ie/en/cbes/5044582/5023896/5140654", "text": "\n(2) There is a flower called \"Early Spring\" the root of which cures piles.\n\n\n\nTo cure an itch rub ink on it.\n\n\n\nTo cure scalds the white of an egg rubbed on the scalds will keep them from blistering. It will also kill the pain.\n\n\n\nThe way to cure a scald is to get lard and laurel leaves and boil them together. When they are about an hour boiling you are to take it up and take the water off them and leave it to harden. When it is hard you are to rub it on the scald once every day until the scald is better.\n\n\n\nRub cream of milk on them before going to bed.\n\n\n\nRub cream of milk on them before going to bed.\n\n\n\nLong ago the people used put the rind of the churn on them\n\n\n\nPut a poultice of linseed meal on them boiling hot\n", "school_info": "School: Kilmurry", "metadata": [{"Location:": "Kilmurry, Co. Offaly", "Teacher:": "\nA. de Búrca\n"}, {"Collector": "Sheila Boland", "Gender": "female", "Age": "13", "Address": "Wood of O, Co. Offaly"}, {"Informant": "Daniel Boland", "Relation": "parent", "Gender": "male", "Age": "59", "Address": "Wood of O, Co. Offaly"}, {"Language": "English"}]}, "5044582/5023897/5140659": {"title": "Local Cures - Boils", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0803, Page 216", "Page 216"], "url": "https://www.duchas.ie/en/cbes/5044582/5023897/5140659", "text": "\n(2) Fine sugar and soap mixed together put on brown paper will cure biles\n\n\n\nMeasels:- hot drinks and punch.\n\n\n\nErysipselas:- Scorched flour and new white flannel.\n\n\n\nHand Cracks: A cure for hand cracks is to melt wax and put it into the cracks.\n\n\n\nColds:- 1. Boiled butter-milk and a lump of butter and sugar is a great cure for a cold.2.Another cure for a cold is boiled flaxseed and a lemon.\n\n\n\n3. Another cure is black currant jam made into punch.\n\n\n\nAsthma:- Raw turnips and brown sugar.\n\n\n\nSty in your eye:- Squirt a drop of cows milk from the udder of the cow into the eye,2. Prod the sty with three gooseberry thorns for nine mornings. The three thorns must be put away in a piece of paper.\n", "school_info": "School: Kilmurry", "metadata": [{"Location:": "Kilmurry, Co. Offaly", "Teacher:": "\nA. de Búrca\n"}, {"Collector": "Celia Dalton", "Gender": "female", "Age": "13", "Address": "Bracklin Little, Co. Offaly"}, {"Informant": "Thomas Dalton", "Gender": "male", "Age": "51", "Address": "Bracklin Little, Co. Offaly"}, {"Language": "English"}]}, "5044652/5029061/5145284": {"title": "Local Cures - Boils", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0821, Page 012", "Page 012"], "url": "https://www.duchas.ie/en/cbes/5044652/5029061/5145284", "text": "\nBoils. Get a bottle and fill it with boiling water and then pour out the water, at the same time preventing the air from entering the bottle.  Place the mouth of the bottle firmly over the boil and it will draw out any matter that is in it.E. Gilmartin from Mrs. Gilmartin, Main St, Birr.\n\n\n\nCoughCut an onion into slices, and put brown sugar between them.  Put it in a jar with a lid on it and leave it there for two days and then take a spoonful of the syrup three times a day.E Gilmartin,\n\n\n\nSore Throat(1) Get a handful of new hay and boil it in two cups of water for about an hour.  Then drink some of the water in which it is boiled.E. Gilmartin(2)  Rub goose grease on the sore throat when going to bed.P Mellsop from John Mellsop, Mill St, Birr.\n\n\n\n(2)  Rub goose grease on the throat when going to bed.P. Mellsop from John Mellsop, Mill St, Birr.\n\n\n\nBad HeartDrink some medicine made\n(continues on next page)\n", "school_info": "School: Birr (St. Brendan's)", "metadata": [{"Location:": "Birr or Parsonstown, Co. Offaly", "Teacher:": "\nS. Ó Conchobhair, R. Ó Huigín\n"}, {"Collector": "E. Gilmartin", "Gender": "unknown"}, {"Informant": "Mrs Gilmartin", "Gender": "female", "Address": "Birr or Parsonstown, Co. Offaly"}, {"Language": "English"}]}, "4921824/4909522/5184372": {"title": "Boils", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0374, Page 098", "Page 098"], "url": "https://www.duchas.ie/en/cbes/4921824/4909522/5184372", "text": "\nPoultices of (a) bread and water (b) bread squeezed out of boiling milk (c) a white turnip(d) a roasted potato.These were used to bring the boil to a head and burst it, then plasters of melted beeswax on brown paper or soap and sugar mixed with boiled milk were applied to draw them.\n\n\n\n1. A man with a white horse was supposed to have a cure for this. When children in a house had whooping cough, a parent or relative watched for a man having a white horse and addresed him this \"Man of the White horse, will you tell me what will cure the chin cough?\" Anything the man suggested was supposed to be effective.2. Donkeys' milk given to children to drink cure the chin cough.\n", "school_info": "School: Baile Tighe Dhomhnaill, Malla", "metadata": [{"Location:": "Baltydaniel West, Co. Cork", "Teacher:": "\nDomhnall de Barra\n"}, {"Language": "English"}]}, "5177641/5175618/5196701": {"title": "Cures - Rheumatism", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0596, Page 053", "Page 053"], "url": "https://www.duchas.ie/en/cbes/5177641/5175618/5196701", "text": "\n(continued from previous page)\n53.31-5-'38      To put two or three drops of turpentine and Tincture of Oidine in milk and drink the mixture . Celery seed  boiled in water to  jelly and taken in small doses .To eat raw celery .Asparagrass as a table vegetable A teaspooonful  of dry sulphur in a glass of milk for three mornings fasting .To keep a raw potato in each trousers pocket.\n\n\n\nBoils A raw potato Scoup of sugar. Pig's lard.Salt. SorrelCowdung placed between two pieces of cloth and applied to the boil The knobs of fig wort chopped very smalland mixed with lard .The roasted root of Meacan Táthú- but the person who has the boil should not stay in the house while the root is being roasted as they say the worm in the boil if he  feels the smell would remove to\n", "school_info": "School: An Daingean, Cuinche", "metadata": [{"Location:": "Dangan, Co. Clare", "Teacher:": "\nStiofán Mac Clúin, Treasa Ní Chonmara\n"}, {"Language": "English"}]}, "5177641/5175620/5196704": {"title": "Cures - Warts", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0596, Page 055", "Page 055"], "url": "https://www.duchas.ie/en/cbes/5177641/5175620/5196704", "text": "\n(continued from previous page)\n55.according as the snail is dying away the wart withers away too.To rub with the juice of the Spurgs plant.To tie a horses hair around it .To tie a cobbler's wax end around it.Dan Kelly ,Drim ,Co.Clare had a cure which was -If a person complained of having warts .Dan used to -I will buy them from you for a penny.When the person gave him the penny the warts disappeared  shortly afterwards one by one.\n\n\n\n31.5.'58 Boils -continuedAnother part of the body .An ointment made from leaves of the Elder tree and lard.A teaspoonful of Olive Oil taken fasting every morning for a week and three or four teaspoonfuls the third week .By that time the boils have disappeared.\n", "school_info": "School: An Daingean, Cuinche", "metadata": [{"Location:": "Dangan, Co. Clare", "Teacher:": "\nStiofán Mac Clúin, Treasa Ní Chonmara\n"}, {"Language": "English"}]}, "4798708/4792160/5267396": {"title": "Rheumatism", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0254, Page 269", "Page 269"], "url": "https://www.duchas.ie/en/cbes/4798708/4792160/5267396", "text": "\n(continued from previous page)\npain and he slept very soundly. When he awoke the limb was very sore. It was also coated over with big white blisters. Each one was a big a half- a - crown. Therese were there for three or four days. Then they disappeared and he man was able to water as well as over. After a week or so he never felt or never complained of a pain in the leg againToothacheAnother herb Fothram (Great Finger)  was known to cure any disease, but when smoked in a pipe was a sure cure for Toothache. Frogspawn and Chickenwood were two herbs that were found very plentifully. They  were usually applied to reduce a swollen face. They were roasted and then applied as a poultice to the neck and face. These were known to reduce toothache swelling in one night !BoilsAnother cure for boils was the wild sorrel. It was usually boiled and then applied as a poultice. It was always known to cure\n\n\n\nAnother herb Fothram (Great Finger) was known to cure any disease, but when smoked in a pipe was a sure cure for Tootache. Frogspawn and Chickenweed were two herbs that were found very plentifully. They were usually applied to reduce a swollen face. They were roasted and then applied as a poultice to the neck and face. These were known the reduce toothache swelling in one night.\n\n\n\nAnother cure for boils was the wild sorrel. It was usually boiled and then applied as a poultice. It was always known to cure.\n", "school_info": "School: Kilmore", "metadata": [{"Location:": "Kilmore, Co. Roscommon", "Teacher:": "\nMáiréad, Bean Mhic Giolla Críost\n"}, {"Language": "English"}]}}