{"4428020/4368666/4474269": {"title": "Composition - Saint Patrick and Ossian", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138, Page 336", "Page 336"], "url": "https://www.duchas.ie/en/cbes/4428020/4368666/4474269", "text": "\nOssian was one of the Fianna, and he had many dealings with Saint Patrick.Once when Saint Patrick was reading Mass, Ossian asked him was there any salvation for the fallen angels but Saint Patrick did not answer until he had finished the Mass.Then he asked the people who had spoken during Mass and they told him that it was Ossian.  Then he went to Ossian and he spoke to him.  Ossian told him that a little red man came to him and told him to ask if there was any salvation for the fallen angels.  Patrick told Ossian that his days were at an end and he told him to make his grave and to lie within it, and to leave the spade and shovel over him in the shape of a cross.  Then he red man came again to Ossian when he was laid in this manner.  He would have harmed him but the cross saved him.  The little red man told him to take the scraw of land and to cut it and that it would make a fire and that was the way the people first found the turf and he told him other things that were good for Ireland.\n", "school_info": "School: Taobh na Cruaiche", "metadata": [{"Location:": "Teevenacroaghy, Co. Mayo", "Teacher:": "\nN. Ní Mhóráin\n"}, {"Collector": "Nora Flanagan", "Gender": "female"}, {"Language": "English"}]}, "4428299/4392566/4476280": {"title": "Scéal fá Naomh Pádraig agus Oisín", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1038, Page 134", "Page 134"], "url": "https://www.duchas.ie/en/cbes/4428299/4392566/4476280", "text": "\nSgéal fá Naomh Padraig agus OisinNuair a bhí Naomh Padraig annseo i nÉirinn bhí Oisin an fear deireannach de na Fiannaibh ann fosta. Lá amháin thuit Naomh Pádraig agus Oisin 'un cómhraigh. Thrácht siad ar an cineal aimsire a bhíodh ann an t-am sin. Dubhairt Oisin le Naomh Padruig go rabh difir mór eadar an cineal aimsire a bhíodh ann annsin agus an cineal aimsire a bhí ann nuair a bhí seisean ina ghasúr. Dubhairt sé go mbíodh fuacht ar dheireadh Earraigh, baile ar dheireadh Samhraidh, clocha sneachta ar dheireadh Fóghmhair agus sioc ar dheireadh gheimhridh. Rinne siad móran trácht ar an aimsir eadair deireadh. Thug Naomh Padraig eolas dó fá'n créideamh fíor agus thug sé baisteadh dó. Bhí Naomh Padruig é fhéin ag éirighe aosta in a am agus bhí croisín leis. Bhí iarrain ar deireadh an croisín aige sa chluiche 's go gcoinneochadh sé greim ar an talamh. Nuair a bhí sé gabhail a thabhairt baisteadh do Oisin sháith sé an croisín ins an talamh agus caidé rinne sé ach an croisín a chuir fríd cois Oisin. Nuair a bhí an baisteadh thart thug sé fá dear caidé bhí déanta aige agus ars sé le Oisin, \"Ca tuige nar labhair tú.\" \"O Muise,\" deir Oisin, \"shíl mise gur de'n bhaisteadh sin.\"Dubhairt Naomh Padruig leis annsin go dtabhradh sé amharc amháin dó ar Afrinn nuair a chonnaic\n(continues on next page)\n", "school_info": "School: Cruach", "metadata": [{"Location:": "Croagh, Co. Donegal", "Teacher:": "\nSéamus Mac Duibhir\n"}, {"Collector": "Mollaidh Ní Ghallchobhair", "Gender": "female"}, {"Informant": "Prionsus a Gallchobhair", "Gender": "male", "Address": "Doobin, Co. Donegal"}, {"Language": "Irish"}]}, "4428343/4397158/4485742": {"title": "Oisín agus Naomh Pádraig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1050, Page 339", "Page 339"], "url": "https://www.duchas.ie/en/cbes/4428343/4397158/4485742", "text": "\nOisín agus Naomh PádraigNuair a bhí Oisín ag Naomh Pádraig bíodh Pádraig ag innse dó fa Dhia, caidé cómh cúmhachtach agus bhí Sé. Shíl Oisín bocht nach dtiocfadh le Dia ná duine a bheith níos cúmhachtaighe nó Fionn Mhac Cúmhaill agus ars seisean le Pádraig lá amháin:\"Da mbíodh mo Rí 'seagus do Rí 'sa,Ar léuna na bhFianseal ag spáirn.Da leagadh do Rí 'samo Rí 'seB'é do Rí 'sa anfear a b'fheárr.\"Thug Pádraig Oisín ar leath-taoibh lá amháin agus le miorbhuiltí thaisbean sé Ifreann dó.\n(continues on next page)\n", "school_info": "School: Éadan Anfaidh", "metadata": [{"Location:": "Edenfinfreagh, Co. Donegal", "Teacher:": "\nGráinne Ní Éagrain\n"}, {"Collector": "Gráinne Ní Éagrain", "Gender": "female"}, {"Language": "Irish"}]}, "4428337/4396587/4499692": {"title": "An tAthair agus an Dá Mhac", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1049, Page 253", "Page 253"], "url": "https://www.duchas.ie/en/cbes/4428337/4396587/4499692", "text": "\n(continued from previous page)\nbliadhan agus lá agus bhí doigh maith ortha ón lá sin go dtí an lá inniú.\n\n\n\nOisín agus Naomh PádraigIndiaidh Oisín a theacht ó Tír na n-Óg agus an chloch mhor a thógailt bhi sé 'na sheanduine críonn cáithte. D'iarr sé ar Naomh Pádraig é a bhaisteadh. Dubhairt Naomh Pádraig go ndéanfadh. Nuair a bhí sé da bhaisteadh chuaidh batal Nomh Pádraig isteach ina chois. Shil Oisín gur rabh seo ins an bhaisteadh, agus níor labhair sé go dtí go rabh sruth fola amach as a chois. Dubhairt Naomh Pádraig leis cad tuige nar labhair sé agus dubhairt sé gur shíl sé go rabh sin ins an bhaisteadh. Shil Nomh Padraig nach bfuigheadh a chos biseach. Nuair a bhí sé cupla lá ag  Nomh Padraig thoisigh se ag éirighe dall agus fuair a chos biseach.Lá amháin d'iarr sé ar\n(continues on next page)\n", "school_info": "School: Na Cruacha", "metadata": [{"Location:": "Croaghgorm or Blue Stack Mountains, Co. Donegal", "Teacher:": "\nMáire C. Ní Chinnéide\n"}, {"Collector": "Máire C. Ní Chinnéide", "Gender": "female", "Address": "Kilrean, Co. Donegal"}, {"Language": "Irish"}]}, "4428327/4395540/4500720": {"title": "Oisín i dTír na nÓg", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1046, Page 612", "Page 612"], "url": "https://www.duchas.ie/en/cbes/4428327/4395540/4500720", "text": "\nSceál\"Oísín i dTír na n-Óg\".Lá dá ráb Fíonn Mac Cumaill agus a gcuid fear ag cois na faírrge, connac siad ag teair tiocfad anall ar an faírrge moír cailín aláinn agus i ag marcuigeair ar capall bán. Nuair a taínig sí deir cuaid sí'un cainnce le fíonn agus d'ínnis sí dó gur Naom Cinn óir a h-ainm. Nuair a connaic sí Oísín glac sí dúit ann agus d'innis sí dó fear gur maíc leíre a mac Oísín a pósfad agus a tabairc leíre go Tír na n-Óg. Bí an brón ar Fionn mar níor maír leis scarad le Oíssín ac in ocaid í a deánam a\n(continues on next page)\n", "school_info": "School: An Charraig", "metadata": [{"Location:": "Carrick, Co. Donegal", "Teacher:": "\nS. Ó Beirn\n"}, {"Collector": "Máire Ní Dóchartaigh", "Gender": "female", "Age": "12", "Address": "Carrick, Co. Donegal"}, {"Informant": "Pádraig Ó Baoighill", "Gender": "male", "Age": "71", "Address": "Meenacharvy, Co. Donegal"}, {"Language": "Irish"}]}, "4428390/4403282/4511398": {"title": "Seanphaidreacha", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1068, Page 245", "Page 245"], "url": "https://www.duchas.ie/en/cbes/4428390/4403282/4511398", "text": "\n(continued from previous page)\nIfreann a dhruid. (Níl aon fhear, bean nó páiste nach ndéarfadh sin trí h-uaire ag gabhail a luighe agus trí h-uaire ag éirigh daobhtha. Ní dhallfhaidh sin feataí Ifrinn go bráthach).\n\n\n\nLá dá raibh na Fianna amuigh ag seilg shuigh siad a dhéanamh sgithiste ar thaobh cnuic. Ní rabh siad ibhfad na suidhe nó gur amharc fear aca siar agus go bhfaca toirt amuigh ar an fhairrge eadar iad féin agus luighe na gréine. \"Fheara\" arsa seisean ag síneadh a mhéir \"an bhfeiceann sibh dadaidh?\" D'amharc achan fhear\n(continues on next page)\n", "school_info": "School: Mín an Chladaigh", "metadata": [{"Location:": "Meenaclady, Co. Donegal", "Teacher:": "\nSeán Mac Fhionnaile\n"}, {"Collector": "Méadhbha Ní Bhriáin", "Gender": "female", "Age": "14"}, {"Language": "Irish"}]}, "4428395/4404251/4512112": {"title": "An Gasúr Cliste", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1070, Page 41", "Page 41"], "url": "https://www.duchas.ie/en/cbes/4428395/4404251/4512112", "text": "\n(continued from previous page)\n\" Níl bhal\" arsa 'n gasúr \" no níl póca ar bith orm\"D'imthigh an sagart amach agus nuair a bhí sé ar an taoibh amuigh de'n doras tcí sé abhainn agus chuir sé ceist ar an ghasúr an bhfuigheadh sé trasna na habhna. \" Gheobhaidh\" ars'an gasúr, nó tá lachain mo mháthair anonn 'sa'nall annsin gach lá agus ní théid sé thar a mbolg ortha\"D'imthigh an sagart ag gáiridhe.\n\n\n\nSgeul- N Pádraic agus OisínBhí fear de na fianna beo go dtí am Naoimh Pádraic agus 'se a t-ainm a bhí air Oisín. Fuair sé dhá shaoghal. Chualaidh Naomh Pádraic iomrádh air. Chuir sé sgeula chuige agus thainic sé. Bhí Naomh Pádraic ag cainnt leis fá Dhia agus fa na flaithis, agus nach bhfuigheadh se na bhflaitheas mar mbéadh sé baistighthe. Chá raibh fhios ag Oisín caidé rud baisteadh agus chá raibh fhios aige caidé'n rud na flaithis ach oiread. Bhí gadhar aige agus cú agus dubhairt sé le PádraicA Phádraic car chuir tú an Fhéinn,Is agat atá an stiúirAn leigfea liomsa go flaithis DéMo ghadhar féin nó mo chú.\n(continues on next page)\n", "school_info": "School: Gort an Choirce", "metadata": [{"Location:": "Gortahork, Co. Donegal", "Teacher:": "\nSéamus Mac Giolla Easboic\n"}, {"Informant": "Anna Ní Fhioruisghe", "Gender": "female"}, {"Informant": "Méadbh Nic Fionnlaoich", "Relation": "relative (other than parent or grandparent)", "Gender": "female", "Address": "Keeldrum Upper, Co. Donegal"}, {"Language": "Irish"}]}, "4428395/4403933/4512393": {"title": "Scéal fá Oisín", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1070, Page 125", "Page 125"], "url": "https://www.duchas.ie/en/cbes/4428395/4403933/4512393", "text": "\nSgeul - Fá OisínCá'n fhuair Oisín ariamh a sháith le hithe fhad's bhí sé ag Pádraic agus deireadh sé le Pádraic i dtólaimh go bhfaca sé measgan ime ag a mháthair níos mó ná an mart a ba  mhó a mhairbhfeadh Pádraic agus go bhfaca sé caor-chaorthain ní badh mhó ná an mheasgan ime a deanfadh an cailín,Lá amhain d'iarr sé ar Phádraic é leigint a sheilg leis an bhuachaill. Dubhairt Pádraic go leigfeadh da dtuirbhradh sé gealltanas do go dtabhairfeadh se na bhaile slán é. D'imthigh siad leo agus nior stad go dtainic siad fhad le beinn leic, agus chuir Oisín ceist ar an bhuachaill an raibh siad ag beinn leic ar bith. Dubhairt an buachaill go raibh. Chuir Oisín a lamh siar faoí an leic agus tharraing aníar fídeóg. Shéid sé an fhídeóg agus chuir ceist ar an bhuachaill an bhfaca sé a dhath ag teacht. Dubhairt an buachjaill go raibh toirt mór ar shiubhal a bhfad uatha. Shéid sé arais í agus d'fiafruigh dó'n bhuachaill an bhfaca sé a' dhath a'teacht. Dubhairt an buachaill go raibh an toirt a'teacht ní ba deise daobhtha anois. Shéid sé an fhídeóg an tríomhadh huair agus chuir ceist  an bhfeiceann sé a dhath a'teacht. Dubhairt an buachaill go raibh an toirt ag teacht i neas daobhtha anois. Chuir sé ceist goidé bhí an cú a dheánamh. Dubhairt  an buachaill nach raibh a'n ribe fionnaidh ar a corp\n(continues on next page)\n", "school_info": "School: Gort an Choirce", "metadata": [{"Location:": "Gortahork, Co. Donegal", "Teacher:": "\nSéamus Mac Giolla Easboic\n"}, {"Informant": "Áine Ní Fhuaruisge", "Relation": "unknown", "Gender": "female"}, {"Language": "Irish"}]}, "4493644/4407356/4515429": {"title": "Seanscéal", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1079, Page 66", "Page 66"], "url": "https://www.duchas.ie/en/cbes/4493644/4407356/4515429", "text": "", "school_info": "School: Doire Chasáin", "metadata": [{"Location:": "Derrycassan, Co. Donegal", "Teacher:": "\nTomás Mac Fhionghaile\n"}, {"Collector": "Gráinne Ní Ghallchobhair", "Gender": "female", "Address": "Derrycassan, Co. Donegal"}, {"Informant": "Séamus Ó Gallchobhair", "Gender": "male", "Age": "86", "Address": "Derrycassan, Co. Donegal"}, {"Language": "Irish"}]}, "4493644/4407362/4515448": {"title": "Seanscéal - Oisín agus Naomh Pádraig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1079, Page 71", "Page 71"], "url": "https://www.duchas.ie/en/cbes/4493644/4407362/4515448", "text": "", "school_info": "School: Doire Chasáin", "metadata": [{"Location:": "Derrycassan, Co. Donegal", "Teacher:": "\nTomás Mac Fhionghaile\n"}, {"Collector": "Caitlín Ní Chathain", "Gender": "female", "Address": "Derrycassan, Co. Donegal"}, {"Informant": "Micheál Ó Siadhail", "Gender": "male", "Age": "71", "Address": "Derrycassan, Co. Donegal"}, {"Language": "Irish"}]}, "4562127/4561863/4569794": {"title": "Oisín and St Patrick", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0022, Page 0412", "Page 0412"], "url": "https://www.duchas.ie/en/cbes/4562127/4561863/4569794", "text": "\nWhen Oisin came from Tir na n-Óg he met St Patrick  and St Patrick tried to convert him. Oisin did not believe in being converted and St Patrick told him that all his Fianna were down in hell. Oisin then said that if only Conan Maol the worst man of the Fianna was there he would bring the forge   and the devil with him on his back. St Patrick then brought Oisin down to Lough Derg and told him to sit there. After a while Oisin fell asleep and had a dream. In his dream he saw hell and when he woke he asked St Patrick to take his comrades out of hell and so Patrick said, \"out of hell there is no redemption\". He then asked St Patrick to relieve them. Oisin then said,\"if all the land on earth were paper\n(continues on next page)\n", "school_info": "School: Cathair Loisgreáin (B)", "metadata": [{"Location:": "Caherlustraun, Co. Galway", "Teacher:": "\nPádhraic de Chlár\n"}, {"Collector": "Thomas Reaney", "Gender": "male"}, {"Informant": "Tom Reaney", "Relation": "grandparent", "Gender": "male", "Address": "Caherakeeny, Co. Galway"}, {"Language": "English"}]}, "4569067/4568581/4584662": {"title": "Seanscéal - Oisín agus Naomh Pádraig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0039, Page 0344", "Page 0344"], "url": "https://www.duchas.ie/en/cbes/4569067/4568581/4584662", "text": "\nOisín agus Naomh Pádraig:-Uair amháin bhí Naomh Pádraig agus Oisín ag cainnt agus dubhairt Oisín gur maith leis na Fíanna a fheiceáil arís.  Theasbáin Naomh Pádraig iad dó agus iad in Ifreann ag troid leis na diabhail.  Ní raibheadar i bhfad ag troid nó go gur bhris an súiste abhí ag Conán Maol na Mallacht agus bhuail na diabhail na Féinne annsin.D'innis Naomh Pádraig d'Oisín annsin má chreidfeadh sé i nDia nach rachadh sé go dtí an áit sin.  Dubhairt Oisín do Phádraig annsin má thiubharfadh sé tug [both sticks or parts of a flail for threshing] d'iarann do Chonán Maol na Mallacht go gcreidfeadh sé annsin i nDia.\n", "school_info": "School: Crois-Bhóthar", "metadata": [{"Location:": "Pollacorragune, Co. Galway", "Teacher:": "\nEibhlín Ní Bhreitheamhan\n"}, {"Collector": "Áine Ní Bhriain", "Gender": "female", "Address": "Cloonkeenbeg, Co. Galway"}, {"Language": "Irish"}]}, "4583300/4577674/4585742": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0048, Page 0047", "Page 0047"], "url": "https://www.duchas.ie/en/cbes/4583300/4577674/4585742", "text": "", "school_info": "School: Dubhras", "metadata": [{"Location:": "Doorus, Co. Galway", "Teacher:": "\nSeán Ó Mearacháin\n"}, {"Language": "Irish"}]}, "4583301/4577731/4586774": {"title": "Seanscéal - Scológ na Féasóige Léithe", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0048, Page 0104", "Page 0104"], "url": "https://www.duchas.ie/en/cbes/4583301/4577731/4586774", "text": "\nB'é Oisín an ceann deireannach de na Fiannta in  Éirinn. Bhí Pádraig ag iarraidh Oisín a  bhaisteadh.  \"Cuimhnigh ar ubhall  na h-aithne\" arsa Pádraic.       \"Dá mbeadh  fhios agam-sa\" arsa Oisín  \"go raibh  a leithead dúil in  ubhla ag an Slánuightheóir chuirfinn múille agus lán cairt isteach go Flaitheas Dé Aige\".\n", "school_info": "School: Northampton", "metadata": [{"Location:": "Northampton, Co. Galway", "Teacher:": "\nTomás Ó Domhnalláin\n"}, {"Language": "Irish"}]}, "4591079/4588537/4593130": {"title": "Scéalta faoi Oisín agus Naomh Pádraig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0010, Page 089", "Page 089"], "url": "https://www.duchas.ie/en/cbes/4591079/4588537/4593130", "text": "\nIns an am fadó nuair a tháinig Oisín ar ais ó Thír na n-Óg bhí Naomh Pádraic annseo in Éirinn.  Lá amháin agus é ag dul thart casadh Oisín air.  Bhíodar ag cainnt le chéile agus deirtear gur bhaist Pádraig Oisín.  D'fhiafruig Naomh Pádraig dhe annsin ar mhaith leis Ifrinn a fheiceal agus dubhairt sé go mba mhaith.  \"Tá go maith\" arsa Pádrai \"siubhal uait liomsa.\"  D'imrigheadar síos staighre mór dorchadhana faoí 'n dtalamh nó go dtáinig siad chomh fada le teine mhór.  Chonaic Oisín duine de na Fianna agus súiste aige ag bualadh na ndiabhal.  Ghlaoidh Naomh Pádraig ar an duine sin agus dubhairt sé leis trí guidhe a iarraidh agus go bhfuighead sé iad.  Sé an chéad rud a diarr sé ná gán a shúiste briseadh go deo, an dara rud gan é a dhóghadh agus an treas rud nuair a bhéadsé ag dul á lasadh fod glas de thalamh na hÉireann a theacht idir é féin agus an teine.  Fuair sé na trí guidhe sin agus annsin d'imthigh Naomh Pádraig agus Oisín leo nó go bhfeiceadh siad Purgadóir.  Cheap Oisín nach raibh aon deifríocht idir Ifrionn agus Purgadóir acht nach raibh aon adharcha nach raibh aon adharcha ar na diabhail a bhí bPurgadóir.  Tháinig siad arais go h-Éireann.  Ba gearr ina dhiaidh sin gur cailleadh Oisín.\n(continues on next page)\n", "school_info": "School: Maighros", "metadata": [{"Location:": "Moyrus, Co. Galway", "Teacher:": "\nSéamus de Brún\n"}, {"Collector": "Máire Ní Dhonncadha", "Gender": "female", "Address": "Letterard, Co. Galway"}, {"Informant": "Maitias Ó Conghaile", "Gender": "male", "Address": "Letterard, Co. Galway"}, {"Language": "Irish"}]}, "4591079/4588539/4593133": {"title": "Scéalta faoi Oisín agus Naomh Pádraig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0010, Page 091", "Page 091"], "url": "https://www.duchas.ie/en/cbes/4591079/4588539/4593133", "text": "\nNuair a tháinig Oisín ar ais ó Thír na n-Óg bhí Naomh Pádraig in Éirinn roimhe. Bhí sé cinnt air Oisín a athrú go dtí an Fíor Chreideamh agus bhíodh siad ag troid le chéile. Bhíodh Pádraig ag rádh go mb'é Dia an fear ba láidre sa domhain agus go raibh sé indhon rud ar bith a dhéanamh. Uair amháin dúirt Oisín leis \"'Á bhfeicfinnse Goll Mac Mórna agus do Dhia ar an gcnocán glas úd thall déarfainnse go mba fhear maith é do Dhia 'á bhfeicfinnse Goll ar lár\". Ansin thug sé amharc dhó ar an gcuuid eile de na Fianna a bhí ceangailte le slabhraí in Ifrinn agus sin é an t-am a d'athruigh Oisín. Nuair a bhí Naomh Pádraig 'á bhaisteadh chuir sé an bacla síos trí na cois. Nuair a bhí an baisteadh thart chonaic Pádraig an fhuil, d'iarr sé de cé'n fáth nár inis sé dhó é. Dúirt Oisín gur cheap sé go mba cuid de'n bhaisteadh é. Bhí sé ag taisteal na hÉireann in aoineacht le Naomh Pádraig nó go bhfuair sé bás.\n", "school_info": "School: Maighros", "metadata": [{"Location:": "Moyrus, Co. Galway", "Teacher:": "\nSéamus de Brún\n"}, {"Collector": "Micheál Mac an Íarla", "Gender": "male", "Address": "Letterard, Co. Galway"}, {"Informant": "Colm Ó Ghaora", "Gender": "male", "Address": "Letterard, Co. Galway"}, {"Language": "Irish"}]}, "4591079/4588540/4593134": {"title": "Scéalta faoi Oisín agus Naomh Pádraig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0010, Page 092", "Page 092"], "url": "https://www.duchas.ie/en/cbes/4591079/4588540/4593134", "text": "\nFadó nuair a bhí Oisín in éineacht le Naomh Pádraic bhí cailín aimsire ag Pádraig. Lá amháin thug sé cáca mór isteach chuig Oisín. \"An bhfaca tú aon cháca ariamh i gCathair na bhFiann chomh mór leis sin\" adeir sí. \"Chonaic mé duilleog eibhinn a bhí chomh mór leis\" adeir Oisín. \"Thug tú 'téach\" ar sise. Ansin thug sí miosgán ime isteach chuige. \"An bhfaca tú aon mhiosgán ime chomh mór leis sin ariamh\" ar sise. Chonaic mé caor chaorthain chomh mór leis\" ar seisean. \"Thug tú 'téach\" ar sise. Ansin thug sí ceathradh caoir-fheola isteach. \"An bhfaca tú aon cheathradh feola ariamh chomh mór leis sin\" ar sise. \"Chonaic mé ceathradh lon dubh chomh mór leis\" a deir Oisín. \"Thug tú 'téach\" ar sise.Maidin lá'r na bhárach chuaidh Oisín agus buachaill aimsire Phádraig amach ag fiadhach agus thugadar cú leo. Bhíodar ag siubhal leo nó go dtáinig siad go dtí gleann mór leathan. Ansin ba ghearr go dtáinig lon-dubh a bhí chomh mór leis an gcú. D'ionnsuigh an lon-dubh agus an cú a chéile agus ba ghearr go bhfuair an cú an lámh uachtair agus chuir sé chun báis é. Ansin fuair Oisín caor chaorthain agus duilleog eibhinn. Bhí siad chomh trom is nach raibh an buachaill indhon iad a ardú. Thug Oisín abhaile chuig an gcailín iad agus nuair nár chreid sí é mharbhuigh sé í.\n", "school_info": "School: Maighros", "metadata": [{"Location:": "Moyrus, Co. Galway", "Teacher:": "\nSéamus de Brún\n"}, {"Collector": "Stiophan Mac Gloinn", "Gender": "male", "Address": "Moyrus, Co. Galway"}, {"Informant": "Beartla Guairim", "Gender": "male", "Address": "Letterard, Co. Galway"}, {"Language": "Irish"}]}, "4687711/4686153/4688486": {"title": "Oíche Shathairn agus Aoine an Chéasta", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0433, Page 123", "Page 123"], "url": "https://www.duchas.ie/en/cbes/4687711/4686153/4688486", "text": "\n(continued from previous page)\nNíor chuaigh bád  mór chun fairrge Aoine an Chéasta chun ualach gainimh a tabhairt a bhaile léi. Thagadh gála mór uirthi aon thrus a chuaidh sí an  agus b'eigint dí chur isteach sa chuan chun fuithint  d'fhágailt ó'n gála. Seumas Ó MáilleCaladh na Feirsde a d'innis an méid sinSeamuas Ó Luain, O.S.,Caladh na Feirsde,Baile'n Mhuilinn\n", "school_info": "School: Caladh na Feirsde", "metadata": [{"Location:": "Callanafersy West, Co. Kerry", "Teacher:": "\nSéamus Ó Luain\n"}, {"Collector": "Seamas Ó Luain", "Gender": "male", "Occupation": "múinteoir", "Address": "Callanafersy West, Co. Kerry"}, {"Informant": "Seamas Ó Máille", "Gender": "male", "Address": "Callanafersy West, Co. Kerry"}, {"Language": "Irish"}]}, "4758475/4747229/4779827": {"title": "Oisín Meets St Patrick at Elphin", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0250, Page 248", "Page 248"], "url": "https://www.duchas.ie/en/cbes/4758475/4747229/4779827", "text": "\nIn his travels through Connaught Patrick made Ailfionn a resting Station and on one occasion when on missionary work he is said to have met Oissian the last of the Fena, as he, Oissian, was drawing stones on his back to the town. They were mutually interested in each other and Patrick after some preliminary questioning about the Fena told Oissian the object of his visit to Ailfionn and asked  him if he would like to be converted and baptised. Oissian, though very friendly and polite to St Patrick said that he would prefer to live and die in the same faith as his dead comrades, The Fena, and that he would join them wherever they were after death.Patrick then pointed out to him that probably many of them were then in hell tormented by devils. Oissian rejoined that when a number of the Fena got together that they would fight their way out of hell and overcome the devils, as it would be impossible to subdue them.Oissian grew wrathful as he thought\n(continues on next page)\n", "school_info": "School: Clooncullaun", "metadata": [{"Location:": "Clooncullaan, Co. Roscommon", "Teacher:": "\nLiam Mac Leastair\n"}, {"Informant": "Michael Gaynor", "Gender": "male", "Age": "96", "Occupation": "tailor", "Address": "Elphin, Co. Roscommon"}, {"Language": "English"}]}, "4769950/4762278/4818599": {"title": "Scéal C", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0776, Page 108", "Page 108"], "url": "https://www.duchas.ie/en/cbes/4769950/4762278/4818599", "text": "\nSeo síos scéal d'inniseadh Rishtéard Mac Cormaic fear oibre a bhíodh ag mo shean-athair agus ag m' athair.  Rugadh i gCill Mháille é agus chaith sé a shaogal ag obair mórthimcheall na hInise.  Ní dóigh liom go raib sé riamh deich míle ó Inis.  Bhí an Ghaedhealg ar fheabhas aige agus is i nGaedhilg a dh'inniseadh sé a chuid scéalta le linn a óige, ach i ndeireadh a shaoghail nuair a bhí an Ghaedhealg beagnach marbh i gCill Mhaille d'inniseadh sé scéalta i mBéarla.  D'airigeas féin é ag innsint an scéal seo i mBéarla breis is 30 bliadhain ó soin.  Cailleadh é tamall beag na dhiadh sin agus é timcheall 80 bliadhain d' aois.  When Oisín returned from Tír na nóg St Patrick took him in to his own monastery and let him live along with the monks.  Oisín was old and quite blind so St Patrick got a little boy to lead him round.  But although Oisín was old he was still very strong compared to the men of Ireland in St. Patrick's time and he had a tremendous appetite.  Now the Saint had a housekeeper who was very miserly and she used not give poor Oisin half enough to eat.  When she used have dinner ready she used blow a whistle a few times, and if the monks and Oisín did not hear her and come at once she would give them nothing.  One day Oisín did not hear the whistle and\n(continues on next page)\n", "school_info": "School: Athgarvan, Curragh", "metadata": [{"Location:": "Athgarvan, Co. Kildare", "Teacher:": "\nBean Mhic Niocaill\n"}, {"Collector": "Bríghid Bean Mhic Niocaill", "Gender": "female", "Occupation": "múinteoir"}, {"Informant": "Risteárd Mac Cormaic", "Gender": "male", "Age": "80", "Occupation": "oibrí", "Address": "Inch, Co. Clare"}, {"Language": "mixed"}, {"Location": "Kilmaley"}]}, "4742097/4735599/4923981": {"title": "Dialogue Between St Patrick & Oisin", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0468, Page 008", "Page 008"], "url": "https://www.duchas.ie/en/cbes/4742097/4735599/4923981", "text": "", "school_info": "School: Snaidhm (B.)", "metadata": [{"Location:": "Sneem, Co. Kerry", "Teacher:": "\nMuiris Mac Gearailt\n"}, {"Language": "mixed"}]}, "4811606/4801224/4943555": {"title": "Na Prátaí", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0274, Page 443", "Page 443"], "url": "https://www.duchas.ie/en/cbes/4811606/4801224/4943555", "text": "\n(continued from previous page)\nbe he would not plough the lios atall. Long ago a man was ploughing a field. There was a lios in the field so he ploughed the lios also. On the following morning when this man went to the field so as to finish the remainder. The patch which he was after ploughing was turned back again. So he never ploughed it ever since.\n\n\n\nLong ago in the year 432 Oisin who had been in Tir-na -nOg came to Ireland. Once he came to this place riding on his milk white steed. He meet a girl who had a horse, she was puting a half sack of flour on the horse. Oisin was a very strong man, so he caught the bag while on his horse and threw it from the ground on the horse's back with one h and. It fell down on the other side again. He then jumped off his\n(continues on next page)\n", "school_info": "School: An Chluain", "metadata": [{"Location:": "Cloan, Co. Cork", "Teacher:": "\nTadhg Ó Cearbhaill\n"}, {"Collector": "Máire Ní Murchadha", "Gender": "female", "Address": "Allihies, Co. Cork"}, {"Informant": "Seán Ó Muchadha", "Gender": "male", "Age": "85", "Occupation": "feirmeoir", "Address": "Allihies, Co. Cork"}, {"Language": "English"}]}, "4922086/4851101/4948526": {"title": "Oisín and St Patrick", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0520, Page 399", "Page 399"], "url": "https://www.duchas.ie/en/cbes/4922086/4851101/4948526", "text": "\nOisín did not feel the three hundred years passing in Tír na n-Óg, (but) he did not feel the time slipping as he had such a joyful life there, but he liked to come back again to Ireland to see the Fianna. On the white steed he came, but they told him if he put his leg on the land of Ireland, he would not be able to come back again to Tír na n-Óg. The Fianna were gone, and everything withered when he reached Ireland. The woods in which he had been used to hunt were all cut down, and houses with cornfields now stood in place of them. The men working in the fields seemed very small and weak in comparison with the men in Ireland before he left.When he arrived near Dublin, he saw men working at a strange building. It was a christian church, because St. Patrick was now in Ireland and was teaching the true faith to the people, but Oisín who was a pagan did not know that. He noticed a few men trying to lift a stone falling from a cart and was not able to lift it.Oisín told the men that he would lift it for them. As he bent over to reach\n(continues on next page)\n", "school_info": "School: Scoil an Chlochair, Cappamore", "metadata": [{"Location:": "Cappamore, Co. Limerick", "Teacher:": "\nAn tSr. Fionntán\n"}, {"Collector": "Cáit Ní Riain", "Gender": "female"}, {"Informant": "Bean Uí Choigligh", "Gender": "female"}, {"Language": "English"}]}, "4922370/4875019/5087390": {"title": "Scéal - Fionn Mac Cumaill", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0617, Page 372", "Page 372"], "url": "https://www.duchas.ie/en/cbes/4922370/4875019/5087390", "text": "", "school_info": "School: Gortown, Cill Seanaigh", "metadata": [{"Location:": "Ballymacravan, Co. Clare", "Teacher:": "\nM. Mac an Airchinnigh\n"}, {"Collector": "Áine Ní Criocháin", "Gender": "female", "Address": "Ballingaddy West, Co. Clare"}, {"Language": "Irish"}]}, "4921578/4881295/5146643": {"title": "Naomh Pádraig agus Oisín", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0282, Page 226", "Page 226"], "url": "https://www.duchas.ie/en/cbes/4921578/4881295/5146643", "text": "\nNuair a tháinig Oisín ó Tír na n-Óg do casadh Naomh Pádruig air. D'fhiafhruigh Naomh Pádruig de Oisín cad é an saghas aimsire a bhíodh ann sa t-sean shaoghal. \"Bíodh geimridh ceodhach, Earrach reódhach, Samhradh riabach agus Fóghmhar grianach.\"\"Is cuma san\" arsa Naomh Pádruig nuair a bhí Dia buidheach díbh\"\"Ba chuma linn\" arsa Oisín \"nuair a bhíomhair féin buidheach dá chéille\"\"An raibh fir láidre ann nuair a bhí tú ann?\" \"Ní raibh fear le fághail ba threise na Oscar\" \"Ba treise Dia na é\" arsa Naomh Pádruig. Do labhair Oisín agus dubhairt sé, \"Dá bhfeicfeá Oscar agus Dia lá ar Chnoc na bhFiann dá bhfeicfeá Oscar ar lár deurfá gur fear láidir Dia.\n", "school_info": "School: Com Sheóla (B)", "metadata": [{"Location:": "Kilmocomoge, Co. Cork", "Teacher:": "\nConchobhar Ó Séaghdha\n"}, {"Collector": "Seán Ó Cróinín", "Gender": "male", "Address": "Coorloum West, Co. Cork"}, {"Informant": "Seán Ó Cróinín", "Relation": "grandparent", "Gender": "male", "Age": "82", "Address": "Coorloum West, Co. Cork"}, {"Language": "Irish"}]}, "4921659/4888078/5152978": {"title": "Naomh Pádraig agus Oisín", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0316, Page 127", "Page 127"], "url": "https://www.duchas.ie/en/cbes/4921659/4888078/5152978", "text": "\nDo bhí Pádraig agus Oisín Mac Fhinn ag argóint ar chúrsaí chreidimh agus do theip glan ar Phádraig a chur 'na luighe ar Oisín fo raibh Dia níos láidre ná Oscur. 'Sé dubhairt Oisín sa deire:    \"Dá bhfiecinn-se Oscur is Dia     Lámh ar lámh ar gCnoch na                 bhFiadhach   Dá bhfeicinn-se Oscur ar lár   Deirfainn annsan gur fear láidir Dia.\"   \"Conas a bhíodh na saosúir agaibh a Oisín?\" arsa Pádraig agus d'fhreagair Oisín:   \"Bíodh Geimhreadh ceódhach    Earrach ródhach    Samhradh ríabhach    Agus Fómhar grianach\"\"Dar mo bhasa a Oisín\" arsa Pádraig \"is maith a bhí Dia dhíbh\" \"Ní hé Dia a bhí go maith dhúinn\" d'fhreagair Oisín, \" 'Fán sinn féin a bhí go maith dá chéile.\"\n", "school_info": "School: An Áird (Ardfield), Clanna Caoilte", "metadata": [{"Location:": "Ardfield, Co. Cork", "Teacher:": "\nPádraig Ó Donnabháin\n"}, {"Informant": "Donnchadh Ó Donnabháin", "Gender": "male", "Age": "circa 70", "Address": "Ballyluck, Co. Cork"}, {"Language": "Irish"}]}, "4921844/4896142/5185543": {"title": "Meeting of Oisin and Saint Patrick", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0378, Page 278", "Page 278"], "url": "https://www.duchas.ie/en/cbes/4921844/4896142/5185543", "text": "\nHunting was the chief sport of the Fianna of Erin chiefly that of the Deer which they followed on foot. During one of those hunts they followed a deer and Oisin being the swiftest he outdistanced the others and in a lonely glen he closed on the deer which to his great surprise turned into a lovely young girl.He stopped running and she stopped also and spoke to him \"You are very swift she said \" there are none of the rest as swift as you\". If you will come with me I will carry you to a place where you will never grow old and you will be the same as you are now until the end of time. Oisin being a splendid looking man and young at the time he agreed to go with her and when the others came up there was no trace of Oisin or the deer.\n(continues on next page)\n", "school_info": "School: Clondulane, Mainistir Fhearmuighe", "metadata": [{"Location:": "Clondulane, Co. Cork", "Teacher:": "\nAindrias Ó Scannail\n"}, {"Collector": "Tadhg Ó hAilgeanáin", "Gender": "male", "Address": "Clondulane, Co. Cork"}, {"Informant": "John Nevin", "Gender": "male", "Address": "Gearagh, Co. Cork"}, {"Language": "English"}]}, "5177599/5172177/5185548": {"title": "The Magic Lake", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0585, Page 144", "Page 144"], "url": "https://www.duchas.ie/en/cbes/5177599/5172177/5185548", "text": "\nOnce upon a time, there was a man who sowed wheat near a lake.  He was surprised when he saw that the wheat was eaten.  He stopped up by night to mind it.  After a while a lot of horses came out of the lake, followed by a small pony.  The man jumped upon the pony.  Off with the pony into the lake, and carried the man to the bottom where he saw a feint old woman and a young girl.  He was there for about four hundred years, and he thought he was only four days.  At the end of that time, he said he would go home to cut the wheat.  The lady gave him the pony to bring him home, and she told him not to leave his foot on a sod of Ireland.  When he came back to his own home he could see nothing but briars and weeds.  He was very sorry, and he said to himself \"what has happened to all my friends,\" and he asked a man what had happened to\n(continues on next page)\n", "school_info": "School: Sallybank", "metadata": [{"Location:": "Drumsillagh or Sallybank (Merritt), Co. Clare", "Teacher:": "\nSeán Ó Riain\n"}, {"Informant": "Mr John J. Nihill", "Relation": "parent", "Gender": "male", "Occupation": "farmer", "Address": "Cloghera, Co. Clare"}, {"Language": "English"}]}}