{"4428184/4384644/4436141": {"title": "Leigheas don Triuch", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0787, Page 94", "Page 94"], "url": "https://www.duchas.ie/en/cbes/4428184/4384644/4436141", "text": "\nAn páisde a bhfuil an aicid seo air. Cuirtear trí huaire iar an druim agus faoi bholg asail í in ainm an Athar agus an Mhic agus an Spiorad Naoimh. Amen.\n\n\n\nAr maidín lá bealtaine tabhair leat leanbh go dtí an áit a bhfuil slatacha saileóige ag fas. Scoilt saileóg le d'ordóg agus tarraing ón a chéile í ionnus go dtig leat an leanbh agus a aghaidh soir a chur fríd trí huaire ar éirigh na gréine\"in ainm and Athar agus an Mhic agus an Spioraid naomh. Annsin ceangaltar an saileóg le snáth dearg agus de réir mar ghreamochas an scoilt sa chrann arais léigheasfaidh an leanbh.\n\n\n\nTá a lán orthaí ann \"ortha an déididh\" ortha an leonadh, ortha an tromluighe, ortha na fola, ortha an doighte, ortha na péiste, ortha na breoite eachra, ortha na fiabrais, ortha an tinnis, ortha an ruad, ortha an tactha, ortha ar dogadh bhui?, ortha an bhuile ceangail, ortha an dul amudha. Seo cuid acas:-\n(continues on next page)\n", "school_info": "School: Naul", "metadata": [{"Location:": "Naul, Co. Dublin", "Teacher:": "\nC. Mac Fhíonntaigh\n"}, {"Collector": "Cathal Mac Fhíonntaigh", "Gender": "male"}, {"Informant": "Neans Ní Chealachain", "Gender": "female", "Age": "74", "Address": "Tawnaghgorm, Co. Donegal"}, {"Language": "Irish"}]}, "4427830/4348120/4455921": {"title": "Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0094, Page 271", "Page 271"], "url": "https://www.duchas.ie/en/cbes/4427830/4348120/4455921", "text": "\nCharmsIt is said that if a person had a pain in his tooth and if he put a little bit of tobacco in it, it would cure it.  Other people say that if you got a little piece of cotton and warmed it and put it to your tooth it would be another cure for it.  It is said that ferrets leavings cure for the chin cough.  Other people say that asses milk is another cure for that cough.  Some people say that if you boil seven tops of nettles and drink the juice of them it would be a cure for a sore throat.  People say that if you find a little hole of water in a stone without looking for it, it would be a cure for a wart.  Other people say that if you get a black snail and kill him and put it three times on the wart and hang him on a bush when the snail would be weathered away the wart would be gone.  People say that if you had a corn and get a little bit of bacon and put it in your sock over the corn, it would be cure for it.  Other people say that if you went in your feet spreading turf in a bog it would be another cure for corns.\n(continues on next page)\n", "school_info": "School: Belcarra (Buachaillí)", "metadata": [{"Location:": "Ballycarra, Co. Mayo", "Teacher:": "\nSeosamh Ó Heireamhóin\n"}, {"Collector": "Thomas Tuffy", "Gender": "male", "Address": "Gweeshadan, Co. Mayo"}, {"Informant": "Thomas Tuffy", "Relation": "parent", "Gender": "male", "Age": "60"}, {"Language": "English"}]}, "4427830/4348123/4455924": {"title": "Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0094, Page 274", "Page 274"], "url": "https://www.duchas.ie/en/cbes/4427830/4348123/4455924", "text": "\nIt is said that if you cut the tops of seven nettles and boil them because it is said that juice of them is good for a sore throat. It is said that if you ask a man with a white horse had he any cure for the chin cough and what ever he will say is good for the chin cough. It is also said if you had warts on your hand and to get a snail whe [sic] you would not be looking for it and to rub him on the wart and stick him in a black thorn bush and the wart will wither. It is also said that if you will get a limestone with a hole in it, it is said that it is another cure for a wart but you must go to that stone every Thursday to wash it. If you had a sprained foot to go and tell the weaver about it but not to ask the thread. The weaver will put a lot of knots on the thread, and he will put the thread on the sprained foot.J. Mac DonnellBallinlassa\n(continues on next page)\n", "school_info": "School: Belcarra (Buachaillí)", "metadata": [{"Location:": "Ballycarra, Co. Mayo", "Teacher:": "\nSeosamh Ó Heireamhóin\n"}, {"Collector": "J. Mac Donnell", "Gender": "male", "Address": "Ballinlassa, Co. Mayo"}, {"Informant": "Patrick Mac Donnell", "Relation": "parent", "Gender": "male", "Age": "40", "Address": "Ballycarra, Co. Mayo"}, {"Language": "English"}]}, "4427830/4348126/4455925": {"title": "Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0094, Page 277", "Page 277"], "url": "https://www.duchas.ie/en/cbes/4427830/4348126/4455925", "text": "\nIt is said that if you meet a man with a white horse and to ask a cure off him for the chin cough anything he would tell you would cure you.  If you had a sore throat and to boil the tops of seven nettles and to drink the juice the sore throat would go.  If you had warts on your hand and to get a snail and to rub him of them.  Then to leave him on a white thorn bush and according to how the snail would be weathering the wart would be going.  If you make a worm knot over a calf that is sick he would get cured.  If you get a stone in the wood and water in it and to wash you hand in it, if you had warts on your hand they would go.  If you had a cold and to let a frog down your back the cold will go.  Some people say that ferrets leavings is good for the chin cough.  If you have the chin cough and to go under an ass three times and then to drink her milk the chin cough would go.J JoyceBelcarraCastlebarThis was told to me by my mother Mrs Joyce Age 45 years\n", "school_info": "School: Belcarra (Buachaillí)", "metadata": [{"Location:": "Ballycarra, Co. Mayo", "Teacher:": "\nSeosamh Ó Heireamhóin\n"}, {"Collector": "J. Joyce", "Gender": "male", "Address": "Ballycarra, Co. Mayo"}, {"Informant": "Mrs Joyce", "Relation": "parent", "Gender": "female", "Age": "45"}, {"Language": "English"}]}, "4427830/4348137/4455937": {"title": "Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0094, Page 287", "Page 287"], "url": "https://www.duchas.ie/en/cbes/4427830/4348137/4455937", "text": "\nOld people have a lot if charms. If you get a bit of meat and put it in a paper and if you had a wart and rub the bit of meat of it once a day and when the meat is gone the wart will be gone. If you had a cold and get a frog and let him down your back the cold will go. If you had the chin cough and go to a man with a white horse anything he says will cure you. If you drink half the asses milk when you have a cold the cold will go. People say that if you get a Muglogh Nut and keep it you would never get a tooth ache. I was looking for nuts and I got one. But also I cracked it and would you believe what ti done. It knocked my tooth clean out. From that day to this I had a tooth ache. If I kept the Muglogh Nut I would never have a tooth ache.Charles A. DalyBelcarraCastleboiCo. MayoThis was told to me by my motherMrs. Daly Age 35 yrs.\n", "school_info": "School: Belcarra (Buachaillí)", "metadata": [{"Location:": "Ballycarra, Co. Mayo", "Teacher:": "\nSeosamh Ó Heireamhóin\n"}, {"Collector": "Charles A. Daly", "Gender": "male", "Address": "Ballycarra, Co. Mayo"}, {"Informant": "Mrs Daly", "Relation": "parent", "Gender": "female", "Age": "35", "Address": "Ballycarra, Co. Mayo"}, {"Language": "English"}]}, "4428221/4386886/4456663": {"title": "The Charm", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0795, Page 062", "Page 062"], "url": "https://www.duchas.ie/en/cbes/4428221/4386886/4456663", "text": "\n\"I'm Martin O'Flaherty from Dromruadh farm,With my pot and pot hooks under my arm;With whiskey and rice I set my charm,And if I don't do good, I won't do harm.\"Martin O'Flaherty lived in the parish of Killentiernach in Co. Kerry. He was supposed to have a charm for curing diseases in sheep. Flor  - a farmer that lived near Hereford, Co Kerry, had a number of sheep that suffered from a disease called the mange. Flor met Martin at the fair in Killarney, and he told him about the disease which his sheep had, as he knew that Martin had the reputation of curing such diseases. Martin promised him that he would cure his sheep. For that purpose he told him to take home a quart of the best whiskey, one pound of tobacco, and a stone of rice. He also said that he would go to Flor's house early the next morning\n(continues on next page)\n", "school_info": "School: Palmerstown", "metadata": [{"Location:": "Palmerston, Co. Dublin", "Teacher:": "\nMrs Tuohy\n"}, {"Informant": "Mr O' Mahony", "Gender": "male", "Address": "Dundrum, Co. Dublin"}, {"Language": "English"}]}, "4427941/4359417/4461605": {"title": "Charms or Pishrogues in Connection with Milk", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0119, Page 327", "Page 327"], "url": "https://www.duchas.ie/en/cbes/4427941/4359417/4461605", "text": "", "school_info": "School: Lios Dubh (C.)", "metadata": [{"Location:": "Lisduff, Co. Mayo", "Teacher:": "\nÁine, Bean Uí Chuinn\n"}, {"Collector": "Annie Murtagh", "Gender": "female", "Address": "Castleroyan, Co. Mayo"}, {"Informant": "Mrs Murtagh", "Relation": "parent", "Gender": "female", "Address": "Castleroyan, Co. Mayo"}, {"Language": "English"}]}, "4427956/4360932/4465313": {"title": "Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0123, Page 168", "Page 168"], "url": "https://www.duchas.ie/en/cbes/4427956/4360932/4465313", "text": "\nThere is a pretty general belief in charms in this district.\"Dust in the eye\" charm.  Patrick McCann, lived for some years before he died, at Lisloughna about one mile to the east of the school.  He lived formerly, at Lavey, which is a village two miles east of Charlestown, on the Charlestown to Ballaghaderin road.  He seems to have some peculiar charm for taking a dust out of the eye.  I knew him to remove a dust from the eye of a pupil, who came to school about nineteen twenty-three.  The boy, Thomas Price, was suffering for a few days with a dust in the eye.  finally McCann was sent for.  Here is what he did according to the boy:- \"He put me sitting on a chair over at the bed; then he got a cup of cold water and placed it in front of him on the table.  After a while, he said it was out of the eye.  He showed me the dust in the water.\"A woman by name Mrs Peyton commonly called 'Máire bán\" lived at Cloonfinisk, she had a charm for removing dust from the eye.  People wrote to her from England.  She worked some charm by which she removed dust from the eye of a person over in England.  She cured several people at home.This woman had also a charm for head - fever.\n", "school_info": "School: Tomghéis", "metadata": [{"Location:": "Tumgesh, Co. Mayo", "Teacher:": "\nM. Ó Casaide\n"}, {"Language": "English"}]}, "4428055/4373222/4466946": {"title": "Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0147, Page 455", "Page 455"], "url": "https://www.duchas.ie/en/cbes/4428055/4373222/4466946", "text": "\nThere is a man in Knockmore and his name is Oliver Rider. He has a charm to cure a sore neck. He leaves his hand on the person's neck once a day for three days then the soreness goes and then the neck is cured. He has this cure because he is the seventh son.When the people are churning they put coals and a grain of salt under the churn for fear the fairies would bring the milk and butter. If anybody comes in while while they they are churning and takes a coal out of the fire they will have the butter with them. If a stranger comes in and he does not churn a while he will have the butter with him.\n(continues on next page)\n", "school_info": "School: Punt Abhann (Pontoon)", "metadata": [{"Location:": "Tawnaghmore, Co. Mayo", "Teacher:": "\nAnastasia Ní Chonaire\n"}, {"Collector": "Winnie Mc Hale", "Gender": "female", "Address": "Tawnaghmore, Co. Mayo"}, {"Language": "English"}]}, "4428026/4369302/4474585": {"title": "Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0140, Page 010", "Page 010"], "url": "https://www.duchas.ie/en/cbes/4428026/4369302/4474585", "text": "\n(The seventh Son) of a family where the birth of a daughter does not intervene is supposed to have a cure for certain diseases in the touch of his hand - such as running sores called \"An evil\" also for ring worm a skin disease. A lock of his hair from around the neck is a cure for whooping cough.Asse's milk given to a baby prevents whooping cough.(Sníomh na bpéiste) or worms knot) young calves are subject to colic also young horses. \"Sníomh na bpéiste) is the charm for this. Someone takes a piece of string and makes the worms knot over the animals belly saying, Sníomh, Sníomh, Sníomh na bpéiste.\n(continues on next page)\n", "school_info": "School: Ballycastle Boys'", "metadata": [{"Location:": "Ballycastle, Co. Mayo", "Teacher:": "\nMícheál de Búrca\n"}, {"Collector": "Dan Lenihan", "Gender": "male", "Address": "Ballycastle, Co. Mayo"}, {"Informant": "Mrs Polke", "Gender": "female", "Age": "63", "Address": "Ballinglen, Co. Mayo"}, {"Language": "mixed"}]}, "4428297/4392413/4480631": {"title": "Ortha an Scabaill", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1037, Page 296", "Page 296"], "url": "https://www.duchas.ie/en/cbes/4428297/4392413/4480631", "text": "\nAn gcluinn sibh mise lucht na Sgaball na deanaigibh faillighe in mhur gcas. Is minic a bhunne gan a carraid agus é na luighe ar leabaidh an bháis. A duine bocht gan chiall na dean bréag le Muire ná ith feoil Ceadaoine agus na fheichaint do innis. Béidh umhal do’n chléir agus do’n na cúig fhlaiceacha. Muire glach comaoineacha i ndilís Dé agus béid tú ar féasta ag Crós na n-Aingeal.Bhí Muire as a Mhach ag shiubhal amuigh san lá thairbísigh dithe as a dheis lámh Sgaball breagh na mbraincí óir. Níl aon duine a chaithcheas a éidheadh mar i cóir nach mbead seal agam ar a anam ins an ghlóir. A Bhainríogeann na bhflaitheas i sgathach na glor is leat a gnídh mo chasaoid ar maidín as tráthnóna sábhail mé ar na pacaidh agus chuir mé ar an eolais go pobal na h-Airthi mar shilteach na deoraid. Líon mó croidhche mo ghrádh ar an Athair nigh mo lámh i smol a pheachadh. Chríost ar uair mo bháis go dtugadh tú m-anam in a Fláitheach.A Mhaighdhean Ghlóreamhail ó far bháiseach. Is tú ma stór, mo lón, mo thaisthigh is tú ár a d’eolais ag gabhail romhan ar na casain le mó chur ar an eolas agus an tór ar an pheachadh. Íosa mhilís. Íosa cheanna líon mo croidhe sa lán de dansáil aon Mhich Mhuire na sgar liom anois ná ar uair mo\n(continues on next page)\n", "school_info": "School: Meenacahan", "metadata": [{"Location:": "Meenacahan, Co. Donegal", "Teacher:": "\nBrigid, Bean Uí Eachthighearn\n"}, {"Collector": "Róise Ní Ghallochabhair", "Gender": "female", "Address": "Meenacahan, Co. Donegal"}, {"Language": "Irish"}]}, "4428319/4394370/4481340": {"title": "Ortha an Scabaill", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1043, Page 247", "Page 247"], "url": "https://www.duchas.ie/en/cbes/4428319/4394370/4481340", "text": "\nÓrtha A’ Sgabaill.Deireadh an sagart an phaidir seo nuair a bhíodh sé ag beannughadh sgabaill.An gcluin tú mé a lucht na sgabaill na bhígidh failligheach ann mhur gcás. Is mairg a bheadh gan caraidh as mé in mo luighe ar leabaidh an bháis. A dhuine bhoicht gan céill na deán bréag le Mhuire Na h-ith feól Céadaoimhe agus ná héagchaoin do thinneas. Umhluigh don Cléir agus dó na cúig féilte Muire. Glac Cumaoineacha dílse Dé agus béidh tú ar féasta gcros na n-aingeal. Bhí Muire agus an mac ag siubhal amuigh sa lá agus casadh dóbhtha pearsa de dhuine naomhtha sa ród. Sgaball bhréagh de na bhrainnse óir. Níl aon duine a chaithfeas mo chulaith mar is coir nach mbéidh séala ar a anam ins an ghlór. A Maighdeán mhortamhail, glormhar, beannuighthe, is tú mo lón, no stór, a’s mo thaisgidh : is tú an réalt eólais a bíonns romham ar an bhealach ag deánamh domhsa an t-eólas nuair a bhíos an tór ar an pheacach.A Bhánríoghan na bflaithis, as a Athar na Trócaire is leat a ghnídhim mo chasaoid ar maidhín as tráthnóna: Mo shabháil ar na peacaidh agus mo chur ar an eólas go pobal na\n(continues on next page)\n", "school_info": "School: Mucros", "metadata": [{"Location:": "Muckros, Co. Donegal", "Teacher:": "\nAodh Ua hEigeartaigh\n"}, {"Informant": "Brigid Ní Bheirn", "Relation": "unknown", "Gender": "female", "Age": "50", "Address": "Roelough, Co. Donegal"}, {"Language": "Irish"}]}, "4428347/4397721/4482676": {"title": "Ortha an Scabaill", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1052, Page 107", "Page 107"], "url": "https://www.duchas.ie/en/cbes/4428347/4397721/4482676", "text": "\nCluin sibh míse lucht na sgabál nach leigh failligh ann mar gcás is mairg bhíos gan caraid as é ‘na luighe ar leabaidh an báis. Duine bocht gan céill ná déan bréag le Muire, ná ith feoil Cead Aoine as na h-éagóin dó tinneas. Bhí Muire agus a mac ag siubhal amuigh sa lá, casad Pearsa daoibhte a bhí ro-naomhtha mar bhí Naomh Séamus as an Róimh, bhí sgaball bréagh na mBrainnse Óir leis in a láimh. Níl éinne a chaithfidh mó chulaith nach mbéidh séala agam ar a anam ins an Ghlóir. A Mhaighdhéan Muire agus athair na ngrás is leat a gnídhim mó casoid maidín as tráthnona ag tobar na h-aithridh an áit a shiltear na deora. Nighim mó láma a smál an pheacaidh ar uair mó bháis tabhair mó anam ‘na bFlaithis\n(continues on next page)\n", "school_info": "School: An Sealgán", "metadata": [{"Location:": "Shallogan Beg, Co. Donegal", "Teacher:": "\nRóis Ní Bhraonáin\n"}, {"Informant": "Padrúig Ua Baoghaill", "Gender": "male", "Address": "Classy, Co. Donegal"}, {"Informant": "Bean Ua Baoghaill", "Gender": "female", "Address": "Classy, Co. Donegal"}, {"Language": "Irish"}]}, "4428345/4397488/4485917": {"title": "Ceití an Chúil Ghearbaigh", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1051, Page 250", "Page 250"], "url": "https://www.duchas.ie/en/cbes/4428345/4397488/4485917", "text": "\n(continued from previous page)\nseacht noidhche agus seacht lá agus bfearr, an la dior ann ach na an chead lá. Cuaidh siad-san an t-ath, mise an clocan. Baitheadh iadsan agus thainig mise. Ní bhfuair mise acht stocai bainne reamhar agus bróga páipeár. D’ol mé na stocai agus stróc mé na bróga agus ta mé annso indiu ag innse an sgeil seo daoibh.\n\n\n\ngCluin sibh mise locht na sgaball. Na dean faillighe in bhur gcás. Is minic a bhí gan a charaid. Is é na luighe ar leabaidh an bháis. A dhuine bhocht gan chéill. Na dean bréag le Muire.Na ith feoil Dia Ceadaoine. Agus na heagcaoin do thinneach. Bhí umhal don chléir.Agus na cuig flacacha Muire. Glac comaoineaca I bfionaise dé. Agus béidh tú ar feasta ar cros na n-aingeal.\n(continues on next page)\n", "school_info": "School: Doobin", "metadata": [{"Location:": "Doobin, Co. Donegal", "Teacher:": "\nMáire Nic Fhloinn\n"}, {"Informant": "Séamus Uí Tuathlann", "Gender": "male", "Age": "70", "Address": "Doobin, Co. Donegal"}, {"Language": "Irish"}]}, "4493626/4405475/4514259": {"title": "Orthaí agus Leigheasanna", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1073, Page 68", "Page 68"], "url": "https://www.duchas.ie/en/cbes/4493626/4405475/4514259", "text": "", "school_info": "School: An Sraith Mhór", "metadata": [{"Location:": "Stramore, Co. Donegal", "Teacher:": "\nBrighid Ní Ghaodhchain\n"}, {"Language": "Irish"}]}, "4493697/4411931/4524776": {"title": "Orthaí", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1094, Page 011", "Page 011"], "url": "https://www.duchas.ie/en/cbes/4493697/4411931/4524776", "text": "\nTá cuid mhór órthaí ag na sean-daoine fa'n áit seo. Ní thabharann na dochtúirí nó an Eaglais isteach(?) dóbhtha acht tá léas ionnta má bhíonn muinghín ag an té atá dá bhfághail go dtiocfaidh biseach air. Tá órtha ag na daoine do chuid mhór rudaí mar órtha an leónta(?), órtha an déididh(?), órtha an ruaidh, órtha dúlagan, órtha an chait bhrághaid.Tá cuid mhór daoine a bhfuil órtha an ruaidh aca. Gheibh siad giota beag ime agus téigheann siad ar a gcuid glúna agus deir siad focla no paidreacha eighinteacht os a chionn. Léasfaidh seo an ruaidh má tá muinghín ag an té a bhfuil sé ortha go léasfaidh sé é.Thig an léas seo a dheanamh as diosta a bhíonns ar an urlár leis na paidreacha céadna a rádh. Nuair a bhéadh an duine a mbéadh na órthaí seo aca ag fághail bháis thiocfadh leis an órtha a thabhairt do dhuine eighinteacht eile.\n", "school_info": "School: An Cuimín", "metadata": [{"Location:": "Commeen, Co. Donegal", "Teacher:": "\nPádraig Mac Aoidh\n"}, {"Collector": "Anna Ní Bhaoghaill", "Gender": "female", "Age": "15", "Address": "Cloghan, Co. Donegal"}, {"Informant": "Pádraic Ó Muighe", "Gender": "male", "Age": "80", "Occupation": "feirmeoir", "Address": "Cloghan, Co. Donegal"}, {"Language": "Irish"}]}, "4493720/4414053/4527760": {"title": "Béaloideas - Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1100, Page 111", "Page 111"], "url": "https://www.duchas.ie/en/cbes/4493720/4414053/4527760", "text": "\nJoe Gallon of Meenareagh and James Gallen of Cronalaughey can cure the sprain by charm. They say some prayers and rub the sprain three times. If it is a week from the person got the sprain it will be another week before that person is better. Patrick Gallen of Lismulladuff can lead for the mumps. The cure of the mumps is: a pair of winkers is put on the person that has the mumps and is lead over a march burn.\n", "school_info": "School: Lios Mullaigh Dhuibh", "metadata": [{"Location:": "Lismullyduff, Co. Donegal", "Teacher:": "\nAodh Mac Giolla Eóin\n"}, {"Collector": "Roise Ní Ghionntaigh", "Gender": "female"}, {"Language": "English"}]}, "4569060/4567679/4583482": {"title": "Charms of Old - Relating to Churning", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0037, Page 0230", "Page 0230"], "url": "https://www.duchas.ie/en/cbes/4569060/4567679/4583482", "text": "\nThis is a true story told by my Grandmother. She often told us about her father going to the fair of Balla on a May morning. He had not gone far when he came across a woman in Loutlodge farm standing at a gap. She was driving all the neighbours cows through the gap and each time a cow passed through the gap she\n(continues on next page)\n", "school_info": "School: Baile an Leasa", "metadata": [{"Location:": "Ballinlass, Co. Galway", "Teacher:": "\nTreasa Bean Uí Mhathghamhna\n"}, {"Collector": "Teresa Egan", "Gender": "female", "Age": "11", "Address": "Carrowkeelanahglass, Co. Galway"}, {"Informant": "(name not given)", "Relation": "grandparent", "Gender": "female", "Age": "95", "Address": "Carrowkeelanahglass, Co. Galway"}, {"Language": "English"}]}, "4583297/4577437/4585967": {"title": "A Charm", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0047, Page 0190", "Page 0190"], "url": "https://www.duchas.ie/en/cbes/4583297/4577437/4585967", "text": "\nThere was once an old woman named Biddy Early who resided near Scariff in County Clare. She was supposed to have a charm. Many people got cured of sore backs and indigestion by means of her power. It was said that anyone who went to her would get a bottle from her and in the interior of that bottle she had the charm. If any other person touched the bottle the charm was gone.When a person would go to [?] her she would look through a bottle and tell one who they met on the road and also what they had at home.One time a boy got crippled and his mother went to Biddy. She gave her a bottle and told her to mind would she fall going out a certain gap so that she would not break the bottle. When the woman was going home she fell going out the gap and broke the bottle. Next day she went to Biddy again and got another bottle. When she was\n(continues on next page)\n", "school_info": "School: Cill Mhic Dhuach", "metadata": [{"Location:": "Kilmacduagh, Co. Galway", "Teacher:": "\nPádraig Ó Cathail\n"}, {"Language": "English"}]}, "4602698/4596201/4606537": {"title": "Ortha na bhFiabhrais Bheaga", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0009, Page 108", "Page 108"], "url": "https://www.duchas.ie/en/cbes/4602698/4596201/4606537", "text": "\nArtha a chuir Muire dá Mac ar tinneas cinn, ar thinneas cuinn, ar thinneas cos agus lámh, agus ar fiabhruis bheaga.Triúr a chuir sí 'ghá tógáil, an t-Athair, an Mac agus an Spiorad Naomh, 'ghá sheóladh 'san áit nach siúbhalfaidh duine ná beithidheach.Artha an t-innis cinnArtha a chuir Muire dá Mac ar th-inneas cinn.Ó bharr do shróine go mullach do chinn as sin go bois do dhá shlinneáin go n-imthighidh an phian.Triúr a chuir sí 'ghá thógáil, an t-Athair an Mac agus an Spiorad Naomh 'ghá seoladh 'san áit nach siúbhalfaidh duine na beithidheach.Artha na n-ArthaineachaGo mbeannuighidh Dia dhíbh a thriúr bráithre.Go mbeannuighidh Dia agus Muire dhíbh.Ca'il sibh ag dul indiú.Ag dul go sliabh na n-olachaí, ag baint ola as crainnte.Tugaidh libh beala na h-ollan, olann\n(continues on next page)\n", "school_info": "School: Cill Chiaráin", "metadata": [{"Location:": "Kilkieran, Co. Galway", "Teacher:": "\nNioclás Mac Aoidh\n"}, {"Collector": "Máire Ní Raghallaigh", "Gender": "female", "Age": "14", "Address": "Kilkieran, Co. Galway"}, {"Informant": "Nuala Bhreathnach", "Gender": "female", "Age": "56", "Address": "Kilkieran, Co. Galway"}, {"Language": "Irish"}]}, "4602698/4596174/4606539": {"title": "Seanfhocla", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0009, Page 081", "Page 081"], "url": "https://www.duchas.ie/en/cbes/4602698/4596174/4606539", "text": "\nTagann maith as cháirde agus grásta as foigid.Is lúgha na'n frith máthair an droch-chomhairle.\n\n\n\nDuine a chonnaic mé, triúr nár bheannuigh mé ar a chuid ba dhruinneach é ar a chuid chaiple stuintheach é. Ar a chuid chaoirí mullach é agus mar a bhfuil sin aige anuas faoi na mhullach é.\n\n\n\nArtha a chuir Muire do Dhiarmada Artha gan iarraidh gan atchuinghe an phian atá in do giall go dtéighid sé go buan as do carbad.\n\n\n\nSanctí thacta, tar a Bhríghid agus fóir ar bhó agus ar mó laoigh in Ainm an Athair agus an Mhic agus an Spiorad Naomh.\n", "school_info": "School: Cill Chiaráin", "metadata": [{"Location:": "Kilkieran, Co. Galway", "Teacher:": "\nNioclás Mac Aoidh\n"}, {"Collector": "Mairéad Ní Níadh", "Gender": "female", "Age": "11", "Address": "Kylesalia, Co. Galway"}, {"Informant": "Bríghid Ní Níadh", "Relation": "parent", "Gender": "female", "Age": "53"}, {"Language": "Irish"}]}, "4602698/4596174/4606541": {"title": "Seanfhocla", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0009, Page 081", "Page 081"], "url": "https://www.duchas.ie/en/cbes/4602698/4596174/4606541", "text": "\nTagann maith as cháirde agus grásta as foigid.Is lúgha na'n frith máthair an droch-chomhairle.\n\n\n\nDuine a chonnaic mé, triúr nár bheannuigh mé ar a chuid ba dhruinneach é ar a chuid chaiple stuintheach é. Ar a chuid chaoirí mullach é agus mar a bhfuil sin aige anuas faoi na mhullach é.\n\n\n\nArtha a chuir Muire do Dhiarmada Artha gan iarraidh gan atchuinghe an phian atá in do giall go dtéighid sé go buan as do carbad.\n\n\n\nSanctí thacta, tar a Bhríghid agus fóir ar bhó agus ar mó laoigh in Ainm an Athair agus an Mhic agus an Spiorad Naomh.\n", "school_info": "School: Cill Chiaráin", "metadata": [{"Location:": "Kilkieran, Co. Galway", "Teacher:": "\nNioclás Mac Aoidh\n"}, {"Collector": "Mairéad Ní Níadh", "Gender": "female", "Address": "Kylesalia, Co. Galway"}, {"Informant": "Bríghid Ní Níadh", "Gender": "female", "Age": "53"}, {"Language": "Irish"}]}, "4602699/4596353/4614981": {"title": "Ortha in aghaidh na Sióga", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0009, Page 260", "Page 260"], "url": "https://www.duchas.ie/en/cbes/4602699/4596353/4614981", "text": "\nA gcúl agus a n-aghaidh uainn as ucht pháis agus bás ar Slanuightheóra\n\n\n\nDuine a chonnaic mé, triúr nár bheannuigh mé ar a chuid ba dhruineach é ar a chuid caiple stuintheach é ar a chuid caoraí mullach é agus mar a bhfuil sin agat anuas faoi na mhullac é.\n\n\n\nChuaidh rud dubh agus rud bán suas an cnoc tháinig an rud dubh anuas agus d'fan an rud bán shuas.Cearc dhubh a rug ubh bhán.Más cám díreach an ród sí an tslidhe mhór an t-aithgiorra\n", "school_info": "School: Cill Chiaráin", "metadata": [{"Location:": "Kilkieran, Co. Galway", "Teacher:": "\nNioclás Mac Aoidh\n"}, {"Collector": "Mairéad Ní Níadh", "Gender": "female", "Age": "12", "Address": "Kylesalia, Co. Galway"}, {"Language": "Irish"}]}, "4602699/4596353/4614982": {"title": "Ortha in aghaidh na Sióga", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0009, Page 260", "Page 260"], "url": "https://www.duchas.ie/en/cbes/4602699/4596353/4614982", "text": "\nA gcúl agus a n-aghaidh uainn as ucht pháis agus bás ar Slanuightheóra\n\n\n\nDuine a chonnaic mé, triúr nár bheannuigh mé ar a chuid ba dhruineach é ar a chuid caiple stuintheach é ar a chuid caoraí mullach é agus mar a bhfuil sin agat anuas faoi na mhullac é.\n\n\n\nChuaidh rud dubh agus rud bán suas an cnoc tháinig an rud dubh anuas agus d'fan an rud bán shuas.Cearc dhubh a rug ubh bhán.Más cám díreach an ród sí an tslidhe mhór an t-aithgiorra\n", "school_info": "School: Cill Chiaráin", "metadata": [{"Location:": "Kilkieran, Co. Galway", "Teacher:": "\nNioclás Mac Aoidh\n"}, {"Collector": "Mairéad Ní Níadh", "Gender": "female", "Age": "12", "Address": "Kylesalia, Co. Galway"}, {"Language": "Irish"}]}, "4602700/4596556/4623491": {"title": "An Bhean a Thug léi Boilgín", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0009, Page 463", "Page 463"], "url": "https://www.duchas.ie/en/cbes/4602700/4596556/4623491", "text": "\n(continued from previous page)\n[-]\n\n\n\nDuine a chonnaic mé, triúr n'ár bheannuigh mé, Ar a chuid ba dhruinneach é. ar a chuid caiple stuintheach é. Ar a chuid caoirí mullach é agus mar a bhfuil sin aige anuas faoina mullach é.\n\n\n\nOrtha a chuir do Dhiarmaid Ortha gan iarraidh gan athchuinge an phian atá thiar in do ghiall go dteighidh sé\n", "school_info": "School: Cill Chiaráin", "metadata": [{"Location:": "Kilkieran, Co. Galway", "Teacher:": "\nNioclás Mac Aoidh\n"}, {"Collector": "Mairéad Ní Níadh", "Gender": "female", "Address": "Kylesalia, Co. Galway"}, {"Language": "Irish"}]}, "4602700/4596557/4623493": {"title": "Ortha an Tachta", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0009, Page 464", "Page 464"], "url": "https://www.duchas.ie/en/cbes/4602700/4596557/4623493", "text": "\nSanctú thachta, tar a Bhríghid agusfóir ar bhó agus ar mó laoigh inainm an athair ag an Mhic agusan Spiorad Naomh.\n\n\n\nCailleach bheag san gcoinra agus sgian sáithte go feirc innte.Freagra cruca ime.Chuaidh rud dubh agus rud bán suas an chnoc tháinig an rud dubh anuas agus d'fhan an rud bán thuas.Freagra. Cearc dubh a chuaidh suas an cnoc rug sí ubh shuas agus tháinig sí fhéin anuas.Dhá bhó bhainne ar thaobh na ghaoithe ceann san oidhche agus cheann sa ló dá dteigheadh an péire sin le chéile ní bheadh Éire beó.An ghealach agus an ghrian.\n", "school_info": "School: Cill Chiaráin", "metadata": [{"Location:": "Kilkieran, Co. Galway", "Teacher:": "\nNioclás Mac Aoidh\n"}, {"Collector": "Mairéad Ní Níadh", "Gender": "female", "Address": "Kylesalia, Co. Galway"}, {"Language": "Irish"}]}, "4602700/4596588/4623513": {"title": "Ortha an Rua", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0009, Page 495", "Page 495"], "url": "https://www.duchas.ie/en/cbes/4602700/4596588/4623513", "text": "\nRuad ruad ruad chun ádbhair d'fiafruig colm cille de chríost. Chéard a leigeasfhadh an ruad.An nimh a chuir ar gcúl agus an t-áth a chuir ar lár gan aon dóchar a bheith san lot. Ac an oiread le bheith slán.\n\n\n\nSainnte aitrige, tar a Bhrígid agus fóir orm.\n\n\n\nTar a Atair le cabair tar a Bhrígidh agus fóir tar a Bhrígidh a Bhrígidh a bhan-naomh gus a dhá easbhall déag agus chuir cosg leis an bfhuil atá a teacht go tréan.\n\n\n\nSiúd sóir an bóthair í láir óg agus í ag seitreach sáil nimneach na timcheall agus a leith deireadh trí lasadTóirneach.\n", "school_info": "School: Cill Chiaráin", "metadata": [{"Location:": "Kilkieran, Co. Galway", "Teacher:": "\nNioclás Mac Aoidh\n"}, {"Collector": "Éithne Ní Dhomhnaill", "Gender": "female", "Address": "Kylesalia, Co. Galway"}, {"Language": "Irish"}]}, "4613671/4606990/4623826": {"title": "Charm", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0016, Page 096", "Page 096"], "url": "https://www.duchas.ie/en/cbes/4613671/4606990/4623826", "text": "\nMary Connell lived in Lowberry near Dunmore. Two men from Hollygrove went to Dunmore for a charm. Their brother was giving up for death. She gave them the charm \"Now be sure ye don't fall asleep till ye get home\" she said. When they got to bóthar buidhe they got sleepy and were going to sleep when two men followed up to hurry the messengers saying that the man was dying. They got home then without falling asleep and so the man was cured with the charm Thomas Kunichan's father Buncrower ser charms for boils.\n\n\n\nThere was another man who was a pig jobber. He had a load of pigs in Dublin. A shopkeeper come out to him and asked how much he was charging for \"the big and the little.\" \"So much\" says the pig jobber. I'll keep them said the shopkeeper and the jobber was picking out the biggest pig and the smallest pig. What are you doing said the shopkeeper. I'm picking the biggest and the smallest for the said the pig jobber. I've the whole lot of them bought says the shopkeeper and so as the bargain was made he had to give all the pig to him. The pig jobber went and told Dan OConnell that he was robbed and that he had to sell all the pigs for the price of two. \"Don't mind\"\n(continues on next page)\n", "school_info": "School: Gort na Díogha", "metadata": [{"Location:": "Gortnadeeve West, Co. Galway", "Teacher:": "\nSéamus Ó Dochartaigh, Bean Uí Dhochartaigh\n"}, {"Informant": "Thomas Brennan", "Gender": "male", "Age": "91", "Address": "Knockmascahill, Co. Galway"}, {"Language": "English"}]}, "4622962/4617230/4627210": {"title": "Paidreacha", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0069, Page 209", "Page 209"], "url": "https://www.duchas.ie/en/cbes/4622962/4617230/4627210", "text": "\n(continued from previous page)\n16.Paidir na FolaIs beannaighthe anam an fhir a sgoilt croidhe an laoigh ghil.Is maith an nidh a tháinig as, fuil, fín is fír-uisge,In ainm an Athar, tabhair dom cabhair an fhuil a stopadh atá ag teacht go tréan.\n", "school_info": "School: An Gort Mór", "metadata": [{"Location:": "Gortmore, Co. Galway", "Teacher:": "\nCriostóir Mac Aonghusa\n"}, {"Collector": "Brighid Ní Gaora", "Gender": "female", "Age": "12"}, {"Informant": "Tomás Gaora", "Relation": "parent", "Gender": "male", "Age": "64", "Occupation": "oibrí", "Address": "Rosmuck, Co. Galway"}, {"Language": "Irish"}]}, "4622969/4618378/4629287": {"title": "Orthaí", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0071, Page 205", "Page 205"], "url": "https://www.duchas.ie/en/cbes/4622969/4618378/4629287", "text": "", "school_info": "School: Leitirmealláin", "metadata": [{"Location:": "Lettermullan Island, Co. Galway", "Teacher:": "\nÉamonn Ó Gógáin\n"}, {"Collector": "Maighréad Ní Dhonnchadha", "Gender": "female", "Address": "Lettermullan Island, Co. Galway"}, {"Informant": "Nóra Bean Uí Bhreathnaigh", "Gender": "female", "Age": "56", "Occupation": "feirmeoir", "Address": "Lettermullan Island, Co. Galway"}, {"Language": "Irish"}]}, "4622979/4620065/4630010": {"title": "Araideacha agus Pisreoga", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0074, Page 618", "Page 618"], "url": "https://www.duchas.ie/en/cbes/4622979/4620065/4630010", "text": "\nAirid na h-arainneBean mhín ag fear borban t-eiriceach 'na luighe ar chluimh na n-eanAgus Mac Dé'na luighe sa gcolgTóg rúnne den cholg agus cuimil é dá bholgAgus béidh an t-eiriceach bocht slán.Araid an Leónta\"Cnáimh le cnáimh agus féith le féithÓ a fhéith go n-iontughir ar d'áit aríst.\" Araid Stopptha FolaGo feargach fiadhán bhí an t-uisgeAgus Íosa ceanamhail grádhamar naomhtha.\n(continues on next page)\n", "school_info": "School: Driseachán", "metadata": [{"Location:": "Drishaghaun, Co. Galway", "Teacher:": "\nNora Ní Mhaolchaoin\n"}, {"Collector": "Eibhlín Nic Allmhúráin", "Gender": "female", "Age": "14", "Address": "Cloghbrack Upper, Co. Galway"}, {"Language": "Irish"}]}, "4622979/4620067/4630011": {"title": "Araideacha agus Pisreoga", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0074, Page 620", "Page 620"], "url": "https://www.duchas.ie/en/cbes/4622979/4620067/4630011", "text": "\n(continued from previous page)\nAraid an RuaidhAraid na bhfiabhrias bheaga - Tinneas CinnAraid na bhfiabhrias bheaga - Tinneas CinnBhí Peadar Aspol fá bhun sgailpe, tháinig Íosa ós a chionn.\"Céard sin ort, a Pheadair Aspol?\" \"Ó a Íosa, mo cheann atá tinn.\"Droch ghalra do ghalra agus fiabhras, éirigh thusa a's bí slán.Ní tusa amhán ach gach neach.Naoi mbriathra a déarfaidh Íosa ós cionn do chinn.Tógfaidh díot do ghalra cinn.Araid an doith-fhiacalAraid na Teine DiaAraid na bhFiabhras Mailílseach\n", "school_info": "School: Driseachán", "metadata": [{"Location:": "Drishaghaun, Co. Galway", "Teacher:": "\nNora Ní Mhaolchaoin\n"}, {"Collector": "Áine Nic Sheóighe", "Gender": "female", "Age": "14", "Address": "Drishaghaun, Co. Galway"}, {"Language": "Irish"}]}, "4622979/4620067/4630012": {"title": "Araideacha agus Pisreoga", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0074, Page 620", "Page 620"], "url": "https://www.duchas.ie/en/cbes/4622979/4620067/4630012", "text": "\n(continued from previous page)\nAraid an RuaidhAraid na bhfiabhrias bheaga - Tinneas CinnAraid na bhfiabhrias bheaga - Tinneas CinnBhí Peadar Aspol fá bhun sgailpe, tháinig Íosa ós a chionn.\"Céard sin ort, a Pheadair Aspol?\" \"Ó a Íosa, mo cheann atá tinn.\"Droch ghalra do ghalra agus fiabhras, éirigh thusa a's bí slán.Ní tusa amhán ach gach neach.Naoi mbriathra a déarfaidh Íosa ós cionn do chinn.Tógfaidh díot do ghalra cinn.Araid an doith-fhiacalAraid na Teine DiaAraid na bhFiabhras Mailílseach\n", "school_info": "School: Driseachán", "metadata": [{"Location:": "Drishaghaun, Co. Galway", "Teacher:": "\nNora Ní Mhaolchaoin\n"}, {"Collector": "Cáit Nic Allmhúráin", "Gender": "female", "Age": "16", "Address": "Cloghbrack Upper, Co. Galway"}, {"Language": "Irish"}]}, "4622979/4620068/4630013": {"title": "Araideacha agus Pisreoga", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0074, Page 621", "Page 621"], "url": "https://www.duchas.ie/en/cbes/4622979/4620068/4630013", "text": "", "school_info": "School: Driseachán", "metadata": [{"Location:": "Drishaghaun, Co. Galway", "Teacher:": "\nNora Ní Mhaolchaoin\n"}, {"Collector": "Cáit Ní Briain", "Gender": "female", "Age": "11", "Address": "Illaunaveel, Co. Galway"}, {"Language": "Irish"}]}, "4622979/4620072/4630035": {"title": "Leigheasanna", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0074, Page 625", "Page 625"], "url": "https://www.duchas.ie/en/cbes/4622979/4620072/4630035", "text": "", "school_info": "School: Driseachán", "metadata": [{"Location:": "Drishaghaun, Co. Galway", "Teacher:": "\nNora Ní Mhaolchaoin\n"}, {"Collector": "Áine Nic Allmhúráin", "Gender": "female", "Age": "12"}, {"Informant": "Máire Nic Allmhúráin", "Gender": "female", "Age": "54", "Address": "Cloghbrack Upper, Co. Galway"}, {"Language": "Irish"}]}, "4622979/4620074/4630040": {"title": "Araideacha", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0074, Page 627", "Page 627"], "url": "https://www.duchas.ie/en/cbes/4622979/4620074/4630040", "text": "", "school_info": "School: Driseachán", "metadata": [{"Location:": "Drishaghaun, Co. Galway", "Teacher:": "\nNora Ní Mhaolchaoin\n"}, {"Collector": "Áine Nic Allmhúráin", "Gender": "female", "Age": "12"}, {"Informant": "Maoilsheachlainn Ó hAllmhúráin", "Gender": "male", "Age": "62", "Address": "Cloghbrack Upper, Co. Galway"}, {"Language": "Irish"}]}, "4623002/4622639/4630565": {"title": "Orthaí", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0080, Page 050", "Page 050"], "url": "https://www.duchas.ie/en/cbes/4623002/4622639/4630565", "text": "\nAr an leonadh:Nuair a leonas duine a láimh no a chos, téidheann sé ag an té a bhfuil an ortha aige. Le linn na h-orthaidhe a dhéanamh deireann -Fear feasa (nó an bhean) na foclí seo fá thrí! -\"An leonadh é seo?Ní headh ach gortúAn fear úd thall a goid na monadhTabhair uaim-se leath an leonadh.\"Ar thinneas cinnTomhaiseann an té aga mbíonn an ortha an ceann le sreang agus le linn an ama sin deireann sé na focla seo thíos -Orth a fuair Muire óna MacNuair a bhí a chorp as an uaigh ag eiséirigheTóig é, Pheadair, Tóig é, Phóil,Tóig é Abstoil tóig é EoinGo dtóigheh do leaca agus do linnAgus cnámha do chinn mar is cóir.\n", "school_info": "School: Sean-Chill", "metadata": [{"Location:": "Shankill West, Co. Galway", "Teacher:": "\nRiobárd Ó Conaill\n"}, {"Informant": "Bean Uí Dhiscín", "Gender": "female"}, {"Language": "Irish"}]}, "4602710/4597561/4631336": {"title": "Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0083, Page 033", "Page 033"], "url": "https://www.duchas.ie/en/cbes/4602710/4597561/4631336", "text": "", "school_info": "School: Druim an t-Seagail", "metadata": [{"Location:": "Ryehill Demesne, Co. Galway", "Teacher:": "\nMáire Ní Eimhirín, Seosamh P. Ó hUigín, Áine Ní Uigín\n"}, {"Collector": "Francis O' Connor", "Gender": "male", "Age": "14", "Address": "Crooroe Park, Co. Galway"}, {"Informant": "Tom O' Connor", "Gender": "male", "Age": "55", "Address": "Crooroe Park, Co. Galway"}, {"Language": "English"}]}, "4602710/4597562/4631337": {"title": "Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0083, Page 034", "Page 034"], "url": "https://www.duchas.ie/en/cbes/4602710/4597562/4631337", "text": "\nTed Fahy of Belleville, Athenry, was able to cure headaches.Mary Forde of Currafaineen who suffered frightfully from headaches was cured after visiting him.He worked the charm by measuring the head both ways, with a woollen thread.\n", "school_info": "School: Druim an t-Seagail", "metadata": [{"Location:": "Ryehill Demesne, Co. Galway", "Teacher:": "\nMáire Ní Eimhirín, Seosamh P. Ó hUigín, Áine Ní Uigín\n"}, {"Collector": "Fran O' Connor", "Gender": "male", "Age": "14", "Address": "Crooroe Park, Co. Galway"}, {"Informant": "John O' Connor", "Gender": "male", "Age": "55", "Address": "Crooroe Park, Co. Galway"}, {"Language": "English"}]}, "4602710/4597563/4631339": {"title": "Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0083, Page 035", "Page 035"], "url": "https://www.duchas.ie/en/cbes/4602710/4597563/4631339", "text": "\nCharms                        25/3/38Mrs Maher of (?), Athenry used to cure colds by tying a bone of a dead calf around the neck of the sick person, telling them to wear it for a month.  She was 80 yrs when she died.Collected by Bridie Mc Grath (13 yrs)BallyskeaghTold byPaddy Flaherty (50 yrs)Ballyskeagh(?)\n", "school_info": "School: Druim an t-Seagail", "metadata": [{"Location:": "Ryehill Demesne, Co. Galway", "Teacher:": "\nMáire Ní Eimhirín, Seosamh P. Ó hUigín, Áine Ní Uigín\n"}, {"Collector": "Bridie Mc Grath", "Gender": "female", "Age": "13", "Address": "Ballyskeagh, Co. Galway"}, {"Informant": "Paddy Flaherty", "Gender": "male", "Age": "50", "Address": "Ballyskeagh, Co. Galway"}, {"Language": "English"}]}, "4602710/4597564/4631342": {"title": "Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0083, Page 036", "Page 036"], "url": "https://www.duchas.ie/en/cbes/4602710/4597564/4631342", "text": "\nCharms    1/4/38Patrick Flaherty, of Ballyskeagh (?)  used to cure ring worm by saying some magical words over the sick person, and making him hold a week-old oatmeal cake in his hand for ten minutes.Collected by Teresa Mc Grath  (15 yrs)Ballyskeagh(?)N.B.  (?) Flaherty is now dead and was 60 yrs old when he died.\n", "school_info": "School: Druim an t-Seagail", "metadata": [{"Location:": "Ryehill Demesne, Co. Galway", "Teacher:": "\nMáire Ní Eimhirín, Seosamh P. Ó hUigín, Áine Ní Uigín\n"}, {"Collector": "Teresa Mc Grath", "Gender": "female", "Age": "57", "Address": "Ballyskeagh, Co. Galway"}, {"Informant": "Paddy Flaherty", "Gender": "male", "Age": "50", "Address": "Ballyskeagh, Co. Galway"}, {"Language": "English"}]}, "4602710/4597565/4631343": {"title": "Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0083, Page 037", "Page 037"], "url": "https://www.duchas.ie/en/cbes/4602710/4597565/4631343", "text": "", "school_info": "School: Druim an t-Seagail", "metadata": [{"Location:": "Ryehill Demesne, Co. Galway", "Teacher:": "\nMáire Ní Eimhirín, Seosamh P. Ó hUigín, Áine Ní Uigín\n"}, {"Collector": "Willie Tannion", "Gender": "male", "Age": "37", "Address": "Roundfield, Co. Galway"}, {"Informant": "Mrs S. Tannion", "Gender": "female", "Age": "55", "Address": "Roundfield, Co. Galway"}, {"Language": "English"}]}, "4602710/4597566/4631348": {"title": "Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0083, Page 038", "Page 038"], "url": "https://www.duchas.ie/en/cbes/4602710/4597566/4631348", "text": "", "school_info": "School: Druim an t-Seagail", "metadata": [{"Location:": "Ryehill Demesne, Co. Galway", "Teacher:": "\nMáire Ní Eimhirín, Seosamh P. Ó hUigín, Áine Ní Uigín\n"}, {"Collector": "John Coen", "Gender": "male", "Age": "12", "Address": "Farravaun, Co. Galway"}, {"Informant": "John Coen", "Gender": "male", "Age": "50", "Address": "Farravaun, Co. Galway"}, {"Language": "English"}]}, "4613716/4611783/4643276": {"title": "Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0406, Page 041", "Page 041"], "url": "https://www.duchas.ie/en/cbes/4613716/4611783/4643276", "text": "\nIf you have warts rub your fasting spit to them for nine mornings in succession and they will go away.If you have warts steal a piece of meat from the butcher and bury it in the dunghill. When the meat begins to rot the warts will rot also.If you have warts rub the water that lodges in the hollow of a limestone to them three times making the sign of the cross each time and the warts will go.If you have warts place a small bag of salt outside somebody's door. Whoever picks up the bag will get the warts.If you have a sty in your eye rub your mother's gold ring to it for nine mornings in succession and it will go away.If you have a 'stitch' in your side from running spit under a flat stone and the pain will go.\n(continues on next page)\n", "school_info": "School: Liostuathail (B.) 1.", "metadata": [{"Location:": "Listowel, Co. Kerry", "Teacher:": "\nSéamus Ó Haodha\n"}, {"Collector": "Tadhg Ua Conchubhair", "Gender": "male", "Address": "Listowel, Co. Kerry"}, {"Language": "English"}]}, "4644827/4612919/4649917": {"title": "Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0408, Page 058", "Page 058"], "url": "https://www.duchas.ie/en/cbes/4644827/4612919/4649917", "text": "\nLong ago some of the old people had charms. The greatest of these charms was the stopping of blood. There was a man living in this district, and he had powerful charms. He was able to stop blood. One day a man came to him to cure his wife for she was bleeding from the nose. He said some words and when he had the words said he told the man to go home that his wife was cured and that he would call to see her the next day. The man went home and his wife was cured and it was just at that moment the words were said the blood stopped. The man called next day to see the woman and she was very weak. When he went in the priest was inside for her had come to anoint her. The priest asked the man why he was working the charms, as it was a very wrong thing to do. He was very vexed with him, because he knew that the man had to stop going to Mass and to the sacraments. So the man said to him \"I have cured this woman's body now, and you can cure\n(continues on next page)\n", "school_info": "School: An Drom Clochach (B.)", "metadata": [{"Location:": "Dromclogh, Co. Kerry", "Teacher:": "\nPártholán Ó Ruadhacháin\n"}, {"Collector": "Patt Mc Elligott", "Gender": "male", "Address": "Banemore, Co. Kerry"}, {"Informant": "John Mc Elligott", "Gender": "male", "Age": "50", "Address": "Banemore, Co. Kerry"}, {"Language": "English"}]}, "4644827/4612946/4650004": {"title": "Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0408, Page 085", "Page 085"], "url": "https://www.duchas.ie/en/cbes/4644827/4612946/4650004", "text": "\nLong ago when my Grandmother was a young girl there was some kind of charm or witchcraft worked by some old people. All the farmers at that time made their own butter as there were no creameries and some wicked people were able to take away by witchcraft their neighbour's butter. This was nearly always worked on May morning. Those old women would go out to their neighbours' cows before the sun rose on May morning and take a sheet with them and wave it over the cows and say some words. It happened on May day a young student was at a party all night at a friends house and was returning home just as the day dawned on May day. He spied an old woman up on a fence looking in at her neighbour's cows. She had a white sheet and she waved it over them (saying) saying at the same time, \"give half your butter to me.\" The student hid and she could not see him. He did not understand what she meant and when she said \"give half your butter to me he said after \"give\n(continues on next page)\n", "school_info": "School: An Drom Clochach (B.)", "metadata": [{"Location:": "Dromclogh, Co. Kerry", "Teacher:": "\nPártholán Ó Ruadhacháin\n"}, {"Collector": "Patt Mc Elligott", "Gender": "male", "Address": "Banemore, Co. Kerry"}, {"Informant": "John Mc Elligott", "Gender": "male", "Age": "50", "Address": "Banemore, Co. Kerry"}, {"Language": "English"}]}, "4666574/4663294/4668035": {"title": "Charm - Cure for Bad Liver", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0401, Page 090", "Page 090"], "url": "https://www.duchas.ie/en/cbes/4666574/4663294/4668035", "text": "\nAt twelve o'clock at night commence making butter in a bottle. The person who sets this charm while fasting gives piece of the butter next morning to the sick person while fasting after saying some prayers over him.It is very unlucky to pull dandelion from the roots during May. The roots of dandelion when boiled or brewed are a cure for a bad liver. Once a person wanted this cure but would not pull the dandelion because it was May. So they got the cock and put her claws around the roots and pulled it that way. That night the cock fell off his perch and was killed.\n", "school_info": "School: Baile an Bhunánaigh (B.)", "metadata": [{"Location:": "Ballybunnion, Co. Kerry", "Teacher:": "\nP. Ó Hailin\n"}, {"Language": "English"}]}, "4672088/4669106/4678465": {"title": "A Charm", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0164, Page 062", "Page 062"], "url": "https://www.duchas.ie/en/cbes/4672088/4669106/4678465", "text": "\nMy Grandmother has a charm for a head-ache. Every one around the village go to her and get cured. She can tell whither you have a big pain or not. She knows how many inches your head is opened with pain. She gets a piece of tape and measures your head from the back to your nose, and from the top of your head, to your chin. She repeats strange words while doing so. There are special days for getting cured, namely Monday, Wednesday, and Friday. You have to go those days to get your head measured. The cure will not be made, unless  you give her some payment such as tobacco, sweets or oranges or anything. \"Some that come to her,\" she says \"their heads are like sponge with pain.\"\n", "school_info": "School: Enniscrone (G.)", "metadata": [{"Location:": "Inishcrone, Co. Sligo", "Teacher:": "\nBean de Búrca\n"}, {"Collector": "Annie Mullany", "Gender": "female", "Age": "12"}, {"Language": "English"}]}, "4678395/4676232/4682903": {"title": "Maiden Without Hands", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0423, Page 044", "Page 044"], "url": "https://www.duchas.ie/en/cbes/4678395/4676232/4682903", "text": "\n(continued from previous page)\nanuas den rann í agus dop chuir sé isteach sa bhlaincéad í agus chuir se anáirde ar a dhrom í agus thug sé go dtí an Óispidéal í. Taréis blaidhna nó  m [?] sin tháinig feabas uirthi agus tháinig sí féin ag an buachaill ainmsire abhaile agus do phósadar ag [?] do dheineadar an t-athair do loghadh.\n\n\n\n[-]\n(continues on next page)\n", "school_info": "School: Ceann Trágha (Ventry)", "metadata": [{"Location:": "Ventry, Co. Kerry", "Teacher:": "\nDonncha Ó Cúrnáin\n"}, {"Informant": "Pádraig Ó Lubhaing", "Gender": "male", "Age": "78", "Occupation": "feirmeoir", "Address": "Kilcolman, Co. Kerry"}, {"Language": "Irish"}]}, "4687700/4685275/4688540": {"title": "An Buachaillín Óg", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0430, Page 003", "Page 003"], "url": "https://www.duchas.ie/en/cbes/4687700/4685275/4688540", "text": "", "school_info": "School: Achadh Caisle,  Caisleán Ghriaire", "metadata": [{"Location:": "Aughacasla North, Co. Kerry", "Teacher:": "\nS. Ó Téacháin\n"}, {"Collector": "S. Ó Téacháin", "Gender": "unknown", "Occupation": "múinteoir"}, {"Informant": "Domhnall Ó Curnáin", "Gender": "male", "Address": "Inchaloughra, Co. Kerry"}, {"Language": "Irish"}]}, "4706347/4704789/4713580": {"title": "Local Cures", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0445, Page 097", "Page 097"], "url": "https://www.duchas.ie/en/cbes/4706347/4704789/4713580", "text": "\n(continued from previous page)\nCure for Eczema :-Goat's milk.Cure for chillblains :-A roasted onion.Cure for Wicklow :-The tissue of an egg.\n\n\n\nCertain people possess charms such as the seventh daughter or son. The seventh son is always called \"Doctor\". The child who never saw his father has a cure in its breath.There was a certain charmer named \"Seán Fleb.\" People used to come from all over the country to him. When he wanted to perform a charm he used to curse and swear and call the fairies.\n", "school_info": "School: Currans (C.)", "metadata": [{"Location:": "Currans, Co. Kerry", "Teacher:": "\nNóra, Bean Uí Bhraoin\n"}, {"Language": "English"}]}, "4713263/4712895/4758438": {"title": "Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0458, Page 076", "Page 076"], "url": "https://www.duchas.ie/en/cbes/4713263/4712895/4758438", "text": "\nCharmsSixty or seventy years ago 'quack' doctors for special diseases were very common in Co Kerry. The people believed that each 'doctor' had a charm for his own special disease and what strengthened this belief was the fact that the ingredients used in the cure were kept an absolute secret by the curers. The cure was supposed to be kept in the family and was transferred from father to son. When there was no male issue the cure died out.           These curers were not confined to human beings:  cattle & horses were also cured by animal \"doctors\" but there were much more common than the others.            People often travelled 15 or 20 miles to get cured of\n(continues on next page)\n", "school_info": "School: Faithche (B.)", "metadata": [{"Location:": "Faha West, Co. Kerry", "Teacher:": "\nSeán Ó Muircheartaigh\n"}, {"Informant": "Eugene Moriarty", "Gender": "male"}, {"Language": "English"}]}, "4758476/4747254/4779997": {"title": "Herbal Remedies", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0250, Page 273", "Page 273"], "url": "https://www.duchas.ie/en/cbes/4758476/4747254/4779997", "text": "\nCow Pox - Roots of Dandelion  Bruised & boiled on milk. apply to sores. Miraculous cure37. Herbal Remedies Fairy Flax.  (womens' ailments) Wall Ivy  (Bladder Troubles) Bog Bane.  (Cure for looseness of Bowels) Garlic  (Colds etc, worms in children) must be sown on Lady Day (25 Mar) and pulled on Lady Day  15 Aug. Comfry (?) Swelling or pain reduced by bathing in C. water St Patrick's leaf. (with veins removed - cure for cuts.)  Plantain ?\n\n\n\nLock of Hair. on top of head pulled for cure of dumb person.Thorns of Gooseberry Bush. for stye in eye.Straining Thread - made by families for sprain on hand or ankle (Murrays', local makers in old days here)Seventh son - cure for ringworm; worm must die on his hand when cure is present.Wedding ring - cure for King's evilPerson born feet first - cure for backache - walks on patient.\"Caul\" or cap on baby when born - saves life at sea etc.Red rag on cow's tail - prevents \"overlooking\" by \"evil eye\"Walking backwards - cure for headache.\n", "school_info": "School: Cluain Uí Chuinn", "metadata": [{"Location:": "Cloonyquin, Co. Roscommon", "Teacher:": "\nMícheál Mac Floinn\n"}, {"Language": "English"}]}, "4758476/4747261/4780025": {"title": "Folk Prayers - Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0250, Page 280", "Page 280"], "url": "https://www.duchas.ie/en/cbes/4758476/4747261/4780025", "text": "\n46A. Folk Prayers - Charms.There are no folk prayers existing in this district but charms are by no means gone.(1) The \"straining thread,\" a thin thread of hemp made with certain prayers, now lost, is usually kept for a cure for sprains + strains Not every one made them, a local weaver named Murray used to make them. He is dead thirty years or so.(2) Cows put out to grass in summer still wear a piece of red cloth tied around the tail. This was for the \"evil eye.\"(3) When a calf dies from black leg a knuckly bone is cut out and put in the  chimney. This prevents the other stock from taking the complaint.(4) The thorn of a gooseberry bush is picked off and pointed nine times at a stye in the eye without touching the eye. It is believed in very much.(5) The seventh son had the power of curing ringworm. Now people know of this power in the child was to place a live worm in the child's hand. If the cure was present the worm convulsed and died A gold wedding ring was often worn for the same cure.\n(continues on next page)\n", "school_info": "School: Cluain Uí Chuinn", "metadata": [{"Location:": "Cloonyquin, Co. Roscommon", "Teacher:": "\nMícheál Mac Floinn\n"}, {"Informant": "M Mc Glynn", "Age": "45", "Address": "Killynagh More, Co. Roscommon"}, {"Language": "English"}]}, "4758497/4748768/4780588": {"title": "Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0844, Page 187", "Page 187"], "url": "https://www.duchas.ie/en/cbes/4758497/4748768/4780588", "text": "\n1. Bury three straws and while the straws wither a wart will wither off.2. If a cow has a sore leg dig a sod in the field and the leg will cure.3. If you had a wart on your leg get two bits of straw cross them and make the sign of the Cross and bury the straws and the wart will fall off.4. If you had a sore get a piece of hay and put it on it and then bury it and the sore will heal.5. If you cut your hair and a bird to get a rib of it you would never have a pain in your head again.6. Bury a rabbit's foot and it will cure a\n(continues on next page)\n", "school_info": "School: Slieverue", "metadata": [{"Location:": "Slieveroe, Co. Kilkenny", "Teacher:": "\nJohn Carey\n"}, {"Collector": "Stás Ní Mhórdha", "Gender": "female", "Address": "Rathpatrick, Co. Kilkenny"}, {"Language": "English"}]}, "4798653/4787212/4818762": {"title": "Folk Prayers, Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0232, Page 106", "Page 106"], "url": "https://www.duchas.ie/en/cbes/4798653/4787212/4818762", "text": "\nThe folk prayers or charms used in connection with the various cures - cancer, head fever, heart fever, mote in the eye, cattle diseases, ring worm etc. are the only folk prayers or charms said now. \"In the name of the Father, Son and Holy Ghost\" is the usual one.The Irish people in this district always prayed for the dead. \"Pater and Ave\" for grandfathers etc.The rosary was usually ended with the words \"Let us pray for our grandfathers and grandmothers, uncles and aunts, brothers and sisters, friends and relations and all the poor creatures that have no one to pray for them.\"Hail, Thou gate of Paradise - Star-pale portal of the skiesUnto thee, we lift our eyes\n", "school_info": "School: Leamh-choill", "metadata": [{"Location:": "Drumsillagh, Co. Roscommon", "Teacher:": "\nCáit Ní Ghadhra\n"}, {"Language": "English"}]}, "4798666/4788451/4823739": {"title": "Charms, Superstitions, Omens, Spells", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0238, Page 119", "Page 119"], "url": "https://www.duchas.ie/en/cbes/4798666/4788451/4823739", "text": "\n119Charms, Superstitions, Omens, Spells.I always put my trust in God for everything and I hope He will always do good for me if I am deserving of it. I myself can never foreshadow anything whether good (or evil) until it actually happens.But there are old people in my locality who say that they can see into he future by certain signs. Contrary to the teaching of the Church it is not only difficult but it is impossible to try to convince them not to give any credit to such superstitions.Some of them can see good or evil in almost everything and hereunder are a few of their beliefs. For instance, on New year's day, they say if one meets a red-haired person one will not have any luck for the rest of the year, but if it is a black-haired person the meeting news, is lucky.A person going on a journey never wished to meet a woman first because if a person does they shall have no luck.The cry of cats and dogs are the sign of death especially at night.If you chance to get two teaspoons in your tea cup when you are drinking it is said you will be at a wedding soon.On May-day they say it is not lucky\n(continues on next page)\n", "school_info": "School: Cloonmagunnane", "metadata": [{"Location:": "Cloonmagunnaun, Co. Roscommon", "Teacher:": "\nT. Rogers\n"}, {"Language": "English"}]}, "4742100/4735876/4925564": {"title": "Orthaí - Ortha na Farraige", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0468, Page 341", "Page 341"], "url": "https://www.duchas.ie/en/cbes/4742100/4735876/4925564", "text": "", "school_info": "School: Fearann Iarthach", "metadata": [{"Location:": "Farraniaragh, Co. Kerry", "Teacher:": "\nSeán Ó Murchadha\n"}, {"Informant": "Partalán Ó Gealbháin", "Gender": "male"}, {"Language": "Irish"}]}, "4742100/4735876/4925565": {"title": "Orthaí - Ortha na Farraige", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0468, Page 341", "Page 341"], "url": "https://www.duchas.ie/en/cbes/4742100/4735876/4925565", "text": "", "school_info": "School: Fearann Iarthach", "metadata": [{"Location:": "Farraniaragh, Co. Kerry", "Teacher:": "\nSeán Ó Murchadha\n"}, {"Informant": "Partalán Ó Gealbháin", "Gender": "male"}, {"Language": "Irish"}]}, "4798685/4790079/4927864": {"title": "Folklore", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0242, Page 122", "Page 122"], "url": "https://www.duchas.ie/en/cbes/4798685/4790079/4927864", "text": "\n(continued from previous page)\nTwo miles to the west of bloonrow Bridge is the monastery of Orlar, a dominican abbey founded in 1434. The lands formerly in possession of the monks are now owned by Mr Sharkey, grand nephew of the last abbot of Orlar, Friar Sharkey.\n\n\n\nCharms.To increase the supply of ButterBy use of the dead hand.This is a story told by Mary Ryan of GorthagannyA carpenter was working at his trade in distant Gavrane near Kilkenny. Evening came and it was time for him to leave for home. Night came terribly wet and stormy, so the carpenter was easily persuaded to remain in the house for the night. He was given a shake - down or temporary bed which was set up in the kitchen.He could not sleep, and the night was wearing out. Suddenly the man and wife who owned the house came down from the bedroom with a candle. They satisfied themselves that their guest was \"asleep\" and proceeded to make a churning.When the churning was made the lady muttered some words in the dish - a prayer that she would get all the butter on the other\n(continues on next page)\n", "school_info": "School: Gort an Ghainimh", "metadata": [{"Location:": "Gortaganny, Co. Roscommon", "Teacher:": "\nM. Ó Cobhthaigh\n"}, {"Language": "English"}]}, "4921974/4914622/4938349": {"title": "Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0491, Page 264", "Page 264"], "url": "https://www.duchas.ie/en/cbes/4921974/4914622/4938349", "text": "\nCharmsMany people were able to set charms long ago. Dan Dore of Ballyowen used cure many people by charms. When dogs used go mad and bite people Dan Dore had a charm that would cure the bitten person. My father was bitten by a mad dog and he was cured by a charm set by Dore. Dan Dore used set the charm by keeping his own cows milk inside and letting it set to make butter of it. The person who wanted to be cured should go to him three mornings fasting and take a bit of the butter. In a bottle he used make this butter and he put no salt in it.He used not charge any money but he used tell the person he cured to give a few pence to the next poor man he would meet. He used to say words over the butter. Children that were bitten by a mad dog used go mad and if they did not seek a cure by a charm it was customary to smother them between two ticks of feathers.Ita Sexton\n(continues on next page)\n", "school_info": "School: Móin na nGé (C.), An Caisleán Nua", "metadata": [{"Location:": "Rahanagh, Co. Limerick", "Teacher:": "\nMáire, Bean Uí Eachtigheirn\n"}, {"Collector": "Ita Sexton", "Gender": "female", "Address": "Camas, Co. Limerick"}, {"Informant": "Pat Sexton", "Relation": "parent", "Gender": "male", "Age": "circa 53", "Occupation": "thatcher", "Address": "Camas, Co. Limerick"}, {"Language": "English"}]}, "4921939/4911629/4941385": {"title": "Local Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0482, Page 069", "Page 069"], "url": "https://www.duchas.ie/en/cbes/4921939/4911629/4941385", "text": "\nLocal Charms.(The following cure charms were given to me by Michael Connolly, Baranique, Carrickerry, aged 70 years, who spent his life in the locality).For the cure of farsi in horses, people of this locality believe in charms as cures.  There was a man living near Rathkeale some years ago, who practiced these \"cures\", and to whom some people brought their horses.  His name was Delmege, and was a Palatine.Some ten or fifteen years ago, a man named Wrenn of Knockfinisk, Athea, took a horse suffering from farsi to this Mr. Delmege.  it was necessary in order to work the \"cure\", that the horse should be taken to him nine mornings in succession, and before the sun would rise.  This man of the Wrenns \"who lives yet\" took his horse for nine mornings before sunrise.  After the first or second morning the horse used to trot away before him, as is he were anxious, and in a hurry for the journey.On the final morning when the \"cure\" was completed Mr. Delmege told Wrenn that he should now \"put\" the ailment on some other animal, and asked him what animal in his home should he put it on.\n(continues on next page)\n", "school_info": "School: Cluain Leith Áird", "metadata": [{"Location:": "Glenbaun, Co. Limerick", "Teacher:": "\nMáirtín de Barra\n"}, {"Informant": "Michael Connolly", "Gender": "male", "Age": "70", "Address": "Bauraneag, Co. Limerick"}, {"Language": "English"}]}, "4921965/4914093/4942439": {"title": "Cures", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0489, Page 073", "Page 073"], "url": "https://www.duchas.ie/en/cbes/4921965/4914093/4942439", "text": "\nThe old people used to have great belief in their fasting spit to cure anything.If a person was sick the people would bring an old woman into the house to set a charm.\n\n\n\nOne day a man got a charm to cure his toothache. He offered the charm when the toothache was gone. This is what was written on the piece of paper \"good-by toothache until we meet in hell.\" When he opened it the toothache came again\n\n\n\nOne day for recreation quite easy in my\n(continues on next page)\n", "school_info": "School: Cill Laichtín, An Caisleán Nua", "metadata": [{"Location:": "Killaghteen, Co. Limerick", "Teacher:": "\nNioclás Breathnach\n"}, {"Informant": "Mrs Hanly", "Gender": "female", "Address": "Barnagh, Co. Limerick"}, {"Language": "English"}]}, "4921965/4914102/4942463": {"title": "A Charm", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0489, Page 082", "Page 082"], "url": "https://www.duchas.ie/en/cbes/4921965/4914102/4942463", "text": "\nOne day a man got a charm to cure his toothache. He opened the charm when the toothache was  gone. This was what was written on the piece of paper \"good- ye toothache until we meet in hell. When he opened the charm the toothache came again.\n\n\n\nOne day for recreation quite easy in my mind.The fields around were brightly crowned with flowers of every kind,About midday I chanced to stray down by the rippling rill.And as I passed I met a lass at the foot of Rooska hill.\n", "school_info": "School: Cill Laichtín, An Caisleán Nua", "metadata": [{"Location:": "Killaghteen, Co. Limerick", "Teacher:": "\nNioclás Breathnach\n"}, {"Informant": "Mrs Hanly", "Gender": "female", "Address": "Barnagh, Co. Limerick"}, {"Language": "English"}]}, "4922203/4860323/4946255": {"title": "Charms and Superstitions", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0551, Page 222", "Page 222"], "url": "https://www.duchas.ie/en/cbes/4922203/4860323/4946255", "text": "\n[-]\n(continues on next page)\n", "school_info": "School: Cill na Coille (Kilemakill), An Teampoll Mór", "metadata": [{"Location:": "Kilmakill, Co. Tipperary", "Teacher:": "\nCáit, Bean Uí Gríobhta\n"}, {"Informant": "Pat Purcell", "Gender": "unknown", "Address": "Kilmakill, Co. Tipperary"}, {"Language": "English"}]}, "4922203/4860325/4946257": {"title": "Charms and Superstitions", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0551, Page 224", "Page 224"], "url": "https://www.duchas.ie/en/cbes/4922203/4860325/4946257", "text": "\n(continued from previous page)\nin in most houses some amount of calcannon used to be left for the \"pooka\"\n\n\n\n4. Some old people will lnot anyone a cllutch of eggs. They will a present of them alright but a penny must be given to them in exchange this penny is taken So that the person who gets the eggs will not take away the good of the other persons hens.\n(continues on next page)\n", "school_info": "School: Cill na Coille (Kilemakill), An Teampoll Mór", "metadata": [{"Location:": "Kilmakill, Co. Tipperary", "Teacher:": "\nCáit, Bean Uí Gríobhta\n"}, {"Collector": "Joseph Griffin", "Gender": "male", "Address": "Kilmakill, Co. Tipperary"}, {"Informant": "Mrs Doheny", "Gender": "female", "Address": "Kilmakill, Co. Tipperary"}, {"Language": "English"}]}, "4742093/4735109/4947759": {"title": "Céad Míle Fáilte Roimh Uan Dílis Dé", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0466, Page 333", "Page 333"], "url": "https://www.duchas.ie/en/cbes/4742093/4735109/4947759", "text": "\n(continued from previous page)\nNuair a bheann[?] ar ár gcúl ins an úir a thabhiart an fhéir go ndeinir slíghe dhúinn gan cúncas i gcúirt i bhFlaithis Dé.\n\n\n\nFear ar lorg an chapaill agus an capall fé n-a thóin.Dá fhaid é an lá 'sé dán na hoidhche teacht.\"Aithnightear duine ar a dhéirch.\"\"Ní raibh mór riamh ná beadh beag.\"\"I ndiaidh na comhaoine bíonn an grádh.\"\n\n\n\nOrtha i nAghaidh an tsluagh sidhe.Gabhaimid le na gcoimirce Is diultaimíd dá n-imirt;A gcúl linn is a n'aghaidh úainnAs ucht páiste is báis.Ár SlánuitheóraOrtha eile a n-Aghaidh na SídhA Mhic Dé, a gcluin tú an gleó so cúgainn go mór san nGleann!\n(continues on next page)\n", "school_info": "School: Lóthar", "metadata": [{"Location:": "Loher, Co. Kerry", "Teacher:": "\nB. Ní Mheidhre\n"}, {"Collector": "Siobhán Ní Chonaill", "Gender": "female", "Address": "Shanaknock, Co. Kerry"}, {"Language": "Irish"}]}, "4742093/4735110/4947760": {"title": "Ortha in aghaidh an tSlua Sí", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0466, Page 334", "Page 334"], "url": "https://www.duchas.ie/en/cbes/4742093/4735110/4947760", "text": "\n(continued from previous page)\nCluinn, a mháthair, ná bíodh eagla ort:Go sábháile Día an tAthair beannuithe sinn;Go mba dún daingean an dún a bhfuilmíd ann;Go mba slúagh dall an slúag dall an slúagh seo chúgainn.Ó a Íosa Críost agus a mhaighdean glórmharÁ chíos ár ndochas agus ár ndíobhailGo sgara tú do chochal beannuithe tharainn - Amen\n\n\n\nOrtha ó Oileán Manan i nAghaidh an tSluagh aeraighSith Día agus sith dhaoineSith Dhia agus Colm CilleAr gach uinneog, ar gach dorus Ar gach uile poll góbhail isteach ré soluis Ar cheithre coirnéil a tigheAr a bhaile tá mé mo luighe,Agus sith Día orm péin\n", "school_info": "School: Lóthar", "metadata": [{"Location:": "Loher, Co. Kerry", "Teacher:": "\nB. Ní Mheidhre\n"}, {"Collector": "Siobhán Ní Chonaill", "Gender": "female", "Address": "Shanaknock, Co. Kerry"}, {"Language": "Irish"}]}, "4922014/4918256/4948204": {"title": "Charm", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0501, Page 256", "Page 256"], "url": "https://www.duchas.ie/en/cbes/4922014/4918256/4948204", "text": "\nCharm.Long ago in the district of Coolcappa near where the ruins of Carnacilla castle now stands, there lived a woman who used several charms to take milk from other peoples cows.  She was suspected by several peopleOne evening as three or four workmen were returning from work, with their spades on their shoulders, they met this woman.  As she was passing them, one of them noticed a long briar stuck to her skirt, and trailing after her.One of the men slipped the spade off his shoulders, and cut the briar in two.  To their amazement pure new milk ran out of the briar on the road.Writtem By Patrick Foley,Reens, Rathkeale.\n", "school_info": "School: Coolcappa, Árd-achadh", "metadata": [{"Location:": "Coolcappagh, Co. Limerick", "Teacher:": "\nBríd Ní Shíthigh\n"}, {"Collector": "Patrick Foley", "Gender": "male", "Address": "Reens, Co. Limerick"}, {"Language": "English"}]}, "4922265/4865549/5054951": {"title": "Cure for Warts", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0572, Page 314", "Page 314"], "url": "https://www.duchas.ie/en/cbes/4922265/4865549/5054951", "text": "\nCure for warts. Keep a knot of washing soda in your pocket and every time you think of it, wet the warts and rub on the W.soda and the warts will soon wear away.If you find a snail without looking for it put it to the warts, put the snail up on a bush and as the snail withers the warts will be withering too. You should not let anyone know where the snail was.Get a person to count your warts and that person will take them.Count your warts , put the same number of stones into a paper and throw them on the road. Whosoever picks them up will get the warts.\n\n\n\nÓrtha Trom Luighe.Mar a luighfinn sa leabhaid'S luighfinn sa uaigh. Iarraim asblóid ort-sa a Íosa Chríost, A Mhuire ro-mheidhreach a Mhaighdean ró-glórmhar go dtugad dom solas nó soillse ag radharc na dtríonóide.\n\n\n\nÓrtha na Fola. Cé sháigh an tsleagh ?Dillín. Cad do tháinigh as ? Thainigh fuil, fíon agus trocaire. In the name of Patrick, stad an fhuil. In ainm an Athair agus an Mhic agus an Spriod Naomh   Amen\n", "school_info": "School: An Churrach (Crogh), Árd Fhionáin", "metadata": [{"Location:": "Curragh, Co. Tipperary", "Teacher:": "\nMícheál Ó Dubhshláine\n"}, {"Informant": "Éamon Ó Corbán", "Gender": "male", "Address": "Knockballiniry, Co. Tipperary"}, {"Language": "Irish"}]}, "5008864/4962082/5078104": {"title": "Unpublished Song", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0674, Page 142", "Page 142"], "url": "https://www.duchas.ie/en/cbes/5008864/4962082/5078104", "text": "\n(continued from previous page)\nIIAs I was going past the windmill there came four and twenty meeting menThey were loose to the waist and the ball was with them most gallantly.I made a few bold dashes at the stoutest hero in my view,But soon I was upsetted by a red haired boy who ran at me,I arose in a great fury, to make havoc on the train.But I was raised with foot and shoulder by a red-haired boy who ran at me.\n\n\n\nThere is supposed to be a stone coffin on Fieldstown hill. Francis Mac Quillan is supposed to have seen the fairy hunt going across the hollow at the foot of Cartown hill\n\n\n\nPassing a child under a donkey three times is supposed to cure the whooping cough. There are hungry sods in certain fields and\n(continues on next page)\n", "school_info": "School: Kellystown, Dunleer", "metadata": [{"Location:": "Kellystown, Co. Louth", "Teacher:": "\nBean Uí Chathail\n"}, {"Language": "English"}]}, "5044809/5040585/5084150": {"title": "Folk Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0970, Page 173", "Page 173"], "url": "https://www.duchas.ie/en/cbes/5044809/5040585/5084150", "text": "\nRingworm1. Putting the middle finger of the right hand to the ground three times, saying while doing so \"In the name of the father and of the son and of the Holy Ghost. 2. Face SorePutting a 'fasting' spit on the sore - saying while doing so \"In the name of the Father etc.\" for 9 mornings.3. \"Derub\" in Cattle.People used to collect and light a fire at \"St Mogues\"!! Well in Derrintinney in the saints ' feast day Each person took a stick (burnt or [?]) out of this fire to cure the above disease in cattle. 4. Whooping Cough.Putting people through a Cord called the Blessed Cord three times. A couple, who had the same family name, before their marriage are supposed to have the cure of above, each family  using their own respective formula.5. MumpsPut reins on a person & drive them around the inside of a byre or pig-house. 6. \"Good Luck\".Any person, who burns a piece of a rowan tree on May morning and keeps it in his house, during the year, will have good luck.\n(continues on next page)\n", "school_info": "School: Drumkerl", "metadata": [{"Location:": "Drumkerril, Co. Cavan", "Teacher:": "\nMl. Mac Aoidh\n"}, {"Language": "English"}]}, "5070743/5058932/5091986": {"title": "Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0987, Page 054", "Page 054"], "url": "https://www.duchas.ie/en/cbes/5070743/5058932/5091986", "text": "\nOnly a certain man has the charm. He stands on a chain in the yard in the vicinity of byres, dwelling house etc, holding apiece of paper (ordinary paper as used for letter writing) in his hand. He says certain words, known only to himself. All the rats gather round him. He gives  the piece of paper to one of the rats. This rat holding the piece of paper leads all the other rats to some other house. He cannot send them across a burn or a stream. This is called \"Billeting Rat.\"\n\n\n\nWhen people are leaving a house, and they wish ill-luck and misfortune on the incomers, they collect a number of white stones which they burn (in the ordinary fire) The ashes is not thrown out.\n", "school_info": "School: Kilcogey (?)", "metadata": [{"Location:": "Kilcogy, Co. Cavan", "Teacher:": "\n-\n"}, {"Language": "English"}]}, "5070822/5067482/5098452": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1011, Page 167", "Page 167"], "url": "https://www.duchas.ie/en/cbes/5070822/5067482/5098452", "text": "\n(continued from previous page)\nher across the country for miles. She jumped over hedges and ditches, and at last she disappeared from their view. They believed that she as a fairy.\n\n\n\nOnce upon a time there was a man and he had conacre. He was going for the cows and crossing a gap he saw a hay rope and he said \"this will be useful to me some day.\" He took it home with him and threw it up on the loft. The woman of the house started to churn, and all of a sudden the churn was full of butter and they did not know what to do. There was a man and he knew all about witches. They sent for the man and he said, \"Have you any -\n(continues on next page)\n", "school_info": "School: Bailieboro (C.)", "metadata": [{"Location:": "Bailieborough, Co. Cavan", "Teacher:": "\nBean Uí Cheallaigh\n"}, {"Collector": "Kathleen Clarke", "Gender": "female", "Address": "Bailieborough, Co. Cavan"}, {"Informant": "Mr P. Clarke", "Gender": "male", "Address": "Bailieborough, Co. Cavan"}, {"Language": "English"}]}, "5070822/5067483/5098454": {"title": "A Charm", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1011, Page 168", "Page 168"], "url": "https://www.duchas.ie/en/cbes/5070822/5067483/5098454", "text": "\n(continued from previous page)\nthing in the house that you found\"? and he said \"No\". There was a little girl in the house and she said \"Daddy you have a rope up on the loft\", and the witch man said, \"Get me the rope quickly\". They got the rope and the man tied it on the cow's neck and the butter disappeared and came on again in the right time.\n\n\n\nOnce upon a time there was a man called McCabe and he had an \"evil eye\". He was going through a farmer's street. He looked over at the pig, and when the man was just gone the pig started to roar. There were two little boys in the house and their father sent them over to McCabe's house and they brought a pair of scissors with them. One of them got behind McCabe's back\n(continues on next page)\n", "school_info": "School: Bailieboro (C.)", "metadata": [{"Location:": "Bailieborough, Co. Cavan", "Teacher:": "\nBean Uí Cheallaigh\n"}, {"Collector": "Kathleen Clarke", "Gender": "female", "Address": "Bailieborough, Co. Cavan"}, {"Informant": "Miss O' Byrne", "Gender": "female", "Address": "Bailieborough, Co. Cavan"}, {"Language": "English"}]}, "5009150/4992073/5103266": {"title": "Ancient Charms and Evil Eye", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0754, Page 195", "Page 195"], "url": "https://www.duchas.ie/en/cbes/5009150/4992073/5103266", "text": "\nNot very long ago there was what we call charmers for both good bad or evil. When a neighbour would have some spleen against one he would go to the abode of a person who was supposed to be able to cause the death of a rival or enemy at a certain time by secret and evil means. It was done in the following way. The charmer got a sheaf of oats or wheat and into each joint of the straw which occurs at every nine or ten inches a clothes pin was stuck. The sheaf was then  buried in a potato field and left there until all the\n(continues on next page)\n", "school_info": "School: Ballycloghan, Ardagh", "metadata": [{"Location:": "Ballycloghan, Co. Longford", "Teacher:": "\nMary Ledwith\n"}, {"Collector": "Brigid M. Farrell", "Gender": "female", "Address": "Garrycam, Co. Longford"}, {"Informant": "Michael Sweeney", "Gender": "male", "Age": "70", "Address": "Druming, Co. Longford"}, {"Language": "English"}]}, "5009170/4993999/5103412": {"title": "A Charm", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0760, Page 058", "Page 058"], "url": "https://www.duchas.ie/en/cbes/5009170/4993999/5103412", "text": "\nThere is a man living in Longford called Mr. Lloyd, he has a charm for curing warts.     One time a girl had warts on her hand, she counted them and she sent another man into Mr. Lloyd to ask him could he cure them, he asked the man how many warts the girl had on her hand, the man told him. After a few days the girl had no wart on her hand.\n", "school_info": "School: Corboy, Meathús Truim", "metadata": [{"Location:": "Corboy, Co. Longford", "Teacher:": "\nSusan Stephens\n"}, {"Collector": "Georgena Denniston", "Gender": "female", "Age": "12", "Address": "Drumnacross, Co. Longford"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "male", "Address": "Drumnacross, Co. Longford"}, {"Language": "English"}]}, "5009180/4994959/5105935": {"title": "Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0762, Page 259", "Page 259"], "url": "https://www.duchas.ie/en/cbes/5009180/4994959/5105935", "text": "\nPeople have the cure for a lot of ailments and they are called charms. Some people have the cure of a thorn in the hand. If you have a thorn in your hand they will say a prayer over the hand, and they say it will come out itself. But you must have belief in the cure.The cure for a sty is to get ten gooseberry thorns, and throw away the tenth one. And for nine mornings throw away each one of the thorns.   Some people can cure ailments when others can't.\n", "school_info": "School: Dring, Granard", "metadata": [{"Location:": "Dring, Co. Longford", "Teacher:": "\nJames Drum\n"}, {"Collector": "Peggy Brady", "Gender": "female", "Age": "13", "Address": "Ballinrooey, Co. Longford"}, {"Informant": "Ellen Brady", "Gender": "female", "Age": "88", "Address": "Dring, Co. Longford"}, {"Language": "English"}]}, "5009180/4994961/5105941": {"title": "Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0762, Page 261", "Page 261"], "url": "https://www.duchas.ie/en/cbes/5009180/4994961/5105941", "text": "\nA cure for a sore throat was fill a stocking full of salt and tie it round the neck.  A cure for an ear-ache is a little bag or pad of hot bran placed to the ear.   A cure for tooth-ache is to take a straw from the Crib and keep it, and rub it to the back of the tooth that is painful.    A cure for a thorn is soap and sugar.   A cure for whooping cough is to put on a horse's winkers and lead the person that has it in and out through the pig-stye three times or under a horse's belly.\n", "school_info": "School: Dring, Granard", "metadata": [{"Location:": "Dring, Co. Longford", "Teacher:": "\nJames Drum\n"}, {"Collector": "Annie Reilly", "Gender": "female", "Age": "11", "Address": "Ballinulty Lower, Co. Longford"}, {"Informant": "Joe Farrelly", "Gender": "male", "Age": "40", "Address": "Dring, Co. Longford"}, {"Language": "English"}]}, "5009005/4976158/5114340": {"title": "Charms and Superstitions", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0713, Page 495", "Page 495"], "url": "https://www.duchas.ie/en/cbes/5009005/4976158/5114340", "text": "\nMy grandmother told me:-that if a hen crows you will have bad luck. Long ago if a hen crew the person would bring him to a cross-roads and which ever road the took there would be bad luck on it.If you found a piece of coal on the road and put it in your pocket it is said you would get money if you kept it.If you saw two magpies on the road you would have good luck and if you saw one you would have bad luck.It is said that if a knife fell there is a man coming to visit you.It is said that if you keep a piece of blessed palm in the cowshed the milk will be good during the year.If a black cat came and stayed in a house it is said you would have good luck. It is said\n(continues on next page)\n", "school_info": "School: Monknewton", "metadata": [{"Location:": "Monknewtown, Co. Meath", "Teacher:": "\nMaighréad Ní Mhurchadha\n"}, {"Collector": "William Clarke", "Gender": "male", "Address": "Monknewtown, Co. Meath"}, {"Language": "English"}]}, "5009018/4977611/5114391": {"title": "Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0717, Page 097", "Page 097"], "url": "https://www.duchas.ie/en/cbes/5009018/4977611/5114391", "text": "\nI (P. Connaughton) got those charms from an old woman on condition that I should not disclose her name. Letter (a) she states can be done even at the present time (& should not be printed for the public)BUTTER;(a)Skim the water off the drinking pool from which the cows drink, with the buttermilk porringer and fill a milking pail - take the water home & put some of it into the first churning. During the skimming it must be said \"The cream of this farmer is mine\" This must be done at day-break on May morn.(b)Tie a woollen thread (yarn) from tráithnín to tráithnín around any \"bó páirc\" on May morn Any cows coming inside that yarn before sun set of that day her butter goes to the family who tied that yarn.(c)Take a piece of clay or mud from between the crúibín of the cow & place that piece under the churn for the first churning. This to be done May Day.\n(continues on next page)\n", "school_info": "School: Ballinacree (B.)", "metadata": [{"Location:": "Ballynacree, Co. Meath", "Teacher:": "\nPádraic Ó Connachtáin\n"}, {"Collector": "P. Connaughton", "Gender": "male", "Occupation": "múinteoir"}, {"Language": "English"}]}, "5009019/4977777/5115202": {"title": "Charms - Taking Butter", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0717, Page 263", "Page 263"], "url": "https://www.duchas.ie/en/cbes/5009019/4977777/5115202", "text": "\n(a) Take a piece of clay or mud from between the crúibín of the cow and place it under the churn for the first churning on May Day. (b) Tie a woollen thread from tráithnín to traithnín around  any bó páirc on May morning. Any cows coming inside the yarn before sunset of that day will give their butter to the family who tied the yarn. (c) Skin the water off the drinking pool from which the cows drink. Fill a milking pail, take the water home and put some of it into the first churning While skimming the pool these words must be said \"The cream of this farm is mine\".(d) By taking a \"dash\" at the churn as the old people express it that is by helping to make the churn.\n(continues on next page)\n", "school_info": "School: Ballinacree (C.)", "metadata": [{"Location:": "Ballynacree, Co. Meath", "Teacher:": "\nEibhlín Bean Uí Chonnachtáin\n"}, {"Language": "English"}]}, "5009019/4977900/5115713": {"title": "Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0717, Page 386", "Page 386"], "url": "https://www.duchas.ie/en/cbes/5009019/4977900/5115713", "text": "\nLong ago in Ireland the people used to be able to take away other peoples butter by charms. It is said that as the people would be milking their cows the person that would be taking the butter would be watching in the field in the shape of a hare. It is said also that the people would come into the house when the people would be churning and start helping them to churn the butter.The remedy was  to shoot the hare with a crooked sixpence and when the person would come into the home to put bars of iron into the fire and as the iron would be getting hot it would start to burn the person and he would have to go.\n", "school_info": "School: Ballinacree (C.)", "metadata": [{"Location:": "Ballynacree, Co. Meath", "Teacher:": "\nEibhlín Bean Uí Chonnachtáin\n"}, {"Collector": "Mairsil Ní Gabann", "Gender": "female"}, {"Informant": "Mrs William Smyth", "Gender": "female", "Address": "Gneeve, Co. Cavan"}, {"Language": "English"}]}, "5009127/4989219/5121666": {"title": "Folk Prayers or Verses", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0747, Page 296", "Page 296"], "url": "https://www.duchas.ie/en/cbes/5009127/4989219/5121666", "text": "\nI heard the following folk prayers.Good FridayGood Friday our Saviour was crucified,The bloody Jews came and pierced him through the side.His blessed Mother was standing byWith a heavy heart and dismal sigh.Whoever shall say this prayer three times by night and three times by day shall never die in mortal sin or enter the gates of hell. Amen.St Peter sat on a marble stoneChrist came to him when alone.\"What ailest thou Peter?\"\"A toothache.\"\"God bless the hour God bless the day.For at this hour on this dateNo one shall ever suffer from toothache again.\"Charms1. If a person buries a sheaf of corn in the ground, having the intention of bringing about the death of an enemy, people say that as the sheaf decays, the\n", "school_info": "School: Ardnagrath", "metadata": [{"Location:": "Ardnagragh, Co. Westmeath", "Teacher:": "\nM. Ní Mhaoldhomhnaigh\n"}, {"Language": "English"}]}, "5009123/4988618/5121686": {"title": "Burns", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0746, Page 249", "Page 249"], "url": "https://www.duchas.ie/en/cbes/5009123/4988618/5121686", "text": "\nIf a person licks the belly of a Dardeel when he would have a burn and then lick the burn it would be cured after a couple of days.\n\n\n\nWhen the seventh son is born it is said that his father or mother puts a worm in his hand and if the worm dies he is supposed to have some cure.\n\n\n\nAnybody who never seen their father has a charm to cure sore mouth.Thomas Fitzgerald a native of Castledaly has a charm for curing eresiplisis or lifting the palet of the mouth. Lifting the palet of the mouth, which is done by lifting a certain hair on the top of the head.\n\n\n\nA black snail if found when not looking for it. Rubbed three times on the wart. The wart will disappear.\n", "school_info": "School: Lower Warren", "metadata": [{"Location:": "Warren Lower, Co. Westmeath", "Teacher:": "\nLiam Mac Coiligh\n"}, {"Language": "English"}]}, "5009288/5004759/5133154": {"title": "A Charm", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0888, Page 184", "Page 184"], "url": "https://www.duchas.ie/en/cbes/5009288/5004759/5133154", "text": "\nWarts may be charmed away from you and given to another person.  For every wart you have, take a small stone and touch each wart with a stone in the Name of the Father, Son, and Holy Ghost.  Then tie all the stones in a bag and drop this in the middle of the road.  Whoever finds the bag of stones takes upon him all your warts and they will leave you and go to him.(Told me by Mr. W Griffen (Aged 80) Curraghlawn.)  14.9.36\n", "school_info": "School: Hollyfort", "metadata": [{"Location:": "Hollyfort, Co. Wexford", "Teacher:": "\nMabel Vaughan\n"}, {"Informant": "Mr W. Griffen", "Gender": "male", "Age": "80", "Address": "Curraghlawn, Co. Wicklow"}, {"Language": "English"}]}, "4921655/4887924/5152870": {"title": "Witchcraft Mixed with Religion - Evil Eye", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0315, Page 117", "Page 117"], "url": "https://www.duchas.ie/en/cbes/4921655/4887924/5152870", "text": "\n(continued from previous page)\nhis brother was of the same opinion. The \"overlooked\" cow was much improved on the following day and after a day or two was as good as ever.\n\n\n\nHe had a vague remembrance of this old woman \"setting\" a charm. He cut his foot and the blood could not be stopped so he was taken to her by somebody & he remembered her cutting bread into little junks & saying something. She also put a mixture of cobwebs and some other stuff on the wound.\n\n\n\nThis man had eight uncles all over 6'2\". One was killed in a faction fight and the remaining seven died of hunger during the famine.Whenever I visited my grandfather I always saw some \"strayway\" sitting by the fire. One of them became a fixture - he was a fiddler who had travelled the world. His stories and his music were payment for his keep. He left his fiddle and box to\n(continues on next page)\n", "school_info": "School: Caisleán na Leacht, Droichead Banndan", "metadata": [{"Location:": "Castlenalact, Co. Cork", "Teacher:": "\nDomhnall Ó Cochláin\n"}, {"Language": "English"}]}, "4921646/4887568/5153080": {"title": "A Charm", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0314, Page 062", "Page 062"], "url": "https://www.duchas.ie/en/cbes/4921646/4887568/5153080", "text": "\nThe 9th generation of a blacksmith can cure ringworm by making the Sign of the Cross with the tongs for 9 mornings in succession (once each morning) on the ringworm. Mr J. Roche, Bandon was cured by that charm. Mr Daily was the smith's name and he lived at Crossmahon.\n\n\n\nBallylangley was called its name because a man named John Langly who came over from England with Cromwell lived there. When Langly was dying he willed that all the Catholic neighbours should be invited to his wake and for 3 days and 3 nights they should get plenty of whiskey and stout. His object for doing so was that when they were all drunk they would fight and kill one another. But he failed and John went to his reward.\n", "school_info": "School: Pádraig Naofa, Droichead Banndan", "metadata": [{"Location:": "Bandon, Co. Cork", "Teacher:": "\nPádraig Ó Faoláin\n"}, {"Collector": "James Scannell", "Gender": "male", "Address": "Bandon, Co. Cork"}, {"Informant": "Mr J. Roche", "Gender": "male", "Age": "60", "Occupation": "tailor", "Address": "Bandon, Co. Cork"}, {"Language": "English"}]}, "4921630/4886411/5168173": {"title": "Spells - Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0310, Page 236", "Page 236"], "url": "https://www.duchas.ie/en/cbes/4921630/4886411/5168173", "text": "\nSome of the old people could work charms to stop bleeding or a thing like that. They didn't see anything wrong in that, as 'twas for a good purpose. They used to do something, and say some prayers. 'Twas done to myself, I suppose it is twenty years ago. I cut my hand badly at a thrashing and I thought I couldn't stop the bleeding at all. John Hurry was there, and I knew he had the spin. I showed him the hand. \"Look\" said I. I didn't ask him do anything, for you know they wouldn't like to have their power spoken about at all. He took my hand and pressed it and the bleeding stopped on the spot. John Hurry was my uncle. He died about fifteen years ago and he over 88. Curly [?] Bán had it too.\n", "school_info": "School: Béal Átha Fhinghín (B.)", "metadata": [{"Location:": "Ballineen, Co. Cork", "Teacher:": "\nBeircheart Seártan\n"}, {"Informant": "Mr Cornelius O' Donovan", "Gender": "male", "Age": "55", "Address": "Shanagh, Co. Cork"}, {"Language": "English"}]}, "4921630/4886412/5168175": {"title": "Spells - Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0310, Page 237", "Page 237"], "url": "https://www.duchas.ie/en/cbes/4921630/4886412/5168175", "text": "\nDan the Captain's father was one day making a kitch, and he cut his hand badly between the thumb and the first finger. It was bleeding very badly and late that night they came here to my grandfather to stop it. We were in bed, and we heard the dog barking. We had a very cross dog and he wouldn't let them in beyond the gate, so they called. My father the Lord have mercy on him, went out. We all got up. My grandfather came on his knees, and having taken the cloth off the hand he said something in Irish, and breathed on the cut. That stopped it. That is about 50 years ago.~ \"Dan the Captain\" ~ Hurley, lives near Coppeen, Eniskean. (70 bl.)The priest would be very angry over it.There is nothing like that going now.\n", "school_info": "School: Béal Átha Fhinghín (B.)", "metadata": [{"Location:": "Ballineen, Co. Cork", "Teacher:": "\nBeircheart Seártan\n"}, {"Informant": "William Shorten", "Gender": "male", "Age": "65", "Address": "Shanagh, Co. Cork"}, {"Language": "mixed"}]}, "4921706/4892236/5188310": {"title": "Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0337, Page 090", "Page 090"], "url": "https://www.duchas.ie/en/cbes/4921706/4892236/5188310", "text": "", "school_info": "School: Dún-dá-radharc", "metadata": [{"Location:": "Dundareirke, Co. Cork", "Teacher:": "\nSiobhán, Bean Uí Shéaghdha\n"}, {"Collector": "Margaret Buckley", "Gender": "female", "Address": "Raleigh South, Co. Cork"}, {"Informant": "Daniel Golden", "Gender": "male", "Age": "85", "Occupation": "feirmeoir", "Address": "Brehaun, Co. Cork"}, {"Language": "English"}]}, "5162149/5158926/5197955": {"title": "Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0655, Page 077", "Page 077"], "url": "https://www.duchas.ie/en/cbes/5162149/5158926/5197955", "text": "\nLong ago some of the old people had power to do some wonderful thing and these powers were called charms. Micilín Burke had a charm for dogs when he used to let his hand on a dog the dog would follow him everywhere. Micilín Burke was  tramp travelling around the Country and he always had a twinty  or thirty dogs following him around from house to house looking for alms for me brothers as he used to call them. Mrs. Nugent, Seskin Carrick-on-Suir had a charm to stop blood. Before a person would have a charm another person should send some words written on piece of paper and the person should not know who send the piece of paper. If a dog bit a person the old people used to catch the dog and they used to pull a rib  of hair from the dog and put it on the cut and it is said that the cut wouldn’t ever fester. When a man would go to town and when he would take some drink he would say the day after that he would like to get a rib from the dog that bit him yesterday.\n", "school_info": "School: An Charraig Bheag, Carraig na Siúire", "metadata": [{"Location:": "Carrickbeg, Co. Waterford", "Teacher:": "\nSeán Ó Comhraidhe\n"}, {"Informant": "Mary Fitzpatrick", "Gender": "female", "Address": "Sheskin, Co. Waterford"}, {"Language": "English"}]}, "5235084/5233685/5235151": {"title": "Cures", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0237, Page 001", "Page 001"], "url": "https://www.duchas.ie/en/cbes/5235084/5233685/5235151", "text": "\nThe Dew.There was a belief among the girls long ago that if they got up early on a May day morning before the sun had risen and washed their faces in the fresh dew they would never have a freckle not be Sun-burnt through out the whole year.Some people still believe in the butter milk.  In those days it was not the fashion to be freckled or sun-burnt.\n\n\n\nI heard people say that too if you got up on a May Day morning and washed your hands three times in the name of the Father Son and Holy Ghost that you'd be able to unfasten any knot that you'd meet.I heard an old woman boast once that she owed her skill in undoing the knots in the wool to this cure as she told me that she never missed a May Day\n(continues on next page)\n", "school_info": "School: Cortubber", "metadata": [{"Location:": "Cortober, Co. Roscommon", "Teacher:": "\nMary A. Burke\n"}, {"Language": "English"}]}, "5235152/5222929/5240777": {"title": "Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0033B, Page 01_065", "Page 01_065"], "url": "https://www.duchas.ie/en/cbes/5235152/5222929/5240777", "text": "\n1. Mary Whelan has a charm for curing a disease called the Thrush or craos galar. Small children are subject to this disease.It is a soreness in the mouth. The charm-worker breathes three times into the patient's mouth. It is said that any person who never saw his father will have this charm.2. Eddy Giant has a charm for a headache. He gets a piece of string and measures the head from the nape\n(continues on next page)\n", "school_info": "School: Baile an Doirín (C)", "metadata": [{"Location:": "Ballinderreen, Co. Galway", "Teacher:": "\nTreasa Bean Uí Bheirn\n"}, {"Collector": "Mary Kealy", "Gender": "female"}, {"Informant": "Mr Michael Kealy", "Gender": "male", "Age": "60", "Address": "Kilcolgan, Co. Galway"}, {"Language": "English"}]}, "5235152/5222943/5240811": {"title": "Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0033B, Page 02_009", "Page 02_009"], "url": "https://www.duchas.ie/en/cbes/5235152/5222943/5240811", "text": "\n1. In the village of Killternan there dwelt a woman by the name of Mrs Loughnane. She had a charm for a \"Cléithín\".The \"cléithín\" means the falling down of the chest. When the chest falls down it becomes a point at the bottom of the stomach and then the point presses in on the stomach.To cure this disease the point must be brought out again.It is cured by an oatmeal cake and a glass tumbler and a candle.The patient eats a small slice of the oatmeal cake and\n(continues on next page)\n", "school_info": "School: Baile an Doirín (C)", "metadata": [{"Location:": "Ballinderreen, Co. Galway", "Teacher:": "\nTreasa Bean Uí Bheirn\n"}, {"Collector": "Kathleen Flannery", "Gender": "female"}, {"Informant": "Michael Fahy", "Gender": "male", "Age": "73", "Address": "Cartron, Co. Galway"}, {"Informant": "John Flannery", "Gender": "male", "Age": "48", "Address": "Ballinderreen, Co. Galway"}, {"Language": "English"}]}, "5235152/5223010/5240977": {"title": "Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0033B, Page 03_018", "Page 03_018"], "url": "https://www.duchas.ie/en/cbes/5235152/5223010/5240977", "text": "\nSome of the old people long ago had charms for curing pain and sores.1.If a child suffer from thrush it could be cured by a person who never saw his father blowing three breaths into the patients mouth.2. Others have charms to cure a fallen palate or a sore throat. They take three ribs of the patients hair from the top of his head and when he would draw the hair it would be cured.3. Mrs Lynane Tyrone has a charm for curing sciatica\n(continues on next page)\n", "school_info": "School: Baile an Doirín (C)", "metadata": [{"Location:": "Ballinderreen, Co. Galway", "Teacher:": "\nTreasa Bean Uí Bheirn\n"}, {"Collector": "Kitty Moran", "Gender": "female"}, {"Informant": "Mrs Thomas Moran", "Gender": "female", "Age": "85", "Address": "Cartron, Co. Galway"}, {"Language": "English"}]}, "5235152/5223079/5241117": {"title": "Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0033B, Page 04_029", "Page 04_029"], "url": "https://www.duchas.ie/en/cbes/5235152/5223079/5241117", "text": "\n1. Mrs Connolly of Kinvara has a cure for [?] She straps you to a bed and presses a tumbler on your stomach.  She does this three times on the following days, Monday, Wednesday and Friday.2. If seven son's are born one after the other the seventh is supposed to have a charm for curing boils. 3. A woman in Doras, Kinvara has a charm for curing \"falling sickness\". She burn's the clothes of the patient and places a\n(continues on next page)\n", "school_info": "School: Baile an Doirín (C)", "metadata": [{"Location:": "Ballinderreen, Co. Galway", "Teacher:": "\nTreasa Bean Uí Bheirn\n"}, {"Collector": "Peggy Moran", "Gender": "female"}, {"Informant": "Mrs Mannin", "Gender": "female", "Age": "67", "Address": "Mweeloon, Co. Galway"}, {"Language": "English"}]}, "5235152/5223167/5241236": {"title": "Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0033B, Page 05_054", "Page 05_054"], "url": "https://www.duchas.ie/en/cbes/5235152/5223167/5241236", "text": "\n1. Charms are used by people as cures. Mary Whelan has a charm for curing the Thrush. She is a girl who was born after her fathers death. All such people have this charm. 2. Eddie Giant has a charm for curing headache. This is how he does it. He gets a tape and he measures the head from the top of the nose to the nape of the neck and from the chin to the top of the head. The person goes to him\n(continues on next page)\n", "school_info": "School: Baile an Doirín (C)", "metadata": [{"Location:": "Ballinderreen, Co. Galway", "Teacher:": "\nTreasa Bean Uí Bheirn\n"}, {"Collector": "Rose Niland", "Gender": "female"}, {"Informant": "Martin Kelly", "Gender": "male", "Age": "56", "Address": "Tyrone, Co. Galway"}, {"Language": "English"}]}, "5235152/5223189/5241270": {"title": "Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0033B, Page 06_014", "Page 06_014"], "url": "https://www.duchas.ie/en/cbes/5235152/5223189/5241270", "text": "\n1. There is a girl named Mary Whelan in Kearnsella who cures the thrush. She is able to cure a person because she never saw her father. When a person comes to be cured to  he she breathes into that person mouth three times. I know a person she cured.2. Mrs Helebert in Caherpeak is able to cure a hedacre. She cured Mrs Spelman of Killealy. She makes the sign of the cross on the head. The person has to bring something in return, for example a head of\n(continues on next page)\n", "school_info": "School: Baile an Doirín (C)", "metadata": [{"Location:": "Ballinderreen, Co. Galway", "Teacher:": "\nTreasa Bean Uí Bheirn\n"}, {"Collector": "Mary B. Mannion", "Gender": "female"}, {"Informant": "Mrs Bridget Tierney", "Gender": "female", "Age": "84", "Address": "Killeenmunterlane South, Co. Galway"}, {"Language": "English"}]}, "5235152/5223239/5241314": {"title": "Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0033B, Page 07_027", "Page 07_027"], "url": "https://www.duchas.ie/en/cbes/5235152/5223239/5241314", "text": "\n1. There is a boy in Pollough who can cure craos galar[?]. His name is Michael Lane.2. When a person goes to him to get cured he breathes three times into the persons mouth and after a day or two the patient is cured. 2. There was once a man who was able to work a charm. If a person had ringworm he went to that person and he would cure him by saying some certain words and by blowing his breath\n(continues on next page)\n", "school_info": "School: Baile an Doirín (C)", "metadata": [{"Location:": "Ballinderreen, Co. Galway", "Teacher:": "\nTreasa Bean Uí Bheirn\n"}, {"Collector": "Bridget Connill", "Gender": "female"}, {"Informant": "Thady Searry", "Gender": "male", "Age": "68", "Address": "Tooreen, Co. Galway"}, {"Language": "English"}]}, "5235152/5223290/5241558": {"title": "Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0033B, Page 08_014", "Page 08_014"], "url": "https://www.duchas.ie/en/cbes/5235152/5223290/5241558", "text": "\nIt is said that the seventh daughter or son of a gypsy has a charm. There was a woman passing through Aran last year and she was going house to house telling fortunes. She went to one house and she said some friend over the sea belonging to the owner would die and leave his money by will. The people are getting it now. She was the seventh daughter of a gypsy. There is a girl living in Clough who has a charm to cure the\n(continues on next page)\n", "school_info": "School: Baile an Doirín (C)", "metadata": [{"Location:": "Ballinderreen, Co. Galway", "Teacher:": "\nTreasa Bean Uí Bheirn\n"}, {"Collector": "Mary Kelly", "Gender": "female"}, {"Informant": "Martin Kelly", "Gender": "male", "Age": "56", "Address": "Tyrone, Co. Galway"}, {"Language": "English"}]}, "5235152/5223318/5241584": {"title": "Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0033B, Page 09_004", "Page 09_004"], "url": "https://www.duchas.ie/en/cbes/5235152/5223318/5241584", "text": "\n1. There is a man living in \"Cnuic Meadha\" who works a Charm to cure Rheumatism.While he is making up the ointment he puts away the household so that they will not see him at work. When he has the ointment made up he will know if it will cure the person or not.Some people do not like to get him to cure them for they say his work is unnatural work. He charges very dear when  he comes to cure a person.When a person has the Whooping Cough it may be cured on meeting a rider\n(continues on next page)\n", "school_info": "School: Baile an Doirín (C)", "metadata": [{"Location:": "Ballinderreen, Co. Galway", "Teacher:": "\nTreasa Bean Uí Bheirn\n"}, {"Collector": "Bridget Fordham", "Gender": "female"}, {"Informant": "Daniel Fordham", "Gender": "male", "Age": "80", "Address": "Kilcolgan, Co. Galway"}, {"Language": "English"}]}, "5235152/5223471/5241730": {"title": "Clothes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0033B, Page 11_049", "Page 11_049"], "url": "https://www.duchas.ie/en/cbes/5235152/5223471/5241730", "text": "\n(continued from previous page)\nthe wool to the factory to get it woven.\n\n\n\nThey had a lot of old songs long ago such as Caileach an Tae, Rowary of the Hill, The long Black hand, The Harp that once through Tara's hall. The owl plad shawl. Rowary of the Hill was a forbidden  song and anyone that was heard singing it was punished.\n\n\n\nThere is a girl living in Keamsella and her name is Mary Whealan. She cures the thrush, the reason why she cures the thrush because she never saw her\n(continues on next page)\n", "school_info": "School: Baile an Doirín (C)", "metadata": [{"Location:": "Ballinderreen, Co. Galway", "Teacher:": "\nTreasa Bean Uí Bheirn\n"}, {"Collector": "Mary Martyn", "Gender": "female"}, {"Informant": "Mr P. Martyn", "Gender": "male", "Age": "53", "Address": "Mulroog West, Co. Galway"}, {"Language": "English"}]}, "5009001/4975533/5262403": {"title": "Charms - Burying the Sheaf (A Wicked Evil Practice)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0712, Page 138", "Page 138"], "url": "https://www.duchas.ie/en/cbes/5009001/4975533/5262403", "text": "\nA sheaf of corn was buried in a person's name whose downfall death or ill health you wished to happen. That person began to pine and often died.This belief in the burying of the sheaf was firmly believed by the people of this district and instances are related of person who instances are related of persons who pined and died because the sheaf was buried for them by an enemy.\n", "school_info": "School: Meath Hill", "metadata": [{"Location:": "Meath Hill, Co. Meath", "Teacher:": "\nPatrick J. Connolly\n"}, {"Language": "English"}]}, "5215784/5210692/5279190": {"title": "Charms", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0095C, Page 17_025", "Page 17_025"], "url": "https://www.duchas.ie/en/cbes/5215784/5210692/5279190", "text": "\nIt is believed that the seventh son or daughter has the power of curing ring-worm, boils, rashes, scurvey, or wild-fire.The sore has to be touched with the boy's or girls right hand. It is supposed that Monday and Thursday are two lucky days for performing this job.A man named McNioclas long ago lived near Kiltamagh. He\n(continues on next page)\n", "school_info": "School: Gleann an Dúin - Prison", "metadata": [{"Location:": "Prison East, Co. Mayo", "Teacher:": "\nMáire A. Ní Dhocartaigh\n"}, {"Collector": "Margaret Kearns", "Gender": "female"}, {"Informant": "Mrs Kearns", "Gender": "female", "Age": "40", "Address": "Manulla, Co. Mayo"}, {"Language": "English"}]}}