{"4723817/4716056/4743442": {"title": "The Wild Goose Lodge", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0935, Page 006", "Page 006"], "url": "https://www.duchas.ie/en/cbes/4723817/4716056/4743442", "text": "\nThere is a rock not far from Carrickmacross called \"The Wild Goose Lodge\". It is said that there was a hiding place under this rock where \"The Earls of Ulster who were called Wild Geese, took shelter when flying to France\n\n\n\nWolfe ToneWhen Wolfe Tone was being taken prisoner to Dublin he passed close to Carrickmacross. There is a meadow close to the town where men were drilled who fought at the Boyne and Aughrim. The great John O Donovan who visited Carrick in 1835 declared that the inhabitants were as Irish then as in the days of Owen Roe O'NeillAt Lough afooka (Loch a' Phúca)\n(continues on next page)\n", "school_info": "School: Clochar Lughaidh, Carraig Machaire Rois", "metadata": [{"Location:": "Carrickmacross, Co. Monaghan", "Teacher:": "\nSr. Máire\n"}, {"Informant": "Mr Peter Connolly", "Gender": "male", "Address": "Mullylusty, Co. Monaghan"}, {"Language": "English"}]}, "4811616/4802279/4949855": {"title": "The Towers", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0277, Page 080", "Page 080"], "url": "https://www.duchas.ie/en/cbes/4811616/4802279/4949855", "text": "\nOne hundred and forty two years ago Wolfe Tone went to France and obtained a fleet which was to come to Ireland to assist him in gaining for her independence. The  fleet left Brest in December 1796, under General Hoche, for Ireland. When some time at sea a gale of fierce velocity arose and the fleet was scattered some of the ships being driven into Bantry Bay. The English were taken unawares and so to secure  their future safety started building the following year five Towers on Beare Island.   These towers were built on the ... of five hills:- two in the East End, one on Cloughland's hill, one on Ardagh's hill and one in the West End. The towers were built by Englishmen who were sent specially for that purpose. The complete placement of stones etc. were sent from England dressed and ready for building. A pier was also built in Lawrence's Cove probably for the purpose of landing these stones.   The towers were then built and also watch-houses as quarters for the watchmen. In the tower there is a well which was to supply the soldiers in case of their being besieged. The soldiers lived in these towers for a few years but they were never used in warfare as batteries.The towers were numbered 1 and\n(continues on next page)\n", "school_info": "School: Cobh Labhráis (B.)", "metadata": [{"Location:": "Rerrin, Co. Cork", "Teacher:": "\nDomhnall Ó Súilleabháin\n"}, {"Collector": "Sean Ó Súilleabháin", "Gender": "male", "Address": "Rerrin, Co. Cork"}, {"Informant": "Miceál Ó Súilleabháin", "Gender": "male", "Age": "55", "Address": "Rerrin, Co. Cork"}, {"Language": "English"}]}, "4921577/4881157/5146197": {"title": "Scéal i dtaobh Wolfe Tone in 1798", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0282, Page 088", "Page 088"], "url": "https://www.duchas.ie/en/cbes/4921577/4881157/5146197", "text": "\nNuair do tháinig Wolfe Tone isteach i gCuan Bheanntraighe i 1798, bhí tighearna talmhan i mBeanntraighe dar-b'ainm Mr. White. Dairigh sé an sgéal i dtaobh Wolfe Tone. Chuaidh sé láithreach go dtí cúl sráideanna Bheanntraighe agus dubhairt sé le doaine bocht ann, dul go dtí Árd na mBráthar ós cionn an chuain, gléasta i bhflainín dearg ag leigint ortha gur saighdiúirí Sasanach iad.Ní fheacha Wolfe Tone iad in aon chor. Annsan chuaidh Mr. White go Corcaig ar chapall bán agus d'innis sé a sgéal go dtí an Riaghaltas i dtaobh Wolfe Tone. Do chreid an riaghaltas a sgéal agus fuar é an teideal \"Tighearna Bheanntraighe\" dá bhárr.Mar cuimhneachán ar an sgéal go léir, do chuireadh suas trí gunnaí móra  bréige ós cionn an cuain, agus in aice a thighe. Tá siad ann le feiscint  fós.Do chaill Wolfe Tone bád beag ins an stoirm agus tá an bád sin ann fós leis.\n", "school_info": "School: Barrlinn", "metadata": [{"Location:": "Inchinarihen, Co. Cork", "Teacher:": "\nMáire Ní Chruadhlaoich\n"}, {"Collector": "Cristíní Ní Luasaigh", "Gender": "female"}, {"Language": "Irish"}]}, "4921577/4881201/5146409": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0282, Page 132", "Page 132"], "url": "https://www.duchas.ie/en/cbes/4921577/4881201/5146409", "text": "\nI live in Ardnagashel. Mrs. Hutchins owns it. The Hutchins family were cousins to Wolfe Tone and he called to see them one night in the year 1798 when he came to Bantry Bay with the French. The Hutchins did not make that known at the time because they were land lords. The first Mr. Hutchins who came to Ardnagashel got a lease of his land during his own lifetime. But the wording of the lease was that he would own Ardnagashel as long as himself would stand on it. When the old man died his son embalmed him and put him standing in a tomb in his own land. So by that clever tick the Hutchins own their land for ever. There is a faimly graveyard around tomb now.\n", "school_info": "School: Barrlinn", "metadata": [{"Location:": "Inchinarihen, Co. Cork", "Teacher:": "\nMáire Ní Chruadhlaoich\n"}, {"Collector": "Eillen Mc Carthy", "Gender": "female", "Address": "Ardnagashel, Co. Cork"}, {"Language": "English"}, {"Location": "Ardnagashel"}]}, "4921578/4881291/5146617": {"title": "Bád Bheanntraí 1796", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0282, Page 222", "Page 222"], "url": "https://www.duchas.ie/en/cbes/4921578/4881291/5146617", "text": "", "school_info": "School: Com Sheóla (B)", "metadata": [{"Location:": "Kilmocomoge, Co. Cork", "Teacher:": "\nConchobhar Ó Séaghdha\n"}, {"Collector": "Riobárd Ua Drisceóil", "Gender": "male", "Address": "Snave, Co. Cork"}, {"Informant": "Seán Ua Drisceóil", "Relation": "grandparent", "Gender": "male", "Age": "79"}, {"Language": "Irish"}]}}