{"4427869/4352251/4436010": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0103, Page 052", "Page 052"], "url": "https://www.duchas.ie/en/cbes/4427869/4352251/4436010", "text": "\n(continued from previous page)\n56.people would not do any farm work, digging etc - on May Day.\n\n\n\n57.Taking a horse three times from under a car used as a hearse: valueing a new horse under a car at a funeral.60.as under section 56. previous page.\n\n\n\nThe Fóidín Marbh, story connected with a single hawthorn bush growing near the school. Tobar-na-Sidhe - the fairy well on the land of Thomas Conry Ballyglass. The old story says that corn left at nightfall near the well was found ground next morning. Everything went on all right until two neighbours came on the same night to have their corn ground. They quarrelled over their rights of precedence with the result that no more corn was ground by the fairies!The \"Banshee\" is still believed in by some people in the district.\n(continues on next page)\n", "school_info": "School: The Neale (B.)", "metadata": [{"Location:": "Neale, Co. Mayo", "Teacher:": "\nTomás Mac an Bháird\n"}, {"Language": "English"}]}, "4428155/4382295/4451191": {"title": "The Fairy Bush", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0652, Page 209", "Page 209"], "url": "https://www.duchas.ie/en/cbes/4428155/4382295/4451191", "text": "\nAbout two miles from Dunmore East there is a spot known as the Fairy Bush. Long ago a pilot named John Glody piloted a ship from Dunmore East to Passage East. On his way back by road he had to pass the Fairy Bush. This night at about twelve o'clock when he was passing it, he saw a priest. Glody said, \"Good night Father\", but got no answer. The next night he saw the priest again, and again saluted him, but again received no answer. He went and told the Parish Priest of Dunmore, and asked him to go with him on the third night to the Fairy Bush. They went and they saw the(y) priest, and the Parish Priest spoke to him and asked him what his trouble was. He told him that he had left one Mass unsaid while he was on ea()th, and that he could not get anyone to answer it. The Parish Priest then told him that Glody\n(continues on next page)\n", "school_info": "School: An Pasáiste Thoir (B.), Port Láirge", "metadata": [{"Location:": "Passage East, Co. Waterford", "Teacher:": "\nProinnsias Ó Heachthigheirn\n"}, {"Collector": "Michael Daley", "Gender": "male"}, {"Informant": "Mrs Elizabeth Leahy", "Relation": "unknown", "Gender": "female", "Age": "circa 70", "Address": "Passage East, Co. Waterford"}, {"Language": "English"}]}, "4428156/4382355/4451329": {"title": "The Fairy Bush", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0652, Page 263", "Page 263"], "url": "https://www.duchas.ie/en/cbes/4428156/4382355/4451329", "text": "\nThe Fairy Bush is the name given to a five branch cross road between Passage East and Dunmore.Years ago John Glody, a Dunmore pilot came up to Passage in a steamer.  When he was going home by the Fairy Bush he saw a priest standing there.  It was at the hour of midnight that this Priest was seen.  John Glody went to the Parish Priest and told him about it.  The Parish Priest said he would go with him and they went.  They saw the Priest standing at the Fairy Bush.  The Parish Priest went over to him and asked him what was his troubles.  He told him that while he was on earth there was one Mass that he did not say and that he was on the altar every night to see if any one would come to serve Mass.  He asked John Glody and the Parish Priest to serve Mass.  The Parish Priest went with John Glody the next night to serve Mass.  When the Priest came out on the altar John Glody went in on the altar and served Mass for him.  In a minute the Church was full\n(continues on next page)\n", "school_info": "School: An Pasáiste Thoir (C.), Port Láirge", "metadata": [{"Location:": "Passage East, Co. Waterford", "Teacher:": "\nClare, Bean Uí Eachthigheirn\n"}, {"Collector": "Philomena Elliott", "Gender": "female", "Address": "Passage East, Co. Waterford"}, {"Informant": "William Leahy", "Relation": "unknown", "Gender": "male", "Age": "circa 78", "Address": "Passage East, Co. Waterford"}, {"Language": "English"}]}, "4428156/4382357/4451332": {"title": "A Fairy Bush", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0652, Page 265", "Page 265"], "url": "https://www.duchas.ie/en/cbes/4428156/4382357/4451332", "text": "\nOn the road between Passage East and Dunmore is a cross roads known as the Fairy Bush.About two hundred years ago there lived in Passage two hunchbacks named Patrick Doran and William Smith.  Patrick (or Paddy) was well liked by the people of the village.  He was very kind and obliging, and always had a good story to tell.  One day when Paddy was taking his usual walk round the country roads, he met a stranger.  This stranger asked Paddy to direct him to the village of Passage.  Paddy did so.  But as the stranger still seemed to have a doubt about the way, Paddy said he was about to go there himself, and if the stranger had no objection he would walk with him.  So off the started.  During their walk the stranger became very chatty.  He asked Paddy how he became a hunch-back, if he was born so, or was it through an accident.Paddy told him that it was the 'Good People' that caused it.  He then asked Paddy if he would like to be rid of it.  Paddy\n(continues on next page)\n", "school_info": "School: An Pasáiste Thoir (C.), Port Láirge", "metadata": [{"Location:": "Passage East, Co. Waterford", "Teacher:": "\nClare, Bean Uí Eachthigheirn\n"}, {"Language": "English"}]}, "4427912/4357050/4452867": {"title": "A Fairy Bush", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0113, Page 215", "Page 215"], "url": "https://www.duchas.ie/en/cbes/4427912/4357050/4452867", "text": "\nOnce upon a time there lived a man namely Tommy Callaghan in Tavrane Kilkelly Co. Mayo. He was going to build a barn there was a bush growing where he was building the barn and he dug up the bush. It was all well until that night he was going out to milk the cows. He heard crying he did not take any notice of it as he thought it was a child in the neighbourhood. Next night when he was going out again he heard the same crying. When he went into the house he told his wife, she went out with Tommy but could\n(continues on next page)\n", "school_info": "School: Teamhrán (C.)", "metadata": [{"Location:": "Tavraun, Co. Mayo", "Teacher:": "\nÁine, Bean Mhic Conmara\n"}, {"Collector": "Annie Marie Dunleavy", "Gender": "female", "Address": "Tavraun, Co. Mayo"}, {"Informant": "Mrs James Shannon", "Gender": "female", "Age": "70", "Address": "Tavraun, Co. Mayo"}, {"Language": "English"}]}, "4427912/4357127/4453965": {"title": "A Fairy Tree", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0113, Page 285", "Page 285"], "url": "https://www.duchas.ie/en/cbes/4427912/4357127/4453965", "text": "\nThere was once a man called Peter Tiernan living in Huntsfield. (Kilkelly, Co. Mayo.) A tall ash tree grew in his land. The people called it \"Crann Mór. and they used to say it belonged to the fairies. One day Peter went out to cut wood and he was in a great hurry so he cut a few brambles off \"Crann Mór\". When he had enough cut and cmoing home he met an old woman that looked like a beggar woman \"Good day Mam\" said Peter \"Good day\" said she you'll be very sorry yet for interfereing with \"Crann Mór\" You better leave the wood back again Well said Peter don't I want a bit of a fire. All right said she go on. With that the woman disappeared. When Peter went home he burned the wood and in a few days after that one of his best cows died\n(continues on next page)\n", "school_info": "School: Teamhrán (C.)", "metadata": [{"Location:": "Tavraun, Co. Mayo", "Teacher:": "\nÁine, Bean Mhic Conmara\n"}, {"Collector": "Bea Anna Hurley", "Gender": "female", "Address": "Tavraun, Co. Mayo"}, {"Informant": "Mr Patrick Forry", "Gender": "male", "Age": "40", "Address": "Tavraun, Co. Mayo"}, {"Language": "English"}]}, "4428068/4374848/4455162": {"title": "A Fairy Bush", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0151, Page 20", "Page 20"], "url": "https://www.duchas.ie/en/cbes/4428068/4374848/4455162", "text": "\nIn Patk. Connor's field there is a large white-thorn bush. It is situated south west of a sandpit, and is in the view of anyone who is passing on the Ballinahaglish road. Patk. went to cut some branches off the bush, and after cutting one, three drops of blood fell on his hand. He left the bush there for a few weeks, and again cut another branch. This time he did not interfere with the side out of which the blood had come.\n(continues on next page)\n", "school_info": "School: Ráithíní (Rehins)", "metadata": [{"Location:": "Rahans, Co. Mayo", "Teacher:": "\nMáirtín Ó Longáin\n"}, {"Collector": "Winnifred Foody", "Gender": "female", "Address": "Ballynahaglish, Co. Mayo"}, {"Informant": "Mr John Foody", "Relation": "parent", "Gender": "male", "Address": "Ballynahaglish, Co. Mayo"}, {"Language": "English"}]}, "4428068/4374870/4455166": {"title": "A Fairy Bush", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0151, Page 22", "Page 22"], "url": "https://www.duchas.ie/en/cbes/4428068/4374870/4455166", "text": "\nAbout 200 yards north of the Ballinahaglish grave-yard there stands a house in which my cousin John Foody is living. Beside this house there is a stable, which was used as a house about 96 years ago. The man who occupied it was Seán More. He was a very supple man. He could run as fast as a hare, and cut a nail made by a blacksmith with his teeth.At dusk one evening a little cripple man went from a \"fairy fort\" to Seán's house. This \"fort\" is about 200 yards north of John Foody's house. Seán cut a bush in this \"fort\" a few days before the little man visited him.\n(continues on next page)\n", "school_info": "School: Ráithíní (Rehins)", "metadata": [{"Location:": "Rahans, Co. Mayo", "Teacher:": "\nMáirtín Ó Longáin\n"}, {"Collector": "Winnifred Foody", "Gender": "female", "Address": "Ballynahaglish, Co. Mayo"}, {"Informant": "Mr John Foody", "Relation": "parent", "Gender": "male", "Address": "Ballynahaglish, Co. Mayo"}, {"Language": "English"}]}, "4427931/4358472/4457739": {"title": "Whit Sunday", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0117, Page 160", "Page 160"], "url": "https://www.duchas.ie/en/cbes/4427931/4358472/4457739", "text": "\n(continued from previous page)\nany kind of sickness it remained.\n\n\n\nWhatever day of the week the 28th of December fell on that day every week for the following year was supposed to be most unlucky.No one would dream of getting married that day or doing any important business that could be avoided.\n\n\n\nThe \"Foidin Marbh\" is a sod of ground and if you stand on it at night, you will be unable to find your way -- lifted as it is called.  If you take off your coat and turn it you will be alright.Long ago people had to carry the coffins long distances and left them down to rest.  This\n(continues on next page)\n", "school_info": "School: Páirc Íseal (C.)", "metadata": [{"Location:": "Lowpark, Co. Mayo", "Teacher:": "\nSorcha Ní Dhumhnaigh\n"}, {"Language": "English"}]}, "4427931/4358473/4457743": {"title": "The Fóidín Marbh", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0117, Page 161", "Page 161"], "url": "https://www.duchas.ie/en/cbes/4427931/4358473/4457743", "text": "\n(continued from previous page)\nplace was the foidin marbh.\n\n\n\nIt is the name often given to the terrible hunger which often strikes people when going on a journey if they step on the foidin marbh.  A little crumb of oaten bread taken is the best cure for fear gorta.\n", "school_info": "School: Páirc Íseal (C.)", "metadata": [{"Location:": "Lowpark, Co. Mayo", "Teacher:": "\nSorcha Ní Dhumhnaigh\n"}, {"Language": "English"}]}, "4427944/4359840/4464819": {"title": "A Fairy Bush", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0120, Page 242", "Page 242"], "url": "https://www.duchas.ie/en/cbes/4427944/4359840/4464819", "text": "\nThere was once a man who was very fond of visiting and cardlaying. One night about half past twelve when he was returning from a neighbouring house, a man came out before him and spread a white table-cloth before him to have a game of cards. The man said he would and after a few hours the man got up to go home. The fairy told him he would bring him home.The fairy took a large lamp from his pocket and told the man to follow him. The man kept following the light until he brought him to a little house under a bush. Then the fairy put out the light and asked him why did he cut the bush that was growing at the bottom of his field. The man said \"it was in my way\" \"Well\" said the fairy, you are in my way too\" and he kicked him away from the house, and the man kept walking up and down and could not find his way until he turned his cap inside out and as soon as he did he found himself walking on the road\n(continues on next page)\n", "school_info": "School: Liosmheadhráin", "metadata": [{"Location:": "Lismiraun, Co. Mayo", "Teacher:": "\nDudley J. Solan\n"}, {"Collector": "Mary Byrne", "Gender": "female", "Address": "Treanfohanaun, Co. Mayo"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "female"}, {"Informant": "Anthony Walsh", "Relation": "grandparent", "Gender": "male", "Age": "circa 80"}, {"Language": "English"}]}, "4428251/4388462/4465938": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1027, Page 037", "Page 037"], "url": "https://www.duchas.ie/en/cbes/4428251/4388462/4465938", "text": "\n(continued from previous page)\nprepare to die. He went home and a lump came on his side and he died within six month.\n\n\n\nThere is a field in Ardfarna and there are stray sods on it. A man named Jim Scallom was walking through the field when he walked on one of the stray sods. He wandered about all night. In the morning he realised where he was and as he was crossing a wall he fell and broke his leg.\n\n\n\nA man was coming home one night from playing cards. When he was crossing a field he walked on a stray sod and\n(continues on next page)\n", "school_info": "School: St Joseph's, Béal Átha Seanaigh", "metadata": [{"Location:": "Ballyshannon, Co. Donegal", "Teacher:": "\nAn Br. S. Ó Murchadha\n"}, {"Collector": "Patrick Mc Aleer", "Gender": "male", "Address": "Drumacrin, Co. Donegal"}, {"Informant": "Mrs Mc Aleer", "Address": "Drumacrin, Co. Donegal"}, {"Language": "English"}, {"Location": "Ardfarn"}]}, "4428251/4388468/4465974": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1027, Page 043", "Page 043"], "url": "https://www.duchas.ie/en/cbes/4428251/4388468/4465974", "text": "\nLong ago people wouldn't leave their children in the house by themselves for the fear fairies would take them away or bewitch them, so that they would not grow any bigger. If they were forced to leave them by themselves they put the tongs over the cradle so forming a cross. In this way they believed the children would be safe. The old people thought that if you throw water out on Halloween night you would, throw it on the fairies.\n\n\n\nThere are many fields around Bundoran with stray sods in them. (A stray sod is supposed to be a patch of ground on which a coffin containing a dead body was placed, while those who were carrying it rested.) If anyone treads on one of these sods he will lose himself and go wandering about for hours. One night about fourteen\n(continues on next page)\n", "school_info": "School: St Joseph's, Béal Átha Seanaigh", "metadata": [{"Location:": "Ballyshannon, Co. Donegal", "Teacher:": "\nAn Br. S. Ó Murchadha\n"}, {"Collector": "Tom Leonard", "Gender": "male", "Address": "Magheracar, Co. Donegal"}, {"Informant": "Dan Gilbride", "Gender": "male", "Address": "1419848"}, {"Language": "English"}, {"Location": "Bundoran"}]}, "4428251/4388490/4466125": {"title": "A Cure for Warts", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1027, Page 065", "Page 065"], "url": "https://www.duchas.ie/en/cbes/4428251/4388490/4466125", "text": "\nIf you accidentally come across a small hole in a stone with some water in it, dip your finger into it and rub the water on the wart and say “In the name of the Father and of the Son and of the Holy Ghost” three times.\n\n\n\nIn Ardfarna there is a field, and in this field there are supposed to be sods known as \"stray sods\". One night a man named Patrick Seallen was going home and it was a cold, dark, stormy night and it was hard to see very far. When he was going through this field he walked on one of those stray sods. Then he began to think he didn’t know where he was. He kept walking on and early the next morning he found himself lying on the road and his head pouring blood.\n(continues on next page)\n", "school_info": "School: St Joseph's, Béal Átha Seanaigh", "metadata": [{"Location:": "Ballyshannon, Co. Donegal", "Teacher:": "\nAn Br. S. Ó Murchadha\n"}, {"Collector": "Aiden Travers", "Gender": "male", "Address": "Bundoran, Co. Donegal"}, {"Informant": "Mrs Travers", "Gender": "female", "Address": "Bundoran, Co. Donegal"}, {"Language": "English"}, {"Location": "Ardfarn"}]}, "4427989/4364551/4468252": {"title": "Fóidín Mearbhaill", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0130, Page 520", "Page 520"], "url": "https://www.duchas.ie/en/cbes/4427989/4364551/4468252", "text": "\nIs minic amuigh ar an sléibh nuair a bhíonn duine in dhiaidh na gcaorach go dtigeann an aicíd air. Na daoine seo a bhíonn cleachtuighthe ar an sléibh tig leó a mbealach a dhéanamh abhaile, is cuma an oidhche nó lá é. Mar sin féin téigheann duine amudha ar uairibh. Ceapann sé go bhfuil sé ag dul an bealach ceart, acht in áit sin tá sé ag dul thart i bhfáinne, agus ní bhíonn sé in don a bhealach do dhéanamh amach. Bíonn sé ag dul thart, agus ag dul thart go mbíonn sé sáruighthe, agus lag leis an ocras, agus bíonn air luighe síos. Is minic gur siocar bais dhuine é.Creideann na daoine go bhfuil lámh ag na daoine maithe ar an rud seo, gur b amhlaidh a cuireann siad an duine amuda in aon torus.Tá daoine eile a chreideann go fuil fód aithrid ann, agus ma sheasann duine air go dtéigheann sé amudha.Tá tuairim ag na daoinibh\n(continues on next page)\n", "school_info": "School: Poll an tSómais", "metadata": [{"Location:": "Pollatomish, Co. Mayo", "Teacher:": "\nProinnsias Mac Gearailt\n"}, {"Language": "Irish"}]}, "4427989/4364552/4468253": {"title": "Fóidín Mearbhaill", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0130, Page 521", "Page 521"], "url": "https://www.duchas.ie/en/cbes/4427989/4364552/4468253", "text": "\n(continued from previous page)\ncomh mhaith, má iompuigheann duine a chóta an taobh amuigh istig go mbéidh sé in don a bhealach a dhéanamh abhaile.\n\n\n\nIs é an féar gortach an aicíd is mionca a thigeas ar daoinibh de bharr sidheóghachta annseo. Is iomda baramhail atá i dtaobh céad is ciontach leis, cuid aca a bréagnú a chéile, acht ní bhíonn an baramhail ceart ag aon aca creidim.Buaileann an féar gortach duine go tobann. Éirigheann gach ball den chorp trom, marbhánta sul a mbuailidh an tinneas é féin duine, cailltear luth na gcos, tuiteann duine as a sheasamh agus muna d'tigidh tarrtháil ar bith air tá sé caillte. Is iomda duine a cailleadh, ar an mbealach seo ar taobh an bhóthair, i lár na h oidhche nuair nách raibh aoine in aice láimhe le cabhair nó congnamh a thabhirt dóbhtha.\n(continues on next page)\n", "school_info": "School: Poll an tSómais", "metadata": [{"Location:": "Pollatomish, Co. Mayo", "Teacher:": "\nProinnsias Mac Gearailt\n"}, {"Language": "Irish"}]}, "4428024/4369019/4473529": {"title": "Féar Gortach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0139, Page 427", "Page 427"], "url": "https://www.duchas.ie/en/cbes/4428024/4369019/4473529", "text": "\nAt certain parts of the road and in certain places on the mountain the féar gortac is to be found. It is a weakness accompanied by a terrible longing for food which comes over one even though it may be but a short time since eating. I experienced the féar gortach on two or three occasions myself. The worst experience I had was around 1927 when teaching in Rossport.                        I left home in Belderrig one summers evening after a substantial dinner. The journey to Rossport usually took me an hour and a quarter and I was never ready for a meal for a couple of hours after arriving. This evening in question when I was at Muingnabo I began to get hungry and weak. A terrible longing for food came over me and I thought if I had one mouthful of anything to eat I should be all right. I got into such a state that I was not able to cycle and walked the last three miles at a snail's pace like a man in the last\n(continues on next page)\n", "school_info": "School: Béal Dearg", "metadata": [{"Location:": "Belderg More, Co. Mayo", "Teacher:": "\nPádraig Mac Conghamhna\n"}, {"Language": "English"}]}, "4428046/4371899/4473850": {"title": "The Fairy Bush", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0145, Page 149", "Page 149"], "url": "https://www.duchas.ie/en/cbes/4428046/4371899/4473850", "text": "\nOnce upon a time there was a man named Thomas Padden who lived in Cross-Patrick. One day he went to an Orchard to cut a bush which was in the middle of the Orchard. It was a lonely white thorn bush, and it was said to be a fairy bush. When he was a while cutting the bush he cut his own ear. As he was cutting away the bush began bleeding on him, as he thought. He threw away his saw, and ran home and told his wife, that as he was cutting the bush, it began bleeding on him. After a while she remarked that it was his ear that was bleeding instead of the bush. He went back to Orchard and the bush.\n", "school_info": "School: Cooneal", "metadata": [{"Location:": "Coonealmore, Co. Mayo", "Teacher:": "\nPatrick Timbin\n"}, {"Collector": "Kathleen Nealon", "Gender": "female"}, {"Informant": "Mrs Nealon", "Gender": "female", "Address": "Carrowreagh, Co. Mayo"}, {"Language": "English"}]}, "4428040/4371289/4473951": {"title": "Féar Gorta", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0144, Page 036", "Page 036"], "url": "https://www.duchas.ie/en/cbes/4428040/4371289/4473951", "text": "\nIf you stand in certain places you will get the \"Feir Ghorta\". When you take it you would have to sit down.It is where the people used to rest with the corpses long ago during the time of the Famine on their way to the graveyard. When you go to those places you get very weak an dhungry until you have to stay there until someone comes and relieves you.There is a place in Cloonyhue, Killala, one in Mr. G. Eardley's land, Dunnamona, Killala, where you take it.\n", "school_info": "School: Teampall Mhuire", "metadata": [{"Location:": "Carbad Beg, Co. Mayo", "Teacher:": "\nEithne, Bean Uí Mhaonghaille\n"}, {"Collector": "Margaret Lynn", "Gender": "female", "Address": "Cartoon, Co. Mayo"}, {"Informant": "Mrs Moran", "Relation": "not a relative", "Gender": "female", "Address": "Cartoon, Co. Mayo"}, {"Language": "English"}]}, "4428301/4392825/4476752": {"title": "The Fairy Bush in St John's Point", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1038, Page 366", "Page 366"], "url": "https://www.duchas.ie/en/cbes/4428301/4392825/4476752", "text": "\nIn St. John's Point situated in South Donegal there are no trees and very few bushes.On the land of Patrick McCready was a thorn bush, the only one in a square mile.It was looked upon with great reverence by the people on account of its great age.It grows beside the path used by the fishermen when going to and from their work.When the men were going to their work one Monday morning in October 1938 they were surprised to see the thorn turned right over by the storm. They all gathered, tried to raise the bush, but were unable to raise it up again to their great sorrow.Coming home in the evening it was in the same position. To their surprise on Tuesday morning the thorn was in its former position as if it had not been tossed and there was not a foot-mark on the ground.Mr McCready says he heard voices during the night but on looking out could see no one. The fairies had gathered during the night an lifted it up.\n", "school_info": "School: Urbal", "metadata": [{"Location:": "Urbal, Co. Donegal", "Teacher:": "\nEamonn de Faoite\n"}, {"Language": "English"}]}, "4428257/4389312/4476847": {"title": "The Fairy Bush", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1029, Page 3", "Page 3"], "url": "https://www.duchas.ie/en/cbes/4428257/4389312/4476847", "text": "\nThere is a bush growing in our field and it was always known as the fairy bush. Once a little girl was coming past this bush from the well with a can of water. She saw a little violin just the length of her own little hand and a bow beside it for playing it and both were as white as snow. She brought it home with her to show it to her father. She was going to try to play on it but her father stopped her and told her to bring it back and leave it where she found it. When she looked for it next morning it was gone. At other times there were little pipes found at the same place but only very small ones. The heads of the pipes were about the size of my thimble.\n\n\n\nThere was a man named Jimmy who lived in Carraicnahorna near Ballyshannon. One night long years ago he was out pulling hay at his haystacks for his cows. It was a bright moonlight night and the time was about twelve o’clock. He heard a lot of voices and when he looked round he saw about fifty fairies on horseback going past him. They were laughing and\n(continues on next page)\n", "school_info": "School: Tulach Mór", "metadata": [{"Location:": "Tullymore, Co. Donegal", "Teacher:": "\nNora Nic an Ultaigh, Maighread Nic an Ultaigh\n"}, {"Collector": "Máire Nic a t- Saoir", "Gender": "female", "Age": "11", "Address": "Tullyhorky, Co. Donegal"}, {"Informant": "Cáit Nic a t Saoir", "Gender": "female", "Address": "Tullyhorky, Co. Donegal"}, {"Language": "English"}]}, "4428304/4393123/4477929": {"title": "Gentle Places", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1039, Page 298", "Page 298"], "url": "https://www.duchas.ie/en/cbes/4428304/4393123/4477929", "text": "\nMoira Molloy. 9th December 1938.Gentle Places;- Long ago the people believed in fairies and that they had special haunts in each locality. It is said that there is a gentle place situated to the north-west of the town of Killybegs. It is in a field belonging to the Mullin's of New Row. In the centre of this field there is a fairy tree about which there are many interesting tales.One day a man was coming down past the field and as he looked at the tree he saw a light. Then he heard singing and sweet music but as he began to walk towards the tree to see what it was the light disappeared and the music and singing ceased and when he reached the tree there was nothing unusual there to be seen and thinking that it was only imagination he went home.Another day afterwards a man was out taking in his cows and as he was passing not far from the tree he saw a similar light and also heard music and singing. And as he went towards the tree to see what it was and this time the light also disappeared and all became quiet as before and going and getting his cows he went home. These\n(continues on next page)\n", "school_info": "School: Niall Mór", "metadata": [{"Location:": "Killybegs, Co. Donegal", "Teacher:": "\nB. Mac Niallghuis\n"}, {"Collector": "Moira Molloy", "Gender": "female", "Address": "Drumbeagh, Co. Donegal"}, {"Informant": "Mr W. Molloy", "Gender": "male", "Age": "81", "Address": "Killybegs, Co. Donegal"}, {"Language": "English"}]}, "4428304/4393127/4477931": {"title": "A Gentle Spot", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1039, Page 300", "Page 300"], "url": "https://www.duchas.ie/en/cbes/4428304/4393127/4477931", "text": "\nKathleen Mc Cahill 9th Dec 1938.A Gentle Spot;- As a rule fairies are to be found in glens, valleys and similar places throughout the countryside. The following is a story of a quarry which is inhabited by fairies.In a place called Conlin about a mile and a half outside Killybegs there is a quarry that is now avoided by everyperson who knows its story. It is situated up in the heart of many high mountains, and is far from sight of any house. It is now overgrown with gorse and grass and the living creatures to be seen within a mile of it are the rabbits and hares of the countryside. The story following tells why it is avoided so much.A man was one dark night returning from visiting a friend. He was rather a stranger to the place and therefore the history of the quarry was unknown to him. Coming near his home however he was unlucky enough to lose his way. He wandered on and on not knowing where he was. Presently it began to rain, and running for shelter he happened to run into the quarry. When the rain ceased and he arose to continue his journey he was astonished to find himself being pushed back again. Effort after effort was made, but in vain. Not until the morning was he able to get out of the quarry, and after this occurrence the quarry was avoided.\n", "school_info": "School: Niall Mór", "metadata": [{"Location:": "Killybegs, Co. Donegal", "Teacher:": "\nB. Mac Niallghuis\n"}, {"Collector": "Kathleen Mc Cahill", "Gender": "female"}, {"Language": "English"}]}, "4428304/4393129/4477935": {"title": "Fairies", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1039, Page 302", "Page 302"], "url": "https://www.duchas.ie/en/cbes/4428304/4393129/4477935", "text": "\n(continued from previous page)\nthat he was standing beside the gate which he was looking for all night and could not get.\n\n\n\nGentle Places;- There are many places about here where fairies inhabited and these places are known as \"gentle\" places. There is a gentle place quite near Killybegs just as you are up at the head of the town, there is a hill up in a field called Gentle Hill. There are many stories told about this place and here is one which I have often heard.One time there was a man up in the hill cutting whins. He had a hook cutting the whins. As the day was very warm he took off his coat and left it on the ground, and he left the hook down also and went down the bank looking for better whins. When he returned he could not get his hook or coat and it is believed fairies took (it) them because he cut the whins. Other misfortunes befell other men also who cut them.\n", "school_info": "School: Niall Mór", "metadata": [{"Location:": "Killybegs, Co. Donegal", "Teacher:": "\nB. Mac Niallghuis\n"}, {"Collector": "Joseph Ward", "Gender": "male", "Age": "13", "Address": "Killybegs, Co. Donegal"}, {"Informant": "Mrs Rowan", "Gender": "female", "Age": "52", "Address": "Killybegs, Co. Donegal"}, {"Language": "English"}]}, "4428304/4393130/4477943": {"title": "A Gentle Place", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1039, Page 303", "Page 303"], "url": "https://www.duchas.ie/en/cbes/4428304/4393130/4477943", "text": "\nMichael O Donnell Dec 12th 1938.A Gentle Place:- There are many \"gentle\" places in Bogagh and I am going to tell you about one such place. Near the river that flows through Bogagh is a stone standing on a small hill and old people say it is \"gentle\" and it is called Gabail Beg.One night a crowd of boys were walking home from a dance. When they were coming down the road they saw a row of lights beside the river. As they walked down the road the lights came down the bank of the river. When the boys came as far as the \"gentle\" stone the lights went out of sight and the boys thought they went into the stone. On the same night many other people from Bogagh saw the lights.One evening a man named John Byrne, who lives on the farm on which the \"gentle\" rock is, was herding cattle and one of the cows went to eat the grass around the rock. Then he heard singing in the rock. Many other things happened near the \"gentle\" rock.\n", "school_info": "School: Niall Mór", "metadata": [{"Location:": "Killybegs, Co. Donegal", "Teacher:": "\nB. Mac Niallghuis\n"}, {"Collector": "Michael O Donnell", "Gender": "male", "Age": "13"}, {"Informant": "Andy Mc Shane", "Gender": "male", "Age": "80", "Address": "Bogagh Glebe, Co. Donegal"}, {"Language": "English"}]}, "4428304/4393131/4477946": {"title": "A Gentle Place", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1039, Page 304", "Page 304"], "url": "https://www.duchas.ie/en/cbes/4428304/4393131/4477946", "text": "\nSarah Gallagher 13th December 1938.A Gentle Place;- There is a small field a little way outside Killybegs in which there is the haunt of fairies. This field is not in use and I never heard whom it belongs to. It is covered with mush-rooms, when the season for them arrives, and it is said that it was once inhabited by the little folk, which we call fairies.Long ago there were lights to be seen there every night. Some people said they heard music there and so they believed that there were fairies there. One night a man was passing the field and he heard very sweet music. Curious to see what was there he got up on the fence and he saw a crowd of little folk who came to him and took him into the field. He stayed with them for a long time and then he fell asleep. When he awoke next morning he found himself sitting by the fire and he recalled to his mind what had happened the night before and he told his neighbours. Everyone from that day to this believed that that field was inhabited by fairies and to this day it is considered as a \"gentle\" place.\n", "school_info": "School: Niall Mór", "metadata": [{"Location:": "Killybegs, Co. Donegal", "Teacher:": "\nB. Mac Niallghuis\n"}, {"Collector": "Sarah Gallagher", "Gender": "female"}, {"Informant": "Mrs P. Gallagher", "Gender": "female", "Age": "42", "Address": "Killybegs, Co. Donegal"}, {"Language": "English"}]}, "4428286/4391857/4478442": {"title": "Fairy Bushes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1036, Page 075", "Page 075"], "url": "https://www.duchas.ie/en/cbes/4428286/4391857/4478442", "text": "\nIt is most unlucky to cut these bushes. Some great disaster is sure to follow. One man, it is said, in order to get a site for a hen house cut one of the these bushes and on the following morning was found with his head turned on his shoulders.The banshee warns for death and is still believed in by some. It is said to follow the Grahams, the Mc Glincheys, the […] and the Thomases [sic]Information received from Pupils who got it at home.\n", "school_info": "School: Loch Iasg", "metadata": [{"Location:": "Tawnyvorgal, Co. Donegal", "Teacher:": "\nMáire, Bean Uí Mhurchadha\n"}, {"Collector": "Teresa Kennedy, Mary Carr", "Gender": "female"}, {"Informant": "Teresa Kennedy, Mary Carr, Elizabeth Wray", "Address": "Friary, Co. Donegal"}, {"Language": "English"}]}, "4428313/4394175/4480363": {"title": "The Gentle Holly Bush", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1042, Page 74", "Page 74"], "url": "https://www.duchas.ie/en/cbes/4428313/4394175/4480363", "text": "\nOn one of the hills of Doohill there is to the present-day a holly bush which the seancuidhthe of the district say is gentle. In a house which is now vacant and which is owned presently by a man named Casey presently living in the Glens of Antrim there lived an old woman years ago by the name of McCullagh. Her family having grown up some of the members had gone on the field of life to face their own successes and reverses. Two remained at home with her and had gone out to rake which commonly means that they had gone out to visit neighbours for the sake of pastime. While the old woman was sitting alone she heard a gentle knock at the door - the door of course being closed as she was all alone knitting by the turf fire.She inquired who was there before taking the bolt off the door and when she heard that it was a young girl and heard the girl's voice she admitted her hurriedly anxious to have her company and conversation. The beauty of the stranger surprised the old woman and she asked the old woman if she were all alone. Yes said she, well said the beautiful young visitor you will not be alone before long because your daughter and son are on their way back to the house just now. This meant of course the two home members that had gone out to rake. There was nothing surprising about the\n(continues on next page)\n", "school_info": "School: Gortnacart", "metadata": [{"Location:": "Gortnacart Glebe, Co. Donegal", "Teacher:": "\nLeón Ó hÚallaigh\n"}, {"Informant": "Annie Shovlin", "Gender": "female", "Age": "86", "Occupation": "farmer", "Address": "Doochill North, Co. Donegal"}, {"Language": "English"}]}, "4428371/4400668/4487534": {"title": "Seanscéal - Fear Gortach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1060, Page 033", "Page 033"], "url": "https://www.duchas.ie/en/cbes/4428371/4400668/4487534", "text": "\nBhí fear ann uair amháin agus bhí sé iontach gortach. Ba mhaith leis bean a phósadh. Acht go beidh go gcaitheadh sé í a thóghmhail. Bhí bean na chomhnuidhe go chogramach dó. Chualaidh sí fa dtaoibh dó agus fa chuid gortach fosta. Smaoitigh sí go ndéanfad sí cleas air. Ar an dhoigh go bpósfadh sé í. Maidín amháin chonnaic sí é ag tarraingt oirthe.Rath sí amach roimhe agus thoisigh sí ag taraingt an fhéir ghlais agus a ithe. Sheasaigh sé ag amharch uirthe. Chuir sé ceist\n(continues on next page)\n", "school_info": "School: Ára Mhór", "metadata": [{"Location:": "Aran Island, Co. Donegal", "Teacher:": "\nAntoine Mac Suibhne\n"}, {"Collector": "Gráinne Ní Aoda", "Gender": "female", "Address": "Fallagowan, Co. Donegal"}, {"Informant": "Máire Níg Aodha", "Relation": "parent", "Gender": "female", "Address": "Fallagowan, Co. Donegal"}, {"Language": "Irish"}]}, "4427796/4345097/4497897": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0087, Page 87", "Page 87"], "url": "https://www.duchas.ie/en/cbes/4427796/4345097/4497897", "text": "\nPeople take the fóidín meara at the same time of the day as they will die. If taken in summer they will die in summer.John Toole56 Romore.NewportWhen people take the fóidín meara they turn their coats inside out and they become allright.John Toole above.\n\n\n\nWhen a person is dying one window must be openedMrs Fadden   60Lecarrow, NewportAn meid seo ó leathanach a 7 bailithe agJosef O Móran14 Lecarrow NewportTá sé in Aimeirica anois\n", "school_info": "School: An Choill Mhór", "metadata": [{"Location:": "Cuilmore, Co. Mayo", "Teacher:": "\nFrainc de Paor\n"}, {"Collector": "Frainc de Paor", "Gender": "male"}, {"Informant": "John Toole", "Relation": "unknown", "Gender": "male", "Age": "56", "Address": "Roemore, Co. Mayo"}, {"Language": "English"}]}, "4498043/4345573/4498063": {"title": "Going for Poitín - Led astray by Fairies", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0089, Page 024", "Page 024"], "url": "https://www.duchas.ie/en/cbes/4498043/4345573/4498063", "text": "\nOne night two or three men went for poteen and they said to one other before they left that they would not take much. When they went in they kept drinking until they got very drunk. One of them fell asleep and the people of the house would not waken him. It was getting later and later and at last the man that was asleep wakened up. They said that they should be going home that their people would be looking for them. As they were coming out the road they met a crowd of fairies going along the road. One of the men said good night but they did not answer him. The two men stopped and the other crowd stopped higher up the road they started dancing. The two men that was drunk did not know what they were and they wanted fight so they went back to the other crowd. The fairies put the two men astray and one of the men fell by the roadside and could not get home. The people of the house went out to look for him and they brought their dog with them. The dog ran off and at last got the man lying in a drain with his head. The drain was full of water and the drunken man was stiff with the cold, and they brought him home. It was a long time before he got better.\n", "school_info": "School: Eaglais", "metadata": [{"Location:": "Burren, Co. Mayo", "Teacher:": "\nS. Ó Mongaigh\n"}, {"Collector": "Nora Ní Chuinneagáin", "Gender": "female"}, {"Informant": "Mr Cunningham", "Relation": "unknown", "Gender": "male", "Age": "60", "Address": "Commauns, Co. Mayo"}, {"Language": "English"}]}, "4498593/4385272/4498601": {"title": "The Stray Sod", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0790, Page 21", "Page 21"], "url": "https://www.duchas.ie/en/cbes/4498593/4385272/4498601", "text": "\nSome 30 years ago with moters and buses were unknown and people had to travel about mostly on foot dirty needless to say every available shortcut was made to use of. One dark winter night a certain young man working and living in Clonsilla went on a visit to Lucan passing through luttrellstown demense for short he lost his way and found himself walking around and around and could not find his way out. Beads of perspiration gathered on his forehead.When he beheld himself he was being followed by a lady in grey. After a while he found himself following the lady. The lady moved away off the circle and he followed her and soon found himself at the gate entrance.Afterwards he learned that there were many stray sods on the estate and the lady was a world known harmless ghost. She had married one of the bad luttrels and lead a most unhappy life. The man to his dying day after told of his gratitude to the ghost (the grey lady) of Luttrelstown Castle Clonsilla for getting him away from the stray sod.\n", "school_info": "School: Clonsilla", "metadata": [{"Location:": "Clonsilla, Co. Dublin", "Teacher:": "\nM. Ní Cholmáin\n"}, {"Collector": "Tommy Lynch", "Gender": "male"}, {"Language": "English"}, {"Location": "Luttrellstown"}]}, "4428250/4388408/4498994": {"title": "Getting Back Stolen Butter", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1026, Page 221", "Page 221"], "url": "https://www.duchas.ie/en/cbes/4428250/4388408/4498994", "text": "\n(continued from previous page)\nand get a horse shoe made. The iron must only be heated once. Take it home and when you start churning again put it under the churn. During the churning moans and cries will be heard outside and the butter will be given back. The shoe is supposed to burn the person who stole the milk ad she repents and gives it back.\n\n\n\nOne night I was coming home from rambling. I went into a field to get home by a short cut. I went around the field for hours and hours and still could not get out of it. All the time I could hear something like a dog scraping after me. At last I got down on my hands and knees and so got out at three o’clock in the morning.\n", "school_info": "School: Loughill", "metadata": [{"Location:": "Ballymunterhiggin, Co. Donegal", "Teacher:": "\nEibhlis Ní Mhathghamhna\n"}, {"Informant": "Eugene Mac Mahon", "Gender": "male", "Age": "22", "Address": "Bundoran, Co. Donegal"}, {"Language": "English"}]}, "4428250/4388409/4499004": {"title": "A Fairy Blast", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1026, Page 222", "Page 222"], "url": "https://www.duchas.ie/en/cbes/4428250/4388409/4499004", "text": "\nOne time a poor old man died. There were only two men sitting up at the wake. After mid-night there came a fairy blast. For candles that were lit around the corpse were all blown out. For about five minutes they sat unable to move. Then the candles lit up again and the corpse and coffin were gone. This old man wished to be buried in some special place but the grave was made in a different place. The coffin and corpse were never seen or heard of afterwards.\n\n\n\nOne night Micky Lennon, an old soldier was coming from his ceilidhe [ie céilí]. He stopped on the top of a hill to light his pipe. He started off again for home as he thought, but instead he took the opposite was. He went\n(continues on next page)\n", "school_info": "School: Loughill", "metadata": [{"Location:": "Ballymunterhiggin, Co. Donegal", "Teacher:": "\nEibhlis Ní Mhathghamhna\n"}, {"Informant": "Eugene Mac Mahon", "Gender": "male", "Age": "22"}, {"Language": "English"}]}, "4428336/4396491/4499606": {"title": "An Fear Gortach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1049, Page 122", "Page 122"], "url": "https://www.duchas.ie/en/cbes/4428336/4396491/4499606", "text": "\nTá cnoc árd ar an ród eadar Árd a Rátha agus na Cealla Beaga. Tá sé ar an taobh ó thuaidh den bhaile Mín a'Bhealaigh, agus fuair an baile seo a ainm ó'n chnuic seo.Oidhche amháin tamall fada ó shoin, fuair fear bás ar an chnoc seo. Bhí sé ag marcaidheacht ar chapall agus thuit sé ó'n diallaid agus bhris sé a muineal.O'n am sin ó shoin is gnáthach leis an fhear gortach a bheith san áit, agus 'siomaid uair a d'éirigh daoin lag san áit sin i ndiaidh na h-oidhche.\n(continues on next page)\n", "school_info": "School: Mín an Bhealaigh", "metadata": [{"Location:": "Meenavally, Co. Donegal", "Teacher:": "\nPádraig Mac Niallghuis\n"}, {"Informant": "Séamus Mac Niallghuis", "Gender": "male", "Age": "66", "Occupation": "múinteoir", "Address": "Meenavally, Co. Donegal"}, {"Language": "Irish"}]}, "4498088/4351362/4503234": {"title": "The Fóidín Mearbhaill", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0101, Page 125", "Page 125"], "url": "https://www.duchas.ie/en/cbes/4498088/4351362/4503234", "text": "\nOne evening a girl from our place was going to a wake and she fell asleep while she was walking. She walked over water and she was not a bit wet. She kept walking until morning. As soon as the sun shone in the morning she woke and went to the nearest house. There she was told that she was six miles from her own home. She was shivering when she woke and she was put to bed and she never left it until she died.  Mr Patrick McGrath, Lissavalley\n", "school_info": "School: Clochar na Trócaire, Baile an Róba", "metadata": [{"Location:": "Ballinrobe, Co. Mayo", "Teacher:": "\nNa Siúracha\n"}, {"Collector": "Kitty Mc Grath", "Gender": "female"}, {"Informant": "Mr Patrick Mc Grath", "Gender": "male", "Age": "60", "Address": "Ballinrobe, Co. Mayo"}, {"Language": "English"}]}, "4498839/4385823/4511362": {"title": "The Stray Sod", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0792, Page 275", "Page 275"], "url": "https://www.duchas.ie/en/cbes/4498839/4385823/4511362", "text": "\nThe Stray SodThere is a field in Ballymun called ‘Green Blakey’ where there is supposed to be a stray sod. This means that if you step after dark on this sod you will wander about unable to get out.My grandfather used to cross this field every night for years on his way home from his work so that he knew every inch of it. One night coming home as usual he happened to stand on the stray sod. He walked round the field for hours but he could not find his way out. Towards morning he turned round and walked in what appeared to him to be the opposite direction to home and this brought him home all right.Another time my uncle was coming home in the dark across ‘The Wild Field’ in Killeek. He stepped on the stray sod there and lost his way. He walked up and down by the gap for hours with-\n(continues on next page)\n", "school_info": "School: St Pappan's, Ballymun", "metadata": [{"Location:": "Ballymun, Co. Dublin", "Teacher:": "\nM. O' Riordan\n"}, {"Informant": "Elizabeth Fields", "Relation": "parent", "Gender": "female", "Address": "Coultry, Co. Dublin"}, {"Language": "English"}, {"Location": "Ballymun"}]}, "4498839/4385837/4511379": {"title": "A Fairy Tree", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0792, Page 288", "Page 288"], "url": "https://www.duchas.ie/en/cbes/4498839/4385837/4511379", "text": "\nA Fairy TreeYears ago my uncle James Murray had a sow which always rested under a lone tree that grew in a grove. One day my uncle cut down the tree. He put it on the fire but when he did so it jumped off. He then put on the pot to keep it on, but the pot jumped off and broke in pieces on the hearth stone. Next he put on the pan which did the same thing and broke also. When he got up in the morning he found his sow and her ten young ones dead. The fairies always have something to do with a lone tree and no one is to interfere with anything belonging to them. There are certain fields that have what is called ‘a fairy pass’ in them.\n(continues on next page)\n", "school_info": "School: St Pappan's, Ballymun", "metadata": [{"Location:": "Ballymun, Co. Dublin", "Teacher:": "\nM. O' Riordan\n"}, {"Informant": "Mary Murray", "Relation": "relative (other than parent or grandparent)", "Gender": "female", "Address": "Collinstown, Co. Dublin"}, {"Language": "English"}]}, "4498840/4385911/4511465": {"title": "The Stray Sod", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0792, Page 410", "Page 410"], "url": "https://www.duchas.ie/en/cbes/4498840/4385911/4511465", "text": "\nThere is a stray sod in the field up beside the Ruckalone Gate.One day, an \"ould\" woman was crossing this field an' she stepped on the stray sod an' the poor \"oul\" woman couldn't get out o' the field till mornin'.\n", "school_info": "School: Clonshough", "metadata": [{"Location:": "Clonshagh, Co. Dublin", "Teacher:": "\nC. Ní Bhroin\n"}, {"Collector": "Noel Dean", "Gender": "male"}, {"Informant": "Mrs Alice Heney", "Gender": "female", "Address": "Turnapin Lane, Co. Dublin"}, {"Language": "English"}]}, "4427831/4348275/4511466": {"title": "Loch na mBreac Caoch", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0094, Page 407", "Page 407"], "url": "https://www.duchas.ie/en/cbes/4427831/4348275/4511466", "text": "\nThe story on opposite page was supplied by Kathleen McDonnell (pupil) who got it from her grandmother who lives in the house.Mrs McDonnell spent the greater portion of her life where she lives and is now about 85 years of age.Mrs McDonnell heard the story from her parents, and elder members of the family now dead.\n(continues on next page)\n\n\n\nThe contribution on following page was brought in by Mary Flynn (pupil) who got it from her mother (Mrs Flynn) who died about seven years ago aged 86 years. Mrs Flynn lived in Cloonduane from the time of her marriage till her death.\n(continues on next page)\n", "school_info": "School: Belcarra (C.)", "metadata": [{"Location:": "Ballycarra, Co. Mayo", "Teacher:": "\nMary T. Moran\n"}, {"Collector": "Mary Flynn", "Gender": "female"}, {"Informant": "Mrs Flynn", "Relation": "grandparent", "Gender": "female", "Age": "86", "Address": "Curraghmore, Co. Mayo"}, {"Language": "English"}]}, "4428403/4404875/4514916": {"title": "Gentle Places", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1072, Page 284", "Page 284"], "url": "https://www.duchas.ie/en/cbes/4428403/4404875/4514916", "text": "\nNot very far from my house in a farm owned by a man named Charles Gamble is a tree which the people call a \"gentle tree.\" The people are now afraid even to go too near this tree as they think the place around it is peopled by fairies. Some of the children in there play around it.Gamble's grandfather at one time took a branch of this tree to repair the manger in the stable. His horse was perfectly well before the branch was taken into the stable but when Gamble went into the stable  a short time afterwards he found the horse very sick and it was prancing about the stable. He took the animal outside and removed the branch. The horse was put in again and was then alright.\n", "school_info": "School: Losad", "metadata": [{"Location:": "Losset, Co. Donegal", "Teacher:": "\nÚna Bean Uí Laoghaire\n"}, {"Collector": "Ellen Doohan", "Gender": "female", "Address": "Bellville or Gartan, Co. Donegal"}, {"Informant": "John Connaghan", "Gender": "male", "Age": "50", "Address": "Carrowtrasna, Co. Donegal"}, {"Language": "English"}]}, "4493672/4409648/4519177": {"title": "Gentle Bushes or Fairy Trees", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1087, Page 023", "Page 023"], "url": "https://www.duchas.ie/en/cbes/4493672/4409648/4519177", "text": "\nIn the farm of Barney Campbell, Cratlagh about a mile west of Milford near Bunlin Bridge on the Carrigart road here is a field having several \"Gentle Bushes\" or \"Fairy Trees\".The owner of the farm tells that on one occasion a storm blew down one of these trees. He went out with a saw and a hatchet to cut down some of the branches of the fallen tree for fire-wood. While he was cutting he noticed that his cows had broken into a field of cows and fixed the broken down part of the fence where the cows went in. On his return he found the tree growing exactly as it was before it had fallen. It had taken root again and all the branches were intact.Sometime afterwards a neighboring farmers daughter named Annie Haye got permission to cut or pull some branches from the same tree. She did so. Every night after that a bright light was seen\n(continues on next page)\n", "school_info": "School: Baile na nGalloglach (Milford)", "metadata": [{"Location:": "Millford, Co. Donegal", "Teacher:": "\nTadhg Ó Súilleabháin\n"}, {"Collector": "Kathleen Conaghan", "Gender": "female", "Address": "Millford, Co. Donegal"}, {"Informant": "Barney Campbell", "Gender": "male", "Age": "50", "Address": "Cratlagh, Co. Donegal"}, {"Language": "English"}]}, "4493702/4412571/4525576": {"title": "Donegal Fairy Bush Mystery", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1095, Page 134", "Page 134"], "url": "https://www.duchas.ie/en/cbes/4493702/4412571/4525576", "text": "\nDONEGAL FAIRY BUSH MYSTERYMystery surrounding a fairy thornbush on the lands of Mr. Pat McCallig, of Ballysaggart, St. John's Point, brings the problem of the existence or non-existence of the \"good people\" again into the public eye.Crumbled with age, bending as if a gale were constantly sweeping over it the lone thorn tree stands on a bleak hillside, where, tradition says, it was planted by Mr. McCallig's ancestors.It is the only tree in the neighbourhood and has become associated with myth, legend and fairy-lore in the district.Last week real mystery is said to have hung its mantle about the McCallig fairy-thorn.On Tuesday morning, the 4th instant, \"the 'fairy bush' was flattened to the ground, being uprooted by the fierce gale of the previous night.In the evening, when the storm ceased, Mr. McCallig thought to replace it, with the assistance of some neighbours, but their efforts were of no avail and the task \"was abandoned as an absolute impossibility.\"The next morning, when fisher-folk of Ballysaggart drew their blinds they were confronted with the familiar but now somewhat awesome sight of the \"fairy bush\" standing just as if there had been no storm.The mystery deepened when people who visited the tree reported that there was no trace whatever of its ever having been disturbed.Mr. William McCreadie, a man whose judgement is respected, declares that when the first grey light of day was breaking on the morning following the abandoned effort to re-plant the tree, he was awakened by a melancholy chant.At first, he says, it seemed quite close to the house but it gradually moved away towards the place where the fairy bush had been.Ballysoggart people are quite frankly mystified because, while hundreds saw the tree tossed by the gale, none is now able to discover any sign that it has ever been disturbed.People who come to inspect the bush just rub their eyes and go away without comment.\n", "school_info": "School: Srath an Urláir", "metadata": [{"Location:": "Stranorlar, Co. Donegal", "Teacher:": "\nAntoine Ó Tiománaidhe\n"}, {"Language": "English"}]}, "4493719/4414266/4526780": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1100, Page 67", "Page 67"], "url": "https://www.duchas.ie/en/cbes/4493719/4414266/4526780", "text": "\nNear St Johnston some years ago a servant man was set to work to stub a Glen in which grew gentry bushes*. He did not know these bushes from any other ones. So he rooted them out.When he was coming home that night, a man came up with him and asked him, did he know where he could get a school to teach. The other man said, I do not know, for in all the schools around here there are teachers.Then the servant noticed he had a cloven foot, so he began to pray. At last the man left him in a flame of fire.The servant went to my grandmother's house and her father had to leave him home.When his brother went to wake him in the morning he was dead.*Clump of scraggy hazel or thorn bushes said to be the haunt of fairies.\n", "school_info": "School: Cúl an Dasain (Cooladawson)", "metadata": [{"Location:": "Cooladawson, Co. Donegal", "Teacher:": "\nPádraig Mag Uidhir\n"}, {"Informant": "Mrs S Lucas", "Gender": "female", "Address": "Cavan Upper, Co. Donegal"}, {"Language": "English"}]}, "4493720/4414296/4527744": {"title": "Béaloideas - The Gentle Bush", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1100, Page 94", "Page 94"], "url": "https://www.duchas.ie/en/cbes/4493720/4414296/4527744", "text": "\nOnce upon a time there was living in Mullaghanety a woman balled Brigid Kelly who had a holly bush growing in the middle of her field. At Christmas she went to the bush for holly to decorate the house. She brought it home and put it up. When she had it up the wind rose and at last it was shaking the whole house and lifting the roof. The woman took down the holly and left it back on the bush and when she came back everything was quiet.The bush is there yet and every branch that falls from it is thrown under it.\n", "school_info": "School: Lios Mullaigh Dhuibh", "metadata": [{"Location:": "Lismullyduff, Co. Donegal", "Teacher:": "\nAodh Mac Giolla Eóin\n"}, {"Collector": "Brighid Ní Cheallaigh", "Gender": "female"}, {"Informant": "Lawrence Kelly", "Gender": "male", "Age": "60", "Address": "Mullaghaneary, Co. Donegal"}, {"Language": "English"}]}, "4493720/4414048/4527756": {"title": "Béaloideas - A Gentle Place", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1100, Page 107", "Page 107"], "url": "https://www.duchas.ie/en/cbes/4493720/4414048/4527756", "text": "\nThere was a little green shot in Mac Guire's field near to Lismulladuff burn. It is a little hollow in the middle of the field.  They tried to plough it. But every time they tried to plough it they lost the sock and could not find it\n", "school_info": "School: Lios Mullaigh Dhuibh", "metadata": [{"Location:": "Lismullyduff, Co. Donegal", "Teacher:": "\nAodh Mac Giolla Eóin\n"}, {"Collector": "Micheal Ó Gallchobhair", "Gender": "male"}, {"Informant": "John Mac Guire", "Gender": "male", "Age": "45", "Address": "Meenahinnis, Co. Donegal"}, {"Language": "English"}]}, "4493707/4413031/4528758": {"title": "Féar Gortach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1096, Page 394", "Page 394"], "url": "https://www.duchas.ie/en/cbes/4493707/4413031/4528758", "text": "\nThere is a certain spot between MacNamees mountain and Duffy's on which any person who walks takes 'Féar Gortac'.Fear Gortac is a dreadful hunger which people take while walking over certain places especially mountains. The ground beneath our feet when we take this hunger is known as 'Hungry Ground'. It is said that someone who was eating bread trod on this spot and let no crumbs fall.The fairies then cursed the spot because they were hungry and had he let any crumbs fall they would have eaten them and thus satisfied their hunger. That is why we take 'Fear Gortach'. One bite of oat-bread is sufficient to banish the hunger.\n", "school_info": "School: Mín Bán", "metadata": [{"Location:": "Meenbane, Co. Donegal", "Teacher:": "\nSeosamh Mac Coluim\n"}, {"Informant": "Pat Breslin", "Gender": "male", "Age": "64", "Address": "Largnalore, Co. Donegal"}, {"Language": "English"}]}, "4493737/4415273/4529305": {"title": "Gentle Bushes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1105, Page 195", "Page 195"], "url": "https://www.duchas.ie/en/cbes/4493737/4415273/4529305", "text": "\nIn many lonely places in the country there are great big hawthorn trees which are called \"gentle bushes.\" It was believed that the fairies or \"gentlefolks\" had their homes in them and it was considered very unlucky to touch one.One man who was foolish enough to cut down one of these bushes lost all his horses and his child never grew. Another man lost his eye and it was not long till he was quite blind.\n\n\n\nGentle bushes sometimes grow in the middle of a field. The fairies are supposed to live in them. Once upon a time a man thought he would cut one of them down as it was a bother to plough round it. It was very hard to cut and when he had the first branch off his horse died. He cut\n(continues on next page)\n", "school_info": "School: Druim Beag", "metadata": [{"Location:": "Drumbeg, Co. Donegal", "Teacher:": "\nSinéad Bean de Faoite\n"}, {"Collector": "John Galbraith", "Gender": "male", "Address": "Dromore, Co. Donegal"}, {"Language": "English"}]}, "4493737/4415273/4529307": {"title": "Gentle Bushes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1105, Page 195", "Page 195"], "url": "https://www.duchas.ie/en/cbes/4493737/4415273/4529307", "text": "\nIn many lonely places in the country there are great big hawthorn trees which are called \"gentle bushes.\" It was believed that the fairies or \"gentlefolks\" had their homes in them and it was considered very unlucky to touch one.One man who was foolish enough to cut down one of these bushes lost all his horses and his child never grew. Another man lost his eye and it was not long till he was quite blind.\n\n\n\nGentle bushes sometimes grow in the middle of a field. The fairies are supposed to live in them. Once upon a time a man thought he would cut one of them down as it was a bother to plough round it. It was very hard to cut and when he had the first branch off his horse died. He cut\n(continues on next page)\n", "school_info": "School: Druim Beag", "metadata": [{"Location:": "Drumbeg, Co. Donegal", "Teacher:": "\nSinéad Bean de Faoite\n"}, {"Collector": "Arthur Galbraith", "Gender": "male", "Address": "Dromore, Co. Donegal"}, {"Language": "English"}]}, "4493741/4415557/4530663": {"title": "A Gentle Bush Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1106, Page 257", "Page 257"], "url": "https://www.duchas.ie/en/cbes/4493741/4415557/4530663", "text": "\nIn the centre of a large field in East Donegal there once grew a large old and ugly thorn bush, which interfered greatly with farming operations and the farmer decided to have it removed although every one told him he would suffer for his action. This tree had long been regarded as a \"gentle bush\". The popular opinion was that it belonged to the fairies and therefore should be allowed to grow on, where it was untouched by the pruner as long as it wished to live. Superstition had it that ill luck would befall those who dared to meddle with its growth in any way. Notwithstanding all this the farmer ordered his servants to uproot it but they flatly refused. Then he and his brother got to work themselves, dug out the old tree and laid it in a corner of the field, where it crumbled away - no one daring to snatch a branch for fuel.The spot where the tree grew was levelled up and the men in doing so found a large quantity of white stones embedded in the soil. (These stones were gifts to the fairies in olden times).The Spring following oats were sown in the field but when harvest came\n(continues on next page)\n", "school_info": "School: Ardagh", "metadata": [{"Location:": "Ardagh, Co. Donegal", "Teacher:": "\nR. W. Cunningham\n"}, {"Collector": "R. W. Cunnigham", "Gender": "male", "Occupation": "teacher"}, {"Informant": "Mr A. C. Alexander", "Gender": "male", "Address": "Drumbarnet, Co. Donegal"}, {"Language": "English"}]}, "4493741/4415561/4530669": {"title": "An Ashfield Gentle Bush", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1106, Page 260", "Page 260"], "url": "https://www.duchas.ie/en/cbes/4493741/4415561/4530669", "text": "\nAn \"Ashfield\" Gentle Bush.A gentle bush once grew near a dwelling house in Ashfield, Raphoe. The owner of the house wished to have it removed so that he could erect a farm on the spot. He did the work himself as none of his men would give a helping hand on account of the superstition connected with old thorn bushes of this kind. Next he built a barn and installed a threshing mill. Then when he was threshing oats one day, his right hand got entangled in the machinery and several of his fingers were torn off. This seemed to be punishment for digging out the old bush.\n", "school_info": "School: Ardagh", "metadata": [{"Location:": "Ardagh, Co. Donegal", "Teacher:": "\nR. W. Cunningham\n"}, {"Collector": "R. W. Cunningham", "Gender": "male"}, {"Informant": "Miss Lowry", "Gender": "female", "Address": "Moneymore, Co. Donegal"}, {"Language": "English"}]}, "4493754/4416672/4530807": {"title": "The Shandrum Fairy Tree", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1110, Page 180", "Page 180"], "url": "https://www.duchas.ie/en/cbes/4493754/4416672/4530807", "text": "\nAt present there is a man residing in Shandrum named Charles MccLaughlin. This man has in his possession a farm. In the middle of this farm is [a] large tree.Manus, his son, thought it was in their way, when they were tilling the land. So he decided to cut it down, but his father wouldn't allow it. He thought there were fairies in it. Manus said he would cut it down [the] following day if it were in the way.On going out the following day he found the branches had been all cut off. He didn't cut it down, and it remains there yet.It is thought that the fairies came and cut the branches in order to save it from being cut.From that day to the present day it is called \"Fairy Tree.\"\n(continues on next page)\n", "school_info": "School: Drumfries", "metadata": [{"Location:": "Drumfree, Co. Donegal", "Teacher:": "\nP. E. Ó Dubhthaigh\n"}, {"Collector": "Liam Kelly", "Gender": "male", "Address": "Shandrim, Co. Donegal"}, {"Informant": "Charles Mc Laughlin", "Gender": "male", "Age": "circa 78", "Address": "Shandrim, Co. Donegal"}, {"Language": "English"}, {"Location": "Shandrim"}]}, "4493754/4416703/4530859": {"title": "The Fairy Tree", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1110, Page 207", "Page 207"], "url": "https://www.duchas.ie/en/cbes/4493754/4416703/4530859", "text": "\nLong, long years ago, there was a small gipsy boy named Pat Mc Donagh. This boys parents were living in a van along the road, and he was living with them.One July day as the sun was shining in all its glory in the heavens, the little gipsy boy was out playing in a field in Meenamallagh called the \"Black Park.\" This field is owned by Mr. Edward Breslin.Meenamallagh lies west on the way to Carndonagh.On his arrival at his home he told them that he came upon a rock with a tree growing out of it, and that he wanted a hook to cut of one of its branches. They foolish enough handed him the hook, and he ran off as fast as his legs could carry him, until he reached the\n(continues on next page)\n", "school_info": "School: Drumfries", "metadata": [{"Location:": "Drumfree, Co. Donegal", "Teacher:": "\nP. E. Ó Dubhthaigh\n"}, {"Collector": "Ethel Fullerton", "Gender": "female", "Address": "Drumfree, Co. Donegal"}, {"Informant": "Edward Breslin", "Gender": "male", "Age": "circa 50", "Address": "Drumfree, Co. Donegal"}, {"Language": "English"}, {"Location": "Drumfree"}]}, "4493754/4416741/4530922": {"title": "The Fairy Tree", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1110, Page 241", "Page 241"], "url": "https://www.duchas.ie/en/cbes/4493754/4416741/4530922", "text": "\nLong long years ago a little bush grew in Glassmullin.Glassmullin lies west of the main road, on the way to Carndonagh.Once upon a time a boy was passing this bush. Unfortunate two black women came out from behind the bush, and left him at his own door. The boy was very much frightened and never went out afterwards.A man named \"Mickie Bars\" cut this bush, and it remains so to the present day. But little small bushes are coming on it.\n(continues on next page)\n", "school_info": "School: Drumfries", "metadata": [{"Location:": "Drumfree, Co. Donegal", "Teacher:": "\nP. E. Ó Dubhthaigh\n"}, {"Collector": "Kathleen Doherty", "Gender": "female", "Address": "Glasmullan, Co. Donegal"}, {"Informant": "Ethel Fullerton", "Gender": "female", "Age": "87", "Address": "Drumfree, Co. Donegal"}, {"Language": "English"}]}, "4493754/4416747/4530928": {"title": "The Fairy Tree", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1110, Page 247", "Page 247"], "url": "https://www.duchas.ie/en/cbes/4493754/4416747/4530928", "text": "\nOnce upon a time a beggar woman came into a house in Meenamallagh. A little girl lay sick with a sore foot. This is how she got it. She tramped on an nail.Well this beggar woman told the mother and (fifth) father of this girl to tie a leaf of Saint Patrick around it.Whither or not they didn't know, where the leaf of Saint Patrick grew. But she told them that it grew on their own street.So they pulled a leaf of St. Patrick and tied it on the sore. and it mended. This bush is still growing.\n", "school_info": "School: Drumfries", "metadata": [{"Location:": "Drumfree, Co. Donegal", "Teacher:": "\nP. E. Ó Dubhthaigh\n"}, {"Collector": "Ethel Fullerton", "Gender": "female", "Age": "87", "Address": "Drumfree, Co. Donegal"}, {"Informant": "Ethel Fullerton", "Gender": "female", "Age": "87", "Address": "Drumfree, Co. Donegal"}, {"Language": "English"}]}, "4493754/4416759/4530941": {"title": "The Fairy Bushes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1110, Page 258", "Page 258"], "url": "https://www.duchas.ie/en/cbes/4493754/4416759/4530941", "text": "\nLong, long ago there lived a man whose name was \"Pat Kavanagh.\" This man one day wanted a stick. He went up to a place where fairies are supposed to be. So he cut the stick. When he was coming home, he had to pass a river. The stones leaped out and hit him in the face. Tommy Carey who is a local farmer of Drumfries saw all this, and he told Pat Kavanagh to leave the stick back where he got it. He did so and nothing happened [to] him.\n", "school_info": "School: Drumfries", "metadata": [{"Location:": "Drumfree, Co. Donegal", "Teacher:": "\nP. E. Ó Dubhthaigh\n"}, {"Informant": "Neil Gill", "Gender": "male", "Age": "68"}, {"Language": "English"}]}, "4493754/4416780/4530953": {"title": "The Strayed Cow", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1110, Page 277", "Page 277"], "url": "https://www.duchas.ie/en/cbes/4493754/4416780/4530953", "text": "\nMany years ago, there lived a woman near the Mintiaghs Lough.One day, as she was sweeping the floor, she saw a cow out on the street. This cow had strayed. The woman put her in and milked her but alas! she only gave a drop of milk. She let her out again, and on the street she let three roars. The woman didn't know what was wrong with the animal.Running out with the broom in her hand, she struck the animal. The cow kicked up her heels, and letting three roars, ran down into the \"Mintiaghs Lake\" where she disappeared.\n", "school_info": "School: Drumfries", "metadata": [{"Location:": "Drumfree, Co. Donegal", "Teacher:": "\nP. E. Ó Dubhthaigh\n"}, {"Informant": "Teresa O' Donnell", "Gender": "female", "Age": "circa 76"}, {"Language": "English"}]}, "4493754/4416791/4530965": {"title": "The Fairy Bush", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1110, Page 287", "Page 287"], "url": "https://www.duchas.ie/en/cbes/4493754/4416791/4530965", "text": "\nAbout two hundred years ago a man named Pat Kavana went to Owenboy to cut bushes. The place where he was going to cut the bushes was called Cnaug na Fannauge. When he was returning with the bushes along the river, the pebbles began to jump out of the river and hit him. A man named James Carey saw him and told him to leave the bushes where he got them. He did so and returned home safe.Cnaug na Fannauge is situated on the south about a quarter of a mile from the school.\n", "school_info": "School: Drumfries", "metadata": [{"Location:": "Drumfree, Co. Donegal", "Teacher:": "\nP. E. Ó Dubhthaigh\n"}, {"Informant": "Ned Kavana", "Gender": "male", "Age": "circa 68"}, {"Language": "English"}]}, "4493712/4413383/4534654": {"title": "Féar Gorta or Hunger Grass", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1098, Page 117", "Page 117"], "url": "https://www.duchas.ie/en/cbes/4493712/4413383/4534654", "text": "\nThese were patches of grass unrecognizable in fields, and when walked on after night, made the victim feel terrible pangs of hunger, which rendered him unable to walk or stand. If he could crawl to a house, and get a bit of oat cake he would be cured. From this it was a custom to carry round a piece of oat cake in one’s pocket.\n\n\n\n“Strays” were patches of ground over which it was impossible to maintain direction at night on every mountain strays were found. Mr. Charles Mortland ceilidhing one night in Cornashesk, ‘strayed’ several miles away in the Cronalaghey district until morning, where he found himself at least 12 miles from home. A “stray” is located particularly on the Tyrone side of Corlea Hill, in the vicinity of Tom Gallen’s (Vics). In order to survive a “stray,” a wayfarer always noted the direction (in relation to the objective) of the wind, because once afflicted, none of the senses could be trusted particularly, the sight  The treatment, was follows: The victim should sit down, shut his eyes, and while seated think of something pleasant. He should turn his coat three times, and having done this, he should open his eyes. If a dense fog appeared before him he should repeat this again, until his surroundings assumed a natural appearance\n(continues on next page)\n", "school_info": "School: Taobh Breac", "metadata": [{"Location:": "Tievebrack, Co. Donegal", "Teacher:": "\nDonnchadh E. Mac Congáile\n"}, {"Collector": "Donnachadh Mac Congáile", "Gender": "male", "Occupation": "múinteoir"}, {"Language": "English"}]}, "4493712/4413454/4534894": {"title": "Gentry Bushes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1098, Page 181", "Page 181"], "url": "https://www.duchas.ie/en/cbes/4493712/4413454/4534894", "text": "\nHere is a snapshot of a “gentry bush” near the fort at Mortland’s field in Ballygonnigan. There is a supposed tunnel leading from the fort (50 yds distant to this fort.)LOCAL DON'TS1.\tDon’t cut ‘gentry bushes.’2.\tDon’t plough the land on the edge of them.3.\tDon’t let farm animals near them.Here is a snapshot of a ‘gentry’ bush on the lands of Mr. Paddy Anderson, of Lisnamulligan called “The Powl Hill.” It is triangular in shape, about 50 yards long and covered with dense shrubbery bushes. It is beside the fort in the same townland.\n", "school_info": "School: Taobh Breac", "metadata": [{"Location:": "Tievebrack, Co. Donegal", "Teacher:": "\nDonnchadh E. Mac Congáile\n"}, {"Collector": "Donnachadh E. Mac Congáile", "Gender": "male", "Occupation": "múinteoir"}, {"Language": "English"}, {"Location": "Donaghmore"}]}, "4493759/4417387/4535368": {"title": "Led Astray", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1111, Page 374", "Page 374"], "url": "https://www.duchas.ie/en/cbes/4493759/4417387/4535368", "text": "\nA man one night decided to spend a few hours on his céilidhe in his neighbour's house in Clonbeg. He went very frequently to this house. His residence was only a few fields away from his neighbours house, and he went across so often that he could cross with his eyes closed.He stayed at his friends house  a considerable length of time, when he thought that he would go home. He started on his short journey and when he past one field he tried to get into the next field but could not find the gap.He spent a full hour in a fruitless attempt to get out of the field could not.\n(continues on next page)\n", "school_info": "School: St Mary's, Buncrana", "metadata": [{"Location:": "Buncrana, Co. Donegal", "Teacher:": "\nMáire, Bean Uí Bhraonáin\n"}, {"Collector": "Maisie Grant", "Gender": "female"}, {"Informant": "Mrs Maggie Smith", "Gender": "female", "Age": "71", "Address": "Ballymagan Upper and Lower and Clonblosk, Co. Donegal"}, {"Language": "English"}]}, "4493759/4417429/4535433": {"title": "Gentle Bushes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1111, Page 416", "Page 416"], "url": "https://www.duchas.ie/en/cbes/4493759/4417429/4535433", "text": "\nLong ago when the fairies were going about through Ireland they lived in Holly Bushes - which are now called gentle bushes.There is one of these bushes in Mr Doherty's (Jinny) field in Ballymagan, and he is ploughing round it at the present, but he never touches it.There is another one of these bushes in my father's farm, and it is conveniently close to the well, and it is said by the old people that it was made by the fairies for their own use.\n(continues on next page)\n", "school_info": "School: St Mary's, Buncrana", "metadata": [{"Location:": "Buncrana, Co. Donegal", "Teacher:": "\nMáire, Bean Uí Bhraonáin\n"}, {"Collector": "Annie Mc Laughlin", "Gender": "female", "Age": "15235"}, {"Informant": "Mrs Sarah Mc Laughlin", "Relation": "parent", "Gender": "female", "Age": "over 70", "Address": "Ballymagan Upper and Lower and Clonblosk, Co. Donegal"}, {"Language": "English"}]}, "4493807/4423117/4538496": {"title": "More Local Tales - Glenburn Quarry", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1124, Page 55", "Page 55"], "url": "https://www.duchas.ie/en/cbes/4493807/4423117/4538496", "text": "\nGlenburn quarry is in a \"gentle knoll\".  One day some men were quarrying stones there.  The next day the returned to find the stones covered with blood.\n\n\n\nIn Drung about 1 ½ miles inland from Malin Presbyterian Church, which is on the shore road, there was a small gentle bush.  A woman sowed some onions.  She pulled the \"gentle\" bush to cover the onions so that the hens would not scrape them out.  The onions did not grow.\n\n\n\nOnce upon a time an old woman lived in this district.  She had magic power and could turn herself into a hare.  She lived with her little grandson.  One day a party of huntsmen came round.  They had not succeeded in raising a hare.  One of them offered the little boy a sum of money if\n(continues on next page)\n", "school_info": "School: Guaire (Goorey)", "metadata": [{"Location:": "Goorey, Co. Donegal", "Teacher:": "\nÚna M. Montgomery\n"}, {"Collector": "Úna M. Montgomery", "Gender": "female", "Occupation": "múinteoir", "Address": "Goorey, Co. Donegal"}, {"Informant": "J. F. Colhoun", "Gender": "male", "Address": "Killin, Co. Donegal"}, {"Language": "English"}]}, "4493804/4422413/4539461": {"title": "The Haunted Rock", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1123, Page 167", "Page 167"], "url": "https://www.duchas.ie/en/cbes/4493804/4422413/4539461", "text": "\n(continued from previous page)\nand got drowned: ever since that part of the sea is haunted\n\n\n\nOne day a man was walking along the road and he met a woman on a level part of the road.  She was lying on the \"dyke\" and then she got up and as soon as the man passed she stood.  When the man was about four yards from her he looked round and she was still in the same place he looked round again and she disappeared and he heard a voice saying she was a witch.\n\n\n\nIn this parish there was a tree which is now dead and rotten, this tree was a gentle tree and no one ever touched it.  One evening a certain man was taking home his cows, and\n(continues on next page)\n", "school_info": "School: St Boden's, Culdaff", "metadata": [{"Location:": "Culdaff, Co. Donegal", "Teacher:": "\nDoiminic Ó Duibhne\n"}, {"Collector": "Kathleen Deeny", "Gender": "female"}, {"Informant": "Kate Mc Colgan", "Gender": "female", "Age": "60", "Address": "Culdaff, Co. Donegal"}, {"Language": "English"}]}, "4493804/4422423/4539509": {"title": "Gentle Tree", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1123, Page 177", "Page 177"], "url": "https://www.duchas.ie/en/cbes/4493804/4422423/4539509", "text": "\nAbout a quarter of a mile east side of Aughaclay Chapel, there is a field with a holly tree growing in the middle of it. The owner of this field who did not believe in fairies employed a man to subsoil the land and remove this holly tree. On the night before he was to remove this holly tree he was preparing for bed when a small woman with a red hood came into the house, although the door was closed. She told him not to interfere with this holly tree but to tell his employer to put a high wall to the west side of it. Then he turned to question the woman she was gone;  the door was closed all the time. He went next morning and told his employer what he saw and heard and said he would not interfere with this holly-tree no matter what he gave him for doing it, as he was afraid. His employer said he would have to remove the tree next\n(continues on next page)\n", "school_info": "School: St Boden's, Culdaff", "metadata": [{"Location:": "Culdaff, Co. Donegal", "Teacher:": "\nDoiminic Ó Duibhne\n"}, {"Collector": "John Joe Mc Grory", "Gender": "male"}, {"Informant": "Manus Harkin", "Gender": "male", "Age": "56", "Address": "Muff, Co. Donegal"}, {"Language": "English"}]}, "4493804/4422429/4539514": {"title": "Fairy Tree", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1123, Page 183", "Page 183"], "url": "https://www.duchas.ie/en/cbes/4493804/4422429/4539514", "text": "\nFairy treeStory told by:- Bernadette McGrory, Scoil Naom Buadain, Cul Dabhcha,Co Dun-na-nGall.From Mrs McLaughlin (70yrs), Fahan, Malin, Co Donegal.There was a man one time who lived in Malin with his wife. Their house was beside a river. At the side of this river there grew a buch of \"sally rods\" which people said they shouldn't be touched because it was a \"fairy tree\".In olden times the people used to make creels and baskets out of rods. So this man went down one might and pulled a burden of the rods to make creels. When he came into the house, his wife asked him what happened to his face and he said nothing happened his face but she said \"something must have happened because your nose is on the side of your face. Then she asked him where he got\n(continues on next page)\n", "school_info": "School: St Boden's, Culdaff", "metadata": [{"Location:": "Culdaff, Co. Donegal", "Teacher:": "\nDoiminic Ó Duibhne\n"}, {"Collector": "Bernadette Mc Grory", "Gender": "female"}, {"Informant": "Mrs Mc Laughlin", "Gender": "female", "Age": "70", "Address": "Fahan, Co. Donegal"}, {"Language": "English"}]}, "4493804/4422465/4539550": {"title": "A Shoemaker", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1123, Page 219", "Page 219"], "url": "https://www.duchas.ie/en/cbes/4493804/4422465/4539550", "text": "\n(continued from previous page)\nfor he was told about a fairy who could tell him how to make money \"easy\".The fairy appeared to him one night at twelve o'clock and told him that he would get the gold at a certain place but he would have to dig till he would come on a box.  So he dug round till he came on a box.He lifted it up with great joy and he said \"I am a rich man for life.\"\n\n\n\nOnce upon a time there was a man coming from his neighbour's house one night.  He saw a woman with white hair and a white dress.  So the man went over and said, \"In the name of God\n(continues on next page)\n", "school_info": "School: St Boden's, Culdaff", "metadata": [{"Location:": "Culdaff, Co. Donegal", "Teacher:": "\nDoiminic Ó Duibhne\n"}, {"Collector": "Mary Ann Long", "Gender": "female"}, {"Informant": "John Mc Eleney", "Gender": "male", "Age": "75", "Address": "Laraghirril, Co. Donegal"}, {"Language": "English"}]}, "4547216/4413792/4548041": {"title": "Fairy Bush", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1099, Page 193", "Page 193"], "url": "https://www.duchas.ie/en/cbes/4547216/4413792/4548041", "text": "\nIn the field the property of Mr. Frank Bradley, Gleneely, Killyordon, there is a holly bush which is supposed to belong to the little-folk. Different people have seen the fairies playing around it and at times have heard strange music coming from it.It is recorded that schoolchildren on their way home from school began to play around the bush. They hung up their bags and coats on the bush. When they returned to look for them, they found that they were gone. Mr. James Bradley once saw three while sheep grazing around the tree but while he was watching them they disappeared into the tree.\n\n\n\nIn the townland of Carnoughter, Castlederg, Co Tyrone, lies a heap of rocks. It is said that Mass was celebrated on this spot during the time of the priest hunting. One of these stones has the track of an elbow clearly imprinted on it. It is not considered lucky to interfere in any way with these stones.One man is said to have used one of them as a flagstone for his kitchen floor at home. From the time that he put in the stone everything went wrong with the unfortunate man. His crops were lost and\n(continues on next page)\n", "school_info": "School: Gleann Fhaoilidh (Gleneely)", "metadata": [{"Location:": "Gleneely, Co. Donegal", "Teacher:": "\nPádraig Mac Fhinn\n"}, {"Collector": "J. Reid Prine", "Gender": "unknown"}, {"Language": "English"}]}, "4547216/4413796/4548061": {"title": "Monellan Estate", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1099, Page 197", "Page 197"], "url": "https://www.duchas.ie/en/cbes/4547216/4413796/4548061", "text": "\nThis is situated a few hundred yards from the village of Killygordon. Two old ladies who formerly resided on this estate died and were buried behind the dwelling house. They were called McWilliams. They were a very eccentric old couple and as a last request asked that their pet dogs should be buried in the same grave. This grave is still an object of much interest in the district and people do not venture near the place after dark for popular belief has it that ghosts can be seen.Another corner of this same estate K.C. was remarkable for the fact that the only case he ever contested in court was in defence of Daniel O'Connell of Catholic Emancipation fame.\n\n\n\nWhen a gang of workmen were engaged in constructing a new road in the town land of Mounthall, they encountered a hawthorn bush directly in their path. The foreman in charge gave orders to some of the men to have it removed. Several of them declined to perform this task declaring that the bush was a fairy-tree and they would be inviting disaster if they interfered in any way with it. One of their\n(continues on next page)\n", "school_info": "School: Gleann Fhaoilidh (Gleneely)", "metadata": [{"Location:": "Gleneely, Co. Donegal", "Teacher:": "\nPádraig Mac Fhinn\n"}, {"Collector": "J. Reid Prine", "Gender": "unknown"}, {"Language": "English"}]}, "4569047/4566601/4583652": {"title": "A Fairy Bush", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0033, Page 0375", "Page 0375"], "url": "https://www.duchas.ie/en/cbes/4569047/4566601/4583652", "text": "\nAbout two miles from the little village of Killeenavara in the County of Galway a large bush is growing on the side of the road and it is haunted by fairies.A fairy can be seen near this bush every night and it is often it followed people that would be coming home late a t night and that person would hardly ever pass by that bush after that.About two hundred years ago this fairy harmed a certain man in the parish of Ballinderreen Co Galway and it injured him seriously. The fairy is in the shape of a black dog and he has a great big nose.The bush is very old and it never bears any fruit. There is a large rock of stone surrounding the bush and it is under the stone the fairy lives.\n", "school_info": "School: Baile an Doirín (Buachaillí)", "metadata": [{"Location:": "Ballinderreen, Co. Galway", "Teacher:": "\nPádhraic Ó Cléirigh\n"}, {"Collector": "John Joe Bermingham", "Gender": "male", "Address": "Cloghballymore, Co. Galway"}, {"Informant": "Ned Bermingham", "Relation": "parent", "Gender": "male", "Address": "Cloghballymore, Co. Galway"}, {"Language": "English"}]}, "4602707/4597269/4631030": {"title": "Scéal - Liam Mac Fhlannacha agus an Fóidín Mearbhaill", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0082, Page 117", "Page 117"], "url": "https://www.duchas.ie/en/cbes/4602707/4597269/4631030", "text": "\nCúpla bliadhan ó shoin bhí fear as Sean Bhóthar san gceanntar so ag dul a bhaile ó Bhaile Mainistreach go mall san oidhche. \"Liam Mac Fhlannacha a bhí mar ainm air\". Ar a bhealach abhaile dó, sheas sé ar an \"bhfóidín mearbhaill\". Chonnaic sé teach beag ar thaobh an bhóthair agus é lán lé solas.Isteach leis agus bhúail sé ar an doras. Tháinig cailín álainn súas agus d'fhoscail sí é. \"Tar isteach a fhir bhoicht agus suidhe síos\" adeir sí leis. Do shuidhe sé cois na teine. Bhí slúagh mór daoine san dteach agus íad ag damhsadh agus ag amhránuigheacht. Bhí seanfhear i gcoirnéal in aice na teine ag caitheamh tobac. \"An tusa Liam Mac Fhlannacha\" adeir sé leis an bhfear. \"Cén chaoi bhfuil d'athair agus do mháthair\". \"Go maith\" arsa (mise) Liam, an bhfuil aithne agat ar mise\". Níl arsa Liam. \"Is mise Seán Phait Ó Conchubhair. Cailleadh mé fiche blíadhna ó shoin, nuair a ghoid na sidhe-óga mise leo agus táim i ngreim acú ó shoin\".Thug an cailín ar osgaill an doras\n(continues on next page)\n", "school_info": "School: Baile Nua (C)", "metadata": [{"Location:": "Newtown, Co. Galway", "Teacher:": "\nBean Mhic Conchoille\n"}, {"Informant": "Maitiú Sionúir", "Gender": "male", "Address": "Abbey, Co. Galway"}, {"Language": "Irish"}]}, "4605938/4603942/4644308": {"title": "Fairy Bushes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0204, Page 233", "Page 233"], "url": "https://www.duchas.ie/en/cbes/4605938/4603942/4644308", "text": "\nThere are thousands of fairy bushes in Ireland. Two of them are on our farm. I know of twelve fairy bushes which are in this district. Any white thorn bush in the middle of a field, and by it self is said to be a fairy bush. On nearly every farm there is a fairy bush. It is not right to cut a fairy bush. One fairy bush is in Lis na nDoras. It is a very remarkable one. The fairies used to dance round it every night. Some people saw them dancing and singing  round it. One man saw the fairies playing tunes and dancing and singing round it. This old tree is rotten and an old man was cutting it down for wood for the fire. He could not cut it, the handle broke and many other things happened, but he cut the bush to the ground but he could not bring it home, as it was too heavy. Another man was cutting a fairy bush, and a branch hit him in the eyes and blinded his two eyes.\n", "school_info": "School: Kilmore", "metadata": [{"Location:": "Kilmore, Co. Leitrim", "Teacher:": "\nEilís, Bean Uí Cheallaigh\n"}, {"Collector": "Tessie Mc Loughlin", "Gender": "female", "Address": "Killadiskert, Co. Leitrim"}, {"Informant": "Francis Mc Loughlin", "Gender": "male", "Age": "55", "Occupation": "carpenter", "Address": "Killadiskert, Co. Leitrim"}, {"Language": "English"}]}, "4605929/4603297/4649766": {"title": "An Féar Gorta", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0202, Page 490", "Page 490"], "url": "https://www.duchas.ie/en/cbes/4605929/4603297/4649766", "text": "\nMany place are noted for the féar górta.  It is said that if a person was eating a meal and did not leave any crumbs for the good people that that spot was noted for the féar górta and anyone who ever walked on that spot would take the féar górta which means a weakness resulting from hunger.  Long ago when people were going on a long journey they would bring oat-meal bread with them in order to prevent them from taking the féar górta.  There are many stories told about the féar górta.One night a man named John Clancy was coming from the fair of Drumkeeran.  On his way home he had to pass through a mountain.  There was a mist that night and the man went astray.  He was found dead the next morning about one mile from his own house.  The doctor was sent for and when he came he said that if the man had a clove or three blades of corn it would keep him alive until morning.\n", "school_info": "School: Druim Caol", "metadata": [{"Location:": "Drumkeel, Co. Leitrim", "Teacher:": "\nTomás Mac Suibhne\n"}, {"Collector": "Nóra Ní Cheallaigh", "Gender": "female"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "male", "Age": "57"}, {"Language": "English"}]}, "4605938/4604080/4649856": {"title": "A Story about Bog Chapel", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0204, Page 371", "Page 371"], "url": "https://www.duchas.ie/en/cbes/4605938/4604080/4649856", "text": "\n(continued from previous page)\none and no one could see her but her husband.  She told her husband at last that there was nothing to stop her of going to Heaven but eggs and salt she borrowed and did not pay it back.  He told the priest and the priest told him to bring her to the chapel.  He did so and she stood before the Alter.  The priest could not see her either.  The priest asked “where is she now” he said, she is six inches up off the ground, and he asked him again “ where is she now” he said, “she is up the height of herself off the ground” and he asked him again “ where is she now” he said “ she is gone”. she never troubled him again after that.  Supplied by Mrs Gilhooly, Derrinvona, aged 75, Drumkeerin.Written by Paddy Gilhooly, Derrinvona, Drumkeerin\n\n\n\nPeople take the far gorta if they are going up a steep hill or going across the mountain.  A person would take a far gorta from long fasting.  Some people bring oat bread and sometimes a drop of whiskey for fear they would take a far gorta.  The old people used to take a far gorta long ago but not so much nowadays.  A far gorta is a weakness for food.\n", "school_info": "School: Kilmore", "metadata": [{"Location:": "Kilmore, Co. Leitrim", "Teacher:": "\nEilís, Bean Uí Cheallaigh\n"}, {"Collector": "B.T. Corristine", "Address": "Killadiskert, Co. Leitrim"}, {"Informant": "James Mc Partland", "Gender": "male", "Age": "55", "Address": "Corchuill Lower, Co. Leitrim"}, {"Language": "English"}]}, "4605938/4604090/4649907": {"title": "The Care of the Feet", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0204, Page 381", "Page 381"], "url": "https://www.duchas.ie/en/cbes/4605938/4604090/4649907", "text": "\n(continued from previous page)\nWhen you go to get a pair of shoes made with the shoemaker he takes your measure with a tape marked in inches like a ruler. He measures the length of the shoes.\n\n\n\nIt is often said “He took a fear gorta with the hunger.”  Long ago when men used to go long journeys across the mountains they used to bring oaten meal cake with them in case they would take fear gorta.  When a person takes a fear gorta with hunger he feels very weak and is very cráidhte.\n\n\n\nWhen people are crossing the mountain they take a weakness called the fear gorta.  People long ago would never cross a mountain without bringing some thing with them.  Oat bread was usually what they used [to] bring with them.  The old people used to say that even a smoke would break the spell.  It is said that a fairy path is across every mountain and if you cross it you will get weak people often got weak crossing a mountatin and some people died from it.  Patrick McKenna died on Gabhlán mountain.  He was crossing the mountain and he got weak and as no one was\n(continues on next page)\n", "school_info": "School: Kilmore", "metadata": [{"Location:": "Kilmore, Co. Leitrim", "Teacher:": "\nEilís, Bean Uí Cheallaigh\n"}, {"Collector": "Brigid Curristine", "Gender": "female", "Address": "Killadiskert, Co. Leitrim"}, {"Informant": "Mrs Curristine", "Gender": "female", "Age": "50", "Address": "Killadiskert, Co. Leitrim"}, {"Language": "English"}]}, "4605938/4604090/4649918": {"title": "The Care of the Feet", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0204, Page 381", "Page 381"], "url": "https://www.duchas.ie/en/cbes/4605938/4604090/4649918", "text": "\n(continued from previous page)\nWhen you go to get a pair of shoes made with the shoemaker he takes your measure with a tape marked in inches like a ruler. He measures the length of the shoes.\n\n\n\nIt is often said “He took a fear gorta with the hunger.”  Long ago when men used to go long journeys across the mountains they used to bring oaten meal cake with them in case they would take fear gorta.  When a person takes a fear gorta with hunger he feels very weak and is very cráidhte.\n\n\n\nWhen people are crossing the mountain they take a weakness called the fear gorta.  People long ago would never cross a mountain without bringing some thing with them.  Oat bread was usually what they used [to] bring with them.  The old people used to say that even a smoke would break the spell.  It is said that a fairy path is across every mountain and if you cross it you will get weak people often got weak crossing a mountatin and some people died from it.  Patrick McKenna died on Gabhlán mountain.  He was crossing the mountain and he got weak and as no one was\n(continues on next page)\n", "school_info": "School: Kilmore", "metadata": [{"Location:": "Kilmore, Co. Leitrim", "Teacher:": "\nEilís, Bean Uí Cheallaigh\n"}, {"Collector": "Tessie Mc Loughlin", "Gender": "female", "Address": "Killadiskert, Co. Leitrim"}, {"Informant": "Mrs Mc Loughlon", "Gender": "female", "Age": "50", "Address": "Killadiskert, Co. Leitrim"}, {"Language": "English"}]}, "4649692/4647756/4659265": {"title": "A Stray Sod", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0211, Page 321", "Page 321"], "url": "https://www.duchas.ie/en/cbes/4649692/4647756/4659265", "text": "\n321A stray sod.There is said to be a stray sod in Tom Lee's hill in Derreen.  Several people went astray on it.  One night Mick Winters was coming home late and he went astray on it.  After he had walked for hours he said to himself he would sit down.. And when he did so a crowd of little red men came and got him to play cards.  At the dawn of day they all disappeared and he got home alright.  He said he must have walked on a fairies pass.\n\n\n\nA Stray Sod.One night William Reynolds was coming from his rambles in John McWeenys.  He walked accross John's field humming as song, but before he crossed the whole field he got afraid that he was going astray.  He continued walking but he was not getting a bit nearer to the house, only fields on every side.  At last he got tired walking and where\n(continues on next page)\n", "school_info": "School: Crummy", "metadata": [{"Location:": "Crummy, Co. Leitrim", "Teacher:": "\nPádhraic Ó Rodacháin\n"}, {"Collector": "Patrick Gralton", "Gender": "male", "Address": "Cornabrone, Co. Leitrim"}, {"Language": "English"}]}, "4649692/4647756/4659266": {"title": "A Stray Sod", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0211, Page 321", "Page 321"], "url": "https://www.duchas.ie/en/cbes/4649692/4647756/4659266", "text": "\n321A stray sod.There is said to be a stray sod in Tom Lee's hill in Derreen.  Several people went astray on it.  One night Mick Winters was coming home late and he went astray on it.  After he had walked for hours he said to himself he would sit down.. And when he did so a crowd of little red men came and got him to play cards.  At the dawn of day they all disappeared and he got home alright.  He said he must have walked on a fairies pass.\n\n\n\nA Stray Sod.One night William Reynolds was coming from his rambles in John McWeenys.  He walked accross John's field humming as song, but before he crossed the whole field he got afraid that he was going astray.  He continued walking but he was not getting a bit nearer to the house, only fields on every side.  At last he got tired walking and where\n(continues on next page)\n", "school_info": "School: Crummy", "metadata": [{"Location:": "Crummy, Co. Leitrim", "Teacher:": "\nPádhraic Ó Rodacháin\n"}, {"Collector": "Ellie Reynolds", "Gender": "female", "Address": "Crummy, Co. Leitrim"}, {"Language": "English"}]}, "4649692/4647757/4659274": {"title": "A Stray Sod", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0211, Page 322", "Page 322"], "url": "https://www.duchas.ie/en/cbes/4649692/4647757/4659274", "text": "\n(continued from previous page)\n322did he find himself but on the bank of Crummy River.  He turned his coat and he got home alright after that.Ellie Reynolds, Crummy.\n\n\n\nOne night Pat Cullen was going on his rambles to Mick Dwyer's.  He went along alright until he came to Conway's hill.  There in a field he spent many long hours roaming up and down.  He took off his cap and started to pray, and continued walking on his rambles as he thought himself.  He saw a light and he thought it was in Mick Dwyer's so he kept making for it.  He did not reach the house.  Instead of that it was making him worse.  He did not know what to do and after wandering around till he was tired he sat down under a bush and fell asleep.  Paddy Conway found him there next morning as he was foddering the cattle.Ellie Reynolds.\n", "school_info": "School: Crummy", "metadata": [{"Location:": "Crummy, Co. Leitrim", "Teacher:": "\nPádhraic Ó Rodacháin\n"}, {"Collector": "Ellie Reynolds", "Gender": "female", "Address": "Crummy, Co. Leitrim"}, {"Language": "English"}]}, "4658436/4655418/4660332": {"title": "A Stray Sod", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0222, Page 291", "Page 291"], "url": "https://www.duchas.ie/en/cbes/4658436/4655418/4660332", "text": "\nSome time ago there were two old men on their céilidhe in a neighbour's house. At about 11 oclock they started to go home each going their own way. They were about two hours parted when they met again some distance from the house they had left. One of them were on the top of a calf-shed, and the other in a meadow.They knew each other again, and seeing a light in the distance, they decided to go there. They were met on the road by a neighbour who put them right for home. It was said afterwards that they got on a stray sod.The same men saw about twelve ladies dressed in white dancing in a field before them one right at about a eleven oclock. They went on the road before them until they came to a stream, and thent hey disappeared.They were called Fairies or the good-people and the old people always said \"God speed them\"\n", "school_info": "School: Adoon", "metadata": [{"Location:": "Adoon, Co. Leitrim", "Teacher:": "\nCharles Flynn\n"}, {"Collector": "Mary Alice Mc Gowan", "Gender": "female", "Address": "Edergole, Co. Leitrim"}, {"Language": "English"}]}, "4672104/4670656/4673034": {"title": "Fairy Trees", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0168, Page 284", "Page 284"], "url": "https://www.duchas.ie/en/cbes/4672104/4670656/4673034", "text": "", "school_info": "School: Cill Ruis Íochtair", "metadata": [{"Location:": "Kilrusheighter, Co. Sligo", "Teacher:": "\nToirdhealbhach Ó Catháin\n"}, {"Collector": "Alice Hegarty", "Gender": "female", "Address": "Corkagh More, Co. Sligo"}, {"Informant": "James Hegarty", "Gender": "male", "Age": "64", "Address": "Corkagh More, Co. Sligo"}, {"Language": "English"}]}, "4672088/4669123/4678498": {"title": "Going Astray", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0164, Page 079", "Page 079"], "url": "https://www.duchas.ie/en/cbes/4672088/4669123/4678498", "text": "\nOnce upon a time my father was going to a fair in Ballina about 2 o'clock in the morning. He was driving cattle. One of the cattle went into Mr. Kilcullen's field. Mike was with him, and he stayed with the other cattle, while my father went in to the field after the other one. It was a very dark night, and he could not make his way out to the road. He went on over hedges and ditches until he found his way out to the road. At last he made his way, and he got out on the road at Mr. Rouses. he met Mike there and they continues their journey to the fair after a long hours travel through the fields.\n", "school_info": "School: Enniscrone (G.)", "metadata": [{"Location:": "Inishcrone, Co. Sligo", "Teacher:": "\nBean de Búrca\n"}, {"Collector": "Annie Mullany", "Gender": "female", "Age": "12"}, {"Language": "English"}]}, "4672088/4669131/4678510": {"title": "Going Astray", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0164, Page 087", "Page 087"], "url": "https://www.duchas.ie/en/cbes/4672088/4669131/4678510", "text": "\nOnce upon a time a man named Johnny Hallerian in Culleens, went a stray. he was out all night going till he come down to house. He thought it was his own house. He walked in to the river and came down the gullets. He went nearly a sleep in the river. He got again and turned his coat. He then realized that he had gone astary but recognized the river and the particular point in which he was standing. He arrived home late that night.\n", "school_info": "School: Enniscrone (G.)", "metadata": [{"Location:": "Inishcrone, Co. Sligo", "Teacher:": "\nBean de Búrca\n"}, {"Collector": "Imeldia Cawley", "Gender": "female", "Age": "11"}, {"Language": "English"}]}, "4701701/4694002/4728476": {"title": "An Fóidín Marbh", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0170, Page 0017", "Page 0017"], "url": "https://www.duchas.ie/en/cbes/4701701/4694002/4728476", "text": "\nLong ago there were only a few carts in every townland.When a person died the people had to carry the corpse across fields to some place where there was a cart or a car. Sometimes they had to rest in a field. They called the spot of ground where the corpse was left a Foidín Mairbh. If a person stood on that spot in the night he was suddenly put astray. One night a young man left his house to go to the road. In crossing a field he passed over one, and all at once he was half a mile away. He tried to go to some light which was near him.But when he got near it he found there was a hedge before him.\n(continues on next page)\n", "school_info": "School: Maigh Locha (B.)", "metadata": [{"Location:": "Moylough, Co. Sligo", "Teacher:": "\nPádhraic Ó Braonáin\n"}, {"Collector": "Thomas P. Brett", "Gender": "male"}, {"Informant": "Pádhraic Ó Braonáin", "Gender": "male", "Occupation": "teacher"}, {"Language": "English"}]}, "4758453/4745361/4778334": {"title": "Hedge-Schools", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0231, Page 135", "Page 135"], "url": "https://www.duchas.ie/en/cbes/4758453/4745361/4778334", "text": "\n(continued from previous page)\nbecause there was no chalk.James Gaffney went to this school but he is dead now.\n\n\n\nJuly 1938\n(continues on next page)\n", "school_info": "School: Árd Ailinne (Mount Allen)", "metadata": [{"Location:": "Mountallen, Co. Roscommon", "Teacher:": "\nÁine, Bean Uí Loingsigh\n"}, {"Informant": "Thomas Flynn", "Gender": "male", "Age": "32", "Address": "Mountallen, Co. Roscommon"}, {"Language": "English"}]}, "4758460/4746217/4782427": {"title": "The Fairy Tree", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0247, Page 006", "Page 006"], "url": "https://www.duchas.ie/en/cbes/4758460/4746217/4782427", "text": "\nThe Fairy TreeThere is an old tree in the Townland of Brackloon! It is known as the Fairy tree of Bowery Bush!A man once cut a branch from the tree to stop a gap.One night later on this man was returning home from rambling when a man walked out from under the Fairy-tree and ordered the other man to put it back which he did there and then!He was told by the spirit that he must never touch the fairy tree - or lone bush!The Spirit then disappeared and to this day no one would dare touch the tree lest he be taken away in the Fairies!\n", "school_info": "School: Hanly Memorial Castlerea", "metadata": [{"Location:": "Castlerea, Co. Roscommon", "Teacher:": "\nAn Br. Seosamh\n"}, {"Collector": "Francis Cahill", "Gender": "male", "Address": "Tully, Co. Roscommon"}, {"Informant": "(name not given)", "Relation": "parent"}, {"Language": "English"}]}, "4770028/4767784/4813101": {"title": "A Fireside Tale - The Fairy Tree", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0833, Page 027", "Page 027"], "url": "https://www.duchas.ie/en/cbes/4770028/4767784/4813101", "text": "\nIn a nearby bog there is a house by the side of the road. Long ago there was a tree growing in front of the door.One cold, wet winter's night the man said, \"Tomorrow I shall cut down that tree in front of the door and make a good fire.\" \"Very well\" said his wife. He arose early next morning and cut the tree. That night a little poorly-clad old woman came to the door and knocked. The woman of the house arose and went to the door. \"What has you out in your bare feet this cold night?\" asked the woman of the house. \"You cut down my house\" replied the little old woman. She said no more but disappeared.That same night when the man of the house went to bed he saw a turkey-cock standing on the rafters. Every night it continued to come, approaching gradually nearer and nearer until after seven years it was by the side of the bed.They went for a priest and he put it away for seven years. When that time\n(continues on next page)\n", "school_info": "School: Barnashrone, Mountmellick", "metadata": [{"Location:": "O'More's Forest, Co. Laois", "Teacher:": "\nBean Uí Fhaoláin\n"}, {"Collector": "Annie Bennett", "Gender": "female", "Address": "Cloncanon Upper, Co. Laois"}, {"Informant": "James Bennett", "Relation": "parent", "Gender": "male", "Address": "Cloncanon Upper, Co. Laois"}, {"Language": "English"}]}, "4770037/4768458/4816682": {"title": "The Buffers Bridge", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0834, Page 326", "Page 326"], "url": "https://www.duchas.ie/en/cbes/4770037/4768458/4816682", "text": "\n(continued from previous page)\nwhite lady. Evidently the priest knew that she was the culprit. He brought her to the buffers on the road between Shane and Coolbangher he told her that she is to stay there under the bridge until the end of time.\n\n\n\nThe Fairy Tree.There is a tree that stands in BorrusLittle Some years ago - part of it lay across the road. Capt Kemmis could not pass with his carriage and horses. He decided to hire a man to cut the tree . No man around the locality would cut the tree. He cut cut the tree and got a pound for cutting it. He only lived five day afterwards. It is said to be a fairy tree. The trunk of it stands to this day. The man's arm withered before he died\n\n\n\nSome twenty years ago there lived a\n(continues on next page)\n", "school_info": "School: Scoil na mBráthar, Portlaoighse", "metadata": [{"Location:": "Port Laoise, Co. Laois", "Teacher:": "\nBr. Frampton\n"}, {"Collector": "P. Dunne", "Gender": "male", "Address": "Port Laoise, Co. Laois"}, {"Informant": "Mr D. Dunne", "Gender": "male", "Address": "Port Laoise, Co. Laois"}, {"Language": "English"}]}, "4770037/4768468/4816714": {"title": "Kyle", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0834, Page 336", "Page 336"], "url": "https://www.duchas.ie/en/cbes/4770037/4768468/4816714", "text": "\n(continued from previous page)\nto him because if they put up a tomb-stone it would be pulled down by the English soldiers. So that is how it got the name of Kyle. The ruins are still there. Inside the walls it is used as a Catholic cemetery\n\n\n\nThe fairy bush of ThinnaThere is a bush outside Portalingon called the fairy bush. One night a man was coming home after playing cards at a neighbours house. He took a short cut across a pasture home in which he had to pass a fairy bush. The fairies were dancing and they took him into the dance to dance and they did not let him home untill day-break. When he reached home he did not recover from the shock and in a very short time he died. The bush is still called the fairy bush\n", "school_info": "School: Scoil na mBráthar, Portlaoighse", "metadata": [{"Location:": "Port Laoise, Co. Laois", "Teacher:": "\nBr. Frampton\n"}, {"Collector": "Thomas Rourke", "Gender": "male", "Address": "Port Laoise, Co. Laois"}, {"Informant": "Mrs O' Rourke", "Gender": "female", "Address": "Port Laoise, Co. Laois"}, {"Language": "English"}]}, "4770040/4768650/4817707": {"title": "A Fairy Bush", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0835, Page 160", "Page 160"], "url": "https://www.duchas.ie/en/cbes/4770040/4768650/4817707", "text": "\nThere is a bush in our farm and it is called the \"Music Bush\".Every night from about twelve to two there used to be a light seen rising out of the bush and over to the house and around the chimney and back to the bush again.This happened every night till at last the people of the house got afraid and they sent for the priest and the priest came and put it into the bush and it was never seen out again.\n", "school_info": "School: Straboe", "metadata": [{"Location:": "Straboe, Co. Laois", "Teacher:": "\nBríd Nic Cormaic\n"}, {"Collector": "Theresa Daly", "Gender": "female"}, {"Language": "English"}]}, "4498593/4385261/4822676": {"title": "The Stray Sod", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0790, Page 20", "Page 20"], "url": "https://www.duchas.ie/en/cbes/4498593/4385261/4822676", "text": "\nClonsilla has always been a  well wooded district. The people from other districts used to come and hide in it in penal times. In Luttrellstown Wood there is a stray sod. Once a man was coming home he stepped on that sod and he kept walking around in a circle till morning. That sod is supposed to be a round circle.Once there was a priest hiding in Luttrellstown. The English knew he was there and they set hounds after him. He went round and round in a circle and then gave a jump to set the hounds off his track that is supposed to be the original of the stray sod. In coolmine woods there is a stray sod it is said that the priest was killed there and anyone who ever steps on a sod where a priest has been murdered will die also.\n", "school_info": "School: Clonsilla", "metadata": [{"Location:": "Clonsilla, Co. Dublin", "Teacher:": "\nM. Ní Cholmáin\n"}, {"Collector": "Ita Mooney", "Gender": "female", "Address": "Porterstown, Co. Dublin"}, {"Language": "English"}]}, "4798709/4792271/4925224": {"title": "Stray Sod", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0254, Page 380", "Page 380"], "url": "https://www.duchas.ie/en/cbes/4798709/4792271/4925224", "text": "\n\"Stray Sod\"In every district in Ireland, there is a particular spot, at which people are supposed to go astray, this is called a \"stray sod\".It is supposed that an unbaptized child is buried there, and that is the reason people go astray. When this happens a person, he should take off his coat, turn it inside out and tie down. This is a story told about a man, that went astray.One night there was a man named Quinn passing through a certain field in the townland of Ballagh, and he was suddenly surrounded by a big wood. This poor man was trying to make his way to a dance, which was in the neighbouorhood. Quinn kept walking on, but the wood was still in front of him. This time he sighted the dance house, but he was aroused by music and laughing that was behind him. Then he thought he\n(continues on next page)\n", "school_info": "School: Dangan", "metadata": [{"Location:": "Dangan (King), Co. Roscommon", "Teacher:": "\nThomas O' Flynn\n"}, {"Collector": "Mamie Stritch", "Gender": "female", "Address": "Ballagh, Co. Roscommon"}, {"Language": "English"}]}, "4798709/4792273/4925261": {"title": "Composition - Stray Sod", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0254, Page 382", "Page 382"], "url": "https://www.duchas.ie/en/cbes/4798709/4792273/4925261", "text": "\nComposition \" Stray Sod\"In every district in Ireland, there is a stray sod. A stray sod is supposed to be the sod under which an unbaptized child is buried.In our land, there is a stray sod. It is situated on the slope of a hill in front of a fort. This is a fairy fort. People say they hear music and singing and see lights in it every night. There are two mounds of earth in this fort. I never heard of anyone  going this way yet, but went astray at night.I heard a story of a man named Morris who went astray one night. He was coming from a neighbour's house. It was late in the night, about 12 O' Clock in the night and the moon was shining brightly. On approaching the fort, Morris saw a light and coming on nearer to the fort, he was set astray. He could see nothing around him but bushes. He walked round and round the bushes but could not get his way out. He then turned his coat inside out, sat on a stone and said some prayers. In some minutes\n(continues on next page)\n", "school_info": "School: Dangan", "metadata": [{"Location:": "Dangan (King), Co. Roscommon", "Teacher:": "\nThomas O' Flynn\n"}, {"Collector": "Patsy Reynolds", "Gender": "female", "Address": "Corbaun, Co. Roscommon"}, {"Language": "English"}]}, "4798709/4792274/4925263": {"title": "Composition - Stray Sod", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0254, Page 383", "Page 383"], "url": "https://www.duchas.ie/en/cbes/4798709/4792274/4925263", "text": "\n(continued from previous page)\nafterwards, he realized where he was, and found himself three miles from home, so set about walking the night path home and it was 5 o clock in the morning when he arrived.Patsy ReynoldsTortviewDrumonaCo Roscommon.\n\n\n\nStray SodThere are many places throughout Ireland noted for stray sods.  It is said that under this sod there is an unbaptised child buried.There is a field a quarter of a mile from my house in which people go astray at night.A man lived in my district long ago.  He had to pass through this field one night.  He went astray.  He did not know what to do.  He saw bushes and lakes and woods every side of him.  When he travelled for a while he sat down and took off his coat.\n(continues on next page)\n", "school_info": "School: Dangan", "metadata": [{"Location:": "Dangan (King), Co. Roscommon", "Teacher:": "\nThomas O' Flynn\n"}, {"Collector": "Maura Hogg", "Gender": "female", "Address": "Tooloscan, Co. Roscommon"}, {"Language": "English"}]}, "4811581/4798889/4927668": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0260, Page 098", "Page 098"], "url": "https://www.duchas.ie/en/cbes/4811581/4798889/4927668", "text": "\nThe Fairy Bush is a little bush in Feeny's field in Tullaghan. It is away from the other bushes. There is a big rock beside it. The rock is shaped like a coffin. There is supposed to be a crock of gold hidden under the rock.\n", "school_info": "School: Radharc na Sionainne", "metadata": [{"Location:": "Clooncah, Co. Roscommon", "Teacher:": "\nNóirín Ní Uiginn\n"}, {"Language": "English"}]}, "4742052/4731120/4938487": {"title": "Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0956, Page 207", "Page 207"], "url": "https://www.duchas.ie/en/cbes/4742052/4731120/4938487", "text": "\n(continued from previous page)\nasked to have some apples, telling her the story of how she got them from the fairies - no one was ever supposed to tell about anything they got from the fairies, and so Mary Martin was punished for breaking their confidence. When she looked in her apron, the apples no longer remained, being now replaced by clay.\n\n\n\nA Fairy Bush :-A man named Thomas Moorhead of Killakena went to cut a loan-bush or a fairy-bush, and with the first blow which he gave it with the axe, his nose began to bleed, and he got a pain in his head, and was confined to bed for three weeks afterwards.\n", "school_info": "School: Monaghan (Convent, Girls)", "metadata": [{"Location:": "Monaghan, Co. Monaghan", "Teacher:": "\nSr Síle\n"}, {"Language": "English"}]}, "4922043/4846849/4952294": {"title": "The Well of Glenbrohane", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0510, Page 021", "Page 021"], "url": "https://www.duchas.ie/en/cbes/4922043/4846849/4952294", "text": "\n(continued from previous page)\nbrohane. Water sprang up there and the druid's name was made famous, and the well which is there to the present day is called after him. Written by Teresa Curtis. Told by Bridget FoleyKilfrushKnocklongCounty Limerick\n\n\n\nA Fairy TreeA short distance out side the town of Clogheen there stands a hawthorn tree--not an ordinary one, though, but of a very peculiar shape. For generations past this tree has been known as the \"Fairy Tree\". How it came by this name is still a mystery, but it is the firm belief that on Mid Summer's eve the fairies dance around this tree, and therefore, it is very much venerated. So much indeed, that nobody would dare to puck a\n(continues on next page)\n", "school_info": "School: Cnoc Luinge (C.)", "metadata": [{"Location:": "Knocklong, Co. Limerick", "Teacher:": "\nSiobhán Ní Néill\n"}, {"Collector": "Teresa Curtis", "Gender": "female", "Address": "Knocklong, Co. Limerick"}, {"Informant": "Mrs Twomey", "Gender": "female", "Address": "Knocklong, Co. Limerick"}, {"Language": "English"}]}, "4769992/4764717/5013462": {"title": "The Fairy Hill", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0825, Page 055", "Page 055"], "url": "https://www.duchas.ie/en/cbes/4769992/4764717/5013462", "text": "\nBeside the townland of Tinnahinch there is a townland called Rathcoffey, The townland got its name from an old Rath which is situated in the land of Rathcoffey, A man named Mr,Coffey owned the land then. The Rath is called the Fairy Hill or the Raheen Hill. There is a large flat stone at this fort or rath. There are many queer x's cut out on this stone, There are also the words \"Red Cure\" and \"Red Hugh\", and  the date sixteen hundred and eleven. It is said that the fairies inhabited the fort long ago and it is also that  pagans were buried on the top of the hill. There are underground tunnels from the fort to various houses\n(continues on next page)\n", "school_info": "School: Tinnahinch, Mountmellick", "metadata": [{"Location:": "Tinnahinch, Co. Laois", "Teacher:": "\nS. Ní Bhradáin\n"}, {"Collector": "Willie Fitzpatrick", "Gender": "male", "Address": "Tinnahinch, Co. Laois"}, {"Informant": "Mr Joseph Dooley", "Gender": "male", "Address": "Tinnahinch, Co. Laois"}, {"Language": "English"}, {"Location": "Rathcoffey"}]}, "4769992/4764719/5013463": {"title": "The Fairy Hill", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0825, Page 057", "Page 057"], "url": "https://www.duchas.ie/en/cbes/4769992/4764719/5013463", "text": "\nThe Fairy Hill is in the town land of Rathcoffey. It is in a field belonging to Mr,Egan. It is a fairly big hill with trees and shrubs growing on and around it. In the centre of the hill there is a hole leading down to a cave. There is a flat stone over the hole that could not be rooted up. On the stone there are x's cut out and \"Red Cure\"is also cut out on it. There is an underground tunnel leading from the cave to Bells in Ballyglaheen. They were big protestant people but none of them are living now.Long ago fairies lived on the Hill\n(continues on next page)\n", "school_info": "School: Tinnahinch, Mountmellick", "metadata": [{"Location:": "Tinnahinch, Co. Laois", "Teacher:": "\nS. Ní Bhradáin\n"}, {"Collector": "Catherine Fitzpatrick", "Gender": "female", "Address": "Tinnahinch, Co. Laois"}, {"Informant": "Mr Joseph Dooley", "Gender": "male", "Address": "Tinnahinch, Co. Laois"}, {"Language": "English"}, {"Location": "Rathcoffey"}]}, "4758479/4747471/5015334": {"title": "Going Astray", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0251, Page 112", "Page 112"], "url": "https://www.duchas.ie/en/cbes/4758479/4747471/5015334", "text": "\nIn rural Ireland people often go stray some time or another. On foggy nights people are sure to leave their way when travelling through big fields and sometimes in certain fields which are known to locals. People say there is a stray in certain places. Many years ago a Rathcroghan farmer had decided to go to a pig fair in Boyle and as he had to start early he thought it was not worth while to go to bed. Fortunately there was a dance in a neighbour's house which he visited to pass away a few hours. He enjoyed the Dance very much and he left at one o'clock to be home a half-hour later. Near the house he met with a number of people who asked him if he was coming home and they\n(continues on next page)\n", "school_info": "School: Rath Cruachan", "metadata": [{"Location:": "Rathcroghan, Co. Roscommon", "Teacher:": "\nSéamus Diúc\n"}, {"Collector": "Peter Finnerty", "Gender": "male"}, {"Informant": "John Padian", "Gender": "male"}, {"Language": "English"}]}, "4922182/4858892/5019794": {"title": "The Fairy Bush", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0546, Page 092", "Page 092"], "url": "https://www.duchas.ie/en/cbes/4922182/4858892/5019794", "text": "\nThere is a field in Templetuohy in which there is a very ancient bush called the Fairy Bush. Long ago two young girls in the neighbourhood went to a cross-road dance one Sunday afternoon with strict orders from their parents to be home at a certain time. On their way home they came through the field where this bush was, on coming near the bush they heard great music and laughter and on coming closer they saw a party of ladies and gentlemen dancing around the bush. They remained a considerable time watching the party and when they went home they were asked by their parents why they were so late and they told them what they heard and seen. Their parents not believing them brought them back to where they had seen\n(continues on next page)\n", "school_info": "School: Teampoll Tuaithe, Teampoll Mór (B.)", "metadata": [{"Location:": "Templetouhy, Co. Tipperary", "Teacher:": "\nSeán Ó Meadhra\n"}, {"Informant": "Denis Doherty", "Gender": "male", "Age": "69", "Address": "Longorchard, Co. Tipperary"}, {"Language": "English"}]}, "4922271/4866164/5072288": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0573, Page 285", "Page 285"], "url": "https://www.duchas.ie/en/cbes/4922271/4866164/5072288", "text": "\nAbout half a mile west of Ballyporeen there is a borheen which leads to a river.There was once a woman washing clothes on the bank of the river when suddenly she heard horses and carts coming down the borheen. The stakes were then knocked down all round her, and the cattle of the neighburing farmer were walloped against the sticks and into the river. This incident took place near the famous Cloc-'Á;Thigearna and undoubtedlu there is some connection between the two. (There is) This is said to be true as another woman afterwards saw it.\n\n\n\nThis old Lios is about three miles from Ballyporeen.  It is in the townland of Killtankin.  It is said that if you cut a tree or took a stick out of this Lios you would be killed.  A man cut down a tree out of it one day, and the next day as he was unloading sheet iron a bit fell on him and killed him.\n\n\n\nThe old fairy bush about one mile from Ballyporeen at Kilcaroon was felled recently by a storm.  It is the tradition of the old people that it stood there for centuries and they tell an old story of a hunchback who was cured\n(continues on next page)\n", "school_info": "School: Ballyporeen", "metadata": [{"Location:": "Ballyporeen, Co. Tipperary", "Teacher:": "\nL. Ó Conchubhair\n"}, {"Collector": "Séamus Mac Giobúin", "Gender": "male", "Address": "Glenacunna, Co. Tipperary"}, {"Language": "English"}]}, "4922273/4866288/5073824": {"title": "The Fairy Tree", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0573, Page 408", "Page 408"], "url": "https://www.duchas.ie/en/cbes/4922273/4866288/5073824", "text": "\nIn the vicinity of Clogheen and in the townsland of Killcaroon an old white thorn tree stands alone overlooking the main road from Clogheen to Ballyporeen. It is known locally as \"the fairy tree\". Tradition maintains that long ago men were hanged from its branches and buried at its roots and further tradition asserts that these men were sworn before execution to guard during all time the treasure deposited there by the fleeing Danes from the onward and victorious  march of Brian Boru's army. At night young and old people would not go near this tree lest they should encounter the eerie folk who guard its treasure. Quite recently the legend associated with it has acquired an almost international fame, owing to the song known as \"the fairy tree of Clogheen\", composed by a well known author and sung by the famous tenor Count John McCormac to American and British audiences\n", "school_info": "School: Clogheen Convent", "metadata": [{"Location:": "Clogheen, Co. Tipperary", "Teacher:": "\nSr. Emmanuel Hearn\n"}, {"Language": "English"}]}, "5008849/4960974/5075533": {"title": "A Hungry Spot", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0669, Page 017", "Page 017"], "url": "https://www.duchas.ie/en/cbes/5008849/4960974/5075533", "text": "\n(continued from previous page)\nsince that.            Rose Devlin,Hacklim,Ardee.\n\n\n\nTwenty years ago there was a house in Co West Meath. One day two men made up their minds to stop in the house. They packed food in baskets and left them in the house during the day. The two men did not come the same road to the house. During the day one of them got sick and could not come. The other man came, not knowing his companion was sick. After a time a ghost came in and he was the same sort of a man as the sick man. The man who gad not been sick thought the ghost was the sick man and he started talking to him. He said to him no ghost came to us yet. In the middle of the night the ghost killed the man.Patrick Devlin,30, Glenview,Drogheda.\n\n\n\nOne night a woman had to milk cows in a field. It was a dark foggy night. When she had\n(continues on next page)\n", "school_info": "School: Dromin, Dunleer", "metadata": [{"Location:": "Dromin, Co. Louth", "Teacher:": "\nS. Ó Cathaláin\n"}, {"Language": "English"}]}, "5008849/4960979/5075607": {"title": "A Stray Sod", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0669, Page 022", "Page 022"], "url": "https://www.duchas.ie/en/cbes/5008849/4960979/5075607", "text": "\nA Stray SodOne night Henry Holdcroft went into his field to count the sheep. It was a dark night and when he had his sheep counted he was going to the gate. There was a dog at the gate and he was barking. The man went round and round the field but he could not find the gate. He was in the field all night.Moira Conalty,Kings Cross,Dromin.\n\n\n\nA Ghost StoryOne night John Taaffe and George Torris were coming home from John Gregory's funeral in Co. Meath. When they were on the top of Mullacurry hill, a big man came out of a field and he stopped them. Then he asked them where were they going at this hour of the night. They said they were going home. The ghost said you better go home quickly or someone will be after you. Then he disappeared.John Taaffe,Dromin,Dunleer.\n\n\n\nA Ghost StoryOne night about a year ago, Jack Halpenny was working in a farmers house in Drumcar. He went to bed this night and it was about twelve o'clock at night. It was in the hay barn he\n(continues on next page)\n", "school_info": "School: Dromin, Dunleer", "metadata": [{"Location:": "Dromin, Co. Louth", "Teacher:": "\nS. Ó Cathaláin\n"}, {"Collector": "Moira Conalty", "Gender": "female", "Address": "Richardstown, Co. Louth"}, {"Language": "English"}]}, "5008849/4960980/5075612": {"title": "A Ghost Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0669, Page 023", "Page 023"], "url": "https://www.duchas.ie/en/cbes/5008849/4960980/5075612", "text": "\n(continued from previous page)\nwas sleeping. There was oats in the barn. He was about an hour in bed when the oats were thrown in on top of him. He had Holy water beside him and he was afraid to put out his hand to bless himself. The next morning when awoke there was not a grain of corn to be seen. He never slept in it again.Mrs Halpenny,Rathescar,Dromin.\n\n\n\nA Hungry SpotAbout six year ago Mrs Murphy and her husband went to Dundalk for groceries. When they were coming home they sat down to rest on the side of the road. Mrs Murphy sat down on the hungary spot. She felt herself getting weak and hungary. They were about half a mile from home. They went into a house and got a piece of bread and she was all right. It happened this side of the blue railway at Dundalk.Mrs Murphy,Rathescar,Dunleer.\n\n\n\nA Stray SodOne night Peter Flanagan was coming home from a house. He crossed the fields home. In this field there were a lot of cattle. He was walking for three miles of the field and could not find a gate. Every yard of the field he would walk he would see a big heap of bushes in front of him. He was there until morning.\n(continues on next page)\n", "school_info": "School: Dromin, Dunleer", "metadata": [{"Location:": "Dromin, Co. Louth", "Teacher:": "\nS. Ó Cathaláin\n"}, {"Collector": "Peter Flanagan", "Gender": "male", "Address": "Rathescar North, Co. Louth"}, {"Language": "English"}]}, "5008860/4961581/5075680": {"title": "Townland of Hitchestown", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0672, Page 188", "Page 188"], "url": "https://www.duchas.ie/en/cbes/5008860/4961581/5075680", "text": "\n(continued from previous page)\nThe Loge field because it is beside the LodgeThe Long field because it is long.Crocnamo, field has a big hill in it.Garryard the name of a big hill.There is a stray  sod in the wild field and one night a man went astray and was out all night.\n\n\n\nThe Moat fieldThe Mill fieldThe IndiagoesThe hill fieldThe Slate field.There is an old saying that there is a fairies pass in Kelly's moat and one night a woman went out into the field and the fairies came and took her away and when she came back she was never the same after.\n\n\n\nThere is an old saying that there is a Stray\n(continues on next page)\n", "school_info": "School: Díseart, Droichead Átha", "metadata": [{"Location:": "Dysart, Co. Louth", "Teacher:": "\nM. Ní Ailpín\n"}, {"Language": "English"}]}, "5008882/4963447/5077644": {"title": "Customs regarding the Dead", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0679, Page 071", "Page 071"], "url": "https://www.duchas.ie/en/cbes/5008882/4963447/5077644", "text": "\nCustoms regarding the DeadIt is never right to have the clocks going when the corpse is in the house.It is right to take the feet of the corpse out the door first.It is right for all the mirrors to be turned while the corpse is in the house.It is not right for the mother of the dead person to go to the funeral.If anybody falls in the grave they will be the next to die.\n\n\n\nIn some fields there is a part of ground called the stray sod. If anybody is crossing the field during the night and they stand on the stray sod they will not be able to get out of that field until daybreak. One night\n(continues on next page)\n", "school_info": "School: Pres. Convent, Drogheda", "metadata": [{"Location:": "Drogheda, Co. Louth", "Teacher:": "\nSr. M. Patrick\n"}, {"Collector": "Veronica Browne", "Gender": "female", "Address": "Sheephouse, Co. Meath"}, {"Informant": "Mrs Browne", "Gender": "female", "Address": "Sheephouse, Co. Meath"}, {"Language": "English"}]}, "5008886/4963835/5077917": {"title": "A Stray Sod", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0680, Page 054", "Page 054"], "url": "https://www.duchas.ie/en/cbes/5008886/4963835/5077917", "text": "\nNearly a century ago there was a wealthy farmer living in the country.One day when he was coming home after being at his work in the fields he thought to take a short cut. He was crossing a field when he strode on a stray sod. He made an attempt to reach the gate. It was impossible for matter where he walked nothing faced him but a ditch. After roaming around the field more times than he could count he turned  his coat inside out. No sooner had he done this than he opened the gate and went home.\n", "school_info": "School: Naomh Pádhraic (C.), Droichead Átha", "metadata": [{"Location:": "Drogheda, Co. Louth", "Teacher:": "\nM. Bhreathnach, M. Ní Dhubhainn\n"}, {"Informant": "Mrs Metcalfe", "Gender": "female", "Age": "56", "Occupation": "oibrí tí", "Address": "Thomas Street, Co. Louth"}, {"Language": "English"}]}, "5008883/4963619/5078250": {"title": "The Stray Sod", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0679, Page 243", "Page 243"], "url": "https://www.duchas.ie/en/cbes/5008883/4963619/5078250", "text": "\nLong long ago there lived in Donore a woman named Biddy Drumgoole. One night Biddy was coming home after bying a gross of eggs. She was crossing a field and stood on a stray sod. All night she walked round the field, but could not get out. People said she stood on a stray sod.\n", "school_info": "School: St. Vincent de Paul, Drogheda", "metadata": [{"Location:": "Drogheda, Co. Louth", "Teacher:": "\nSr. Magdalen\n"}, {"Informant": "Mrs Kelly", "Gender": "female", "Address": "West Street, Co. Louth"}, {"Language": "English"}]}, "5008892/4964352/5078600": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0682, Page 008", "Page 008"], "url": "https://www.duchas.ie/en/cbes/5008892/4964352/5078600", "text": "\n(continued from previous page)\ngone too far and lost their way, and it is said that their music was heard under the Railway Bridge Duleek.\n\n\n\nAfter the Battle of the Boyne the remains of some of the soldiers who were killed in the battle were brought to Donore and buried in a marshy piece of land in Mr. Berrills farm near the village of Donore.  It is said that if you walk on the graves of the soldiers at night you will step on a \"stray sod\" and you will be walking round the field all night.\n", "school_info": "School: Donore", "metadata": [{"Location:": "Donore, Co. Meath", "Teacher:": "\nMaighréad Nic Eóin\n"}, {"Collector": "Gerard Victory", "Gender": "male", "Age": "60"}, {"Informant": "John Victory", "Gender": "male", "Age": "60", "Address": "Donore, Co. Meath"}, {"Language": "English"}]}, "5008866/4962233/5078778": {"title": "A Stray Sod", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0674, Page 292", "Page 292"], "url": "https://www.duchas.ie/en/cbes/5008866/4962233/5078778", "text": "\n1.  There are certain fields in this district that containes a stray sod and has a lot of storys connected  with them. One of Byrnes fields of the Cavan contains a stray sod. If you were so unluckly to be crossing that field at twelve ocloc at night when the faires are coming they would be there till the next morning going round the field looking for the gate. When you would be coming near the gate you would see it but when you would come up to, the gate would disappear out of your sight.2.  Once upon a time an old woman named Mrs Onews was coming home from the Cavan. On her way home she had to cross one of Byres fields whice the call the big meadow. She was so unlucky to stand on the certain sod that she went round the field for the whole night. At lenth she saw the gate she also saw a white woman standing on it. When the woman disappeared out of sight Mrs Ownes saw the gate and got out of the field.3.  There are two ways to get out of a stray sod in the night. First is to sit down in the field then take out a fag and smoke it. Second is to close your eyes keep them closed for about ten minutes the you can see the gate and can get out.\n(continues on next page)\n", "school_info": "School: Tenure", "metadata": [{"Location:": "Tinure, Co. Louth", "Teacher:": "\nS. Ó Cathail\n"}, {"Collector": "Peggy Mc Cullough", "Gender": "female", "Address": "Ferny Park, Co. Louth"}, {"Language": "English"}]}, "5008891/4964285/5080054": {"title": "The Stray Sod", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0681, Page 005", "Page 005"], "url": "https://www.duchas.ie/en/cbes/5008891/4964285/5080054", "text": "\nMany years ago a man was very fond of taking a walk late at night. One night he took a walk in a field at the back of his house. He went through the gap at the end of the garden about eleven o'clock. As he went through the gap he stood on a stray sod.He was walking around the field for about four hours. It was about three o'clcok in the morning when he got out. He never went into the field again at night.\n", "school_info": "School: Naomh Muire (B.), Droichead Átha", "metadata": [{"Location:": "Drogheda, Co. Louth", "Teacher:": "\nA. Mac Uidhlinn\n"}, {"Collector": "Patrick Bagnall", "Gender": "male", "Address": "Pearse Park, Co. Louth"}, {"Informant": "Miss A. Walsh", "Gender": "female", "Address": "Newfoundwell Road, Co. Louth"}, {"Language": "English"}]}, "5044784/5037752/5081761": {"title": "Folk Tale - The Stray Sod", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0963, Page 027", "Page 027"], "url": "https://www.duchas.ie/en/cbes/5044784/5037752/5081761", "text": "\nThis belief is everywhere around here.There are '' stray sods ''When a person is out at night if he stands on such a sod he goes astray and loses all idea of direction so that he wanders hopelessly around generally till morning.Sometimes in his wanderings he may reach a road or house and then he is all right.It is helpful, if such should happen to you, to take off your coat and turn it inside out and wear it thus.That is the only hope of undoing the charm.Tom Dolan of Altaturham stood on a ''stray sod  one evening when he was searching for his cattle.Next evening he was out wandering around Florence court some 14 miles away. The '' Stray\n(continues on next page)\n", "school_info": "School: Tullybrack", "metadata": [{"Location:": "Tullybrack, Co. Cavan", "Teacher:": "\nF. Maguire\n"}, {"Informant": "F. Maguire", "Gender": "unknown", "Address": "Tullybrack, Co. Cavan"}, {"Language": "English"}]}, "5044784/5037764/5081794": {"title": "An Féar Gortach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0963, Page 039", "Page 039"], "url": "https://www.duchas.ie/en/cbes/5044784/5037764/5081794", "text": "\nThis belief has come down the generations. The great hunger is called the Féir Gortach and the name is used to name the complaint just as the name of any other illness would be - thus \"the \"Feír Gortach\" struck him on his way home. It is described as a wonderful hunger or feeling of being hungry.There is no cure except some oat-meal.It was the custom in olden times for people always to carry a piece of oat-bread in the pocket.Long stories are told about victims of the mysterious disease and Long descriptions of how they felt and of the immediate cure on eating the smallest morsel of oat meal.\n", "school_info": "School: Tullybrack", "metadata": [{"Location:": "Tullybrack, Co. Cavan", "Teacher:": "\nF. Maguire\n"}, {"Informant": "Frank Maguire", "Gender": "male", "Address": "Tullybrack, Co. Cavan"}, {"Language": "English"}]}, "5044795/5039018/5082725": {"title": "The Stray Sod", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0966, Page 060", "Page 060"], "url": "https://www.duchas.ie/en/cbes/5044795/5039018/5082725", "text": "\nThe Stray SodThe \"stray sod\" is another belief in this district.  There are stray sods in several places - James Paíd's Bog, Altataskin, Pat Bán's Hill, Tullylugfinn, Patrick Dolan's Bog, Altataskin, Commas Mountain, James Pat's Bog, Owencam and McAuley's Hill Tullynamoltra.No one can tell the exact spot where the sod lies as it is only after sunset that it has its power.  Anyone who happens to stand on the \"sod\" immediately loses his way and cannot find his way further.  He must keep on travelling until daybreak and sometimes after hours of travelling finds himself back at the place he started.  At other times the person may find himself a long distance from the place he lost his way.\n(continues on next page)\n", "school_info": "School: Alt an Chuilinn", "metadata": [{"Location:": "Altachullion, Co. Cavan", "Teacher:": "\nBrigid Martin\n"}, {"Language": "English"}]}, "5044845/5043840/5086608": {"title": "Ghosts", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0980, Page 042", "Page 042"], "url": "https://www.duchas.ie/en/cbes/5044845/5043840/5086608", "text": "\n(continued from previous page)\nthen lighted, and placed within the make believe head, so that when the boys came round the turn, at Matt Reilly's lane they thought it was a living- being.  They all went by it, but James Tierney who happened to be coming home of his ceilidh wouldn't go by it.The men who put it up were hidden close by, so they quenched the candle and pulled the stick out of the ground bringing the sheet and turnip with them as if it vanished.  Tierney then passed by in a terrible fright and ever since, he wouldn't go by the bridge without a light or someone with him.\n\n\n\nThere was a man named Patrick smith who when returning home at night, had\n(continues on next page)\n", "school_info": "School: Knocknagilla", "metadata": [{"Location:": "Knocknagillagh, Co. Cavan", "Teacher:": "\nT. Gilchrist\n"}, {"Collector": "Andy Mc Manus", "Gender": "male"}, {"Informant": "Andy Mc Manus", "Gender": "male", "Address": "Greaghnagee, Co. Cavan"}, {"Language": "English"}]}, "5044849/5044071/5087683": {"title": "Fairy Bushes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0981, Page 134", "Page 134"], "url": "https://www.duchas.ie/en/cbes/5044849/5044071/5087683", "text": "\nOne situated along side of road at Longfield. Large white thorn bush with many old & thick stems. Despite orders from Co Council to have it cut no one has ever dared & co council employees never interfere with it. It is alleged that this bush was often seen illuminated with fairy lights.Drumhallagh Bush in townland of Drumhallagh & in a field adjacent to Kilnargarbet pass. Miss Catherine Rourke alleges that at the fork of it is  entrance  to a fairy castle &  an underground tunnel leads from here to Lissigney fort. At the bottom of the bush  is a hollow alleged to be dug by those seeking the mythical crock of gold. In connection with litigation re the farm on which t is situated I have mentioned the foliation & the blossoms in month of December.\n", "school_info": "School: Laragh (B.)", "metadata": [{"Location:": "Larah, Co. Cavan", "Teacher:": "\nP. Ó Briain\n"}, {"Language": "English"}]}, "5070770/5061116/5094247": {"title": "The Fear Gortach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0994, Page 163", "Page 163"], "url": "https://www.duchas.ie/en/cbes/5070770/5061116/5094247", "text": "\nWhen a person is going on a journey he puts a piece of oaten bread in his pocket afraid he would meet the Fear Gortach or the hunger man.He sits along the side of the road and eats the bread.  If he lets a single crumb fall when he is eating it the Féar \"Gortach\" will grow beside him.  In the townland of Omard in the hollow of the road below Lynch’s gate people have been overtaken by the Fear Gortach.\n\n\n\nIt is said that if anyone steps on a féar gorta he will fall down and if he does not get food he will die.A féar gorta is caused by people eating bread without dropping a crumb and this is said to anger the good people.There is a stray sod where an unbaptized child is buried and often people going home at night step on a stray sod and go astray.  When a person goes astray he usually takes off his coat and puts it on inside out.  This is said to enable him to find his way home.\n", "school_info": "School: Kilnaleck (B.)", "metadata": [{"Location:": "Kilnaleck, Co. Cavan", "Teacher:": "\nP. Ó Máirtín\n"}, {"Language": "English"}]}, "5070770/5061116/5094251": {"title": "The Fear Gortach", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0994, Page 163", "Page 163"], "url": "https://www.duchas.ie/en/cbes/5070770/5061116/5094251", "text": "\nWhen a person is going on a journey he puts a piece of oaten bread in his pocket afraid he would meet the Fear Gortach or the hunger man.He sits along the side of the road and eats the bread.  If he lets a single crumb fall when he is eating it the Féar \"Gortach\" will grow beside him.  In the townland of Omard in the hollow of the road below Lynch’s gate people have been overtaken by the Fear Gortach.\n\n\n\nIt is said that if anyone steps on a féar gorta he will fall down and if he does not get food he will die.A féar gorta is caused by people eating bread without dropping a crumb and this is said to anger the good people.There is a stray sod where an unbaptized child is buried and often people going home at night step on a stray sod and go astray.  When a person goes astray he usually takes off his coat and puts it on inside out.  This is said to enable him to find his way home.\n", "school_info": "School: Kilnaleck (B.)", "metadata": [{"Location:": "Kilnaleck, Co. Cavan", "Teacher:": "\nP. Ó Máirtín\n"}, {"Language": "English"}]}, "5070770/5061123/5094291": {"title": "A Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0994, Page 170", "Page 170"], "url": "https://www.duchas.ie/en/cbes/5070770/5061123/5094291", "text": "\n(continued from previous page)\nDuring the flight into Egypt the Holy Family rested at at a place where rushes were growing and Our Lord went playing in the rushes and the top of one of them entered his eye and from that day until this the tops of rushes are withered.\n\n\n\nThere is a ''Stray Sod'' on Charles Boylan's land between the townlands of Toneylion and Mullycastle.The late Ned McLoughlin repeatedly stated that he had been put astray, while returning to Kill from his Ceili in Mullycastle, when passing over this spot.\n", "school_info": "School: Kilnaleck (B.)", "metadata": [{"Location:": "Kilnaleck, Co. Cavan", "Teacher:": "\nP. Ó Máirtín\n"}, {"Language": "English"}]}, "5044839/5043209/5094293": {"title": "The Fear Gorta", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0978, Page 283", "Page 283"], "url": "https://www.duchas.ie/en/cbes/5044839/5043209/5094293", "text": "\nThe Fear-Gorta was a feeling of great weakness and hunger suddenly taken at certain places when going a journey.Several people took the Fear-Gorta at the \"Hollies\" half way up Largain brae.  The person who took the Fear-Gorta had sometimes to lie down and rest, or sometimes he made his way to the nearest house and asked a bit of oaten-bread.Some people carried a piece of oaten bread on a journey afraid of the Fear-Gorta.N.B.  A traveller is supposed to take the \"Fear Gorta\" at the spot where a person or persons died from the famine.\n", "school_info": "School: Árd-chill", "metadata": [{"Location:": "Ardkill More, Co. Cavan", "Teacher:": "\nBean Uí Chonalláin\n"}, {"Collector": "Ben Galligan", "Gender": "male", "Address": "Ardkill More, Co. Cavan"}, {"Language": "English"}]}, "5008895/4964575/5095767": {"title": "Standing on a Stray Sod", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0682, Page 231", "Page 231"], "url": "https://www.duchas.ie/en/cbes/5008895/4964575/5095767", "text": "\nThere was a man living in Duleek long ago, and his name was Owen Burley. He used to be working on the railway, and one time they were working down at Plattin. One dark night he was going home from his work and he went across the Commons. He kept going on for about an hour and still there was no sign of anything about.  He thought he could see a big hedge on every side of him. When he would try to get to it, it would be as far away as ever. Then he turned his coat inside out and daw a light coming from behind a bush, and when he followed it he found himself in a bog and could not get out. The light went out and he thought it must have been \"Jack the Lantern.\" When a man found him in the morning he was forst bitten.There was a woman going to milk cows in the fields near to the Commons, and she saw something while in the middle of the field. But she never got over to it that night because she stood on a stray sod and was going round in a ring the whole time.\n", "school_info": "School: Duleek (B.)", "metadata": [{"Location:": "Duleek, Co. Meath", "Teacher:": "\nMicheál Ó Braonáin\n"}, {"Collector": "Seumas Ó Gormáin", "Gender": "male", "Address": "Commons, Co. Meath"}, {"Informant": "Thomás Ó Gormáin", "Gender": "male", "Age": "56", "Address": "Commons, Co. Meath"}, {"Language": "English"}]}, "5070817/5067136/5097663": {"title": "A Stray Sod", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1010, Page 267", "Page 267"], "url": "https://www.duchas.ie/en/cbes/5070817/5067136/5097663", "text": "\nThere is a stray sod on our hill; it is supposed that there  was an unbaptised child buried there. If anyone went astray he would have to turn his coat before he could get off it. Mrs MacManus, Bridget Clarke, and Phil Carroll went astray on it.\n\n\n\nThe reason the top of the rush is brown is because Saint Patrick cursed it! It stuck in his eye. You would never get a rush without the top of it being brown.\n", "school_info": "School: Druim an Easbuig", "metadata": [{"Location:": "Drumanespick, Co. Cavan", "Teacher:": "\nÁ. Ní Dhálaigh\n"}, {"Collector": "Eileen Carroll", "Gender": "female", "Address": "Monaghanoose, Co. Cavan"}, {"Informant": "Phil Carroll", "Gender": "male", "Address": "Monaghanoose, Co. Cavan"}, {"Language": "English"}]}, "5070798/5065004/5100189": {"title": "A Stray Sod", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1003, Page 381", "Page 381"], "url": "https://www.duchas.ie/en/cbes/5070798/5065004/5100189", "text": "\nOne time, long ago two girls were home in Crossreagh on holidays, and a friend called to see them one evening and asked them to his home in Ardlow. They had to pass through a haunted field and they did not know the field was haunted. When they were in middle of the field they saw a big ditch before them and somthing brought them a mile from the field they did not know where they were or what to do as they were passing through fields for almost 3 hours. Soon the found a gate leading to a house. When they went into the house the people told them never to go to go into that field again that it was a haunted field.\n", "school_info": "School: Cros Riabhach", "metadata": [{"Location:": "Crossreagh, Co. Cavan", "Teacher:": "\nT. Ó Siordáin\n"}, {"Collector": "Maureen Keating", "Gender": "female", "Address": "Crossreagh, Co. Cavan"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "female"}, {"Language": "English"}]}, "5070798/5065024/5100257": {"title": "A Stray Sod", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1003, Page 401", "Page 401"], "url": "https://www.duchas.ie/en/cbes/5070798/5065024/5100257", "text": "\nI live in Moortown and there are fields all around our house.One fine bright night, my man Laurence Cahill was coming home from his Céilidhe and he fund he could not find the pass to the house though he could see the light.He knew he came on a \"stray sod\" so he took off his coat and found himself at the gate.\n", "school_info": "School: Cros Riabhach", "metadata": [{"Location:": "Crossreagh, Co. Cavan", "Teacher:": "\nT. Ó Siordáin\n"}, {"Informant": "Martha Cahill", "Gender": "female", "Address": "Moortown, Co. Meath"}, {"Language": "English"}]}, "5009166/4993513/5104589": {"title": "Led Astray", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0758, Page 249", "Page 249"], "url": "https://www.duchas.ie/en/cbes/5009166/4993513/5104589", "text": "\nOne night six boys from Lettergonnel were going to a dance in Jim Cunninghams.On going across Gaigue hill they saw a little man before them. They hurried to catch up with him but he still kept the same distance before them and they were unable to catch up with him.When they thought they ought to be at Cunninghams they saw a light and on going to it they entered the mill of John Flynn Creelaughta where the kiln-man was up drying oats. It was then four o'clock in the morning. So they decided they would go back to the dance. But the boys never got there, the next place they arrived was at Gunshinans Lettergullion. They called them there and two of the boys who were at the dance and gone to bed got up and left them across Gaigue Hill. It was then near seven o'clock in the morning.\n", "school_info": "School: Géag (C.), Baile na Muc", "metadata": [{"Location:": "Gaigue, Co. Longford", "Teacher:": "\nMáire Ní Mhurchadha\n"}, {"Collector": "Annie Larkin", "Gender": "female", "Age": "14", "Address": "Gaigue, Co. Longford"}, {"Informant": "Mrs P Larkin", "Relation": "grandparent", "Gender": "female", "Address": "Gaigue, Co. Longford"}, {"Language": "English"}]}, "5008901/4965342/5105668": {"title": "The Stray Sod of Bellewstown", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0685, Page 042", "Page 042"], "url": "https://www.duchas.ie/en/cbes/5008901/4965342/5105668", "text": "\nThere is a stray sod on Bellewstown Hill Many people have been rambling all night over this sod Old people say that to say the rosary is the only remedy to get off it. It is said that an un Baptised child or person was buiried there.\n\n\n\nNot far from my home there is a place called Silver stream there was a family in that district and whenever one of those people died a crowd of foxes would come around the house and would not go away, and the more they would chase them away the more that would come.\n", "school_info": "School: Bellewstown", "metadata": [{"Location:": "Bellewstown, Co. Meath", "Teacher:": "\nUinsionn Ó Draghneáin\n"}, {"Collector": "Bernadette Blacke", "Gender": "female", "Address": "Bellewstown, Co. Meath"}, {"Language": "English"}]}, "5008912/4966237/5106145": {"title": "Stray Sod", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0687, Page 109", "Page 109"], "url": "https://www.duchas.ie/en/cbes/5008912/4966237/5106145", "text": "\nMany people tell stories of a stray sod. If anyone chances to tread on this particular sod he loses all sense of direction and wanders round and round for hours completely lost. The remedy is. Turn your coat or put it on inside if  (?)  is supposed to bring you to your senses.This stray sod is supposed to cover the grave of an unbaptised child.\n\n\n\nThere is also a sod called the hungry sod and if you tread on it you get weak with hunger and almost drop. You have to call at the nearest house and ask something to eat.I have heard of this is in the west of Ireland also but they call it \"The Hungry Grass.\"There is said to be a hungry sod in the manor farm about 1/2 mile from the school.\n", "school_info": "School: Johnstown", "metadata": [{"Location:": "Johnstown, Co. Meath", "Teacher:": "\nMiss H.C. Hickie\n"}, {"Language": "English"}]}, "5070850/5070182/5106384": {"title": "The Stray Sod", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1023, Page 203", "Page 203"], "url": "https://www.duchas.ie/en/cbes/5070850/5070182/5106384", "text": "\nRight beside us at home there lived a man named Johnny McQuillan. He is dead for a number of years but Patrick O'Reilly knew him very well. He was through the Board War and was stationed in Ceylon  Mr. O'Reilly told me that one night Mc. Quillan was at a game of cards over somewhere in Laragh and when coming home he was led astray. He knew there was someone bringing him through the fields but he could not \"see a sinner\". Finally he found himself in a \"pratie field\" with forrows but do as he might he could not get out of the field. he kept splas -\n(continues on next page)\n", "school_info": "School: Bláithín Íosa, Lappin (?)", "metadata": [{"Location:": "Lappanbane, Co. Cavan", "Teacher:": "\n-\n"}, {"Collector": "Margorie Smith", "Gender": "female"}, {"Informant": "Mr P. O' Reilly", "Gender": "male", "Address": "Corgreagh, Co. Cavan"}, {"Language": "English"}]}, "5008956/4970624/5108769": {"title": "The Stray Sod", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0699, Page 034", "Page 034"], "url": "https://www.duchas.ie/en/cbes/5008956/4970624/5108769", "text": "\nOn a large grazing farm one mile from Trim is a small patch of green grass and which the oldest inhabitants call \"a stray sod\" which means if you happen to walk on this particular sod you can never find your way.Once a man happened to walk on the sod around nine o'clock and strange to relate that man was walking the whole night till seven o'clock next morning when the herd of the farm found him he was almost exhausted from exposure after his weary night. The herd\n(continues on next page)\n", "school_info": "School: Mercy Convent, Trim", "metadata": [{"Location:": "Trim, Co. Meath", "Teacher:": "\nSr. Berchmans\n"}, {"Collector": "Una Stenson", "Gender": "female", "Address": "Newhaggard Road, Co. Meath"}, {"Informant": "Mrs Stenson", "Gender": "female", "Address": "Newhaggard Road, Co. Meath"}, {"Language": "English"}]}, "5008925/4967097/5109018": {"title": "The Fear Gorta", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0689, Page 450", "Page 450"], "url": "https://www.duchas.ie/en/cbes/5008925/4967097/5109018", "text": "\nSometimes a person gets suddenly very hungry an old person would say oh! “you stood on the hungry sod” or “you met the fear gorta”The bean sidhe cries certain families. She comes to the window and cries mournfully. The \"Raheen Dubh\" in Clarkestown on the farm formerly owned by the Carlows.A rick of hay was made on this rath once, next morning it was found knocked down and the hay all scattered outside the rath.Frances DoranParish DanganTownland IsaacstownCo Meath.\n", "school_info": "School: Gallow", "metadata": [{"Location:": "Gallow, Co. Meath", "Teacher:": "\nCáit, Bean Uí Mhuirín\n"}, {"Collector": "Frances Doran", "Gender": "male", "Address": "Dangan, Co. Meath"}, {"Language": "English"}]}, "5008977/4972938/5111289": {"title": "More Local Cures", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0705, Page 142", "Page 142"], "url": "https://www.duchas.ie/en/cbes/5008977/4972938/5111289", "text": "\n(continued from previous page)\ngot the leavings of a wheaten cake from Mrs Tommy Reilly next door, who was Reilly before marriage and it cured them.Fr. Gerard, Mountnugent (R.I.P.) cured Jack Hall's child of meningitis, when the doctors had given up as incurable. The only malady left was that he had to wear glasses.\n\n\n\nOne evening as Pat Owens was coming home from the town of Mullagh Cavan the fear gorta came on him at Rosie Smyth's house a little distance from his own and he had a rest for awhile with weakness and hunger.  When he did drag himself home he came in sweating and exhausted till food again revived him.\n", "school_info": "School: Woodpole", "metadata": [{"Location:": "Woodpole, Co. Meath", "Teacher:": "\nSiobhán, Bean Uí Chonaill\n"}, {"Language": "English"}]}, "5008968/4971931/5111767": {"title": "The Old Catholic Church of Kells", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0703, Page 125", "Page 125"], "url": "https://www.duchas.ie/en/cbes/5008968/4971931/5111767", "text": "\nThe old R.C Church was situated in the ash grove, that was at the back of the tennis courts. The entrance to it was the present entrance in Wallace’s coal yard. A few old people remember having heard holy mass there. They are old Bawthy or Balthy Smith also known as Tom the Bawthy, Maurice Swift and Tom Fields. All these are deceased R.I.P. The present Catholic Church was built at the beginning of the nineteenth century.\n\n\n\nUnbaptised children were sometimes buried in a garden or in the corner of a field; and sometimes they were buried outside the graveyard or buried in the graveyard in a special corner of their own.The place where an unbaptised child was buried was called “the straying sod”. If you ashamed to step on this sod at night you would lose your way, and you\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire, Ceannanus Mór", "metadata": [{"Location:": "Kells, Co. Meath", "Teacher:": "\nSiúracha na Trócaire\n"}, {"Collector": "Philomena Usher", "Gender": "female", "Age": "12"}, {"Language": "English"}]}, "5008999/4975403/5111926": {"title": "The Stray Sod and the Hungry Sod", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0712, Page 007", "Page 007"], "url": "https://www.duchas.ie/en/cbes/5008999/4975403/5111926", "text": "\nIt is quite a common belief in this district that there is such a thing as a \"Stray Sod\". If a traveller happens to put his foot on this sod in a field at night time he immediately loses all sense of direction. Stories are frequently told of people spending the whole night aimlessly wandering around fields which they know well, and unable to find their way home till morning. If a traveller happens to lose his way by treading on \"a Stray Sod\", and takes the trouble of turning his coat inside-out, he will at once be able to know where he is and find his way home. A Stray Sod is supposed to be the spot where an unbaptised child was buried.There is also the \"Hungry Sod\" or the Fod Ghorta as it is sometimes called. If a person happens to stand on this sod he is seized with hunger and weakness. The Hungry Sod is supposed to be the spot where an illegitimate unbaptised child was buried secretly.Patrick Cassidy N.T.DrumconrathArdee\n", "school_info": "School: Drumconrath (B.)", "metadata": [{"Location:": "Drumcondra, Co. Meath", "Teacher:": "\nPatrick Cassidy\n"}, {"Collector": "Patrick Cassidy", "Gender": "male", "Occupation": "teacher", "Address": "Drumcondra, Co. Meath"}, {"Language": "English"}]}, "5009006/4976197/5112902": {"title": "A Stray Sod", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0714, Page 002", "Page 002"], "url": "https://www.duchas.ie/en/cbes/5009006/4976197/5112902", "text": "\nThere are three fields situated about half a mile from where I live which are called the \"Fairy Fields.\" I have often wondered why and how they got that name and if there were really such things as fairies in which our forefathers believed. I have made many inquiries of the old people I thought would know about things which occured in the older time, and here is a story which my father told me, not why they got that name, but of a very strange thing which happened to him on one of these fields, and here it is as he told it to me. \"One evening when I came home from work I put my hand in my pocket and found I had no tobacco so I decided to go to the shop for a smoke. The shop was about two miles when going round the road and about half the journey across the fields so I strolled down across the fields. After having a treat and a chat with some old friends I came out to make my return journey home. At about nine o clock I strolled up across the fields and when I came to the middle of one of the Fairy Fields my coat became as heavy as lead and the hair stood on my head with fear. After that I must have lost my senses. I thought every hedge\n(continues on next page)\n", "school_info": "School: Stackallen", "metadata": [{"Location:": "Stackallan, Co. Meath", "Teacher:": "\nP.T. Mac Gabhann\n"}, {"Collector": "Philomena Tighe", "Gender": "female", "Address": "Rochestown, Co. Meath"}, {"Informant": "Charles Tighe", "Gender": "male", "Age": "circa 66", "Address": "Stackallan, Co. Meath"}, {"Language": "English"}]}, "5008992/4974861/5113249": {"title": "A Stray Step", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0710, Page 190", "Page 190"], "url": "https://www.duchas.ie/en/cbes/5008992/4974861/5113249", "text": "\nNot far from our home in the townland of Dunheeda There is a big field of about twelve acers and if you crossed that at a certain time of the night. It serves as a shortcut from the main road to another road, you would you would certainly not get out of it till day light. Several people have encountered this a strange thing even not very long ago about a year ago. All the explanation that can be given for this is that many years ago an unbaptised child was supposed to be buried some place in this field but no one is living now that ever knew anything about it except what they heard from their forefathers.\n", "school_info": "School: Carrickleck", "metadata": [{"Location:": "Carrickleck, Co. Meath", "Teacher:": "\nMáire Ní Ragallaigh\n"}, {"Informant": "Anthony Kierans", "Gender": "male", "Address": "Carrickleck, Co. Meath"}, {"Language": "English"}]}, "5009006/4976307/5113325": {"title": "The Leipreachán", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0714, Page 112", "Page 112"], "url": "https://www.duchas.ie/en/cbes/5009006/4976307/5113325", "text": "\n(continued from previous page)\nand brought out their child. He was never seen or heard of again.\n\n\n\nOne day a man was coming from Navan and he met the fear górta.  He got it hard to get off the bicycle and he had to crawl on his hands and knees to the nearest house.  If he had a crust of bread to eat he would have got better.The fear górta is a spirit that meets people on the road and makes them exceedingly hungry.\n", "school_info": "School: Stackallen", "metadata": [{"Location:": "Stackallan, Co. Meath", "Teacher:": "\nP.T. Mac Gabhann\n"}, {"Language": "English"}]}, "5009014/4977210/5114895": {"title": "The Stray Sod of Ballinvalley", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0716, Page 088", "Page 088"], "url": "https://www.duchas.ie/en/cbes/5009014/4977210/5114895", "text": "\nIn Ballinvalley there is a field called the Caldra.  In this field there are many old graves.  In this field also there is a stray sod.  They say that there is a child buried under this stray sod.  The child it is said was never baptized and that it is not at rest because it never saw the face of God.  If people walk on this piece of land it is said that they are sure to go astray.  The grass always stays green on this sod and that is the only way people\n(continues on next page)\n", "school_info": "School: Oldcastle (C.)", "metadata": [{"Location:": "Oldcastle, Co. Meath", "Teacher:": "\nMáire D. Ní Nualláin\n"}, {"Informant": "Mr Reynolds", "Gender": "male", "Address": "Drumlerry, Co. Meath"}, {"Informant": "Mr Tobin", "Gender": "male", "Address": "Drumsawry or Summerbank, Co. Meath"}, {"Language": "English"}]}, "5009014/4977212/5114896": {"title": "The Stray Sod of Fennor", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0716, Page 090", "Page 090"], "url": "https://www.duchas.ie/en/cbes/5009014/4977212/5114896", "text": "\nThe Stray Sod of Fennor.In the field where Fennor is buried there is a stray sod and if anyone walk on this sod he will lose his sight and will go astray.One night as my father was walking through this field everything seemed to grow dark in front of him and he saw h beautiful lights.  He was going along trying to find his way he hit his head against and found his way to the house.  When he came into the house he regained his eyesight.My Uncle who lives near Virginia has a field called the black field which has also a stray sod.  One night a man was walking through the field\n(continues on next page)\n", "school_info": "School: Oldcastle (C.)", "metadata": [{"Location:": "Oldcastle, Co. Meath", "Teacher:": "\nMáire D. Ní Nualláin\n"}, {"Informant": "Mr Peter Brady", "Gender": "male", "Address": "Fennor Upper, Co. Meath"}, {"Language": "English"}]}, "5009039/4979935/5116146": {"title": "An Old Chapel", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0724, Page 163", "Page 163"], "url": "https://www.duchas.ie/en/cbes/5009039/4979935/5116146", "text": "\nGeorge Anderson of Moyleroe, Delvin was one day leaving Mrs Gilmore at the station. Just above Ballinlough George Anderson showed her where there was an old chapel long ago. There was a little wooden cross on top of a mud-wall. Tom Farrell, who lived in Delvin was at Mass in it.\n\n\n\nThere is a field  in Moyleroe, owned today, by Mrs Tormey of Delvin and there is a stray sod in it. Anyone that goes into it at night cannot get out again until morning.\n", "school_info": "School: Ballinvally (C.)", "metadata": [{"Location:": "Ballinvally, Co. Westmeath", "Teacher:": "\nS. Nic Shiomóin\n"}, {"Language": "English"}]}, "5008932/4967741/5119200": {"title": "A Stray Sod", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0692, Page 158", "Page 158"], "url": "https://www.duchas.ie/en/cbes/5008932/4967741/5119200", "text": "\nIn a field of Patrick Gorrey's Clondoogan there is supposed to be a stray sod. If a person stands on this sod he or she will not get out of the field that night.Once an old woman named Mrs. Malone, was going home from Patrick Gorrey's one night with a can of milk. She had to cross this field as it was the shortest way. The night was very dark and she could hardly see her way. She thought of the Stray Sod but considered it was a lie. When she was half-way across she found she was not going towards the gap. She turned in the direction of it and walked straight for it but she could not get it. She decided to go all round the hedge so that she could not miss it, but she found that she was on the opposite side of the field so she went back to the other side and tried to get through the hedge when a voice said \"Dont come out here.\" She tried to scream but she could not. When morning came she was in the field still. She went home and never went out in the night any more.\n", "school_info": "School: Dangan", "metadata": [{"Location:": "Dangan, Co. Meath", "Teacher:": "\nBrian Mag Fhógartaigh\n"}, {"Collector": "Niall Nicholas Fagan", "Gender": "male", "Address": "Clondoogan, Co. Meath"}, {"Informant": "Mrs T. Fagan", "Relation": "parent", "Gender": "female", "Age": "47", "Address": "Clondoogan, Co. Meath"}, {"Language": "English"}]}, "5009062/4982532/5119277": {"title": "Going Astray", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0731, Page 089", "Page 089"], "url": "https://www.duchas.ie/en/cbes/5009062/4982532/5119277", "text": "\nOnce Joe Daly was going down to the bottoms to look at the horses, and he fell between the stucks of turf and he got up but could not find his coat and he kept searching till he got tired.He started for home and lost his way and he thought he crossed the foot stich and he said,\"I will get out on the road and go into Nugents.  When he got out on the road and went into Nugents and when he went into the house he was at Mc.Donalds in Ballyconnell, four miles from the bottoms.\n", "school_info": "School: Dalystown", "metadata": [{"Location:": "Dalystown, Co. Westmeath", "Teacher:": "\nKathleen Grehan\n"}, {"Collector": "Katty O' Brien", "Gender": "female", "Address": "Clonfad, Co. Westmeath"}, {"Informant": "Christopher Munroe", "Gender": "male", "Address": "Clonyhague, Co. Westmeath"}, {"Language": "English"}]}, "5009081/4984650/5119377": {"title": "A Strange Incident", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0736, Page 081", "Page 081"], "url": "https://www.duchas.ie/en/cbes/5009081/4984650/5119377", "text": "\n(continued from previous page)\nsod\". He went on some distance in the field and suddenly he did not know where he was and he went on further.He was in the fields for about an hour and a half.He got out on the road near Loughnavally.It was ten oclock when he got home.\n\n\n\nMy grandfather Christopher Bannon was going home from work one evening and he crossed this field in which the \"stray sod\" - the same field in which\n(continues on next page)\n", "school_info": "School: Ballinea", "metadata": [{"Location:": "Ballina, Co. Westmeath", "Teacher:": "\nMrs Farrell\n"}, {"Collector": "Nicholas Nally", "Gender": "male"}, {"Informant": "Christopher Bannon", "Gender": "male", "Address": "Strattonstown, Co. Westmeath"}, {"Language": "English"}]}, "5009008/4976606/5120858": {"title": "Stray Sods", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0714, Page 453", "Page 453"], "url": "https://www.duchas.ie/en/cbes/5009008/4976606/5120858", "text": "\nAs Mrs. Madden was coming from Heronstown to her home she carried a hatch of eggs. Twilight fell as she went into the fields. She stepped on a stray sod and went round and round the field. She thought the ditches were mountains and that she had not left the field, but she found herself about four miles from home at Joe Halton's of Newtown.\n", "school_info": "School: Grangegeeth", "metadata": [{"Location:": "Grangegeeth, Co. Meath", "Teacher:": "\nSeósaimhín, Bean Uí Dhubhghaill\n"}, {"Informant": "Mrs Madden", "Gender": "female", "Age": "70", "Address": "Crossane, Co. Meath"}, {"Language": "English"}]}, "5009008/4976608/5120875": {"title": "Stray Sod", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0714, Page 455", "Page 455"], "url": "https://www.duchas.ie/en/cbes/5009008/4976608/5120875", "text": "\nOne night as James Russell was going to look at cattle, and as he was coming through Carney's field, he stepped on a stray sod, and as he couldn't get the gap to get out in another field. He went round and round the field and still couldn't get the gap. At last he thought he felt the gap, but still he went on. At last he felt the iron bars of the gap and he got out in the other field. He was out from half-past nine till five past-three.\n", "school_info": "School: Grangegeeth", "metadata": [{"Location:": "Grangegeeth, Co. Meath", "Teacher:": "\nSeósaimhín, Bean Uí Dhubhghaill\n"}, {"Informant": "James Russell", "Gender": "male", "Age": "34", "Address": "Rathmaiden, Co. Meath"}, {"Language": "English"}]}, "5044771/5037115/5137213": {"title": "A Fairy Tree", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0927, Page 107", "Page 107"], "url": "https://www.duchas.ie/en/cbes/5044771/5037115/5137213", "text": "\nIn the field near Ballyduff new school, there is a lonely sceac tree and through fear of the fairies the people called it the \"Good peoples tree\"  Our forefathers thought that somewhere round it was the home of the fairies.  The reason why is because the fairies always dwelt under it.When this tree would come in blossom, the inhabitants round would not dare to touch as much as one flower on it.  Later on of course a time would come when the haws would come on this sceach.  Beautiful ripe haws they were.  No matter how ripe this fruit was the people would do no more than look at them.However strange to say the Winter before last the wind blew the sceach down.  Shortly after some of the inhabitants gathered together and put it up again.  Strong wire was caught around its bark and fastened it tightly in the ground.  Today that lonely sceach tree is its nicest in Mr. Thunder's field.\n", "school_info": "School: Ballyduff", "metadata": [{"Location:": "Ballyduff Upper, Co. Wicklow", "Teacher:": "\nCaitlín Ní Mharannáin\n"}, {"Collector": "Lil Byrne", "Gender": "female", "Address": "Boleynass Upper, Co. Wicklow"}, {"Informant": "Mrs Byrne", "Relation": "parent", "Gender": "female", "Address": "Boleynass Upper, Co. Wicklow"}, {"Language": "English"}]}, "4921763/4904680/5171677": {"title": "The Fairy Tree", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0358, Page 191", "Page 191"], "url": "https://www.duchas.ie/en/cbes/4921763/4904680/5171677", "text": "\nThere was a blackthorn tree seen on dire on a fence between Laca and Mountinfant. A woman named (lived in ) Sibhan lived in a little house near this tree, and she used to dance with the fairies. One night she was going up to see Con Kelleher who was sick. The fairies told her not to do any good for him or that she would pay for it.There was a tree on fire near James Daly's kiln of Tureenreagha and it used be seen evry night It was very near Sonney Rings house. It was supposed to be a\n(continues on next page)\n", "school_info": "School: Cnoc na Groighe (B.), Ráth Mhór", "metadata": [{"Location:": "Knocknagree, Co. Cork", "Teacher:": "\nDiarmuid Ó Muimhneacháin\n"}, {"Collector": "Conchubhair Ó Líonacháin", "Gender": "male"}, {"Informant": "Thomas Murphy", "Gender": "male", "Age": "80", "Address": "Knockyhena, Co. Cork"}, {"Informant": "Daniel Buckley", "Gender": "male", "Age": "68", "Address": "Knockyhena, Co. Cork"}, {"Language": "Irish"}]}, "5177653/5177212/5190780": {"title": "An Féar Gorta", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0599, Page 208", "Page 208"], "url": "https://www.duchas.ie/en/cbes/5177653/5177212/5190780", "text": "\nThe Feár Gorta is a complete collapse from hunger that overtakes some people. It attacks people that are only after eating, as well as people that are long fasting. Some people are more subject to it than others, and as a precaution such persons put a crust of bread, or a few grains of wheat or oats in their pockets when travelling long distances from home. It is said tha the smallest portion of food will give relief. The Fear Gorta  is a peculiar sensation. A profound sense of weakness seizes the victim, and an overwhelming longing for food, so much so that the person so affected is prepared to eat any kind of raw food.Dennis Kelly and his brother from Kinturk, Conolly, Co Clare were hunting hares one morning early. Both were fasting. When they had killed one hare, Dennis was attacked by the Féar Gorta. He complained of his weakness to his brother, who chided him and forced him to carry the hare and\n(continues on next page)\n", "school_info": "School: Ballycar, Cuinche", "metadata": [{"Location:": "Ballycar, Co. Clare", "Teacher:": "\nLiam Mac Clúin\n"}, {"Language": "mixed"}]}, "5177653/5177224/5190788": {"title": "Going Astray", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0599, Page 220", "Page 220"], "url": "https://www.duchas.ie/en/cbes/5177653/5177224/5190788", "text": "\nThere are various fields and many people have been known to go astray when travelling through them.John Clune Quin Co Clare was working in Boora, and as the time was summer, he said he would take the short cut home. A beaten path easily recognisable, and quite familiar to John led the whole way home. No sooner had John left the public road and got on to the path than he went astray, for he found himself at the public road again and again. No matter what care John took in pursuing the path he went astray on each occasion. John knew quite well that the path led to a narrow drain after a short distance through a field. He could never reach the drain. He knew also that his journey home led past a farmer's house. The field that the path led through was small being less than an acre in area, and was bounded on three sides by a stone fence and on the other by the drain. Tired of aimless travelling John stopped and took his bearings. He realized that he was not in the field that\n(continues on next page)\n", "school_info": "School: Ballycar, Cuinche", "metadata": [{"Location:": "Ballycar, Co. Clare", "Teacher:": "\nLiam Mac Clúin\n"}, {"Informant": "James O' Dea", "Gender": "male"}, {"Language": "English"}]}, "5162129/5156488/5197327": {"title": "The Fairy Tree", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0574, Page 009", "Page 009"], "url": "https://www.duchas.ie/en/cbes/5162129/5156488/5197327", "text": "\nThe Fairy tree.In the vicinity of Cloghun and in the townsland of Kilcaroon and old white thorn tree stands alone overlooking the main road from Cloghun to Ballyporeen. It is known locally as 'the fairy tree.' Tradition maintains that long ago men were hanged from its branches and buried at its roots and further tradition asserts that these men were sworn before execution to guard during all time the treasure deposited there by the fleeing Danes from the onward and victorious march of Brian Boru's army.At night young and old people would not go near this tree lest they should encounter the eerie folk who guard its treasure. Quite recently the legend associated with its has acquired an almost international fame, owing to the song known as \"The fairy tree of Cloghun\" composed by a\n(continues on next page)\n", "school_info": "School: Convent of Mercy, Clogheen", "metadata": [{"Location:": "Clogheen, Co. Tipperary", "Teacher:": "\nSr. M. Emmanuel Hearn\n"}, {"Collector": "Mona Morrissey", "Gender": "female", "Address": "Ballyboy West, Co. Tipperary"}, {"Informant": "Mr Denis Fox", "Gender": "male", "Address": "Ballyboy West, Co. Tipperary"}, {"Language": "English"}]}, "5162129/5156495/5197331": {"title": "The Fairy Tree", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0574, Page 016", "Page 016"], "url": "https://www.duchas.ie/en/cbes/5162129/5156495/5197331", "text": "\nThe Fairy TreeAbout a mile from Ballyporeen and three miles from Clogheen stands the Fairy Tree. It is commonly known as the \"Carragan Bush\" owing to its situation on a very high hill overlooking the main road from Clogheen to Ballyporeen. The fairy Tree is only a name given it by people who wish to make themselves grand.The tree is also known as the \"One mile tree\" as it marks a mile from Ballyporeen. The hill is called \"One tree hill\" as this tree is the only one growing on the hill and that on the summit. The bush is a blackthorn bush and the fruit it bears are very tiny and no-body even birds or animals\n(continues on next page)\n", "school_info": "School: Convent of Mercy, Clogheen", "metadata": [{"Location:": "Clogheen, Co. Tipperary", "Teacher:": "\nSr. M. Emmanuel Hearn\n"}, {"Collector": "Mary Fahy", "Gender": "female", "Address": "Carrigmore, Co. Tipperary"}, {"Informant": "Mrs P. Fahy", "Gender": "female", "Address": "Carrigmore, Co. Tipperary"}, {"Language": "English"}]}, "5162129/5156529/5197367": {"title": "The Fairy Tree of Kilcommon", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0574, Page 050", "Page 050"], "url": "https://www.duchas.ie/en/cbes/5162129/5156529/5197367", "text": "\nThe Fairy Tree of Kilcommon.There is a Lis seen in Killcommon. Around this Lis grows a clump of tree. One day two men were digging potatoes in a field, close by the Lis, and when mid-day came they began to eat their dinner when all of a sudden they saw six young women dressed in cloaks and hoods. They came into the field where the men were working, and began to pick the potatoes into their aprons but all the time there were working they never said a word. The fairy women kept\n(continues on next page)\n", "school_info": "School: Convent of Mercy, Clogheen", "metadata": [{"Location:": "Clogheen, Co. Tipperary", "Teacher:": "\nSr. M. Emmanuel Hearn\n"}, {"Collector": "Mary Mc Grath", "Gender": "female", "Address": "Clogheen, Co. Tipperary"}, {"Language": "English"}]}, "5162149/5158856/5197749": {"title": "The Straying Sod", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0655, Page 007", "Page 007"], "url": "https://www.duchas.ie/en/cbes/5162149/5158856/5197749", "text": "\nThe Straying SodThere is field in the townsland of Joanstown called the pump-field. It is a very dangerous field during mid-night. It is said that in this field there is a straying sod and if you walk on this sod when you are crossing the field you are sure to go astray. When you stand on the sod you cannot find your way out of the field. If you keep walking round and round the field you cannot find a gap or ditch. A clever man once thought out the matter and he got out of the difficulty. He turned his coat inside out and in that way he got out of the field.\n", "school_info": "School: An Charraig Bheag, Carraig na Siúire", "metadata": [{"Location:": "Carrickbeg, Co. Waterford", "Teacher:": "\nSeán Ó Comhraidhe\n"}, {"Collector": "Michael Mc Grath", "Gender": "male", "Address": "Joanstown, Co. Waterford"}, {"Informant": "Mr Patrick Burke", "Gender": "male", "Address": "Joanstown, Co. Waterford"}, {"Language": "English"}, {"Location": "Joanstown"}]}, "5215809/5231357/5264026": {"title": "Going Astray", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137F, Page 11_027", "Page 11_027"], "url": "https://www.duchas.ie/en/cbes/5215809/5231357/5264026", "text": "\nOne day Pat Duffy of Lanmore was coming from Midgefield from his sister's house. He was coming above Conry's of Lanmore when a big fog came and he was put astray. The fairies put him down hills and he said himself he thought he was coming home all the time. When he was going down these hills he never felt them a bit. He thought he was in a lovely place. While he was going along he could hear lovely singing and talking. He never felt until he was struck up against Knappa Church. He stood there until the fog went and then\n(continues on next page)\n", "school_info": "School: Lankill", "metadata": [{"Location:": "Lankill, Co. Mayo", "Teacher:": "\nSeán Ó Cibhil\n"}, {"Collector": "Nora King", "Gender": "female", "Address": "Lanmore, Co. Mayo"}, {"Informant": "John Walsh", "Gender": "male", "Address": "Lanmore, Co. Mayo"}, {"Language": "English"}]}, "5215809/5231400/5264244": {"title": "A Fairy Bush", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137F, Page 12_016", "Page 12_016"], "url": "https://www.duchas.ie/en/cbes/5215809/5231400/5264244", "text": "\nThere is a fairy bush east of our house on the road side.  It is a white thorn bush.  People can see lights of many colours jumping around that bush at about twelve o'clock.One time a man passed that bush when he was coming from town and he saw a small man sitting on the bush.  He walked quickly passing the bush and the man disappeared.  When he looked behind he saw a few lights like candles running across the road after one another.  He walked quickly home that night and he is afraid passing that bush ever since.  The bush is still there.  Lights were seen there last winter by a girl named Annie\n(continues on next page)\n", "school_info": "School: Lankill", "metadata": [{"Location:": "Lankill, Co. Mayo", "Teacher:": "\nSeán Ó Cibhil\n"}, {"Collector": "Eileen King", "Gender": "female", "Address": "Lanmore, Co. Mayo"}, {"Informant": "Tom King", "Gender": "male", "Address": "Lanmore, Co. Mayo"}, {"Language": "English"}]}, "5215809/5231416/5264927": {"title": "A Fairy Bush", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137F, Page 12_032", "Page 12_032"], "url": "https://www.duchas.ie/en/cbes/5215809/5231416/5264927", "text": "\nThere was a bush in the fort in Clooneskill. About six years ago John Walsh of Cloonskill dug the bush out of the fort. The next day he had to go to bed because he got ill. He was in bed for a long while. One night a neighbour came in and he told him that if he left back the bush again he would get all right. John Walsh could not leave back the bus as he was ill to his neighbour left it back. He got all right again and was able to get up next day.I heard this story from John Walsh, Lanmore, Liscarmey POst Office Westport Co. Mayo\n", "school_info": "School: Lankill", "metadata": [{"Location:": "Lankill, Co. Mayo", "Teacher:": "\nSeán Ó Cibhil\n"}, {"Collector": "Eileen Walsh", "Gender": "female", "Address": "Lanmore, Co. Mayo"}, {"Informant": "John Walsh", "Gender": "male", "Address": "Lanmore, Co. Mayo"}, {"Language": "English"}]}, "5215809/5231422/5264952": {"title": "A Fairy Bush", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137F, Page 12_038", "Page 12_038"], "url": "https://www.duchas.ie/en/cbes/5215809/5231422/5264952", "text": "\nThere is a white thorn fairy bush outside Loftus's old house in Creggsundarragh. One night Martin Kerrigan of Knappa-Beg was looking out the door and he saw a blaze of light over all the bush. He kept looking because he was not afraid. The next place ha saw the light was on a hill on his own land. He did not know how it got to that hill. It stayed there for about a half and hour playing around a rock on the hill. Then it went down behind the hill and disappeared.I heard this story from Julia Kerrigan, Knappabeg, Westport Co Mayo  23.11.1937\n", "school_info": "School: Lankill", "metadata": [{"Location:": "Lankill, Co. Mayo", "Teacher:": "\nSeán Ó Cibhil\n"}, {"Collector": "Eileen King", "Gender": "female", "Address": "Lanmore, Co. Mayo"}, {"Informant": "Julia Kerrigan", "Gender": "female", "Address": "Knappagh Beg, Co. Mayo"}, {"Language": "English"}]}}