{"4428099/4378027/4442301": {"title": "Daoine Cáiliúla", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0637, Page 309", "Page 309"], "url": "https://www.duchas.ie/en/cbes/4428099/4378027/4442301", "text": "\nDo bhí fear i gCnoc an Óir agus do chuir sé iarainn isteach sa teine agus do bhí giota an iarainn ceithre slat ar fhaid. Nuair a bhí an -iarann dearg do thóg sé amach as an teine é. Annsan do shiúil sé ar an iarainn agus é dearg. Ní raibh an bhróga air agus níor rith sé in aon chor. Níl fhios agam cad é an ainm a bhí air.\n\n\n\nDo bhí fear i gCnoc an Fheoir uair agus do bhí sé ábalta cnámh bhriste do dheisiughadh.Do bhí fear eile ins an áit seo agus do thóg sé dhá 1/2 chts in a mhéurannaibh agus thóg sé ós cionn a chinn iad. D'fhág sé ann iad go cionn cúig neomat. Is é anim bhí ag an fear ná Mac Craith.\n", "school_info": "School: Knockanore, Tulach an Iarainn", "metadata": [{"Location:": "Knockanore, Co. Waterford", "Teacher:": "\nConchobhar Ó Cróinín\n"}, {"Collector": "Máire Ní Mhullamhnaigh", "Gender": "female", "Address": "Ballyphilip West, Co. Waterford"}, {"Language": "Irish"}]}, "4427877/4353330/4449303": {"title": "Food", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0105, Page 250", "Page 250"], "url": "https://www.duchas.ie/en/cbes/4427877/4353330/4449303", "text": "\n(continued from previous page)\nwith the potatoes. Times were hard then. The people were not fully fed. They would eat a great deal of potatoes at a meal. I heard of two men who were working at a widow-woman. She did not give them anything to eat until evening and she left them down a great heap of potatoes on the table . They had neither knife nor fork. They kept eating ever ever until they could not see one another with the heap of skins that were on the table. Men were half starved in those times.\n\n\n\nTom Concannon who lived at the foot of the Hill where the old hedge school was and where John Morris used to live up to very lately was a bone-setter. He was father to James Concannon the Hedge Teacher. Peter Thornton, father of Michael Thornton of Rahard used to measure heads for a disease known then as fiabhras sgoibheadach. he used to measure heads Mondays\n(continues on next page)\n", "school_info": "School: Scoil N. Comáin, Hollymount", "metadata": [{"Location:": "Hollymount Demesne, Co. Mayo", "Teacher:": "\nDonncha Ó Riain\n"}, {"Collector": "Donnchadh Ó Riain", "Gender": "male", "Occupation": "múinteoir", "Address": "Rahard, Co. Mayo"}, {"Informant": "John Merrick", "Gender": "male", "Age": "85", "Occupation": "farmer", "Address": "Hollymount Demesne, Co. Mayo"}, {"Language": "English"}]}, "4428079/4375956/4450224": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0153, Page 180", "Page 180"], "url": "https://www.duchas.ie/en/cbes/4428079/4375956/4450224", "text": "", "school_info": "School: Eiscreach", "metadata": [{"Location:": "Eskeragh, Co. Mayo", "Teacher:": "\nSeán Ó Raghallaigh\n"}, {"Collector": "Seán S. Ó Raghallaigh", "Gender": "male", "Occupation": "múinteoir", "Address": "Eskeragh, Co. Mayo"}, {"Language": "English"}]}, "4649705/4648849/4661528": {"title": "Bonesetting", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0214, Page 343", "Page 343"], "url": "https://www.duchas.ie/en/cbes/4649705/4648849/4661528", "text": "\nCloone(Teague, Donohue, Bohan). These families are very successful bonesetters. The first especially has been successful in cases where amputation was held to be the only cure by Dublin doctors. Heartache: Cup of oatmeal to forehead or breast. Warts: Hide a piece of raw meat. A chewed ivy leaf to draw out a thorn. Cure for warts: Cut a raw potato, and put it to them. Cure for nettle sting: Rub with a dock-leaf.\n", "school_info": "School: Gort Leitreach", "metadata": [{"Location:": "Gortletteragh, Co. Leitrim", "Teacher:": "\nSeosamh Mac Cionnaith\n"}, {"Language": "English"}]}, "4706347/4704791/4713592": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0445, Page 099", "Page 099"], "url": "https://www.duchas.ie/en/cbes/4706347/4704791/4713592", "text": "\n(continued from previous page)\nthis district who could cure mortification. One of the cures used was forge water stolen from a smith.\n", "school_info": "School: Currans (C.)", "metadata": [{"Location:": "Currans, Co. Kerry", "Teacher:": "\nNóra, Bean Uí Bhraoin\n"}, {"Language": "English"}]}, "4742109/4736803/4949810": {"title": "Bone-Setters", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0471, Page 266", "Page 266"], "url": "https://www.duchas.ie/en/cbes/4742109/4736803/4949810", "text": "", "school_info": "School: Kilgobnet (C.)", "metadata": [{"Location:": "Kilgobnet, Co. Kerry", "Teacher:": "\nEibhlín, Bean Uí Fhoghladha\n"}, {"Language": "English"}]}, "4770004/4766087/4956687": {"title": "Ruins of a Church", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0828, Page 153", "Page 153"], "url": "https://www.duchas.ie/en/cbes/4770004/4766087/4956687", "text": "\n(continued from previous page)\nwas near us. Her Aunt showed her where the Stations were in the church.A that time a lot of poor people would be seeking alms around the country and most of the people would give them a nights lodging.\n\n\n\nOne poor crippled and innocent creature used to be wheeled in a barrow from one neighbour's house to another and there was always a \"cead- mile-failte\" before her others would be around selling wares and those would be sure to have all the news of the country for miles around.\n\n\n\nThere was a man who lived a few miles away from us who was a great cow Doctor, and also the Delaney's of Feerigh who were famous \"bone Setters and their was\n(continues on next page)\n", "school_info": "School: St John of God Convent, Rathdowney", "metadata": [{"Location:": "Rathdowney, Co. Laois", "Teacher:": "\nThe Sisters\n"}, {"Language": "English"}]}, "4922231/4862829/5019356": {"title": "Bone-Setters", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0560, Page 049", "Page 049"], "url": "https://www.duchas.ie/en/cbes/4922231/4862829/5019356", "text": "\nThere is a bone setter in the parish named Willam Bolger. He lives in Glennaskough. He is able to mend any broken or put any bones that are out of place that are out of place back again. His father was also a bone setter. He charges a little to fix bones. His son Paddy is also a bone setter but is not as good as his father.\n", "school_info": "School: Grangemocler (B.) Carrick-on-Suir", "metadata": [{"Location:": "Grangemockler, Co. Tipperary", "Teacher:": "\nGan ainm / Mícheál Ó Séaghdha\n"}, {"Collector": "Peter Lanigan", "Gender": "male", "Age": "12"}, {"Informant": "Peter Walshe", "Relation": "grandparent", "Gender": "male", "Age": "66", "Occupation": "farmer", "Address": "Grangemockler, Co. Tipperary"}, {"Language": "English"}]}, "4922232/4862858/5019373": {"title": "Bone-Setter", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0560, Page 078", "Page 078"], "url": "https://www.duchas.ie/en/cbes/4922232/4862858/5019373", "text": "\nBone Setter Etc.William Bolger , Glennashough is a famous bone setter and people come from all over the country to have their broken bone set or mended. He is about eighty years now and he is still strong and healthy.Mrs Cantwell Kilcash has a cure for a burnMrs White, Slatequarries has a cure for ring worm tethers and all sort of skin diseases. She is also one of the best herbalists that I have heard of she has a remarkable means of relieving pain and internal troubles.Jack Kicham Castlegohm can stop bleeding from a wound or otherwise. He is also a water diviner Cahills blood cure Wild fire.\n(continues on next page)\n", "school_info": "School: Grangemocler (C.) Carrick-on-Suir", "metadata": [{"Location:": "Grangemockler, Co. Tipperary", "Teacher:": "\nMrs Brigid Feehan\n"}, {"Collector": "Cissie Maher", "Address": "Bleenaleen Lower, Co. Tipperary"}, {"Informant": "Mrs Comerford", "Gender": "female", "Age": "45", "Address": "Bleenaleen Lower, Co. Tipperary"}, {"Language": "English"}]}, "4922256/4864606/5051947": {"title": "Bone-Setting - Cures", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0568, Page 275", "Page 275"], "url": "https://www.duchas.ie/en/cbes/4922256/4864606/5051947", "text": "\nThere is a family living in Glenaskaugh a few miles from Kilcash on the side of Slievenanion caled Bolger. William Bolger who is still alive but now over 80 years of age is famed as a bone-setter, and is well known all over this part of the country. He has done wonderful cures in his time and even still does some work in setting broken bones. Cases which have failed the doctors he had been known to cure, even to go so far as to break badly set bones to get them right again. There was no breath that he had not the courage to fix and it is unheard of to have a case go against him. He had no training of any kind as he is a small farmer, but his name became so well known that it is said he has some certificates in Anatomy and so was allowed to charge his patients. The usual payment from most people around was whisky. William is also a great fiddler. His family have inherited the gift to a small extent - one daughter and one sone, but neither will ever be as good as the father.\n(continues on next page)\n", "school_info": "School: Cill Chais, Cluain Meala", "metadata": [{"Location:": "Kilcash, Co. Tipperary", "Teacher:": "\nPádraig Ó Dubhghail\n"}, {"Collector": "C. Ní Mhainnín", "Gender": "female"}, {"Language": "English"}]}, "5009138/4990465/5101386": {"title": "Bone-Setting", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0750, Page 442", "Page 442"], "url": "https://www.duchas.ie/en/cbes/5009138/4990465/5101386", "text": "\nA noted bone-setter named Brian Costello lives between Moate and Moyooughley. He is now about seventy years of age. His, father, grandfather, and great grandfather had all the same gift. When anyone breaks a limb he is brought to the bonesetter rather than to a doctor, and he has cured cases where doctors have failed. People come from far and near to him when bones are broken or put out of place.   He attends bad cases at the sufferer's home and he charges a small fee.\n", "school_info": "School: Forgney, Ballymahon", "metadata": [{"Location:": "Forgney, Co. Longford", "Teacher:": "\nMrs B. Higgins\n"}, {"Collector": "John Maloney", "Gender": "male", "Age": "13"}, {"Language": "English"}]}, "5009046/4980803/5116448": {"title": "Local Cures - Heart Trouble", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0726, Page 215", "Page 215"], "url": "https://www.duchas.ie/en/cbes/5009046/4980803/5116448", "text": "\n(continued from previous page)\nspecialise in any particular case of heart disease but he is credited with prolonging the lives of some persons after all other remedies had failed. How remedy is applied.\n\n\n\nThe cure locally prescribed-melt a bit of a \"blessed candle\" and put it into the decayed tooth.\n\n\n\nThe ingredients for the cure of the burn consists of a collection herbs, namely the daisyrod, blackberry leaf, the laurel leaf, hollyhock, yarrow leaf, the leaves are mixed with lard fried on a pan and applied to the part effected.\n\n\n\nJoseph Murray Bracklin said his father licked a lizard with his tongue, this little animal is also called a  \"mankeeper.\" The person who licks the lizard can by licking the burn cure it.\n\n\n\nBroken bones are nearly always treated by a Bonesetter, this faculty is descended or handed down from father to son, and sometimes a woman of the family can undertake and set broken or disjointed bones with success. A bone setter by the name of Muldoon is the local person he lives in the Parish of Fore.\n", "school_info": "School: Killough", "metadata": [{"Location:": "Killulagh, Co. Westmeath", "Teacher:": "\nMary Lynch\n"}, {"Language": "English"}]}, "5008898/4965037/5118097": {"title": "Bone-Setters", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0684, Page 225", "Page 225"], "url": "https://www.duchas.ie/en/cbes/5008898/4965037/5118097", "text": "\nNot many years ago a man names Andrews lived in Stackallen.He was a bone setting expert and all the inhabitants of the place had wonderful belief in him as well as people from all parts of Meath and the adjoining counties.He was a famous man and he was never known to set a bone wrongly.When he died there were great laments and regrets for him.There was another man in Deanhill by name Willie McKnight who had the same talent but was not so well known.At the age of 30 he came from Collon to live in Deanhill where he spent 55 years of his life at successful bonesetting.\n", "school_info": "School: Yellow Furze", "metadata": [{"Location:": "Yellow Furze, Co. Meath", "Teacher:": "\nSíle, Bean Uí Leamhain\n"}, {"Collector": "Veronica Quinn", "Gender": "female"}, {"Informant": "Mr Elmes", "Gender": "male"}, {"Language": "English"}]}, "5009088/4985382/5120629": {"title": "Local Cures - The Wart Well", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0738, Page 007", "Page 007"], "url": "https://www.duchas.ie/en/cbes/5009088/4985382/5120629", "text": "\n(continued from previous page)\nIt is surprising to see a spring so high up and though we have had no rain for a month there is no sign of the well going dry.The children all go to this well to get rid of their warts.  They dip their hands in the water and throw a piece of rag into the well.\n\n\n\nJohn Muldoon Ballard who died two years ago was a great loss to this district.  When ever any one had the misfortune to break a bone the sufferer was brought to this man's house.  He never failed to set the bone though he never got any training for the work.  People had more faith in his skill than in any doctor.\n(continues on next page)\n", "school_info": "School: Balrath", "metadata": [{"Location:": "Balrath, Co. Westmeath", "Teacher:": "\nBean Uí Oirghiall\n"}, {"Collector": "Millie Smyth", "Gender": "female", "Address": "Balrath, Co. Westmeath"}, {"Informant": "George Demmody", "Gender": "male", "Address": "Wattstown, Co. Westmeath"}, {"Language": "English"}]}, "5009106/4987194/5122512": {"title": "Folklore Cures -  Bone-Setting", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0742, Page 142", "Page 142"], "url": "https://www.duchas.ie/en/cbes/5009106/4987194/5122512", "text": "\nFolklore CuresBone settingSome years ago there lived in Empor a man who could set bones. He name was Micky Leonard. He used pull the bone first and get it into the right place. Then he put a charge on it. The charge was made up of the following items, black pitch, white pitch, dragons blood and venus turpentine. It had to be left on for nine days and when he would take it off the bone would be set.\n", "school_info": "School: Irishtown", "metadata": [{"Location:": "Milltown, Co. Westmeath", "Teacher:": "\nMargaret McNally\n"}, {"Collector": "Donal Fox", "Gender": "male", "Age": "12", "Address": "Churchtown, Co. Westmeath"}, {"Informant": "John Jordon", "Gender": "male"}, {"Language": "English"}]}, "5009110/4987634/5124088": {"title": "Folklore of Moate Castle", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0743, Page 061", "Page 061"], "url": "https://www.duchas.ie/en/cbes/5009110/4987634/5124088", "text": "\n(continued from previous page)\ncastle and locked the door never to be opened He can be heard in the room with chains rattling to this day.\n\n\n\nknown all over the country side as \"Ward the bonesetter” he was locally known as Peter Ward of 'The Rookery\" because the local people had no confidence in him as a bonesetter.Some of his ancestors were famous bonesetter and Peter and his father Pat Ward felt that the art was in their blood.  Pat Ward had a very wide practice and inspired great confidence in his patrons by his dignity and his strict adherence to the golden rule of silence.As a matter of fact, people were afraid to ask his opinion they would come for him at all hours and take him on the most comfortable car procurable to the patient whom he would in the first instance agonize with puling and rough handling of the limb.Pat would give a slight smile\n(continues on next page)\n", "school_info": "School: Moyvoughley", "metadata": [{"Location:": "Moyvoughly, Co. Westmeath", "Teacher:": "\nC. Ní Fhlannagáin\n"}, {"Language": "English"}]}, "4922171/4858183/5130720": {"title": "Local Cures", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0543, Page 208", "Page 208"], "url": "https://www.duchas.ie/en/cbes/4922171/4858183/5130720", "text": "\n(continued from previous page)\nwhile he would be dressing the skull. It was the means of knocking all sympathy out of me for sores to this day. It was the first time I saw Iodine used. He died at the age of 85.\n\n\n\nMickey Griffin Foilnamon Milestone Thurles was the chief bonesetter for Co Tipperary, Co Clare and Co Limerick. He also cured tetters and disease of the bladder. His cure for bladder complaint – Boil Suilceach a kind of plant in water and store it in jars and drink an eggcup every morning. I saw my Father (R.I.P.) use it 55 years ago. Died at the age of 89.Later we had John Griffin son of Mickey Griffin pursuing the same calling. He had certain days that his patients used visit him. He was widely known in Tipperary, Clare, Limerick. Died at the age of 83.At the present day, we have Mrs Michael Carey Foilnaman daughter of Mickey Griffin and Sister of John able to carry on the work laid down by Father and brother\n", "school_info": "School: Inse-Bhó-Leanna (Inchavallana)", "metadata": [{"Location:": "Knockduff, Co. Tipperary", "Teacher:": "\nRisteárd Ó Riain\n"}, {"Language": "English"}]}, "5044577/5023565/5138315": {"title": "Cure for Erysipelas", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0802, Page 059", "Page 059"], "url": "https://www.duchas.ie/en/cbes/5044577/5023565/5138315", "text": "\n(continued from previous page)\nSeveral children in the school have been cured of the \"Menareac\" by taking the bottle made up by Miss Dunne.\n\n\n\nIn the village of Shandra just outside Portarlington there lives a man called Mr Mangan who has inherited the gift of bone-setting from his ancestors. It has been in the family for generations. Any people in the district who are suffering from broken bones or bones out of place go to Mr Mangan and he is able to set the bones or even break them if they are not knitting properly,\n(continues on next page)\n", "school_info": "School: Portarlington (Presentation Convent)", "metadata": [{"Location:": "Portarlington, Co. Laois", "Teacher:": "\nSr Imelda\n"}, {"Collector": "Máire Ní Chaoimh", "Gender": "female", "Address": "Portarlington, Co. Laois"}, {"Informant": "Mr J Mc Guire", "Gender": "male", "Address": "Bracklone, Co. Laois"}, {"Language": "English"}]}, "4921598/4883293/5148563": {"title": "Bone-Setting Family", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0289, Page 097", "Page 097"], "url": "https://www.duchas.ie/en/cbes/4921598/4883293/5148563", "text": "\nAbout a hundred years ago there lived in Ballybawn a woman whose name was Nell O Brien. She was famous for bone setting. She was the first bone setter in Ballybawn.Her father Liam Mor O Brien used give lodging to travelling people. There was a French doctor who had learned bone setting and he was travelling round at the time. He went to Liam Mor's house for lodging and it was from him Nell learned bone setting. She thaught the trade to her brother and her brother thaught it to his own family so it was handed down to father to son on to the present generation.I got this information from my father.\n\n\n\nI live in the townland of Cappa More and in Schull parish which is in the barony of West Carbery. Cappa More means the big tillage plot. There is a townland adjoining it called Cappa\n(continues on next page)\n", "school_info": "School: Doirín Árd, Béal Átha an Dá Chab", "metadata": [{"Location:": "Cappagh More, Co. Cork", "Teacher:": "\nDonncha Ó Dubhgáin\n"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "male"}, {"Language": "English"}]}, "5162155/5159433/5181089": {"title": "Tobacco and Pipes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0656, Page 203", "Page 203"], "url": "https://www.duchas.ie/en/cbes/5162155/5159433/5181089", "text": "\nPeople used walk about three miles for tobacco long ago. There are two kinds of pipes known in this district, the timber pipes and the chalk pipes. Pipes were never made in this district. Pipes were never repaired around this district.\n\n\n\nThere was a bonesetter in my district long ago. His name was Dearby Ó'Brien. He lived in Curtiswood. He is dead over fifty years. He often settled peoples' limbs.\n", "school_info": "School: Bennettschurch, Baile Mhic Cairbre", "metadata": [{"Location:": "Graignagower, Co. Waterford", "Teacher:": "\nMáiréad, Bean Uí Dhíomasaigh\n"}, {"Informant": "Bean Uí Riain", "Gender": "female", "Age": "84", "Occupation": "bean feirmeora", "Address": "Ballymacarbry, Co. Waterford"}, {"Language": "English"}]}, "5162151/5159060/5198251": {"title": "Funeral Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0655, Page 209", "Page 209"], "url": "https://www.duchas.ie/en/cbes/5162151/5159060/5198251", "text": "\n(continued from previous page)\nalive. The bell is rung when the funeral is coming near the chapel three at a time for a man and two for a woman.Curtha síos ag Criostóir de Búrca, An Ceathramhadh Liath, Ráth ó gCormaic ó innsint a mháthar, Máire de Búrca, Aois 55\n\n\n\nThe bone-setters that lived around here were the late Maurice Connolly and his mother of Ballyclough.  It is not certain whether he did any great jobs of bones or not.  Not one of his children is a bone-setter.There is another great bone-setter named Pat Walsh of Coolnahorna and he is still alive.  His father was able to mend bones also and he was a cousin to the Walsh's of Tinhalla who were also great bone-setters.  The Walshs of Tinhalla were related to the Walshs of Barnakill in Stradbally, and the Walshs of Ballykeorage were great bone setters to.  There is another great bone setter Jim Bolger of Cluanasgeac, Slievenamon.  He is over eighty years of age and he still sets bones.\n(continues on next page)\n", "school_info": "School: Ráth Ó gCormaic (B.), Carraig na Siúire", "metadata": [{"Location:": "Rathgormuck, Co. Waterford", "Teacher:": "\nMícheál Mac Créigh\n"}, {"Collector": "Seathrún Ó Muirigheasa", "Gender": "male", "Address": "Knockalafalla, Co. Waterford"}, {"Informant": "Pádraig Ó Muirigheasa", "Relation": "parent", "Gender": "male", "Age": "60", "Address": "Knockalafalla, Co. Waterford"}, {"Language": "mixed"}]}}