{"4427840/4349264/4440068": {"title": "Hedge-Schools", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0096, Page 481", "Page 481"], "url": "https://www.duchas.ie/en/cbes/4427840/4349264/4440068", "text": "\n(continued from previous page)\nwere against them and they had to leave it. They had not to pay anything at the hedge schools.\n\n\n\nThere was a hedge school in Carranurlaur Ballindin, and a man named Mr Prendergast taught in it who had about fifty pupils at a time.\n\n\n\nThe leather for the clogs was prepared in Washington near Ballindine in the tannery there.\n", "school_info": "School: Baile an Daingin (C.)", "metadata": [{"Location:": "Ballindine, Co. Mayo", "Teacher:": "\nMáire de Staic\n"}, {"Collector": "Brigid Mc Manus", "Gender": "female", "Address": "Cloonmore, Co. Mayo"}, {"Informant": "Mrs Mc Manus", "Gender": "female", "Age": "53", "Address": "Cloonmore, Co. Mayo"}, {"Language": "English"}]}, "4428104/4378291/4445064": {"title": "Tanners", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0638, Page 276", "Page 276"], "url": "https://www.duchas.ie/en/cbes/4428104/4378291/4445064", "text": "\nThere were four Tan Yards near Tallow at Lisfinny and Knocknamuck. The people running these industries were named Nugent, Blackburn and two families named Conway. The work was discontinued just a little over sixty years ago. For tanning an abundant supply of water was necessary. The acid used was oak bark and the process was a rather simple one. The hides were steeped in a solution of oak bark for periods from three weeks to three months, according to the class of hides used and the quality of leather desired. The lather produced had a great reputation for long wear. The industry appeared to have been carried on for well over a century and considerable quantities were sent to England. The site of one of the tanneries is still well defined on the farm of Mr. Murphy. It is walled in and the opening in the wall for the barrows is still there.The leather was sent by small boats called barges down the River Bride and Blackwater to Youghal where it was put on large ships which took it to England. The Bride was then navigable for a few miles above Tallow Bridge\n(continues on next page)\n", "school_info": "School: Tulach an Iarainn", "metadata": [{"Location:": "Tallow, Co. Waterford", "Teacher:": "\nEibhlín Ní Dhubhshláinge\n"}, {"Collector": "Brigid Conway", "Gender": "female", "Address": "Tallow, Co. Waterford"}, {"Informant": "Mr M Conway", "Gender": "male", "Age": "60", "Address": "Tallow, Co. Waterford"}, {"Language": "English"}]}, "4428233/4387378/4458904": {"title": "The Tannery, Croney Byrne Estate, Co. Wicklow", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0797, Page 150", "Page 150"], "url": "https://www.duchas.ie/en/cbes/4428233/4387378/4458904", "text": "\nAbout ten mile from the town of Wicklow, and four miles from Rathdrum, on the Croney Byrne Estate, there are the remains of an old tannery.It was in full swing about sixty years ago, and was owned by the Croney Byrnes. The Croney Estate is said to be haunted even to this day, and about fifteen or twenty years ago, a man said that when he was coming home from work one Winters night, he saw a carriage and pair driving up, the front avenue to the main entrance of the private house, and when he went to see what it was there was nothing there. This is only a story, but there are a few old people still alive, who lived on the estate at the time, and they firmly believe the place is haunted.The tanholes in the tanyard where the hides and the oak bark, out of which some substance was taken, which was used in the tanning, were steeped, were still there a few years ago, but\n(continues on next page)\n", "school_info": "School: Stillorgan", "metadata": [{"Location:": "Stillorgan, Co. Dublin", "Teacher:": "\n-\n"}, {"Collector": "Eamon Byrne", "Gender": "male", "Address": "Stillorgan, Co. Dublin"}, {"Language": "English"}]}, "4428251/4388458/4465773": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1027, Page 033", "Page 033"], "url": "https://www.duchas.ie/en/cbes/4428251/4388458/4465773", "text": "\nAt one time there were a number of tanneries in this town. At Portnason there were some and others were in Market Street. These tanned all the hides of cattle and sheep slaughtered in the district. The leather was sold over a wide area. These tanneries gave a great deal of employment.\n\n\n\nIn Catesby there is a cave and it is said if anyone goes into it he will never come out again. It is said Cromwell imprisoned a priest and a boy there. He left them there to die. If anyone throws a stone into it there is an echo.\n", "school_info": "School: St Joseph's, Béal Átha Seanaigh", "metadata": [{"Location:": "Ballyshannon, Co. Donegal", "Teacher:": "\nAn Br. S. Ó Murchadha\n"}, {"Collector": "Michael Gavigan", "Gender": "male", "Address": "Ballyshannon, Co. Donegal"}, {"Informant": "Mr James Gavigan", "Gender": "male", "Address": "Ballyshannon, Co. Donegal"}, {"Language": "English"}, {"Location": "Ballyshannon"}]}, "4428300/4392778/4476714": {"title": "Old Mills", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1038, Page 324", "Page 324"], "url": "https://www.duchas.ie/en/cbes/4428300/4392778/4476714", "text": "\n(continued from previous page)\nSince the Famine days. He says the machinery was of a very primitive type and must have been made at least 150 years ago. The road past this old mill is still called the Mill Road.\n\n\n\nAt Spamount near the old church was a brewery. This industry seems to have been run in connection with smuggling wine. at least the stories told about it mixes up the owner of the brewery and coast watchers and smugglers. It must be over 120 years since this institution stopped production.\n\n\n\nThis tannery was situated on the shore at Bruckless and was owned by Sam Cassidy J.P. It produced leather of first class quality and supplied the needs of all the local cobblers and shoemakers for half a century. Its production ceased about forty five years ago although the building\n(continues on next page)\n", "school_info": "School: Dún Ceann Fhaolaidh", "metadata": [{"Location:": "Dunkineely, Co. Donegal", "Teacher:": "\nSeaghan Mac Cuinneagáin\n"}, {"Language": "English"}]}, "4428265/4389694/4477915": {"title": "Leather Tanning", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1030, Page 331", "Page 331"], "url": "https://www.duchas.ie/en/cbes/4428265/4389694/4477915", "text": "\nThere was leather tanned in the townland of Aghavore. The animals’ hides were put in a pit and covered with lime. They were left for some time in the pit and they came through many processes before they were made into leather.\n\n\n\nBefore people go to fish in this district they dig worms. [sic] They look for them in the wet ground. They only take the black headed worms because the trout tale them faster than others. There is a white grub which is a still better “bait” but it is very hard to get. The best place to look for them is under the roots of “dockens” in fairly dry ground. The river Termon is the nearest river to us and the only fish that are in it are the trout. Sometimes a small Salmon comes up from the Erne.\n", "school_info": "School: Gortnessy", "metadata": [{"Location:": "Gortinessy, Co. Donegal", "Teacher:": "\nM. Nic Sheáin\n"}, {"Collector": "Ernest Crawford", "Gender": "male", "Address": "Cullion, Co. Donegal"}, {"Informant": "Mr B. Crawford", "Gender": "male", "Age": "59", "Address": "Cullion, Co. Donegal"}, {"Language": "English"}]}, "4493760/4417563/4531008": {"title": "Tanning Leather", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1112, Page 018", "Page 018"], "url": "https://www.duchas.ie/en/cbes/4493760/4417563/4531008", "text": "\nTanning LeatherLong ago the people used the skin of their own animals also for making leather. The skin is taken off the animals. then it is left out in the sun for two or three days to dry. It is then put into lime for to dry still more. The people then take the fat of the animal and boil it. Sometimes they they boil the bark of the trees with it and mix it with the oil of the oil of the fat. This thickens the skin and makes it wear longer. Then they nail the skin to the door for to dry it. The women then take the roughest of the hair off. Then the leather is cut into the shape of a shoe. They then get a piece of wood and make it the shape of the sole. There was holes then made. There was holesthen made in the wood and in the leather. The people then twisted the hair and made a long cord of it. They then sowed the leather to the wood and then the shoe was made. They also made their laces with the hair.\n", "school_info": "School: Naomh Aicnidh", "metadata": [{"Location:": "Buncrana, Co. Donegal", "Teacher:": "\nRistéard Ó hAoláin\n"}, {"Collector": "Joseph Mc Laughlin", "Gender": "male", "Age": "14", "Address": "1419856"}, {"Informant": "Rose Doherty", "Gender": "female", "Age": "72", "Address": "1419856"}, {"Language": "English"}]}, "4569062/4568131/4584556": {"title": "Tanning Leather", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0038, Page 0222", "Page 0222"], "url": "https://www.duchas.ie/en/cbes/4569062/4568131/4584556", "text": "\nFirst it would be brought to the tanyard. The skin would be put into boiling water and lime. Then it would be taken out and dried and tanned.\n", "school_info": "School: Gort na Léime", "metadata": [{"Location:": "Gortaleam, Co. Galway", "Teacher:": "\nPádhraic Ó Corcoráin\n"}, {"Collector": "Sarah Moore", "Gender": "female", "Address": "Flaskagh More, Co. Galway"}, {"Informant": "Mrs Sarah Kelly", "Gender": "female", "Age": "65", "Address": "Flaskagh More, Co. Galway"}, {"Language": "English"}]}, "4613671/4606940/4623722": {"title": "Shoe Polish", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0016, Page 056", "Page 056"], "url": "https://www.duchas.ie/en/cbes/4613671/4606940/4623722", "text": "\n(continued from previous page)\none person had to hold the little stand while the person who was ironing went round with edge of cap carefully between first finger and thumb of both hands. Bit by bit wed be left on iron, pressed on it and at even distances the whole cap or bonnet edge was a line of little ripples or furrous.Other articles of clothing were pressed by sitting on them and no iron was used.\n\n\n\nThe people got a lot of cipins and put them in a cloth and tied them and put them in a pot to boil, and this made dye, for clothes leather etc. It was only one colour and that was dark brown. The dye that is out now is not worth a d-m,. After paying six-pence a packet for it.\n\n\n\nTá céad fear in Éireann nar ól ariamh cróin, fuirseadh na deirce agus mála ar a thóin.\n", "school_info": "School: Gort na Díogha", "metadata": [{"Location:": "Gortnadeeve West, Co. Galway", "Teacher:": "\nSéamus Ó Dochartaigh, Bean Uí Dhochartaigh\n"}, {"Informant": "Jude Henry", "Gender": "female", "Age": "76", "Address": "Faartan, Co. Galway"}, {"Language": "English"}]}, "4649689/4647519/4651312": {"title": "A Tanyard", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0211, Page 085", "Page 085"], "url": "https://www.duchas.ie/en/cbes/4649689/4647519/4651312", "text": "\n85A TanyardThere is a hole twenty yards in circumference and five feet deep in Laheen wood, called the Tanyard.  Long ago people used to bury animal skins and lime to take the hair off it.  The skins used to be left there for four or five weeks.  This was last used in Peyton's time.  There are six or seven trees growing round it. Lizzie Beirne, 31..3..1938.\n", "school_info": "School: Ceis Carraigín", "metadata": [{"Location:": "Keshcarrigan, Co. Leitrim", "Teacher:": "\nTomás Mag Fhionnáin\n"}, {"Collector": "Lizzie Beirne", "Gender": "female", "Address": "Shanraw, Co. Leitrim"}, {"Language": "English"}]}, "4649696/4648103/4651794": {"title": "A Local Tanner", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0212, Page 155", "Page 155"], "url": "https://www.duchas.ie/en/cbes/4649696/4648103/4651794", "text": "\nIn the townland of Cornagon there lived a man named Frank Horan and he was called the tanner because he tanned leather.  If any animal round the place died he would the skin from the people for a few shillings and he would make fine leather out of the skin.  He had two sons and they helped their father tan the leather.  When their father began the tanning he had not a very good place for tanning but when his two sons grew up they put up a nice tan yard and it was in this place they tanned the leather.  They burned the hair off the skin first and they had an engine and they put the skin in the engine and they tanned the leather.\n", "school_info": "School: Glostremin", "metadata": [{"Location:": "Glasdrumman, Co. Leitrim", "Teacher:": "\nMaire Nic an Bháird\n"}, {"Collector": "M. Gallagher"}, {"Informant": "Críostiona Ó Néill", "Gender": "female", "Age": "24", "Address": "Greagh, Co. Leitrim"}, {"Language": "English"}]}, "4658451/4657001/4661015": {"title": "A Witch", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0226, Page 059", "Page 059"], "url": "https://www.duchas.ie/en/cbes/4658451/4657001/4661015", "text": "\n(continued from previous page)\nwas bleeding.This witch used to go to the bog to work at the turf. When she wanted to put them in footings, she said \"Three standing and one on the top.\" No sooner had she these words said then the turf got up and do as she bade them.\n\n\n\nFirst they took the skin off an an animal which they were going to make into leather. They placed it on the ground with the hairy side up. They dusted it over evenly with quick lime. They left in for ten days. It was washed then and the hair came off. It is put down in a hole with water and oak bark. It is left there for some time. After it is taken up it is perfect leather.\n(continues on next page)\n", "school_info": "School: An Dubh-Chearn", "metadata": [{"Location:": "Doochorran, Co. Leitrim", "Teacher:": "\nBean Mhic an Ríogh\n"}, {"Collector": "Brigid Sutherland", "Gender": "female", "Address": "Toome, Co. Leitrim"}, {"Language": "English"}]}, "4658420/4653324/4666674": {"title": "Tanning", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0217, Page 276", "Page 276"], "url": "https://www.duchas.ie/en/cbes/4658420/4653324/4666674", "text": "\nThe way the leather is tanned is.When the beast is killed, the hide is taken off. It is sent to the tan yard. It is then soaked in water and lime and left there for two weeks. The lime is washed from the skin and leaves the hair easily got off. It is then sent to the tanning machine and the machine changes it from the hide of an animal to a piece of leather. The leather is then sent to the shops and sold to customers. Sometimes if the shopkeeper is a shoe-maker he makes boots out of the leather.\n\n\n\nThe ploughs were made out of wood long ago. They were similar to the ploughs made now. The handles are made now out of iron. The parts of the plough are the sock, the mould-board, the wrack, the wheels, the wheel cutter, the coulter, the beam, the handles.\n", "school_info": "School: Cluain Tuirc (B.)", "metadata": [{"Location:": "Cloonturk, Co. Leitrim", "Teacher:": "\nSeán Ó Conchobhair\n"}, {"Language": "English"}]}, "4672112/4671244/4682443": {"title": "Tanning of Leather", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0171, Page 401", "Page 401"], "url": "https://www.duchas.ie/en/cbes/4672112/4671244/4682443", "text": "\nTanning of leatherIn olden times the tanning of leather was carried on in this district in this way -: First get the skin of the sheep and cover it over with lime and leave it for two or three days. then get a pot of boiling water and spread the skin over the mouth of the pot, leave it there for about a half an hour. Then pluck the wool off the skin. After that dissolve alum and paint the raw skin with it. After two days the skin is ready for use.Soap Making.First get a few bundles of sally rods burn them and collect the ashes then wet them and make them into cakes; leave them in a cool place for two or three days until they get hard then they are ready for use.Collected by Phillis Feighan,Tubbercurry.\n\n\n\nFirst get a few bundles of sally rods burn them and collect the ashes then wet them and make them into cakes; leave them in a cool place for two or three days until they get hard then they are ready for use.\n", "school_info": "School: Clochar Muire, Tobar an Choire", "metadata": [{"Location:": "Tobercurry, Co. Sligo", "Teacher:": "\nAn tSr. M. Nioclás\n"}, {"Collector": "Phillis Feighan", "Gender": "female", "Address": "Tobercurry, Co. Sligo"}, {"Language": "English"}]}, "4742104/4736296/4759102": {"title": "The Tanner", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0470, Page 213", "Page 213"], "url": "https://www.duchas.ie/en/cbes/4742104/4736296/4759102", "text": "\nA tanner lived in Black Stones long ago. Mrs. Foley saw her mother tanning a sheep skin. She rubbed new milk and salt into the inside of the skin. Then she hung it up to dry near the smoke to harden it. When it was hard it was taken down. An iron band was put into the skin and a small piece was turned down to stick to the band. These rolls were called dilldars or (Reléiris). The dilldars were for keeping wool or stockings. Leather was tanned by a man who lived in Glencar and his name was Sean A Caóig. He first made a pit and put a layer of the bark of the oak tree into it. He next put in hides of cows and shook lime on them. After a few weeks he took the hides and scraped off the hair with a scraper. Then he hung the hides over\n(continues on next page)\n", "school_info": "School: Seana-Caiseal", "metadata": [{"Location:": "Shanacashel, Co. Kerry", "Teacher:": "\nMáire, Bean Uí Fhoghludha\n"}, {"Collector": "Margaret Shea", "Gender": "female"}, {"Language": "English"}]}, "4742083/4734098/4786026": {"title": "A Tannery", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0463, Page 298", "Page 298"], "url": "https://www.duchas.ie/en/cbes/4742083/4734098/4786026", "text": "\nCow hides were tanned in Lehud wood tannery about four miles from the school there. Patsy Leary who is now a shoe maker here in Lehud John Leary Patsys Father called Sean  O Ríain remembered it who was a shoe maker about fifty years ago. He remember when a man used to come over the workmen on horseback and that when the reins fell out of his hands he wouldnt give himself time to get off to get the reins but rode away with the reins pulling after him. He was afraid that the workers would find out about his arrival and that they'd be tanning for themselves as well as for their masters. In my grandmother's days, the men used to wear shoes only seldom. They too walked the mountains bare footed and even the public road until they neared the town when they sat down and put on their shoes either for Mass\n(continues on next page)\n", "school_info": "School: Landsdowne (Cuar na gCoileach)", "metadata": [{"Location:": "Coornagillagh, Co. Kerry", "Teacher:": "\nEibhlín, Bean Uí Súilleabháin\n"}, {"Collector": "Kathleen O' Sullivan", "Gender": "female", "Address": "Coornagillagh, Co. Kerry"}, {"Informant": "Julia O' Sullivan", "Relation": "parent", "Gender": "female", "Address": "Coornagillagh, Co. Kerry"}, {"Language": "English"}]}, "4742133/4738989/4814246": {"title": "Salann", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0476, Page 466", "Page 466"], "url": "https://www.duchas.ie/en/cbes/4742133/4738989/4814246", "text": "", "school_info": "School: Scoil na mBráthar, Cathair Saidhbhín", "metadata": [{"Location:": "Cahersiveen, Co. Kerry", "Teacher:": "\nAn Br. B. L. Mac Eoin\n"}, {"Language": "Irish"}]}, "4723848/4718443/4814498": {"title": "Old Crafts - Leather Tanning", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0943, Page 032", "Page 032"], "url": "https://www.duchas.ie/en/cbes/4723848/4718443/4814498", "text": "\nLong ago people tanned the leather used for the making of their shoes. There were two tan yards in the town of Castleblayney at the end of Muckno St. Long ago there were no leather harness used for horses. Wooden shoulder pieces were used to which the load was tied. Before these wooden pieces came into use the poor horses had their tails cut at a joint and bent up. This grew and healed in a sort of loop and the heavy load was hooked on to it. It was very cruel treatment for the animals.\n\n\n\nLong ago there were few clocks. People had the sun dials for telling the time. The old people could tell the time by the sun or by the light of the sun thrown through a window or on the floor. The old clocks were called the wags of the wall. They had faces like clocks nowadays but had two heavy weights on chains. As the clock wore down the weights dropped to the floor. To wind the clock it was only needed to draw up the weights on the chains.\n", "school_info": "School: Drumakill", "metadata": [{"Location:": "Drumakill, Co. Monaghan", "Teacher:": "\nFlorence Harrison\n"}, {"Collector": "Peggy Mc Creedy", "Gender": "female", "Address": "Longfield, Co. Monaghan"}, {"Language": "English"}]}, "4742101/4736024/4824156": {"title": "Leasú Leathair", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0469, Page 088", "Page 088"], "url": "https://www.duchas.ie/en/cbes/4742101/4736024/4824156", "text": "", "school_info": "School: Gráig na Gréine", "metadata": [{"Location:": "Graignagreana, Co. Kerry", "Teacher:": "\nAnna Ní Shiocfhradha\n"}, {"Collector": "Anna Ní Shiocfradha", "Gender": "female", "Occupation": "múinteoir"}, {"Informant": "Micheál Ua Laocda", "Gender": "male", "Address": "Clash, Co. Kerry"}, {"Language": "Irish"}]}, "4742089/4734883/4928182": {"title": "Leasú Leathair", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0466, Page 112", "Page 112"], "url": "https://www.duchas.ie/en/cbes/4742089/4734883/4928182", "text": "", "school_info": "School: Doirín Darach", "metadata": [{"Location:": "Derreendarragh, Co. Kerry", "Teacher:": "\nMáire, Bean Uí Chathbhuaidh\n"}, {"Collector": "Abraham Páiméar", "Gender": "male", "Address": "Derreendarragh, Co. Kerry"}, {"Informant": "Pádraig Páiméar", "Gender": "male", "Address": "Derreendarragh, Co. Kerry"}, {"Language": "Irish"}]}, "4769974/4763499/4928800": {"title": "Old Crafts - Spinning of Wool", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0781, Page 020", "Page 020"], "url": "https://www.duchas.ie/en/cbes/4769974/4763499/4928800", "text": "\n(continued from previous page)\nknitting.\n\n\n\nYears ago women made thread from sheep's wool got by the ditches. They had two cards, with teeth on one side and smooth on the other side. They had a spinning wheel for spinning on. They used to dye the wool with sheep's manure and boiled tea.\n\n\n\nThe only tannery in this neighbourhood is at Ballytore, and is owned by Mr Cullen. Before the Great War Mr Cullen employed between thirty and forty men.He supplied a large proportion of boot manufactures to Dublin and Cork as well as the neighbouring towns with leather.\n(continues on next page)\n", "school_info": "School: Churchtown, Athy", "metadata": [{"Location:": "Churchtown South, Co. Kildare", "Teacher:": "\nP. Ó Dubhlaoich\n"}, {"Collector": "Eileen Heydon", "Gender": "female", "Address": "Brownstown, Co. Kildare"}, {"Informant": "Mrs M. Heydon", "Gender": "female", "Age": "45", "Address": "Brownstown, Co. Kildare"}, {"Language": "English"}]}, "4811599/4800565/4929092": {"title": "Former Local Industries - Flour Mills", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0270, Page 201", "Page 201"], "url": "https://www.duchas.ie/en/cbes/4811599/4800565/4929092", "text": "\n(continued from previous page)\nby a man named Burns from whom the mill got its name and who was the landlord of the adjoining townland of Cartron.This mill was, later, used as a thickening mill for woollens and gave much employment to the local people. There was also a mill for Thickening woollens in the parish of Coroboy, about two miles away, the ruins of which still are to be seen.\n\n\n\nThere was formerly a tannery near the village of Brideswell about three miles from this place. In proof of this ,there is a village still called Poll a Leathair which was the centre of the industry. The pits or holes where the hides were steeped can still be seen\n", "school_info": "School: Cluain na Cille", "metadata": [{"Location:": "Cloonakille, Co. Roscommon", "Teacher:": "\nEithne , Bean Uí Fhallamhain\n"}, {"Language": "English"}]}, "4742096/4735529/4930078": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0467, Page 288", "Page 288"], "url": "https://www.duchas.ie/en/cbes/4742096/4735529/4930078", "text": "\nThey knew how to tan leather round here. I heard my father telling about a family of young men in this neighbourhood who used to tan the hide of every dog who died in the neighbourhood to make Sunday shoes for themselves.\n\n\n\nSome say it is very lucky to churn on May day and May day butter was supposed to cure any sore, though I heard another old woman still living say it was wrong to churn on May day. It is most unlucky to give anything away on May Day. When I was a child a man refused to give the scholars the kindling for the school fire on May morning though he gave it every other day.No one should leave the house while the churn is going on without(Mrs M O'Sullivan, Ankail House, Tahilla)\n(continues on next page)\n", "school_info": "School: Doirín na nDamh", "metadata": [{"Location:": "Derreenneanav, Co. Kerry", "Teacher:": "\nMáire, Bean Uí Shúilleabháin\n"}, {"Collector": "May O Sullivan", "Gender": "female"}, {"Language": "English"}]}, "4758588/4757029/4935783": {"title": "Spade-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0933, Page 060", "Page 060"], "url": "https://www.duchas.ie/en/cbes/4758588/4757029/4935783", "text": "\nPatrick Meegan, Treagh, Inniskeen, Co. Monaghan. He was famous for spade making. He could make twelve spades in one day.\n\n\n\nJames Mc alroy, Topriss, Inniskeen, Co. Monaghan. He was famous for wheel making. He could make four wheels in one day.\n\n\n\nPeter Ward who lived in Channonrock, Co. Louth, could make any class of nails.\n\n\n\nJoe Coleman, Dundalk, Co. Louth, was a great man for Tanning leather.\n", "school_info": "School: Inniskeen", "metadata": [{"Location:": "Inishkeen, Co. Monaghan", "Teacher:": "\nLouis A. Duffy\n"}, {"Language": "English"}]}, "4723835/4717446/4939112": {"title": "Cooper", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0940, Page 075", "Page 075"], "url": "https://www.duchas.ie/en/cbes/4723835/4717446/4939112", "text": "\nThe cooper around here some years ago was James Marron who lived beyond Ballytrain. He made tubs, firkins, barrels, churns and many other things. First he cuts down the trees and then cuts them into small pieces. He soaked them in water until the got soft and then they make the firkins, tubs, barrels and churns. They sold them for five shillings each.\n\n\n\nLong ago there was a tannery at Ballytrain. It took them seven months to tan a hide. At that time the people thought it great work to tan it in seven months. Nowadays the can tan in in three or four weeks.\n\n\n\nYears ago when the wool was cut off the sheep the woman of the house washed it, dried it, and straightened it. At that time there was a spinning wheel in every house. There was a little step on it for their feet and places to\n(continues on next page)\n", "school_info": "School: Corracharra", "metadata": [{"Location:": "Corracharra, Co. Monaghan", "Teacher:": "\nBrian Mac Aodha\n"}, {"Language": "English"}]}, "4758506/4749737/4952468": {"title": "Candle-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0847, Page 041", "Page 041"], "url": "https://www.duchas.ie/en/cbes/4758506/4749737/4952468", "text": "\n(continued from previous page)\nrepeated several times until the house was supplied with candles.\n\n\n\nThe tanning of leather in olden times was very common. The skins of the cows were steeped in oak-bark and lime. Then they were taken out and hammered very hard. Then they were made into leather. Then they were made into leather. Then they were left steeping in the oak-bark and lime again for a few days. Then they were again dried, and this was continued till the leather was firm and colourerd.\n", "school_info": "School: The Rower (B.), Inistioge", "metadata": [{"Location:": "The Rower, Co. Kilkenny", "Teacher:": "\nRisteárd Ó Cuirrín\n"}, {"Collector": "Edward Dwyer", "Gender": "male", "Address": "Cullentragh, Co. Kilkenny"}, {"Informant": "John Galavan", "Gender": "male", "Age": "52"}, {"Language": "English"}]}, "4758509/4750206/4953240": {"title": "Old Crafts - Leather Tanning", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0848, Page 045", "Page 045"], "url": "https://www.duchas.ie/en/cbes/4758509/4750206/4953240", "text": "\nJust near Barrettstown a little bit beyond the village of Knocktopher is a field which is called Páirc an t-Sudaire.At one corner of the field the site of an old house can be traced.Here lived an old man who went round buying skins. These he steeped in a pool near the house & then by some process which he is said to have kept a secret from his neighbours he made a piece of leather which was said by old people to be very fair and to compare well in wear if not in appearance with the leather made in ThomastownThis account was got from Seumas Brennan on whose father's farm this field is situated. Seumas is at present in St Kieran's College, Kilkenny.\n", "school_info": "School: Ballyhale", "metadata": [{"Location:": "Ballyhale, Co. Kilkenny", "Teacher:": "\nEibhlín Ní Shúilleabháin\n"}, {"Informant": "Seumas Brennan", "Gender": "male"}, {"Language": "English"}]}, "4758526/4751742/5009797": {"title": "Old Crafts - Basket-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0852, Page 256", "Page 256"], "url": "https://www.duchas.ie/en/cbes/4758526/4751742/5009797", "text": "\nJack Brien of Kilmaganny made baskets of sally switches. He steamed them, so as to be able to bend them\n\n\n\nMartin Walshe did likewise, but he peeled the rods at first. He sold his baskets at Carrick-on Suir.\"Jack the basket\" also made & sold them.\n\n\n\nWm. Walshe from Crocthabeg used a handloom to weave cloth.\n\n\n\nTwo thatchers were Pat Norris from Cruethabag and Games Reidy from Monsa\n\n\n\nPearse Cody of Callan tanned leather.\n\n\n\nIn Cahill's limestone quarry in Old Castle, Kilmaganny, there was a lime-kilm that employed six men.The fire was begun with sticks to which 'colm' (a kind of slack coal mixed with clay & water) was added. Stones were put on the colm; then a layer of 'colm' & so on. It took a good while to burn it.\n\n\n\nMr Millea of Killmaganny made barrels & churns\n(continues on next page)\n", "school_info": "School: Kilmaganny, Thomastown", "metadata": [{"Location:": "Kilmaganny, Co. Kilkenny", "Teacher:": "\nC. Ó Hurdail\n"}, {"Collector": "Gretta Butler", "Gender": "female"}, {"Language": "English"}]}, "4770054/4769795/5017229": {"title": "Folklore - Lime-Kilns", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0839, Page 127", "Page 127"], "url": "https://www.duchas.ie/en/cbes/4770054/4769795/5017229", "text": "\n(continued from previous page)\nand eighty nine.\n\n\n\nMr. William Lynam used to make wheels, six years ago. he lived in Monevea.\n\n\n\nMr. Bob Fennell tanned leather for his own use. He stopped tanning in the year nineteen and thirty.\n", "school_info": "School: Tolerton, Ballylickmoyler", "metadata": [{"Location:": "Towlerton, Co. Laois", "Teacher:": "\nL. Ó Broin\n"}, {"Collector": "John Moore", "Gender": "male", "Address": "Towlerton, Co. Laois"}, {"Informant": "Mr James Moore", "Relation": "parent", "Gender": "male", "Address": "Towlerton, Co. Laois"}, {"Language": "English"}]}, "4922236/4863065/5020743": {"title": "Tanning of Leather", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0560, Page 284", "Page 284"], "url": "https://www.duchas.ie/en/cbes/4922236/4863065/5020743", "text": "\nThe hide was first put into a pit of lime where the action of the lime softened the hair. It was then taken up and rubbed with a sharp board to remove the hair. It was next put into a pit with the bark of the oak, the hole being known as the \"bark hole\", and was left there for about nine months to colour. The leather was then hung up to dry and harden.\n", "school_info": "School: Mullinahone (C.)", "metadata": [{"Location:": "Mullinahone, Co. Tipperary", "Teacher:": "\nMáire Ní Shéaghdha\n"}, {"Collector": "Nellie O' Connell", "Address": "Mullinahone, Co. Tipperary"}, {"Informant": "John Norton", "Gender": "male", "Age": "73", "Occupation": "shopkeeper", "Address": "Mullinahone, Co. Tipperary"}, {"Language": "English"}]}, "4922225/4862393/5022385": {"title": "Tanning of Leather", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0557, Page 490", "Page 490"], "url": "https://www.duchas.ie/en/cbes/4922225/4862393/5022385", "text": "\nTanning of leatherLong ago when there were no tanneries the people had a way of their own for tanning leather, and this is how they did it: they used to bark the oak with implements called \"strippers\" a flat piece of iron inserted into a wooden handle, it would represent the \"slane\" which they have for cutting turf in the Bog of Allen, and in other bogs at the present day. They would leave the bark in a place called a barkyard to dry in the sun, there was one at Mr St. John's place in Killurney. When the bark was well dry there used to put it into tanks made for the purpose in the bark yard, which would be full of water, then they would leave the hides and the bark steeping together. After three weeks steeping they would take the hide out, and all the hair and dirt would be left behind. They had a square timber log and they used to place the leather upon and beat it with a mallet to make it firm.\n(continues on next page)\n", "school_info": "School: Cill Loiste (Killusty), Fíodh Árd", "metadata": [{"Location:": "Killusty North, Co. Tipperary", "Teacher:": "\nMáire, Bean Uí Mheacháir\n"}, {"Collector": "John Sheehan", "Gender": "male", "Address": "Clare Beg, Co. Tipperary"}, {"Informant": "Patrick Quinn", "Gender": "male", "Age": "82", "Address": "Walshsbog, Co. Tipperary"}, {"Language": "English"}]}, "4922239/4863391/5052287": {"title": "Old Crafts - Tanning of Leather", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0562, Page 083", "Page 083"], "url": "https://www.duchas.ie/en/cbes/4922239/4863391/5052287", "text": "\nLeather was tanned years ago with the bark of an oak tree. The hides are first heaped for a certain length of time, about five or six months. Before being heaped it is steeped in lime. It is then taken up and tacked to a board and the hair is scraped off. The second process was done from the sap of the bark of the oak tree. This was done at Coady's and Dunphy's in Callan and the yards where they buried the skins were called tanyards. The holes were to be seen in the yards up to a few years ago.\n\n\n\nThatching is an important industry in this locality. Almost all the houses in the district are thatched including our own. The men that thatch houses are called thatchers. When our house was first built it was thatched by the late William McEvoy of Mohober and Peter Byrne of Callan, Co. Kilkenny.Wheaten straw is the best straw for thatching. It is drawn our of a rick and made into bundles called \"Thatchers bundles\". Thin hazel sticks called scollops are then cut with a billhook and they are brought into the house. The ladder is placed level along the roof of the house. The thatcher begins at the eve of the house and he works up to the top. The thatch is put in streaks each streak being about fourteen inches wide.\n(continues on next page)\n", "school_info": "School: Mághthobair (Mohober), Dúrlas Éile", "metadata": [{"Location:": "Mohober, Co. Tipperary", "Teacher:": "\nMáirtín Ó Mathghamhna\n"}, {"Collector": "Ena Fitzgerald", "Gender": "female", "Address": "Ballintaggart, Co. Tipperary"}, {"Informant": "John Cashin", "Gender": "male", "Age": "48", "Address": "Ballingarry, Co. Tipperary"}, {"Language": "English"}]}, "5008882/4963464/5077655": {"title": "Leather-Tanning", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0679, Page 088", "Page 088"], "url": "https://www.duchas.ie/en/cbes/5008882/4963464/5077655", "text": "\nThe tanning of leather was a great industry in our own town in the olden days. There were three large tan yards situated in John Street which gave a great amount of employment to men and boys.Formerly the tannery owners would by a number of horse and cow hides and sprinkle salt over them so as to help to remove the hair. Then they were spread on large stone slabs and cleaned with sharp knives. They were next placed in large pits of water about six feet deep and four feet wide. The barks of oak trees were then ground\n(continues on next page)\n", "school_info": "School: Pres. Convent, Drogheda", "metadata": [{"Location:": "Drogheda, Co. Louth", "Teacher:": "\nSr. M. Patrick\n"}, {"Collector": "Sheila Bannon", "Gender": "female", "Address": "Cord Road, Co. Louth"}, {"Informant": "Jack Craig", "Gender": "male", "Age": "48", "Address": "Cord Road, Co. Louth"}, {"Language": "English"}]}, "5008887/4963870/5077996": {"title": "Old Crafts - Salt", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0680, Page 089", "Page 089"], "url": "https://www.duchas.ie/en/cbes/5008887/4963870/5077996", "text": "\nAbout fifty years ago there was a salt factory in Drogheda beside the Old Abbey. It was owned by a Mr Leland. The salt water was brought up the Boyne in barges and then pumped into big pans six or seven feet in diameter. The salt water was mixed with rock salt until it was quite thick. Then it was heated until all the water had evaporated. The salt was hung up in straw bags in a shed and left until the salt was dry. Farmers then came in and bought cart loads of the salt  to feed their cattle.\n\n\n\nThere were several tanneries in Drogheda forty years ago. Most of them were situated in John St. There are many people still alive who remember the leather hanging up on the walls of the houses. The crooks on which the leather was hung are still to be seen. It is said that when Drogheda was visited by Cholera the only part of the town that escaped this\n(continues on next page)\n", "school_info": "School: Naomh Peadar, Droichead Átha", "metadata": [{"Location:": "Drogheda, Co. Louth", "Teacher:": "\nS. Mac Maoláin\n"}, {"Collector": "W. Ormiston", "Address": "William Street, Co. Louth"}, {"Language": "English"}]}, "5008960/4971093/5109648": {"title": "Tanning", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0700, Page 136", "Page 136"], "url": "https://www.duchas.ie/en/cbes/5008960/4971093/5109648", "text": "\nThe last of the tanning men in Navan died in September 1937 after being ill for two years. His name was Mr Lynch and lived in a comfortable tatched house in Cannon Row. He tanned the leather as follows. He bought the hide from farmers and sometimes he bought it from that well known man Twiney Byrne. He had a big barrel in which he half filled with water and then put lime in. He left the hide steeping in the water and lime for two or three days. Then he took it out and put some sort of soap on it. Then he placed it on a long narrow stone which was held by a flat piece of wood to the ground. The hair now being soft comes off with the corner of a square stone. Then he puts it in a barrel of clean water for a few hours. Then he leaves it out to dry. When it is finished he sells it to the\n(continues on next page)\n", "school_info": "School: St Columba's Abbey, Navan", "metadata": [{"Location:": "Navan, Co. Meath", "Teacher:": "\nBr. Abban O' Donoghue\n"}, {"Collector": "Pilib Mach Niocail", "Gender": "male"}, {"Language": "English"}]}, "5008987/4974338/5112735": {"title": "Robertstown Tannery", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0708, Page 229", "Page 229"], "url": "https://www.duchas.ie/en/cbes/5008987/4974338/5112735", "text": "\nLong ago there were boots made locally by handy men who were called cobblers and when a tannery was established in Robertstown in the seventeenth century more men took up the trade of boot-making. At Robertstown castle where a plantation is now situated there were twelve holes dug in the ground and in those holes leather was made.This tannery was owned by a man named Charley O'Reilly who was then called \"Charley beag the currier\" which means small Charley the leather dresser. This man was a great grandfather to Charles O'Reilly who now owns the land where this tannery was situated. O'Reilly who lived in Robertstown castle had four brothers who worked for him and the tan-yards were locally known as O'Reilly's tan-yards.When O'Reilly died the landlord caused the castle where he lived to be pailed in\n(continues on next page)\n", "school_info": "School: Kilbeg", "metadata": [{"Location:": "Robertstown, Co. Meath", "Teacher:": "\n-\n"}, {"Collector": "Matthew O' Connell", "Gender": "male", "Address": "Drakerath, Co. Meath"}, {"Informant": "Philip Foy", "Gender": "male", "Address": "Newtown, Co. Meath"}, {"Language": "English"}]}, "5008969/4972086/5113426": {"title": "Old Trades", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0703, Page 310", "Page 310"], "url": "https://www.duchas.ie/en/cbes/5008969/4972086/5113426", "text": "\n(continued from previous page)\nused to make all classe of nails. Horse nails of all sizes. And all cllasses of nails for building contractors. Even pig rings, staples and hooks for down pipes and gutters. They was a large trade of nails throughout the country.\n\n\n\nUp to fifty years ago there was a tannery in Kells, in Newmarket Street, in the yard which is owned and occupied by Mr. McEntee, this tannery gave employment to thirty people. In Market Street also there was a chandlery where millions of candles were manufactured, this also gave employment to twenty or thirty people Olden times were worse than the times we have now.\n", "school_info": "School: Ceannanus Mór, Scoil na mBráthar", "metadata": [{"Location:": "Kells, Co. Meath", "Teacher:": "\nAn Br. M.L. Ó Séaghdha\n"}, {"Collector": "Stanislaus Mc Entee", "Gender": "male", "Address": "New Market Street, Co. Meath"}, {"Informant": "Mr Patrick Gibney", "Gender": "male", "Age": "48"}, {"Language": "English"}]}, "5008995/4975067/5113652": {"title": "Leather Tanning", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0711, Page 100", "Page 100"], "url": "https://www.duchas.ie/en/cbes/5008995/4975067/5113652", "text": "\nLeather TanningSometimes the people of this district tanned the leather they used in olden times. They used to dig a pit in the ground and put the hide into it. Then they covered it with good, strong lime. They left it so for some time and, when they were satisfird with it, they took it up and rubbed it well with a certain type of oil.When this dried into the skin, the \"leather\" was ready for use. There were \"cobblers\" or shoe-makers in the district and the people used to bring the leather to them to have boots and shoes made for themselves.Dolours Sheridan.WilkinstownNavanInformation from:Laurence CrahanWilkinstownNavan\n", "school_info": "School: Wilkinstown", "metadata": [{"Location:": "Wilkinstown, Co. Meath", "Teacher:": "\nMáire Ní Failcheallaigh\n"}, {"Collector": "Dolours Sheridan", "Gender": "female", "Address": "Wilkinstown, Co. Meath"}, {"Informant": "Laurence Crahan", "Gender": "male", "Address": "Wilkinstown, Co. Meath"}, {"Language": "English"}]}, "5008971/4972211/5114105": {"title": "Crafts", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0703, Page 435", "Page 435"], "url": "https://www.duchas.ie/en/cbes/5008971/4972211/5114105", "text": "\n(continued from previous page)\nbecause one with the leather when tanned. The farmers round supplied hides.\n\n\n\nTanning was a great industry in this county of Meath, up to about fifty years ago, but now the industry has died out and only in a few places are there traces of it. At Bensfort on the Kells-Oldcastle road, about 2 miles beyond Drumbaragh there was tanning carried out. The vats are still to be seen.The hides were cut into lengths and put into vats of brine. They were left for some days in the brine to make them soft and clean. They were then put into vats with the bark of oak, again.The oak contains tannin. They were left there for about 12 months. The leather then had taken in the preserving qualities from the oak. Then the leather was tanned and prodiced magnificent leather.\n(continues on next page)\n", "school_info": "School: Drumbaragh", "metadata": [{"Location:": "Drumbaragh, Co. Meath", "Teacher:": "\nM. Brighid, Bean Uí Draoighneáin\n"}, {"Collector": "Josephine Thornton", "Gender": "female", "Address": "Kells, Co. Meath"}, {"Informant": "H. Mulvany", "Age": "54", "Occupation": "civil servant", "Address": "Kells, Co. Meath"}, {"Language": "English"}]}, "5009049/4980989/5116338": {"title": "Old Crafts - A Tannery", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0727, Page 046", "Page 046"], "url": "https://www.duchas.ie/en/cbes/5009049/4980989/5116338", "text": "\nThere was a tannery long ago on Kill-Lock river. Hagerty was the man's name who used to work it. He used to skin animals steep the skins in water and lime and then bury them for a week and then he used to take them up and nailed them to a board to stretch them. Then he used to put two skins together and press them closely with a machine.\n", "school_info": "School: Raharney (B.)", "metadata": [{"Location:": "Raharney, Co. Westmeath", "Teacher:": "\nS. Ó Conmhidhe\n"}, {"Language": "English"}]}, "5009079/4984429/5119005": {"title": "Old Crafts - The Tanneries of Mullingar", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0735, Page 025", "Page 025"], "url": "https://www.duchas.ie/en/cbes/5009079/4984429/5119005", "text": "\n25The Tanneries of MullingarIn olden times Mullingar had two tanneries which we may boast about.  One of these was situated off the lane leading to the Presentation Convent.  It was owned by a man named Tuite who afterwards sold it to the Dowdall family.  They working hard all the week produced large quantities of leather for the town and supplied factories in the town also.  On the outside of the tannery were  three big holes in which the hide was put down to harden.  Nailer Lacey was the man who made\n(continues on next page)\n", "school_info": "School: Mullingar (Pres. Convent)", "metadata": [{"Location:": "Mullingar, Co. Westmeath", "Teacher:": "\nSr. Colmcille\n"}, {"Collector": "Rose Mc Cormack", "Gender": "female", "Address": "Irishtown, Co. Westmeath"}, {"Informant": "Rose Delaney", "Gender": "female", "Address": "Irishtown, Co. Westmeath"}, {"Language": "English"}]}, "5009079/4984432/5119007": {"title": "Old Crafts - Tanning", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0735, Page 028", "Page 028"], "url": "https://www.duchas.ie/en/cbes/5009079/4984432/5119007", "text": "\n28Tanningsome two centuries ago tanning was a flourishing industry in Mullingar.  As far back as 1736 pelts were tanned in Mullingar tanneries, of which there were four.The site of the old tannery was in Bishops Gate Street.  The tannery extended along the lane which is now known as Presentation Convent Lane, to where the Legion Hall and Shaw's Stores are now situated.  In 1741 the tannery was bought by the Dowdall family now represented by T.J. Dowdall Esq.  Mr B.L. Tuite was overseer of the factory for some years.The pelts used in the tannery were bought from the farmers in the locality.  Every Tuesday the pelts were purchased at a place\n(continues on next page)\n", "school_info": "School: Mullingar (Pres. Convent)", "metadata": [{"Location:": "Mullingar, Co. Westmeath", "Teacher:": "\nSr. Colmcille\n"}, {"Language": "English"}]}, "5009080/4984576/5119206": {"title": "Industries - Tanning - The Old Tannery", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0736, Page 008", "Page 008"], "url": "https://www.duchas.ie/en/cbes/5009080/4984576/5119206", "text": "\nIndustriesTanning Some two centuries ago Tanning was a flourishing industry in Mullingar. As far back as 1736 - pelts were tanned in Mullingar tanneries - of which there were four. The Old Tannery. Site Bishop's Gate Street. Extended along a lane now known as Presentation Convent Lane; to where present Legion Hall and and Shaw's Stores are situated. In 1741 - tannery was bought by a member of Dowdall family - now represented by  T. J Dowdall, Esq, [B?]. (Hence name Dowdall's Tannery). A Mr. Tuite was manager for years. Hides or pelts used in tannery were  bought from farmers of locality -  every Tuesday - at Daly's Crossing, about 1 1/2 miles outside town in direction of L. Eunel. One of the buyers was named Bailey. The men employed in tannery were paid at rate of 8d. per day - working from 6 a.m until late at night. The remains of what was\n(continues on next page)\n", "school_info": "School: Mullingar (Pres. Convent)", "metadata": [{"Location:": "Mullingar, Co. Westmeath", "Teacher:": "\nSr. Brigid\n"}, {"Collector": "Agnes Whearty", "Gender": "female", "Address": "Mullingar, Co. Westmeath"}, {"Collector": "Eileen Beglin", "Gender": "female", "Address": "Culleen More, Co. Westmeath"}, {"Informant": "Mrs Mc Donnell", "Gender": "female", "Age": "50", "Address": "Mullingar, Co. Westmeath"}, {"Informant": "John Daly", "Gender": "male", "Age": "70", "Address": "Culleen More, Co. Westmeath"}, {"Language": "English"}]}, "5009080/4984578/5119209": {"title": "Industries - Tanning - The Old Tannery", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0736, Page 010", "Page 010"], "url": "https://www.duchas.ie/en/cbes/5009080/4984578/5119209", "text": "\n(continued from previous page)\nhunted priests, and escorted him through the darkness of the night, under the shelter of a double hedge which then ran over 'The Bogras' and terminated at the end of Bank of Ireland. Having crossed the street and reached the lane and tannery, Mass was celebrated and the little crowd dispersed in silence as they had come. Priest hunters were busy in the district but is is said that on only one occasion did they raid the tanyard. [?] hung outside the doors on Sundays as on weekdays so there was little evidence of what went on within. On the occasion of the raid the alarm was supposed to have been raised by the hooting of a horn. The priest was quickly divested of his vestments - buried with chalice and missal in one of the old pits and the soldiers had to depart with their pray.\n\n\n\nNailer Lacy. Connected with the tannery was a famous character, Tom Lacy,  better know as 'The Nailer'. A nail-maker by trade, he worked in his little thatched\n(continues on next page)\n", "school_info": "School: Mullingar (Pres. Convent)", "metadata": [{"Location:": "Mullingar, Co. Westmeath", "Teacher:": "\nSr. Brigid\n"}, {"Collector": "Maeve Hickey", "Gender": "female", "Address": "Mullingar, Co. Westmeath"}, {"Informant": "John Hickey", "Gender": "male", "Age": "45", "Occupation": "butcher", "Address": "Mullingar, Co. Westmeath"}, {"Language": "English"}]}, "5009080/4984580/5119212": {"title": "Industries - Tanning", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0736, Page 012", "Page 012"], "url": "https://www.duchas.ie/en/cbes/5009080/4984580/5119212", "text": "\nKeena's Tannery. Owned by a Jas. Keena. Situated between Levington and Cullion. Tannery near Blackhall - Owner a Mr. Tuite, who was at that time landlord of Springfield site now occupied by \"Midland Bakery\". Mary Street Tannery and Boot Factory. A tannery is supposed to have worked in Mary Street. Site now occupied by Byrne's house and yard etc. Later is was converted into a boot factory. Leather was brought from Dowdalls. Boots were sold on streets, off stands on market and fair days. \"Travellers\" of who Bartry and Stanley were best known, supplied country shopkeepers and customers with boots. They travelled by means of horse and van. Amongst the shoe-makers are named - Sheer[?] and Crowley.\n", "school_info": "School: Mullingar (Pres. Convent)", "metadata": [{"Location:": "Mullingar, Co. Westmeath", "Teacher:": "\nSr. Brigid\n"}, {"Collector": "Maura Cremer", "Gender": "female", "Address": "Mullingar, Co. Westmeath"}, {"Informant": "Thomas Kennedy", "Gender": "male", "Age": "98", "Address": "Mullingar, Co. Westmeath"}, {"Informant": "May Kennedy", "Gender": "female", "Address": "Mullingar, Co. Westmeath"}, {"Language": "English"}]}, "5009062/4982550/5119347": {"title": "Leather Tanning", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0731, Page 107", "Page 107"], "url": "https://www.duchas.ie/en/cbes/5009062/4982550/5119347", "text": "\nThere was a tannery in Mullingar owned by Messrs Dowdall.  The skins were tanned with oak-bark.\n\n\n\nThere were brick-hills in Mr. Quinns field at Dalystown.  The Bricks and Clay is there still.  With these bricks wall around Carrick House garden was made and the bricks are as good as the day they were made although they are 200 years made.Newforest House was also surrounded by a wall made of bricks made on the estate at a place called Cloncrow.\n\n\n\nWhat is the difference between a foxhound and a ladies peticoat.Answer:  one draws the covers\n(continues on next page)\n", "school_info": "School: Dalystown", "metadata": [{"Location:": "Dalystown, Co. Westmeath", "Teacher:": "\nKathleen Grehan\n"}, {"Language": "English"}]}, "5009106/4987172/5122397": {"title": "Folklore - Old Craft - Tanning Leather", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0742, Page 120", "Page 120"], "url": "https://www.duchas.ie/en/cbes/5009106/4987172/5122397", "text": "\nFolklore   Old CraftTanning leatherAbout forty perches from this school on the Ballynacargy road there lived a man about thirty years ago. He was called the Tanner Lyons because he used to prepare the skins of beasts for rugs and even for boots and shoes/The park then held hundreds of deer and the tanner often got a deer skin which used to prepare and keep soft by some secret. Goat skins and sheep skins used to be treated for rugs and cow and calf hide for boots and clogs. His sons were not able to coax the secret from him.\n", "school_info": "School: Irishtown", "metadata": [{"Location:": "Milltown, Co. Westmeath", "Teacher:": "\nMargaret McNally\n"}, {"Collector": "Phyllis Reilly", "Gender": "female", "Age": "13", "Address": "Irishtown, Co. Westmeath"}, {"Informant": "Larry Lyons", "Gender": "male", "Age": "60", "Occupation": "farmer", "Address": "Ballintue, Co. Westmeath"}, {"Language": "English"}]}, "5009092/4985689/5122463": {"title": "Old Crafts - Dyeing", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0738, Page 314", "Page 314"], "url": "https://www.duchas.ie/en/cbes/5009092/4985689/5122463", "text": "\n(continued from previous page)\nPeople used blossoms of fruze for dyeing clothes yellow.  Logwood for dyeing articles purple, froughans for blue dye, pig's gaul for green dye.  The also used \"Bee Moor\", \"Tansey\", heather, briar roots and the bark of oak trees.\n\n\n\nRopes were made of horse hair, hemp, tow, flax and hay and straw.  The hay and straw ropes were called \"sugans\".\n\n\n\nThe bark of oak trees was used for tanning leather. There is a place in Knockdrin wood where the bark was taken of the trees. This place is called the \"Bark Yard\" to this day. The bark was then loaded on to carts and taken to a tanyard in Cullion. This tanyard was called \"Keenagh's Tanyard\". The tanyard was afterwards moved into Mullingar. Some people tanned their own leather and made their own boots at home. A piece of wood was made to shape of a boot and the boot was made round this. The boots were sewn with hemp which was also made at home. As the people only used wooden lasts at that time they could not put nails in the soles of the boots. So they put wooden pegs in the soles of the boots instead.\n\n\n\nLong ago most of the vessels used were made of wood.\n(continues on next page)\n", "school_info": "School: Carley", "metadata": [{"Location:": "Crooked Wood, Co. Westmeath", "Teacher:": "\nBrigid Cooke\n"}, {"Language": "English"}]}, "5009220/4999234/5123345": {"title": "New Ross, Co. Wexford - Sites of Old Breweries in the Town", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0871, Page 128", "Page 128"], "url": "https://www.duchas.ie/en/cbes/5009220/4999234/5123345", "text": "\nSutton's BreweryI  Where the Good Shepherd Convent now stands was the site of a very progressive brewery owned by people named Sutton.  The last representative of these Suttons, Miss Anna Sutton, entered the Carmelite Order at the Mount Carmel Convent, New Ross, in or about 90 years ago.The Brewery then fell into the hands of the Devereux family, the distillers, Wexford, and was later acquired by the Good Shepherd Order in or about 1860.The site is now adorned with the magnificent buildings and grounds of the Good Shepherd Convent.IIHowlett's BreweryHowlett's Brewery was situated in Priory Lane.  It was dominated by the Howlett Residence, the large towering house in Priory St. used now as a Garda Barracks.  There were three gates on the Brewery Priory gate, Trinity gate and Marsh gate.The Howlett FamilyThe Howlett family were the princes of the commerical life of New Ross about 90 or 100 years ago.  They owned fleets of sailing boats and exported the products of the brewery, and imported raw material.  James E. Howlett was the last of a long & honourable line.  He married a Miss Smithwick of Kilkenny.  They had five daughters who emigrated after Mrs. Howlett's death.\n", "school_info": "School: San Leonard, Ballycullane", "metadata": [{"Location:": "Saintleonards, Co. Wexford", "Teacher:": "\nMary B. Dunphy\n"}, {"Collector": "Mary B. Dunphy", "Gender": "female", "Occupation": "teacher"}, {"Language": "English"}]}, "5009220/4999240/5123401": {"title": "Tanning Leather and Chamois in New Ross", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0871, Page 134", "Page 134"], "url": "https://www.duchas.ie/en/cbes/5009220/4999240/5123401", "text": "\nJones's Tannery300 men were working in Mr. Jones's Tannery about 60 ^or 70 years ago in New Ross.& Mar. Lamb had the care of the Chamois department.\"Brandon Cottage\"New RossMr. Jones built this beautiful residence overlooking the river.  It cost so much money that it almost 'broke' him.  It seems that what would be built to-day would be knocked down to-night.  No one knew at first who was doing the mischief.  The Catholics were blamed.  But afterwards when both Mr. Jones and Mr Lamb sold out their interest in the premises it transpired that it was \"perfidious Albion\" was at the bottom of the mischief.  Jones's Tannery was a serious rival on the English markets both for quality and price.  So by hook or crook Jones was to be put off the markets.  This was done by the usual method of English gold --- it was not Catholics who were knocking down Jones's buildings at night but Protestants.Mr. Jones took as many employees as would go with him to Derby where he set up a Tanning industry.  Jones's Tannery bought by Mr. Bagenal Boyd Kiltro BannowFrom Jones the tannery passed to Mr. Boyd who ran it under the name 'Jones & Co'. up to about 20 years ago.  It was then 'closed down'.  The premises were purchased by Doyle's Brandon, who used it as a kennel for their dogs.  It was re-opened as a Tannery by a New Ross Co. of which the Doyles are head about 3 years ago & is going still.\n(continues on next page)\n", "school_info": "School: San Leonard, Ballycullane", "metadata": [{"Location:": "Saintleonards, Co. Wexford", "Teacher:": "\nMary B. Dunphy\n"}, {"Collector": "Mary B. Dunphy", "Gender": "female", "Occupation": "teacher"}, {"Language": "English"}]}, "5009246/5001170/5123463": {"title": "Our Local Tannery", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0879, Page 065", "Page 065"], "url": "https://www.duchas.ie/en/cbes/5009246/5001170/5123463", "text": "\nThe local industries of long ago were spinning, weaving, starch making, candle-making and tanning.  The tanning industry was carried on about fifty years ago in the townland of Cottage, about an Irish mile from this school, where Mr. Doyle now resides.  The yard in front of the kitchen door there is still known as the tan yard.  It was owned by people named Sinnott.The hides were obtained from the local farmers when animals were killed.  At that time farmers used to kill their own cattle for meat.  In preparing them for the making of leather tow deep holes were dug in the ground in the yard, which is now opposite the kitchen door.  In one of these holes water was put and the hides were steeped in it for some months.  Lime was put in the other one into which the hides were put after taking them out of the water.  As each one was put in lime was put on it.  They were then put through other processes to make them into leather.  Twenty and thirty men were employed there and their wages were sixpence a day.When the leather was manufactured it\n(continues on next page)\n", "school_info": "School: Tagoat", "metadata": [{"Location:": "Tagoat, Co. Wexford", "Teacher:": "\nPádraig Coilféir\n"}, {"Collector": "Peggy Doyle", "Gender": "female", "Address": "Drimagh, Co. Wexford"}, {"Informant": "Peter Ellard", "Gender": "male", "Address": "Ballycowan, Co. Wexford"}, {"Language": "English"}]}, "5009293/5005151/5132417": {"title": "Old Crafts", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0890, Page 005", "Page 005"], "url": "https://www.duchas.ie/en/cbes/5009293/5005151/5132417", "text": "\n(continued from previous page)\nTannery which was most important of all.\n\n\n\ntanning which was most important of all.Tanning of LeatherThe Tannery of Ballycanew was owned by Mr T Bass from whom I received the following information. He is again living in the house where he and his father before him carried on the industry.When the Tannery closed down 1891 he left the village and went to live in Carrigbeg where he owned a farm a few miles from Gorey. He is now 80 years of age and still healthy.The Tan Holes are still to be seen but the other implements used are not to be found e.g. the knives called \"Shiguers\" [?].Before '98 Rebellion the hides were supplied by butchers of Gorey, Tinahely etc. The Oak Bark necessary for tanning was obtained from the Earl of Courtown, Mr Doyne of Wells, Brook's Estate. This dried bark was stored in packs. It had to be ground by a mill drawn by horse into pieces as fine\n(continues on next page)\n", "school_info": "School: Ballycanew (2)", "metadata": [{"Location:": "Ballycanew, Co. Wexford", "Teacher:": "\nCaitlín Maybury\n"}, {"Language": "English"}]}, "5044654/5029194/5145813": {"title": "Old Crafts - Coach-Building in Birr", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0821, Page 145", "Page 145"], "url": "https://www.duchas.ie/en/cbes/5044654/5029194/5145813", "text": "\n(continued from previous page)\noutside traps, wagonettes, carriages, broughams, buses, van and brakes.The above account was got from John McNamara,  Moorpark St, Birr, son of Michael and nephew of Patrick McNamra.  The trade is still carried on by his cousins Thomas and Denis at John's Mall, Birr.\n\n\n\nTanning of LeatherAbove the old bridge of Birr which is situated at the end of Bridge St leading to High St there was a tanyard named Kinehan's Tanyard.  It is only a few years ago that the hole in which the leather was tanned was filled up.  This house and yard is now occupied by a man named Flannagan.  Hundreds of loads of stuff were required to cover in this hole it was so deep.Boots and shoes were made in Birr in those days.  A family named Winters employed a great many workers in their shop in Moorpark.\n", "school_info": "School: Birr (Mercy Convent)", "metadata": [{"Location:": "Birr or Parsonstown, Co. Offaly", "Teacher:": "\nSr. Flannan\n"}, {"Language": "English"}]}, "4921620/4885624/5150491": {"title": "Tanning Industry in Dunmanway", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0305, Page 002", "Page 002"], "url": "https://www.duchas.ie/en/cbes/4921620/4885624/5150491", "text": "\nThis industry is 200 years old. The first owners were planters names Wright. A man named Brennan was the first currier. It took at first nine months to tan a hide and the bark was taken off the oak for tanning purposes. About thirty-five hides were tanned together and about twenty men were employed.The feet of the hide were all cut off except one The horns were sent to Bristol to make combs and the hoofs were also sent to England to make glue.   At present only one man is employed  and tanning by the old system is carried on.\n\n\n\n1 One at Dromleena - The field is called Paírc an t-Sagairt.2. One at Gort-na-Malach. An ancient candle stick was found there.3. One at Beách-Gulláin\n", "school_info": "School: Naomh Pádraig (B.), Dún Mánmhaí", "metadata": [{"Location:": "Dunmanway, Co. Cork", "Teacher:": "\nSeán Young\n"}, {"Language": "English"}]}, "4921635/4886901/5152519": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0312, Page 004", "Page 004"], "url": "https://www.duchas.ie/en/cbes/4921635/4886901/5152519", "text": "\nThere is a leather tanning factory in Dunmanway, Co. Cork.  Mostly all the hides used there were cattle hides.  When a large number of hides are collected they are put into a tank, and pickle and salt thrown in with them.  They are left there until the hair falls off the hides.  Then they are run through different kinds of machinery.  After a time they are soaked in water and are beaten to toughen the hides.  Then the hides are run secondly, and are beaten till they are made into leather.  It is made into boots and shoes, which are sent to the shop to be sold.Collected byVictor EedyLetterClonakiltyCo. Cork\n(continues on next page)\n", "school_info": "School: Cill Gharbh, Clanna Caoilte", "metadata": [{"Location:": "Kilgarriff, Co. Cork", "Teacher:": "\nAdelaide Mac Carthy\n"}, {"Collector": "Victor Eedy", "Gender": "male", "Address": "Letter, Co. Cork"}, {"Informant": "Mr J. Deasy", "Gender": "male", "Age": "68", "Address": "Letter, Co. Cork"}, {"Language": "English"}]}, "4921646/4887540/5152993": {"title": "Old Fairs and Markets in Bandon", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0314, Page 034", "Page 034"], "url": "https://www.duchas.ie/en/cbes/4921646/4887540/5152993", "text": "\nA cattle, sheep and horse fair was held monthly at Hill Terrace.Cabbage market opposite the Allin Institute.Meat was sold at the Shambles.Fish Market was where Mr. Bateman's Garage is now.Potatoes, other vegetables and fruit markets were held at Market Street.Wool was sold where Slattery's Garage is in Market Street.Eggs, butter, fowl were sold where Mr. Murphy the contractor has his stores now.The Duke of Devonshire owned all the property.\n\n\n\nThere were 3 tanyards in Watergate one of which was owned by Clare and the other two were owned by Sullivans. Clare lived at the end of Watergate St. and Sullivan lived at Jeffer's service-hall.Billie Sullivan lived beside the convent in Convent Hill. A man named Barrett owned a tanyard in Gallow's Hill. Smith's tanyard was at Driscoll's yard in Stanton's Lane of Cavendish Quay. Mr. Smith lived beside the yard.\n\n\n\nHurley's Brewery was near the Nursing Home and was the first Brewery in Bandon.Dowden's Brewery was down at the end of Watergate Street.Fitzgerald's Distillery was at the left of Carriage Road at a place\n(continues on next page)\n", "school_info": "School: Pádraig Naofa, Droichead Banndan", "metadata": [{"Location:": "Bandon, Co. Cork", "Teacher:": "\nPádraig Ó Faoláin\n"}, {"Language": "English"}]}, "4921646/4887549/5153012": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0314, Page 043", "Page 043"], "url": "https://www.duchas.ie/en/cbes/4921646/4887549/5153012", "text": "\nTannery and weaving were the chief industries in Bandon about 100 years ago.Behind the Convent ropes were made. The path going to the rope factory is to be seen yet.Near Convent Hill there was a weaving factory.Nails were made in Foxes Street, Gallows Hill, and Cork Road by Allman Brothers.Near Old Chapel there was a cotton mill where over 1,000 men were employed.Iron was moulded by Johnson at Weir Street over 50 years ago.Mason's weaving mill at the Distillery was opened over 40 years ago.The Bandon station was rebuilt 40 years ago by Sisk the builder of Cork. West Cork station was above the church. The two stations were not connected.In the Quaker's Lane (Factory Lane now) was the first post office known as Rowland Hill's post office. The entrance to this is still to be seen. Nearby Cromwell's soldiers guarded Cromwell while he slept in the house now occupied by Mr. Scott, South Main Street. Almost at the same place was the Corduroy factory.On market days baskets made by a man named Skuce from twigs grown at the back of the Shannon Street houses were sold where the butter market is held now. Griffin, the cooper, also\n(continues on next page)\n", "school_info": "School: Pádraig Naofa, Droichead Banndan", "metadata": [{"Location:": "Bandon, Co. Cork", "Teacher:": "\nPádraig Ó Faoláin\n"}, {"Collector": "Gregory Burke", "Gender": "male", "Address": "Bandon, Co. Cork"}, {"Informant": "Mr Cornelius Donoghue", "Gender": "male", "Age": "65", "Occupation": "clerk", "Address": "Bandon, Co. Cork"}, {"Language": "English"}]}, "4921759/4904125/5168092": {"title": "Tanning", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0356, Page 481", "Page 481"], "url": "https://www.duchas.ie/en/cbes/4921759/4904125/5168092", "text": "\nTanningAll boots worn by the people long ago, were strong brógs but the people liked to have a pair of shoes with light uppers for Sunday, and dancers wanted them for dancing. There were a number of famous dancers in this parish twenty years ago. The people made light leather for the uppers of these shoes themselves. They killed a dog a skinned him. Lime was sprinkled on the hair of the skin and the skin buried to exclude the air. The action of the lime separated the hair from the skin.When the hair was removed oak bark was boiled in water. Alum was mixed with this water and the skin steeped in it for eight or nine days. It was then taken out, stretched and nailed to a timber frame or to the back of the door and dried in the sun and wind. One side of it was tn coated with copperas water. The leather was then fit for the shoemaker.\n", "school_info": "School: Cnoc an Chláraigh, Séipéal na Carraige", "metadata": [{"Location:": "Knockaclarig, Co. Cork", "Teacher:": "\nDavid Ó Ceallacháin\n"}, {"Language": "mixed"}]}, "4811666/4810729/5170371": {"title": "Tan-Yards", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0342, Page 272", "Page 272"], "url": "https://www.duchas.ie/en/cbes/4811666/4810729/5170371", "text": "\nTanyards.There were three originally in Macroom. One disappeared a long time ago, and the others are non-existent for 30 years. They were in Massytown, a part of the town of Macroom, and were owned by the late Richard Neville and then afterwards his son, John Neville.The skins were obtained from farmers in the district, from butchers of the locality and from dealers in the city of Cork.Over 30 men were constantly employed, viz yardmen,tannerscurriers, andfinishers.The \"yardmen\" lifted the leather (skin) out of the holes of water in which they were steeped.The \"tanners\" were occupied in scraping the hair from the hides and preparing the hides for the tan-holes.The \"curriers\" shaved the hides, and graded the thickness according to the class or quality of leather required.The finishers prepared the leather for the shop after the material had been taken out of the\n(continues on next page)\n", "school_info": "School: Maghcromtha (B.)", "metadata": [{"Location:": "Macroom, Co. Cork", "Teacher:": "\nPádraig Ó Deasmhumhna\n"}, {"Informant": "James Kelly", "Gender": "male", "Age": "62", "Address": "Masseytown, Co. Cork"}, {"Language": "English"}]}, "4921733/4901411/5180466": {"title": "Tanning", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0351, Page 180", "Page 180"], "url": "https://www.duchas.ie/en/cbes/4921733/4901411/5180466", "text": "\nAll boots worn by the people long ago, were strong brógs, but the people liked to have a pair of shoes with light uppers for Sunday, and dancers wanted them for dancing. There were a number of famous step-dancers in the parish, twenty years ago.    The people made the light leather, for the uppers of these shoes themselves. They killed a dog and skinned him. Lime was sprinkled on the hair of the skin, and the skin buried to exclude the air. The action of the lime separated the hair from the skin.    When the hair was removed, oak bark was boiled in water. Alum was mixed with this water and the skin steeped in it for eight or nine days. It was then taken out, stretched and nailed to a timber frame, or to the back of the door and dried in the sun and wind.    One side of it was then coated with copperas water. The leather was then fit for the shoemaker.\n", "school_info": "School: Séipéal na Carraige", "metadata": [{"Location:": "Rockchapel, Co. Cork", "Teacher:": "\nDonncha Ó Géibheannaigh\n"}, {"Collector": "Maggie Stack", "Gender": "female"}, {"Informant": "David Stack", "Gender": "male", "Address": "Knockahorrea East, Co. Cork"}, {"Language": "English"}]}, "4921686/4889968/5184637": {"title": "Candle-Making", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0322, Page 359", "Page 359"], "url": "https://www.duchas.ie/en/cbes/4921686/4889968/5184637", "text": "\nLong ago people made their own lights from rushes. The rushes were pulled and skinned. The pith when dried, was dipped in melted fat. The vessel used for melting the fat was called a grisit. When the rush was taken out of the fat it was then hard enough and fit for use.\n\n\n\nLeather tanning was carried on in former times in the townland of Mossgrove situated about four miles from Bandon. It was\n", "school_info": "School: Cnoc an Bhile, Upton", "metadata": [{"Location:": "Upton, Co. Cork", "Teacher:": "\nD. Ó Donnchadha, S. Ní Liatháin\n"}, {"Language": "English"}]}, "5177617/5173584/5198514": {"title": "Leather Tanning", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0590, Page 134", "Page 134"], "url": "https://www.duchas.ie/en/cbes/5177617/5173584/5198514", "text": "\nMany of the old men long ago used to make their own boots and shoes.  They had no such machines for making them as we have nowadays.  They used to make the boots from the hides or skins of animals.  The hide of the ox was used more than the others.  When they would have the skin taken off they used to shake dry lime on it and hang it on a line until it became dry and stiff and if it was damp it would decay if it was not made into leather quickly.  The first thing that was to be done was to soak the skin in water into which lime was put.  They used to leave it steeping in this water\n(continues on next page)\n", "school_info": "School: Drumcharley, An Tulach", "metadata": [{"Location:": "Drumcharley, Co. Clare", "Teacher:": "\nMáire Nig Dhubháin\n"}, {"Collector": "Máire Ní Mhaoldhomhnuigh", "Gender": "female", "Address": "Glendree, Co. Clare"}, {"Informant": "(name not given)", "Relation": "grandparent", "Gender": "female", "Age": "61", "Address": "Glendree, Co. Clare"}, {"Language": "English"}]}, "5177626/5173967/5200224": {"title": "Mat-Weaving", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0591, Page 353", "Page 353"], "url": "https://www.duchas.ie/en/cbes/5177626/5173967/5200224", "text": "\n(continued from previous page)\nAgain people made straw straddles to put on the asses' backs to protect them from being chafed with the cliabhs which were placed on either side of ass drawing turf or manure for the baskets were used for such purposes.This is a tradition that people came here from Cork selling mats made from woven hair of cow etc. and that the people learned the trade in exchange for lodging and board.  They then travelled northwards with these and sold them.\n\n\n\n(skins were freed of hair and got some treatment to preservation)I have go no information about this but I heard that long ago they made boots of these using timber soles.\n\n\n\nThese are pastimes the young boys and men engage in at suitable times for each.  My boys could tell me exactly when the forbidden times are and what kind of fishing is forbidden by law without a license.\n", "school_info": "School: Lúbán Díge (Bodyke)", "metadata": [{"Location:": "Bodyke, Co. Clare", "Teacher:": "\nBríd, Bean Uí Chadhla\n"}, {"Language": "English"}]}, "5215813/5215094/5238816": {"title": "Old Crafts - Tanning", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138D, Page 10_041", "Page 10_041"], "url": "https://www.duchas.ie/en/cbes/5215813/5215094/5238816", "text": "\nMicheál Mór Ó h-Oistín's wife tanned a bag out of a sheep's skin. This is how she tanned it. She rubbed it between her hands and steeped it in milk and sewed it up for a bag.\n\n\n\nSpinning was and is carried on in this place. Every house has a spinning wheel and wool-cards. They used to spin enough thread to make clothes for them-selves. They used to spin a big\n(continues on next page)\n", "school_info": "School: St Bridget's", "metadata": [{"Location:": "Derrymore, Co. Mayo", "Teacher:": "\nMáire Uí hOistín\n"}, {"Collector": "Peigí C. M. Ní Oistín", "Gender": "female"}, {"Language": "English"}]}}