{"4427832/4348819/4434557": {"title": "Cures - Sprain Thread", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0095, Page 64", "Page 64"], "url": "https://www.duchas.ie/en/cbes/4427832/4348819/4434557", "text": "\n(continued from previous page)\nbeen sent to England to cure boys from Belcarra district who suffered from Sprain in England where they went to work.Thomas Naughton was (or is) a shoemaker. He is aged 19 years (in 1938) and is now in the Country Home, Castlebar. Tommie is able to make a plaster that can cure the \"Evil\" which is some thing like a running sore.He instanced to me the case of a neighbor who had the  Evil in his face. The doctors could not cure it. He got Tommie's plaster and it  cured him in a short time.\n\n\n\nThe curer of the Cléithín enjoys quite a reputation.  O'Hora of Ballyvary is almost famous.The cléithín is also called the spool of the breast. A bone or something in the breast, they say falls down out of its place and must be lifted up into its place.\n(continues on next page)\n", "school_info": "School: Clochar", "metadata": [{"Location:": "Clogher, Co. Mayo", "Teacher:": "\nM. Ó Gealbháin\n"}, {"Collector": "Micheál Ó Gealbháin", "Gender": "male"}, {"Informant": "Mrs Garry", "Gender": "female", "Age": "75", "Address": "Knockboy, Co. Mayo"}, {"Language": "English"}]}, "4428019/4368558/4474108": {"title": "The Cléithín", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138, Page 229", "Page 229"], "url": "https://www.duchas.ie/en/cbes/4428019/4368558/4474108", "text": "\nThe cléithín is the spool of a person's breast fallen down.  The way it is lifted is to make an oatmeal cake the breadth of the mouth of a glass.  Leave it on the breast and leave the glass on the person's breast. If the spool of the person's breast is down it will stick on to the glass and keep pulling it up until it has the spool of the breast lifted.  Then it is cured.  If the spool of the breast is not down it will not stick to the glass.\n\n\n\nThe cléithín is some bone that drops down in the breast.  If it is not lifted up the person might die.  There is a cure for the cléithín.  A big round glass called a tumbler has to be placed to the breast to put the bone in it's right place again.   The air in\n(continues on next page)\n", "school_info": "School: Coill Sailighe", "metadata": [{"Location:": "Kilsallagh, Co. Mayo", "Teacher:": "\nMáiréad, Bean Uí Ghiobáin\n"}, {"Informant": "Mrs Gannon", "Gender": "female", "Address": "Kilsallagh Lower, Co. Mayo"}, {"Language": "English"}]}, "4428019/4368558/4474112": {"title": "The Cléithín", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138, Page 229", "Page 229"], "url": "https://www.duchas.ie/en/cbes/4428019/4368558/4474112", "text": "\nThe cléithín is the spool of a person's breast fallen down.  The way it is lifted is to make an oatmeal cake the breadth of the mouth of a glass.  Leave it on the breast and leave the glass on the person's breast. If the spool of the person's breast is down it will stick on to the glass and keep pulling it up until it has the spool of the breast lifted.  Then it is cured.  If the spool of the breast is not down it will not stick to the glass.\n\n\n\nThe cléithín is some bone that drops down in the breast.  If it is not lifted up the person might die.  There is a cure for the cléithín.  A big round glass called a tumbler has to be placed to the breast to put the bone in it's right place again.   The air in\n(continues on next page)\n", "school_info": "School: Coill Sailighe", "metadata": [{"Location:": "Kilsallagh, Co. Mayo", "Teacher:": "\nMáiréad, Bean Uí Ghiobáin\n"}, {"Collector": "Willie O Malley", "Gender": "male", "Address": "Kinknock, Co. Mayo"}, {"Language": "English"}]}, "4566063/4563716/4571644": {"title": "Diseases - The Cleheen and Thrawlagh", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0026, Page 0106", "Page 0106"], "url": "https://www.duchas.ie/en/cbes/4566063/4563716/4571644", "text": "\nDiseases - The Cleheen and ThrawlaghThere is a very old cure for the Cleheen. It is performed in this way by getting a glass tumbler and placing it on the bone. Six rushes are then got and the tops of them are lighted. They are placed under the glass. A prayer is then said and after some time the glass is raised and the bone is raised with it. This was thought an infallible cure in olden times. There are old people in this district that can cure this disease. \"Thrawlagh.\" The cure for thrawlagh is the skin of an eel applied to the wrist very tightly with a bandage and\n(continues on next page)\n", "school_info": "School: Beárna Dhearg (C )", "metadata": [{"Location:": "Barnaderg, Co. Galway", "Teacher:": "\nBean Uí Shúilleabháin\n"}, {"Collector": "Peggy Healy", "Gender": "female", "Address": "Killererin, Co. Galway"}, {"Informant": "James Healy", "Gender": "male", "Address": "Killererin, Co. Galway"}, {"Language": "English"}]}, "4569059/4567892/4583391": {"title": "Cléithín", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0037, Page 183", "Page 183"], "url": "https://www.duchas.ie/en/cbes/4569059/4567892/4583391", "text": "\nSINE  SEADHÁINThis is said to be the little-tongue. The sufferer's mouth was swoollen inside   and he was scarcely able to speak. It is said to be akin to tonsilitis. Mrs Heneghan of Burrish was cured\n(continues on next page)\n", "school_info": "School: Sean-Bhaile Mór", "metadata": [{"Location:": "Shanballymore, Co. Galway", "Teacher:": "\nPádraig Ó Donnabháin\n"}, {"Collector": "Patrick O' Donovan", "Gender": "male", "Occupation": "teacher", "Address": "Dunmore, Co. Galway"}, {"Language": "English"}]}, "4613698/4609824/4626972": {"title": "Leigheasanna - Cois Leonta", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0066, Page 012", "Page 012"], "url": "https://www.duchas.ie/en/cbes/4613698/4609824/4626972", "text": "\n(continued from previous page)\ngo ngeobhfadh sí snáthadh leónta ón bhfigheadóir go mbéidir go leigheasfadh sé é. Fuair sí é agus chas sí é tuairim deich n-uaire timcheall rúitín an fhir.D'fhág sé ar an ruitín é go ceann seachtmhaine agus nuair a thog sé é dhe bhí sé go mhaith.\n\n\n\nBhí fear ann uair amháin agus chaith sé an-fhada ag casaid le píanta ina thaobhaona. Bhí sé ag dul go dtí dochtúire o bhliadhain go bliadhain agus bhí sé cinnte oraibh é do leigheas. Acht lá amháin bhí sé ann dona agus chuimhnuigheadar annsin gur cléithin a bhí aige. D'imthigh sé leis lá go ndeachaidh sé ag fear a bhí ag tógailt cléithin i Leitir Móir,\n(continues on next page)\n", "school_info": "School: An Léim", "metadata": [{"Location:": "Leam East, Co. Galway", "Teacher:": "\nM. Ó Dubhda\n"}, {"Collector": "Cáit Breathnach", "Gender": "female", "Address": "Leam West, Co. Galway"}, {"Collector": "Pádraig Breathnach", "Gender": "male", "Age": "13", "Address": "Leam West, Co. Galway"}, {"Informant": "Pádraig Breathnach", "Gender": "male", "Age": "13", "Address": "Leam West, Co. Galway"}, {"Language": "Irish"}]}, "4672107/4670885/4672792": {"title": "Local Cures - Spool of the Breast", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0171, Page 045", "Page 045"], "url": "https://www.duchas.ie/en/cbes/4672107/4670885/4672792", "text": "\nIn olden times people claimed that there was a part of the breast called the \"Spool\" and if a person got it dislocated they would never get alright unless they got the cure made and the spool lifted.  The person having the cure first made an oatmeal cake about a quarter of an inch thick, unbaked.   They then got a large tumbler and cut out the size of it from the cake.  Nine short pieces of rushes were then peeled and dipped in tallow and when firm they were stuck round in the portion of the cake cut out by the wine glass and lighted.  The patient was then stretched out on his back and the cake with the light candles was placed on the part of the breast where the spool is supposed to be.   The tumbler was then placed on top of the cake and left there for some time.  The glass then lifted up.  If it came away easily the spool was not down at all but if it was down it was with great.\n(continues on next page)\n", "school_info": "School: Cloonacool", "metadata": [{"Location:": "Cloonacool, Co. Sligo", "Teacher:": "\nSeán Ó Blioscáin\n"}, {"Collector": "Kathleen Bradly", "Gender": "female", "Address": "Mullaun, Co. Sligo"}, {"Language": "English"}]}, "4701699/4693666/4713468": {"title": "Local Cures - Thorn in Finger", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0169, Page 118", "Page 118"], "url": "https://www.duchas.ie/en/cbes/4701699/4693666/4713468", "text": "\nOften times a person might get a thorn in his finger.  If he could not get it out with a pin  or a needle, an easy way it to get it out is to get  the tongue off a fox and rub it to the thorn.  Then it will come out.\n\n\n\nWhen the spool of the breast goes down, the cure is to bake an oatmeal cake about the size of the mouth of a tumbler.  Then break matches in halves and stick them down in the cake and light them.  Then place the tumbler down on the cake and leave it on the patient's breast and it will soon soak up the breast.   Mr McCann of Tobercurry has the cure of it.  Patrick Davis, Leekfield, Skreen, Co. Sligo\n", "school_info": "School: Dún Flainn", "metadata": [{"Location:": "Doonflin Upper, Co. Sligo", "Teacher:": "\nSeán Ó Maolagáin\n"}, {"Collector": "Patrick Davis", "Gender": "male", "Address": "Leekfield, Co. Sligo"}, {"Language": "English"}]}, "4769976/4763650/4929002": {"title": "Ailments and Cures - The Falling Breast Bone", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0781, Page 201", "Page 201"], "url": "https://www.duchas.ie/en/cbes/4769976/4763650/4929002", "text": "\nA person cures the falling breast bone. Her name is Mrs. Doyle; she lives in Burtown Athy. A person with the breast bone down feels in bad form, and feels some pressure about the chest. People go to Mrs Doyle to get cured, and they must go three times.She puts a sixpenny bit on the person's chest. She puts a candle on the sixpence. She lights the candle, and puts a tumbler over it. If the flesh goes up in the tumbler your breast bone is down. After the third visit to Mrs. Doyle the bone will be set back in its right place.My mother told me about this cure.\n", "school_info": "School: Skerries, Athy", "metadata": [{"Location:": "Skerries North, Co. Kildare", "Teacher:": "\nE. Tansey\n"}, {"Collector": "Julia Dempsey", "Gender": "female"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "female"}, {"Language": "English"}]}, "4921567/4880356/4929977": {"title": "The Cure of the Cleheen", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0269, Page 138", "Page 138"], "url": "https://www.duchas.ie/en/cbes/4921567/4880356/4929977", "text": "\nMrs Bridget Kelly, Culleenirvan, succeeded by her son Edward (both deceased) were the hereditary doctors of this disease. There is a belief very common in the district that in the case of delicacy the pit of the stomach falls in.The following was the method adopted. The man or woman was placed on the broad of his or her back on a table. The quack then placed a lighted candle on the stomach. A tumbler was placed over this candle and when the candle died the tumbler was removed with some force. The patient usually screamed some prayers were said. This was repeated on three successive Thursdays. Edward Gately, Bredagh, Ballyforan underwent the operation and came through successfully. There are also others, but in the majority of cases the patients died. Coming to these quacks was the last resort in many cases when doctors could do no nothing.\n", "school_info": "School: Baile 'n tSléibhe (B.)", "metadata": [{"Location:": "Cornalee, Co. Roscommon", "Teacher:": "\nMáirtín Mac Conchradha\n"}, {"Language": "English"}]}, "4769987/4764373/4933427": {"title": "Cures - Cure for a Ringworm", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0823, Page 478", "Page 478"], "url": "https://www.duchas.ie/en/cbes/4769987/4764373/4933427", "text": "\n(continued from previous page)\nworm, and it is said to get better.\n\n\n\nA penny is placed on the person's breast bone, and a candle is lighted, and placed on the penny, Then a glass is left over the candle, which goes out after a time, and this proves that the breast bone is down.The suction of the glass raises the bone, when this is done two or three times.\n\n\n\nThe stem of a plant called \"Sun Spurge\" is broken.When this is a milky liquid appears on the end of each piece, This is rubbed on the warts, until they disappear.\n", "school_info": "School: Mountmellick (B.)", "metadata": [{"Location:": "Mountmellick, Co. Laois", "Teacher:": "\nDll. Binéad\n"}, {"Language": "English"}]}, "4758583/4756591/4934912": {"title": "Local Cures", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0867, Page 348", "Page 348"], "url": "https://www.duchas.ie/en/cbes/4758583/4756591/4934912", "text": "\n1.For Breaking Out (Eczema?) on the face. Cut up Roots of Dock Leaf then fill three quarters of a small suacepan - pour vinegar on them to cover the Roots - Leave simmering by the fire over night. Rub mixture to \"sores\"\n\n\n\nA pint (by measure) of yarrow (wild) leaves. Cover with water. Draw as tea for an hour beside the fire. Strain off liquid.Take half a glass for nine mornings fasting.\n\n\n\nCover scalded part with flower or bread soda. If blisters 'rise' 'let' them.To heal the scald - powder chalk mix with hog's lard, apply as ointment.\n\n\n\nLight stump of wax camdle or breath under an inverted tumbler. On removal of tumbler the Bone will rise.\n", "school_info": "School: Clomanto", "metadata": [{"Location:": "Clomantagh Upper, Co. Kilkenny", "Teacher:": "\nLiam Mac Óda\n"}, {"Informant": "William Keyes", "Gender": "male", "Age": "70", "Address": "Castlecomer, Co. Kilkenny"}, {"Language": "English"}]}, "4921939/4911633/4941392": {"title": "The Raising of Breastbones", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0482, Page 073", "Page 073"], "url": "https://www.duchas.ie/en/cbes/4921939/4911633/4941392", "text": "\nThe Raising Of Breastbones.(Though this cure is not a charm-cure, being a natural method of treatment.  It is interesting and was practiced by the old people.  I was told of it by Mrs. Mary Griffin, Baranigue, Carrickerry, Ardagh,  aged 68).An ailment  especially among women is the falling inwards of a bone in the breast.  There was a woman in this locality who cured the ailment by raising the breast bone, which had fallen.  Her name was \"Mare\" Meara (or Mary O'Meara).The operation was performed by means of a tumbler and a piece of lighted candle.  A penny or other flat little object was placed on the centre of the affected part.  Then a piece of candle, short enough to allow a tumbler to be placed over it, was put standing on this penny, and was lighted.  The tumbler was now placed over the candle, and the mouth of it pressed very firmly on the breast, so that no air could get into it.The candle was allowed to burn for a while.  Then the curer caught a firm hold of the tumbler and pulled it as strongly as she could upwards, without turning it to any side.  This pull on the tumbler brought the fallen bone back to its original position. The drawing up of the tumbler\n(continues on next page)\n", "school_info": "School: Cluain Leith Áird", "metadata": [{"Location:": "Glenbaun, Co. Limerick", "Teacher:": "\nMáirtín de Barra\n"}, {"Informant": "Mrs Mary Griffin", "Gender": "female", "Age": "68", "Address": "Bauraneag, Co. Limerick"}, {"Language": "English"}]}, "4922096/4852127/4946793": {"title": "Cure for Yellow Jaundice", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0524, Page 036", "Page 036"], "url": "https://www.duchas.ie/en/cbes/4922096/4852127/4946793", "text": "\nCure for Yellow Jaundice1/In the olden times the people used to get the bay flower root to boil it in milk and take an egg cupfull of it three times a day2/There is another cure which is known only to one woman which was handed to her by her people and she keeps it as a secret.\n\n\n\n1/ The people in the olden times had a cure for the breast bone when down. The people said to put a penny to the breast and then get a small tumbler and put a lighting candle into the tumbler and when the candle would be quenched it was said it would draw out the flesh and then the bone would go into its own place.\n", "school_info": "School: Ahane (C.) Lisnagry", "metadata": [{"Location:": "Ahane, Co. Limerick", "Teacher:": "\nL. T. Walsh\n"}, {"Collector": "Maura Cosgrove", "Gender": "female", "Address": "Richhill, Co. Limerick"}, {"Informant": "Mr Cosgrove", "Relation": "parent", "Gender": "male", "Address": "Richhill, Co. Limerick"}, {"Language": "English"}]}, "4922383/4876245/5082894": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0621, Page 354", "Page 354"], "url": "https://www.duchas.ie/en/cbes/4922383/4876245/5082894", "text": "\n(Sketch showing the sick person lying in bed receiving the cure for breast bone trouble: a lighted candle placed on a penny on the breast bone and covered with a tumbler. )\n(continues on next page)\n", "school_info": "School: Lahinch", "metadata": [{"Location:": "Lehinch, Co. Clare", "Teacher:": "\nDónall Ó Ríordáin\n"}, {"Informant": "Michael Finucane", "Gender": "male", "Age": "60", "Address": "Moymore South, Co. Clare"}, {"Language": "English"}]}, "5008960/4971080/5109543": {"title": "Ringworm", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0700, Page 123", "Page 123"], "url": "https://www.duchas.ie/en/cbes/5008960/4971080/5109543", "text": "\nFasting spit is also a cure for Ringworm.\n\n\n\nOld Mrs Keapock had also a cure for this disease it consisted principally of Bees Wax and Elder leaves.\n\n\n\nRub oatmeal on part.\n\n\n\nA drink of water - N. GilesHold your breath - P. MathewsBlow into a brown bag - M. MurraySpit on your hand and put your hand under your knee - G DohertyEat a pinch of salt - G DuignanHold pulse while saying three H Marys - H DonnellanGet someone to give you a frightHold your breath and with top of fingers of each hand alternately open and close both ears.\n\n\n\n3 pinches flour and blessed it 3 times with holy water and put on affected part in the name of the Trinity - Mrs Austen\n", "school_info": "School: St Columba's Abbey, Navan", "metadata": [{"Location:": "Navan, Co. Meath", "Teacher:": "\nBr. Abban O' Donoghue\n"}, {"Language": "English"}]}, "5044582/5023900/5140748": {"title": "Local Cures - A Burst", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0803, Page 219", "Page 219"], "url": "https://www.duchas.ie/en/cbes/5044582/5023900/5140748", "text": "\n(continued from previous page)\nand was the burst well.\n\n\n\na sprained ankle:The way to cure a sprained ankle is to get bog moss and boil it in water. When it is boiled it is taken up and the water of it is used to was the ankle. Then the tight band is tied round the ankle.\n\n\n\nPains in your limbs: To rub eels grease on your limbs is a cure for pains.\n\n\n\nFallen breast bone: A man named James Leavy, Ballydaly, Tullamore, can take it up with the aid of a tumbler and a lighted candle.\n\n\n\nProud flesh: The rind of butter-milk which rests on the churn.\n\n\n\nBad stomach: To cure a bad stomach people used swallow live frogs.\n\n\n\nSore chest: Sheeps wool used be got and lard used be rendered and put on the wool. Then it used be put on childrens chest for a week or so, then taken off.\n", "school_info": "School: Kilmurry", "metadata": [{"Location:": "Kilmurry, Co. Offaly", "Teacher:": "\nA. de Búrca\n"}, {"Collector": "Michael Boland", "Gender": "male", "Age": "11", "Address": "Wood of O, Co. Offaly"}, {"Informant": "Julia Boland", "Relation": "parent", "Gender": "female", "Age": "55", "Address": "Wood of O, Co. Offaly"}, {"Language": "English"}]}, "5177649/5176655/5202101": {"title": "Leigheasanna - Craosghalar", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0598, Page 098", "Page 098"], "url": "https://www.duchas.ie/en/cbes/5177649/5176655/5202101", "text": "\n(continued from previous page)\nname of Father, Son & H. Ghost.\n\n\n\nbody covered with red spots. Apply a little of blood of a person called Walshe.\n\n\n\nCure - Place penny (preferably a bucker's penny - a very large one - of which there were odd ones) on flesh just below extremity of breastbone. On penny put 3 pieces of the very small candles in used long ago. Light them & place tumbler over  them lighting. After a time the candles would be extinguished. The force necessary to pull off the tumbler wd. raise the bone. This was done on 3 successive\n(continues on next page)\n", "school_info": "School: Meelick (B.)", "metadata": [{"Location:": "Meelick, Co. Clare", "Teacher:": "\nEoghan Ó Néill\n"}, {"Language": "English"}]}}