{"4427846/4350099/4447498": {"title": "Liam na Lasóige nó An Sop Reatha", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0097, Page 667", "Page 667"], "url": "https://www.duchas.ie/en/cbes/4427846/4350099/4447498", "text": "\nBhí gabha ann fadó agus bhí sé an-bhocht. Aon lá amháin agus é ag obair in-a cheardchain tháinig an deabhal chuige agus dubhairt sé leis go dtuibhradh sé saidhbhreas dó acht a theacht leis i gcionn seacht mbliadhain. Do ghéill an gabha agus d'eirig sé an-saidhbhir. Ansin tháinig Aingeal chuige agus thug sé trí guidhe dó.  Seo é an chéad ceann. Gan duine ar bith a bheith in ann a sparán a fhosgailt acht é fhéin. An dara ceann Duine ar bith a suidhfeadh i n-a chathaoir go mbheadh sé greamaighthe dí agus an treas ceann duine ar bith a thogfadh an t-ord i n-a láimh nach mbéadh sé i n-ainm é a chaitheadh uaidh acht ar mhian an ghabhann. Tá siad geallta arsan t-aingeal acht níor iarr tú ar neamh agus ní ghabhfaidh tú ann go brách. Bhí sé an-siadhbhir agus i ndeireadh na seacht mbliadhan tháinig an diabhal chuige agus d'iarr sé air a dhul\n(continues on next page)\n", "school_info": "School: Cill Bheidhin (Kilvine)", "metadata": [{"Location:": "Kilvine, Co. Mayo", "Teacher:": "\nPádhraic Ó Reachtagáin\n"}, {"Collector": "Brigíd Ní Fhlannagáin", "Gender": "female", "Address": "Shanvallyboght, Co. Mayo"}, {"Informant": "Seán P. Ó Flannagáin", "Relation": "parent", "Gender": "male", "Address": "Shanvallyboght, Co. Mayo"}, {"Language": "Irish"}]}, "4427876/4353302/4449266": {"title": "Jack and the Three Hags", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0105, Page 222", "Page 222"], "url": "https://www.duchas.ie/en/cbes/4427876/4353302/4449266", "text": "\n(continued from previous page)\nAt last the owner of the hotel had barrels of tar put round it. Away go the hags loaded with money, but poor Jack got captured in one of the tar barrels. In the morning the hotel keeper found the robber! Jack was sentenced to be hanged from the shaft of a sidecar. He asked one request before being hanged - leave to put on his red cap.The hangman got on the car. \"High over to Ireland,\" said Jack. At once Jack, car and hangman were all flying to Ireland. As they were passing over the English Channel Jack gave a cuff to the hangman. He himself landed home safe and sound to his mother in Connemara, but the hangman went to the bottom of the sea.\n\n\n\nOnce upon a time there was a man and his wife and children who were all very poor. This man had a forge but he had not many customers. One day he came in from the forge and saw the pot on the fire. He asked the wife, \"why have you the pot on the fire.\" His wife answered: \"To keep the children from falling in the fire.\" Billy said \"God is good and the devil isn't bad either.\"After a while a knock came to the door. Billy opened it and saw the devil standing outside. The devil said to Billy \"Didn't you mention my name a few minutes ago?\" Billy answered \"I did not.\" \"Yes, you did, you said God is good and the devil\n(continues on next page)\n", "school_info": "School: Gort Sceithe", "metadata": [{"Location:": "Gortskehy, Co. Mayo", "Teacher:": "\nTomás Ó Cléirigh\n"}, {"Collector": "Tomás Ó Cléirigh", "Gender": "male", "Occupation": "múinteoir", "Address": "Annefield, Co. Mayo"}, {"Language": "English"}]}, "4427956/4360928/4465310": {"title": "Willie the Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0123, Page 163", "Page 163"], "url": "https://www.duchas.ie/en/cbes/4427956/4360928/4465310", "text": "\nWillie the wispOnce upon a time there lived a blacksmith who was very tall, and on that account he was called \"Willie the wisp.\" This blacksmith was very fond of drink and one day as he was going towards his forge, the devil came to him with a purse. He said \"I will give you this purse which is never empty if you promise to come with me after seven years.\" \"Well if I get the purse, I will go with you after seven years\" said Willie.On getting the purse he was delighted. but he never told anybody, lest it might be stolen. About a year afterwards, one morning on going to his forge, he saw a little man standing outside, who seemed to be shivering with the cold. He told him to come in and warm him self, this the stranger did, but on leaving he told Willie he would grant him any wish he desired. \"Well I am not short of money\" said Willie \"but I have a purse and will you grant that anything I put into it will never come out.\"\"Well your wish is granted\" said the\n(continues on next page)\n", "school_info": "School: Tomghéis", "metadata": [{"Location:": "Tumgesh, Co. Mayo", "Teacher:": "\nM. Ó Casaide\n"}, {"Collector": "Mary Neary", "Gender": "female"}, {"Language": "English"}]}, "4428043/4371831/4475061": {"title": "A Story - Willie the Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0144, Page 647", "Page 647"], "url": "https://www.duchas.ie/en/cbes/4428043/4371831/4475061", "text": "\nWillie the wispWillie cooper was a black - smith. He hunted away his wife. He used be drunk very often. Then he lost all his customers. One day he stood at his shop door, a small little man came to him and asked him for work. Willie said he had no work for him. The small man said if he kept him for one year, he would give him any three gifts he liked. The little man promised also that he would bring back all his customers again. The first gift the little man gave Willie was: the money he would put into his purse no one would be able to take it out until he would take it out himself. The second gift was: anyone would not be able to take his sledge; if anyone tried to take it their hands would fasten to it. The third gift was; anyone that would\n(continues on next page)\n", "school_info": "School: Gleann Mór", "metadata": [{"Location:": "Attishane, Co. Mayo", "Teacher:": "\nA. de Brún\n"}, {"Language": "English"}]}, "4428031/4370070/4475214": {"title": "Will o' the Wisp or locally Willie the Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0141, Page 231", "Page 231"], "url": "https://www.duchas.ie/en/cbes/4428031/4370070/4475214", "text": "\nWill o' the Wisp or Locally (Willie the Wisp.)When Our Lord was leaving the Garden of Gethsemani he appealed to one of the soldiers to have pity on Him, but the soldier only gave Him a slap on the back and said \" Be off, be going with you ! \" When this soldier died his soul appeared before the Lord. The latter remembered him and said \" Be off, be going with you\" but he gave Him a candle to light him on his way round the world till the day of judgement. He is now called Willie the wisp.T. Harte told by Annie Bourke Palmerstown Killala. Aged 65.\n", "school_info": "School: Beann-chorr", "metadata": [{"Location:": "Banagher, Co. Mayo", "Teacher:": "\nTadhg Ó Hairt\n"}, {"Collector": "T. Harte", "Gender": "male"}, {"Informant": "Annie Bourke", "Gender": "female", "Age": "65", "Address": "Palmerstown, Co. Mayo"}, {"Language": "English"}]}, "4428031/4370071/4475215": {"title": "Willie the Wisp in Forge Village", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0141, Page 232", "Page 232"], "url": "https://www.duchas.ie/en/cbes/4428031/4370071/4475215", "text": "\nOnce upon a time there was a man going around at night time carrying a light through the lakes and marshes. He was called Willie the wisp. I had one uncle called Thomas Killeen. When he was a little boy, it was near xmas and his mother was talking about going to the shop to buy the xmas things and he went before her to the shop and the night came so bad that his mother did not go to get late in the night he began to get uneasy and the people of the shop said they would leave him at home.He said he was not afraid so\n(continues on next page)\n", "school_info": "School: Beann-chorr", "metadata": [{"Location:": "Banagher, Co. Mayo", "Teacher:": "\nTadhg Ó Hairt\n"}, {"Collector": "Thomas Collins", "Gender": "male", "Address": "Carrowtrasna, Co. Mayo"}, {"Informant": "Margaret Killeen", "Gender": "female", "Age": "45", "Address": "Carrowtrasna, Co. Mayo"}, {"Language": "English"}]}, "4428332/4396137/4484129": {"title": "Superstitions", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1048, Page 184", "Page 184"], "url": "https://www.duchas.ie/en/cbes/4428332/4396137/4484129", "text": "\n(continued from previous page)\nthe gull returned and came to the little boy's house and went to his bedroom and dropped a stone out of its beak into the boy's bed. Next day the boy's parents told the priest about the stone. The priest told them to put the stone into water. They did so and the priest blessed the water, the boy drank some of the water and he soon got well again. It is supposed that the stone came from Palestine.\n\n\n\nThis story was told by Andy McHugh who lives Kentucky, Ardara age 65 years. He heard it from his father when he was a young boy. His father lived in Maghera - a place on Loughrous beag bay about four miles from Ardara.There was a man one time named \"Willie the Wisp\" and he was a blacksmith. He gave himself up to the devil. The devil used to come many a time (to) but Willie used to ask him to be let stay on earth another while. He came for him this time and he had to go with him. When they\n(continues on next page)\n", "school_info": "School: An Tulach Mór", "metadata": [{"Location:": "Tully More, Co. Donegal", "Teacher:": "\nMáire, Bean Uí Bhrisleáin\n"}, {"Collector": "Patrick Mc Hugh", "Gender": "male", "Age": "11"}, {"Informant": "Andy Mc Hugh", "Gender": "male", "Age": "65", "Address": "Ardara, Co. Donegal"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "male", "Address": "Maghera, Co. Donegal"}, {"Language": "English"}]}, "4428368/4400622/4487725": {"title": "Will O' the Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1059, Page 88", "Page 88"], "url": "https://www.duchas.ie/en/cbes/4428368/4400622/4487725", "text": "\nOften in the Glen a light is seen at night, and my uncle said it was Will O' the Wisp.Will O' the Wisp is a spirit who could neither get into heaven or hell He is doomed to wander till the end, carrying in his hand a big light to show him the way. Will O' the Wisp was a blacksmith who sold himself to the devil for three years in order to get rich. The devil game him three years, and three wishes, and at the end of that time he was to come back, and take Will with him down to his kingdom. The first request Will asked was that anyone who got a hold of his sledge could never leave it down again until he allowed him to do so. The second was that anybody who sat in his chair he kept in the forge, couldn't get up, until he ordered him to; and the third, and last, was that any money Will ever put into his purse couldn't be taken out again by anyone except himself. The devil then went away saying he'd come back on that day three years. \"All right,\" says Will, \"I'll go with you.\"\n(continues on next page)\n", "school_info": "School: Acres", "metadata": [{"Location:": "Roshin Acres, Co. Donegal", "Teacher:": "\nEilis Ní Dhomhnaill\n"}, {"Collector": "Rose-Ann Ward", "Gender": "female", "Age": "14", "Address": "Roshin Acres, Co. Donegal"}, {"Informant": "James O' Donnell", "Gender": "male", "Age": "41", "Address": "Leckenagh, Co. Donegal"}, {"Language": "English"}]}, "4428382/4402273/4493499": {"title": "Liam na Sopóige", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1065, Page 104", "Page 104"], "url": "https://www.duchas.ie/en/cbes/4428382/4402273/4493499", "text": "\nBhí gabha na comhnuidhe i nÉirinn fad ó shoin darbh' ainm Liam. Bhí sé na chomhnuidhe leis féin. Ní rabh a dhath idir é fhéin agus an saoghal ach cathaoir, crann ubhal agus bocsa beag ádhmaid. Bhí sé iongantach tugtha do'n ól. Lá amháin bhí sé ag gabháil thart le teach tabhairne agus bhí a theangaidh amuigh le tart. Ba mhaith leis gloinne uisce bheatha fhagháil ach ní rabh oiread agus pighinn ruadh aige. \"Ach\", ar seisean, \"níl a dhith orm ach scilling ach dhíolfainn mo anam leis a diabhal dá dtabharfadh sé scilling amháin damh a gheobhadh gloinne uisce beatha damh. D'amharc sé ar an urlár agus chonnaic sé scilling caithte ann. Thóg sé an scilling, chuaidh isteach go teach na tabhairne agus d'ól gloinne bréagh. Annsin thug sé a aghaidh ar an bhaile.Cé bhí istigh sa cheardcha ach Naomh Peadar agus capall leis fá choinne crúthacha a fhagháil air. Thoisigh Liam ar an obair agus ba ghoirid go rabh na cruthacha aige ar an chapall. Nuair a bhí sé réidh arsa Naomh Peadar, \"tá trí athchuinge le fagháil agat anois\", \"bhal\", arsa Liam, \"tá crann ubhall agam agus bíonn an t-aos óg ag tabhairt leo na n-ubhall agus is é an athchuinge atá mé a iarraidh duine ar bith a leagfas a láimh air é ciongladh  dó nó go scaoilfeadh seisean é\". \"An dara cionn\", ar seisean, \"má shuidheann duine ar bith\n(continues on next page)\n", "school_info": "School: Rann na Feirsde", "metadata": [{"Location:": "Rinnafarset, Co. Donegal", "Teacher:": "\nPádraig  Ó Baoighill\n"}, {"Informant": "Niall Ó Domhnaill, local name Niall (Séimisín) Ó Domhnaill", "Gender": "male", "Age": "82", "Address": "Derrynamansher, Co. Donegal"}, {"Language": "Irish"}]}, "4497975/4345178/4497979": {"title": "Liam an tSoip (Will o' the Wisp)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0088, Page 116", "Page 116"], "url": "https://www.duchas.ie/en/cbes/4497975/4345178/4497979", "text": "\nBhí fear ann uair amhain darb ainm Líam. Gatha a bhí ann. Lá fluich tháinig fear isteach aige agus thug Líam neart bide agus tune dhó. Dubhairt sé leis purcacht go maidín. Dubhairt an fear nach dtáinig leis, sé son dá rud a d'íarrfadh é air go duirtfradh sé dhó íad. D'íarr Líam casúr nach dtiocfadh lé aoinneach a thógfadh é a leagaint síos go dtugadh Líam cead dhó; agus cathaoir nach dtiocfadh le aoinneach a suidhfeadh inniu, eirighe go dtugadh Líam cead dhó. Nár íarr na flaitís, agus cheap Líam ann sin gurb é ár Slanuighteóir a bhí ann, agus bhí brón mór air nar íarr se na flaitís.Lá amhain táinig an diabhal isteach ag Líam agus dubhairt Liam leis siudhe 'sa cathaoir fhad is bhéadh sé ag fágail fá réir. Nuair a bhí léann réid, d'fhuagar sé ar an diabhal a bheith ag teacht, agus bhí an diabhal annsin agus sarmghadh air eirige as an gcathaoir.Niorbh fhada go dtáinig Líam agus\n(continues on next page)\n", "school_info": "School: Maol Raithnighe", "metadata": [{"Location:": "Mallaranny, Co. Mayo", "Teacher:": "\nAn tSiúr Philomena\n"}, {"Collector": "Tomás Ó Domhnaill", "Gender": "male"}, {"Informant": "Maighréad Ní Mháille", "Relation": "grandparent", "Gender": "female", "Age": "99", "Address": "Dooghbeg, Co. Mayo"}, {"Language": "Irish"}]}, "4498770/4385631/4510292": {"title": "Will o' the Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0792, Page 103", "Page 103"], "url": "https://www.duchas.ie/en/cbes/4498770/4385631/4510292", "text": "\nWillo the Wisp.This is how we play \"Willo the Wisp\".Any number of children can play this game.n a dark night, one person goes out to hid carrying a flash-lamp, and when he is ready he flashes his lamp to show the followers where he is.The followers run in that direction and immediately \"Willo the Wisp\" runs in another direction, and when the followers go to the spot, he has gone, then they call \"Willo the Wisp\" show your lights.This is repeated until \"Willo the Wisp\" is caught.  Then another child is sent out and the same method is followed.\n", "school_info": "School: Howth (B.)", "metadata": [{"Location:": "Howth, Co. Dublin", "Teacher:": "\nE. J. Crowley\n"}, {"Collector": "Val Flood", "Gender": "male"}, {"Language": "English"}]}, "4428244/4388038/4510353": {"title": "The Boy who Was Sent to a College to Learn Latin", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0799, Page 237", "Page 237"], "url": "https://www.duchas.ie/en/cbes/4428244/4388038/4510353", "text": "\n(continued from previous page)\ncareer.  The late Mr. Campbell lived at Taplagh, Broomfield, Castleblayney.\n\n\n\nWill ' the Wisp is in Farney a wandering fairy who only appears in certain places at certain times.  Tom McCable a local fiddler of Aghnafareon Co. Monaghan related once that he saw Will ' the Wisp at the spot in a meadow where he had buried a cow.  Will ' the Wisp in the minds of the people of Aghnafareon townland was in some way associated with the burial place of dead domestic animals, as the cow and the horse.\n", "school_info": "School: St Peter's, Phibsboro", "metadata": [{"Location:": "Phibsborough, Co. Dublin", "Teacher:": "\nSs. Breathnach\n"}, {"Collector": "Séamus Breathnach", "Gender": "male"}, {"Language": "English"}]}, "4428389/4403191/4511213": {"title": "Liam an Dealáin (Willy the Wisp)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1068, Page 154", "Page 154"], "url": "https://www.duchas.ie/en/cbes/4428389/4403191/4511213", "text": "", "school_info": "School: Cnoc an Stolaire", "metadata": [{"Location:": "Knockastoller, Co. Donegal", "Teacher:": "\nSeosamh Ó Gallchobhair\n"}, {"Language": "Irish"}]}, "4428380/4402149/4512248": {"title": "Liam na Sopóige", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1064, Page 49", "Page 49"], "url": "https://www.duchas.ie/en/cbes/4428380/4402149/4512248", "text": "\nLiam na SopóigeBhí gabha ' na chomhnaidhe i n Éirinn fad ó soin darb' ainm Liam. Ní raibh aige ach é féin. Ní raibh de sháidhbhreas aige ach cathaoir, crann ubhall, bosca adhmaid agus an cheardhcha. Bhí sé iongantach tugtha don ól. Lá amháin bhí sé ag gabhail thart le teach tabhairne agus dar leis gur dheas an rud gloine biotailte ach ní raibh oiread agus pighinn ruadh aige.\"Ach\" ar seisean, \"níl a dhíth orm ach scilling amháin agus dhíolfainn mé fhéin leis an diabhal dá dtabhairfeadh sé scilling amháin domh a gheobhadh gloine uisce bheatha domh a fliuchadh mo bhéal.\"D'amharc sé thart ar an talamh agus chonnaic sé scilling 'na luighe ag n-a thaoibh. Chuaidh sé isteach agus cheannuigh sé gloine uisce bheatha.Chuaidh sé 'na bhaile annsin agus cé bhí istoigh roimhe ach Naomh Peadar agus capall leis le cruitheacha a fhágháil air. Thoisigh an gabha agus ní raibh sé bhfad ná ghearr go raibh na cruitheacha ar an chapall aige.\n(continues on next page)\n", "school_info": "School: Rann na Feirsde", "metadata": [{"Location:": "Rinnafarset, Co. Donegal", "Teacher:": "\nDomhnall Ó Baoighill\n"}, {"Collector": "Sorcha Anna Ní Dhomhnaill", "Gender": "female", "Address": "Derrynamansher, Co. Donegal"}, {"Informant": "Niall Ó Domhnaill", "Relation": "grandparent", "Gender": "male", "Age": "82", "Address": "Derrynamansher, Co. Donegal"}, {"Language": "Irish"}]}, "4428401/4404735/4512777": {"title": "Seanscéalta", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1072, Page 16", "Page 16"], "url": "https://www.duchas.ie/en/cbes/4428401/4404735/4512777", "text": "\n(continued from previous page)\nfá dhéin na ngárdaí. Tháinig siad-san go dtí an cró agus thug leo an cholainn gan cheann 'un na beirice. Chuir said ináirde ar spíce é go bhfeicfidh cé ar leis é. Oidhche amháin dubhairt  an stócach  leis an tsean-bhean \"Cuirfidh mise orm culaith dubh agus  cuirfidh (mise)  tusa braithlín geal rachfaimuid 'un na beirice fá dhéin na colna. Sílfidh na gárdaí gur an diabhal agus  an Mhaighdean Mhuire atá  ann\". Nuair  a thainig siad go dtí an bheiric sgannruigh na peus agus leig siad ar siubhal an cholainn gan cheann. chuaidh an tsean-bhean agus  an stócach 'na bhaile agus iad bréagh sásta\n\n\n\n(Brighid Bean Mhic Eachmharaigh, Caoldruim, Gort-a-Choirce)Fuaras an sgéal seo ó mó  mhathair mhór Caoldruim uachtarach, Gort a' Choirce, Tír Chonaill Aodh Mac Gabhna,  Árdaidh Bhig, Gort a Choirce, Tír Chonaill           Liam na SapóigeBhí gabh ann fad ó shoin darbh ainm Liam na Sapóige. Fuair sé trí athchuingeacha1) An té a bheirfeadh ar an  órd nach dtiocfadh\n(continues on next page)\n", "school_info": "School: Cnoc na Naomh", "metadata": [{"Location:": "Crocknaneeve, Co. Donegal", "Teacher:": "\nPádraig Mac Cnáimhsighe\n"}, {"Collector": "Aodh Mac Gabhna", "Gender": "male", "Address": "Ards Beg, Co. Donegal"}, {"Informant": "Brighid Bean Mhic Eachmharcaigh", "Relation": "grandparent", "Gender": "female", "Address": "Keeldrum Upper, Co. Donegal"}, {"Language": "Irish"}]}, "4493649/4407559/4518120": {"title": "Scéal - An Bhean agus an Pota", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1080, Page 245", "Page 245"], "url": "https://www.duchas.ie/en/cbes/4493649/4407559/4518120", "text": "", "school_info": "School: Rosguill & Doe Branch I.N.T.O.", "metadata": [{"Location:": "Rosguill, Co. Donegal", "Teacher:": "\nT. Mc Ginley\n"}, {"Collector": "Mícheal Mac Giolla Cheara", "Gender": "male", "Address": "Doagh, Co. Donegal"}, {"Language": "Irish"}]}, "4493698/4412089/4525340": {"title": "Seanscéal - Mar a Fuair Liam na Sopóige a Ainm", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1094, Page 168", "Page 168"], "url": "https://www.duchas.ie/en/cbes/4493698/4412089/4525340", "text": "", "school_info": "School: An Árd Leathan", "metadata": [{"Location:": "Altlahan, Co. Donegal", "Teacher:": "\nPádraig Mac Ailin\n"}, {"Collector": "Pádraig Mac Ailin", "Gender": "male", "Occupation": "múinteoir"}, {"Language": "Irish"}]}, "4493696/4411794/4526503": {"title": "Scéalta - Liam an tSoip", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1093, Page 295", "Page 295"], "url": "https://www.duchas.ie/en/cbes/4493696/4411794/4526503", "text": "\nBhí fear ann am amháin darbh ainm Liam. Bhí sé i na gabha , droch fhear a bhí ann agus dhiol sé a anam leis an diabhal.    Tháinigh an diabhal fa na choinne achan triúir seacht mbliadhain.    Lá amháin tháinigh an diabhal isteach , agus diarr Liam air bualadh leis an órd, thosuigh an diabhal ag bualadh , agus ní chuca leis stád. Sa deireadh thug Liam cead do imtheacht arís.   Indhe seacht mbliadhain eile , tháinigh sé arais arís, diarr Liam air suidhe ar stól, suidhe an diabhal, ar an stól, agus\n(continues on next page)\n", "school_info": "School: Baile Ciaragain", "metadata": [{"Location:": "Ballykergan, Co. Donegal", "Teacher:": "\nCáitlín, Bean Mhic Fhionntaigh\n"}, {"Informant": "Seán Ua Cearbhallain", "Gender": "male", "Age": "68", "Occupation": "feirmeoir", "Address": "Letterkillew, Co. Donegal"}, {"Language": "Irish"}]}, "4493707/4413085/4528940": {"title": "Will o' the Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1096, Page 442", "Page 442"], "url": "https://www.duchas.ie/en/cbes/4493707/4413085/4528940", "text": "\nWill o' the WispThere is a light seen at all times of the year chiefly on hills and in glens during the night. It keeps constantly moving. It is Will o' the Wisp. He is doomed to wander the end and this is why:~Will was always great with the devil and one Will asked him for three wishes. First, as he was a blacksmith, he said 'if any one lifts my sledge give me power not to let him leave it down again until I tell him'. Second 'if anyone sits on my iron chair give me power not to let him up until I'm ready' and third 'if I put money in my purse give me power not to let anyone take it out except my-self. The devil granted Will his wishes but told he could enjoy them three years as he was\n(continues on next page)\n", "school_info": "School: Mín Bán", "metadata": [{"Location:": "Meenbane, Co. Donegal", "Teacher:": "\nSeosamh Mac Coluim\n"}, {"Collector": "Susan Duffy", "Gender": "female"}, {"Informant": "Mrs Duffy", "Gender": "female", "Address": "Meenbane, Co. Donegal"}, {"Language": "English"}]}, "4493754/4416762/4530944": {"title": "Will o' the Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1110, Page 260", "Page 260"], "url": "https://www.duchas.ie/en/cbes/4493754/4416762/4530944", "text": "\nAbout fifty years ago there lived a man whose name was Will O' the Wisp. This man sold himself to the devil for three years.After three years the devil came for him. Will O' the Wisp who was a blacksmith told him to sit down on a chair until he would cut off his head with a sledge. Will of the Wisp said to the devil, \"If I let you up will you let me stay on the world for three more years.\" \"I will\" said the devil. Then one day as Will O' the Wisp and the devil were out walking they came to a public house.Will of the Wisp said to the devil\n(continues on next page)\n", "school_info": "School: Drumfries", "metadata": [{"Location:": "Drumfree, Co. Donegal", "Teacher:": "\nP. E. Ó Dubhthaigh\n"}, {"Collector": "Ethel Fullerton", "Gender": "female"}, {"Informant": "Philip Doherty", "Gender": "male", "Address": "Ballinlough, Co. Donegal"}, {"Language": "English"}]}, "4493754/4416774/4530947": {"title": "Will o' the Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1110, Page 271", "Page 271"], "url": "https://www.duchas.ie/en/cbes/4493754/4416774/4530947", "text": "\nThere lived a man once upon a time, whose name was Will O' the Wisp. He was a blacksmith, and shoed horses.One day St. Joseph came to have his donkey shod. Will O' the Wisp shod the donkey. Then he asked St. Joseph for the money. St. Joseph said he had none. But St. Joseph, gave him three wishes. He took the three wishes, but he didn't wish to get to heaven. When he died he didn't get to heaven, and is wandering through the hill to this present day with a light.\n", "school_info": "School: Drumfries", "metadata": [{"Location:": "Drumfree, Co. Donegal", "Teacher:": "\nP. E. Ó Dubhthaigh\n"}, {"Informant": "Henery Toland", "Gender": "male", "Age": "26"}, {"Language": "English"}]}, "4493756/4417136/4531443": {"title": "A Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1111, Page 127", "Page 127"], "url": "https://www.duchas.ie/en/cbes/4493756/4417136/4531443", "text": "\n(continued from previous page)\nthe field so from that day till this day there never came a good crop of potatoes or corn from the field.\n\n\n\nBefore Will o' the Wisp got his name this is how it happened.  One time a man appeared to a Blacksmith and he told him that he would get any three wishes he asked for. The first wish he asked for was a purse that what ever he put into the purse would not come out without him letting it. The second wish was for a chair that if anybody would sit on it they could not get out of it without him letting the person out.  The third and last wish was to always have plenty of money. A few years after that the devil came to this blacksmith to take him to hell. The blacksmith told the\n(continues on next page)\n", "school_info": "School: St Columba's, Buncrana", "metadata": [{"Location:": "Buncrana, Co. Donegal", "Teacher:": "\nEoghan Ua Gallchobhair\n"}, {"Collector": "Patrick Doherty", "Gender": "male"}, {"Informant": "Mr Charles Doherty", "Gender": "male", "Address": "Buncrana, Co. Donegal"}, {"Language": "English"}]}, "4493761/4417813/4531837": {"title": "Will o' the Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1112, Page 442", "Page 442"], "url": "https://www.duchas.ie/en/cbes/4493761/4417813/4531837", "text": "\nPeople believed in will o the wisp. They thought it was an invisible man that carried a light about the size of a candle light and it used to go about a quarter of a mile at a time. The people said he was too bad to get to heaven and the devil would not let him into hell.  Others said that he was a blacksmith who sold himself to the devil and the devil told him he would get money every time he struck the anvil.  When he was selling himself to the devil he made three promises.1 Whoever lifts the sledge cannot leave it down till he gives him leave.2 Whoever sat on a chair they could not rise till he told them.3 Whatever money was put into his purse could not be taken out until he told it.When will o the wisp sold himself to the devil he got three years leave to live on earth. At the end of the three years the devil came and asked him to come with him and Will told him he would go whenever he would finish a  piece of work he had to do and he asked the devil to sledge some for him. When the devil lifted the sledge he could not leave to down again unless he promised three more year to the blacksmith to remain on earth and so he did.\n(continues on next page)\n", "school_info": "School: St Egney's (C.), Buncrana", "metadata": [{"Location:": "Buncrana, Co. Donegal", "Teacher:": "\nEllen Daly\n"}, {"Informant": "William J Mc Laughlin", "Gender": "male", "Age": "89", "Address": "1419855"}, {"Language": "English"}]}, "4493798/4421755/4541963": {"title": "An Old Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1121, Page 448", "Page 448"], "url": "https://www.duchas.ie/en/cbes/4493798/4421755/4541963", "text": "\nLiam-na-Go or Willie the Wisp was an Irish blacksmith who lived away in a distant part.  One day he was working in his forge.  When in steps a Druid or Magician the newcomer asked Liam could he make a sword Liam said he could make the best that no blacksmith within the four corners of Erin could beat.  Very well says the magician make me one the sharpest blade in Erin.  I will give you three days to make it.  When I will call you for it and if it suits me I will give you a pack of cards and grant you any three requests you may ask for.  At the appointed time the Druid returned and examined the sword.  He was pleased with it he pulled forth a pack of cards and\n(continues on next page)\n", "school_info": "School: Béal Trágha", "metadata": [{"Location:": "Carrowreagh or Craignacally, Co. Donegal", "Teacher:": "\nEibhlín Nic Lochlainn\n"}, {"Informant": "Edward Toland", "Gender": "male", "Address": "Doagh Isle, Co. Donegal"}, {"Language": "English"}]}, "4547213/4413777/4547804": {"title": "Willie the Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1099, Page 18", "Page 18"], "url": "https://www.duchas.ie/en/cbes/4547213/4413777/4547804", "text": "\none day a red haired boy called at a forge to get his plough mended. The blacksmith was busy and told the boy to wait a while.When the blacksmith had finished the work he was at he fixed the plough for the red haired boy. The boy told him that he had no money but that he would give him three wishes. Full of glee the smith wished for three things. the first wish was that whoever would sit in the chair at the forge would not be able to get up until smith wished it. The second wish was that whoever caught the sledge would be unable to let it go until  smith pleased. The third wish was that whatever got into smith's purse would not be able to get out until smith wished it. \"Poor Foolish Willie\" said the boy \"wouldn't wish for Heaven.\" The boy then went off and left Willie in the forge. Willie was indeed foolish, for, some years before this happened, Willie had sold his soul to the Devil in return for money. The bargain was that when the Devil would come for him Willie would have to go with him. Soon after Willie had got the three wishes the Devil came to him. Willie said to the Devil, \"Sit down there in the chair until I fix the tongs.\" The Devil\n(continues on next page)\n", "school_info": "School: Mín na Glaise (Meenglass)", "metadata": [{"Location:": "Meenglass, Co. Donegal", "Teacher:": "\nSíle, Bean Uí Mhaolagáin\n"}, {"Collector": "Thomas Boland", "Gender": "male", "Address": "Carrickmagrath, Co. Donegal"}, {"Informant": "Neil Boland", "Relation": "parent", "Gender": "male", "Address": "Carrickmagrath, Co. Donegal"}, {"Language": "English"}]}, "4602676/4594550/4614997": {"title": "Willie the Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0004, Page 059", "Page 059"], "url": "https://www.duchas.ie/en/cbes/4602676/4594550/4614997", "text": "\nThere was once a poor blacksmith living in the district of Clifden. He used to get a fair share of work but he used to buy drink for the money. One day he was working very hard and he saw a man coming up the lane.  He was dressed in a big top hat and he had a short silver stick for walking.The man came into the forge and he asked the blacksmith what was his name. The blacksmith said my name is Willie. The gentleman said will you come with me in seven years time. I will said the blacksmith if you give me £200 to-day. \"Alright\" said the blacksmith. The man took out £200 out of his pocket and he gave it to the blacksmith. In seven years time I will call for you on the seventh hour of the seventh day of the seventh month of the seventh year.\n(continues on next page)\n", "school_info": "School: An Clochán (B)", "metadata": [{"Location:": "Clifden, Co. Galway", "Teacher:": "\nAn Br. Angelo Mac Shámhais\n"}, {"Collector": "Ignatius Ludden", "Gender": "male"}, {"Informant": "Thomas Folan", "Gender": "male", "Age": "60"}, {"Language": "English"}]}, "4591092/4589829/4615589": {"title": "An Old Story - Will o' the Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0013, Page 153", "Page 153"], "url": "https://www.duchas.ie/en/cbes/4591092/4589829/4615589", "text": "\nWill of the Wisp was a man named William Foster, a blacksmith by trade, and was always very poor. He was constantly complaining of his hard lot to his wife and neighbours.One day when working in his forge a little man dressed\n(continues on next page)\n", "school_info": "School: Baile Ruadh (Cailíní)", "metadata": [{"Location:": "Ballyroe, Co. Galway", "Teacher:": "\nMáire, Bean Uí Fhearghail\n"}, {"Collector": "Seosaimhín Ní Thormhaigh", "Gender": "female", "Address": "Kilnalag, Co. Galway"}, {"Informant": "Seán Ó Thormaigh", "Relation": "unknown", "Gender": "male", "Address": "Kilnalag, Co. Galway"}, {"Language": "mixed"}]}, "4622995/4621947/4629043": {"title": "Will of the Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0078, Page 150", "Page 150"], "url": "https://www.duchas.ie/en/cbes/4622995/4621947/4629043", "text": "\nA certain man lived one time his name was Will of the Wisp he was a blacksmith. This day he was working in his forge when a small man walked in to the forge.  Will told him to go down to the fireplace to warm himself. The little man was delighted at that.  You have three wishes now said the little man.  Will said he had a big iron and he would wish that anyone who would catch hold of it would grip it, now it is granted said the little man.  The next wish is said Will that anyone who will sit on the armchair I have will grip to it. The third wish was that whenever he would open his purse we would like to see it full of money. In seven years from this said the little man you will come with me. When the seven years had passed the little man came to Will and asked him to go with him. I will said WIll if you hold this iron, the little man caught hold of the iron and his hands gripped to it. If you take the iron of my hands said the little man I will give you seven yrs more. Will took\n(continues on next page)\n", "school_info": "School: Naomh Ruadhan, Gallach", "metadata": [{"Location:": "Gallagh, Co. Galway", "Teacher:": "\nD. Ó Neachtain\n"}, {"Collector": "John Maher", "Gender": "male", "Address": "Hampstead, Co. Galway"}, {"Informant": "(name not given)", "Gender": "unknown", "Age": "77", "Occupation": "farmer"}, {"Language": "English"}]}, "4605954/4605494/4643194": {"title": "Will o' the Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0208, Page 032", "Page 032"], "url": "https://www.duchas.ie/en/cbes/4605954/4605494/4643194", "text": "\nWill o' The WispA long time ago there lived blacksmith named Will Cooper. One day as he was working in his forge the devil appeared to him and told him that he would give him three wishes if he promise to go with him at the end of six months. Will consented. The three wishes were That his hammer would stick to the hand of anyone who lifted it and that he could not get rid of it until Will was pleased to let him go. The second wish was that anyone who sat in his chair could not get up without his permission. And the third one was no one could take money out of his purse without his permission. At the end of the six months he came back again. Will asked him to sit on the chair while he was getting ready to go. When he tried to get up he could not as he was\n(continues on next page)\n", "school_info": "School: Aughagrania", "metadata": [{"Location:": "Aghagrania, Co. Leitrim", "Teacher:": "\nMiss Róisín Mulvey\n"}, {"Collector": "Tearance Moran", "Gender": "male", "Address": "Aghagrania, Co. Leitrim"}, {"Informant": "William Moran", "Gender": "male", "Age": "68", "Occupation": "farmer", "Address": "Aghagrania, Co. Leitrim"}, {"Language": "English"}]}, "4613720/4612538/4649922": {"title": "Scéalta - Willie the Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0407, Page 229", "Page 229"], "url": "https://www.duchas.ie/en/cbes/4613720/4612538/4649922", "text": "\n23/7/37. He was a blacksmith by trade.  One day a respectable looking man (as he thought) walked into his house, and who was it but the Devil.  They had a great talk for a time.  After a while the devil said \"If you will come with me after seven years I will give you a chair and anybody who sits in it will stick in it until such time as you yourself will order him to be free.\"  The devil also gave him a sledge and anybody who should catch hold of it would also stick to it, and a purse that could not be opened by anyone but himself..  After seven years the devil came again and said \"Are you ready\".  \"Just ready but a small delay\" said the smith.  \"Sit down on the chair for a minute.\"  Then when he asked the devil to go, he was stuck to the chair and was unable to release himself.  So the devil screamed to release him from the chair and that he would not come for seven years again.  When the seven years were up the devil came again, and said \"Are you ready now?\"  \"Yes, but [?] minutes till I make a set of horse-shoes for my neighbour.\"  So the devil caught the sledge and when he had finished the set of shoes, he could not release himself from the sledge.  He said, \"If you release me I will give you seven more years.\"  Again at the end of seven years he came.  \"Are\n(continues on next page)\n", "school_info": "School: Ladhar an Chrompáin", "metadata": [{"Location:": "Lyracrumpane, Co. Kerry", "Teacher:": "\nPádraig Ó Súilleabháin\n"}, {"Collector": "Siobhán Ní Leidhe", "Gender": "female", "Address": "Knockaunbrack, Co. Kerry"}, {"Informant": "Michael Hannon", "Gender": "male", "Age": "60", "Address": "Bunglasha, Co. Kerry"}, {"Language": "English"}]}, "4649698/4648248/4658842": {"title": "Will o' the Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0212, Page 330", "Page 330"], "url": "https://www.duchas.ie/en/cbes/4649698/4648248/4658842", "text": "\nOnce upon a time there was a man called Will Cooper and one day he was working in his forge when there came in another man and asked him for the use of his forge for a while, the man told him he could have it. The other man went out and was back in about five minutes hauling two old women after him. He put them in the fire, and when he took them out he hammered them on the anvil, until he hammered them in to one good woman.Will had a wife and mother in law that could never agree, and he thought that he would do the same as the other man did. He put them in the fire and they burned to death, then Will was worse than ever, and the man came back and fixed them the same as ever for him. When he was leaving he told Will that he would grant him three wishes, and to ask what ever he liked. Will agreed. First he asked that anyone who would lift his hammer could not leave it down until he took it from him. Secondly, that anyone who sat on his chair could not leave until he let them. Thirdly, that any money that went into his purse noone but him self could take it out.\n(continues on next page)\n", "school_info": "School: Druim Áine", "metadata": [{"Location:": "Drumany (O'Brien), Co. Leitrim", "Teacher:": "\nPádhraic Mac Raghnaill\n"}, {"Collector": "Bernard Gilheany", "Gender": "male", "Address": "Derrinkip, Co. Leitrim"}, {"Informant": "Pat Gilheany", "Gender": "male", "Age": "66", "Address": "Derrinkip, Co. Leitrim"}, {"Language": "English"}]}, "4658430/4654637/4659316": {"title": "A Cruel King", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0221, Page 036", "Page 036"], "url": "https://www.duchas.ie/en/cbes/4658430/4654637/4659316", "text": "\n(continued from previous page)\nEvery year afterwards there grew on the horses back five thousand packs of wool and five thousand bushles of blackberries.You are a liar and a born liar and I can stand you no longer\" said the fisherman.  So the fisherman was set in the red hot Chair + the wise old man set free.\n\n\n\nWillie the WispStory taken down from Biddy Gilchrist  Annaughmaconway, Cloone, age 72 years. Farmers wife,maiden name Biddy Casey. This Casey family were great story tellers.Once upon a time there lived a blacksmith named Willie, and he was very poor. One day the devil came to him and said he would give him 100 pounds if he would come with him at the end of six months. Willie wanted the money so badly that he took it and gave the devil his promise. One day shortly after a saint and a little boy we going along the road with an ass and they went into the forge to set a shoe on the ass. Willie was so poor that he had no iron to make the shoe so he made it out of his hammer. When the saint saw what Willie had done, he gave him three wishes and they were: Anything that would get into his armchair would not get out till Willie would like; Anyone that got a hold of his sledge could not let it go till Willie liked; and anything that got into his purse could not get out of it till Willie would like. At the end of the six months the devil came for Willie. Willie was busy when the devil came putting hoops on a tub and he told the devil to rest himself in the chair till he was ready. When Willie had the job finished he told the devil he was ready to go but the devil could not rise from the chair. He squealed and –but it was no good so he told Willie that if he could release him he would give him six months more and another hundred pounds Willie let him go then. At the end of the second six months the devil came again and willie said that he would go with him when he had finished sledging a piece of iron. He asked the devil to help him sledge and when they had finished Willie said he was ready to go. But the devil could not let go the sledge. He shouted and roared and shook his hands but it was no good he could not drop the sledge so he told Willie he would give him another six months and another hundred pounds if he would take the sledge from his hands. Willie took the sledge from him and the Devil went.  At the end of the third six months the devil came again and this time he would neither sit in the chair or sledge to iron for Willie so that in the long run Willie had to go with him. As they were passing a public house willie saw two men drinking and he said to the devil “set those two men drunk and you can take them with you too, for it is easy for the devil to take drunken men.” ‘That is a good idea’ said the devil “but I have no money.” “Musha” said willie “you a poor devil if that’s any trouble to you I hear you can change yourself into many shapes and surely you can change yourself into a florin\" So the devil changed himself into a florin and Willie put him into his purse and went home. The devil cried and shouted and said he would give thousands of pound and a whole life time to Willie if he would let him go. But Willie was not satisfied with that. He took the purse to the forge and placed it on the anvil and began to sledge it for all he was worth. The devil began to roar and said hilt or hair of him would never be seen in the world again if Willie would let him go. So Willie let him go and he never troubled him after. Willie lived to be very old and when he died he went up to heaven to get in. But St Peter met him at the gate and said he could not come there as he sold himself to the devil when on earth and to go to him now. So Willie had to go down to hell but when the devil saw him coming he was in a terrible state and he had all the devils working for all they were worth shutting the gates, locking them and building up fires against them. When Willie arrived at the gates the devil shouted that he would not let him in, that he would play some trick on them and told him to go back and St Peter again refused him. Then Willie tried to force his way in and St Peter threw a lighted candle at willie. TH candle struck Willie and knocked him down on the earth through the sky. When Willie was falling he caught the lighted candle and ever since at night he is flying around with his lighted candle and in the day time he blows the dust+ straws and thraunins up in the air and is called Willie the Wisp.\n(continues on next page)\n", "school_info": "School: Drumloughan (Dromlachan)", "metadata": [{"Location:": "Sunnagh More, Co. Leitrim", "Teacher:": "\nPeadar Mac Giolla Choinnigh\n"}, {"Collector": "P. Mac Giolla Choinnigh", "Gender": "male"}, {"Informant": "Biddy Gilchriest", "Gender": "female", "Age": "72", "Occupation": "farmer's wife", "Address": "Annaghmaconway, Co. Leitrim"}, {"Language": "English"}]}, "4658439/4655771/4659864": {"title": "A Story - Will-o-the-Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0223, Page 001", "Page 001"], "url": "https://www.duchas.ie/en/cbes/4658439/4655771/4659864", "text": "\nLong ago there lived a blacksmith who used to work in his forge. A man came to him. It was the devil. He said to the man whose name was Will Cooper \"Will, it is in my power that you may make two wishes which I will give you seven days to think over\" and then he went away. When the seven days were up the man came back again and said to Will \"Have you the two wishes made up and what are they\". Will said \"I have and the first is :- any man who takes my sledge in his hand can not leave it down until I take it from him. The second is any person who sits down on my chair can not get up until I take him up\". The man said to him \"why did you not wish for heaven\" and he went away. At the end of seven years the man came back again.\n(continues on next page)\n", "school_info": "School: Lios an Chairn", "metadata": [{"Location:": "Lissacarn, Co. Leitrim", "Teacher:": "\nLiam Ó Fuaráin\n"}, {"Collector": "Georgie Carrigan", "Gender": "female", "Address": "Kiltyhugh, Co. Leitrim"}, {"Informant": "Mick Fee", "Gender": "male", "Age": "over 80", "Address": "Curraghnawall, Co. Leitrim"}, {"Language": "English"}]}, "4658459/4657770/4668599": {"title": "Version of Will-o'-the-Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0228, Page 118", "Page 118"], "url": "https://www.duchas.ie/en/cbes/4658459/4657770/4668599", "text": "\nWillo the wisp was a soul that knocked at the gates of heaven and would not be let in on account of his bad deeds so was sent to hell, but \"taunted\" the devil so much that the devil hunted him out of hell. Willo the wisp said how can I find my way without a light. The devil lit a wisp and said here this will light you out. Ever since that he goes around with a wisp lighted.\n\n\n\nThe trough that the irons are cooled in contains water and it is said to cure warts and chilblains.A horse shoe is hung on the wall of the house outside and another inside for luck.It is considered lucky to get money in a forge. A person collecting money is glad to get even a penny in a forge thinking it lucky.\n", "school_info": "School: Druim Bréan Lios", "metadata": [{"Location:": "Drumbreanlis, Co. Leitrim", "Teacher:": "\nEibhlín Nic Ghuidhir\n"}, {"Informant": "Frank Doyle", "Gender": "male", "Age": "60", "Address": "Errew, Co. Leitrim"}, {"Language": "English"}]}, "4701699/4693612/4713343": {"title": "Will of the Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0169, Page 064", "Page 064"], "url": "https://www.duchas.ie/en/cbes/4701699/4693612/4713343", "text": "\nWill o' the Wisp(2) There was once a Blacksmith and he was a very bad man.  he never did a good deed for anybody.  he was so bad that no person would go near him to do, give him any work to do.  Then he became very poor.  As he was walking along the road one day suddenly a man appeared before him.  The Blacksmith asked him for some money.  he gave him three bags of gold and twenty years to live but he had to have his soul at the end of that time.  The man was the devil.  The Blacksmith went home and told his wife about his good luck.  So they went and enjoyed themselves.  Before half the twenty years was up they\n(continues on next page)\n", "school_info": "School: Dún Flainn", "metadata": [{"Location:": "Doonflin Upper, Co. Sligo", "Teacher:": "\nSeán Ó Maolagáin\n"}, {"Collector": "Ambrose Beglane", "Gender": "male", "Address": "Laragh, Co. Sligo"}, {"Informant": "Mr. Eamon Foley", "Gender": "male", "Address": "Skreen, Co. Sligo"}, {"Language": "English"}]}, "4723876/4721360/4761443": {"title": "Willie the Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0961, Page 113", "Page 113"], "url": "https://www.duchas.ie/en/cbes/4723876/4721360/4761443", "text": "\nThere is a road leading from Monaghan to Armagh known now as the old Armagh road which runs through a townland called Killgneill. Some years ago when motor-cars were not so plentiful as they are now, Medical men, Clergy men used all go on horse-back. People used see a light in a bog every night and they could not find out what it was. One night a Priest got a sick call and he went on a horse. As he began the journey he saw the same light, but when he went down the road he saw another light. At last he got as far as the first light and he looked into the field and he saw a man with a light and he was feeding cattle. The priest asked him to show him the house with the dying person in it. The man said he would so they went on and they came nearer and nearer to it. The\n(continues on next page)\n", "school_info": "School: Baile i Meadhon Locha", "metadata": [{"Location:": "Bellanaman, Co. Monaghan", "Teacher:": "\nC. Nic Gabhann\n"}, {"Informant": "Guard Cauley", "Gender": "male", "Occupation": "garda"}, {"Language": "English"}]}, "4723877/4721424/4780226": {"title": "The Story of Willy the Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0961, Page 177", "Page 177"], "url": "https://www.duchas.ie/en/cbes/4723877/4721424/4780226", "text": "\nThe Story of Willy the Wisp.One time there was a man who sold himself to the devil. The devil gave him three wishes. The man wished that when anyone would take a hammer of his in their hands that they could not leave it down without his leave and 2nd that nobody could rise off the chair without his leave. 3rd If he put money in a purse that nobody could take it out without his leave. After this he became a blacksmith and one day the devil came for him when he was mending a grubber. The blacksmith told him to take a hammer and hit the grubber four or five shots. The devil took the hammer and when he was leaving it down he could not do so. The blacksmith said if you give me another six months I will take the hammer out of your hands. The devil said he would. In six months he came back. He had a big iron chair in the corner and the devil said he\n(continues on next page)\n", "school_info": "School: Cluain Cátha", "metadata": [{"Location:": "Cloncaw, Co. Monaghan", "Teacher:": "\nP. Ó Hanluain\n"}, {"Informant": "Patrick O' Brien", "Relation": "unknown", "Gender": "male", "Address": "Emy, Co. Monaghan"}, {"Language": "English"}]}, "4742166/4741468/4784222": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0774, Page 365", "Page 365"], "url": "https://www.duchas.ie/en/cbes/4742166/4741468/4784222", "text": "\nLong ago an old woman went around with besoms. She gave them to the farmers wives for bread and milk. She was called \"Biddy the Besom\". A beggarman went around here long ago and he was called \"Jack the Ripper\". Another old man was called \"Jack the Skinner\". Jack Kelly was his real name butyhe went around looking for old goats. He used to skin them and he sold the skin afterwards. Jack the Skinner is still alive.\n\n\n\nPeople have a lot of stories about Will O the Wisp. Here is one of them. Once upon a time there was a\n(continues on next page)\n", "school_info": "School: Allenwood", "metadata": [{"Location:": "Allenwood, Co. Kildare", "Teacher:": "\nSeán Ó Clúmháin\n"}, {"Language": "English"}]}, "4723833/4717269/4785005": {"title": "Willie the Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0938, Page 265a", "Page 265a"], "url": "https://www.duchas.ie/en/cbes/4723833/4717269/4785005", "text": "\n1. Name of person from whom story was got Bernard Hand2. His address, Ballybay Co Monaghan3 Age 28 years4 Occupation Spirit Merchant and Grocer5 Where reared and where spent his life, is Monaghan6 Name of person from whom he heard story. James Hand7 How many years ago, 5 years ago8 Age of other person at that time, 50 years9 Place other person living, Shercock10 Date story written in this book, 22nd Sept 1939\n(continues on next page)\n", "school_info": "School: Ballybay (C.)", "metadata": [{"Location:": "Ballybay, Co. Monaghan", "Teacher:": "\nMiss Hargaden\n"}, {"Informant": "Bernard Hand", "Gender": "male", "Age": "28", "Occupation": "grocer", "Address": "Ballybay, Co. Monaghan"}, {"Language": "English"}]}, "4713223/4709084/4814291": {"title": "Bill Cotter and his Son", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0449, Page 118", "Page 118"], "url": "https://www.duchas.ie/en/cbes/4713223/4709084/4814291", "text": "\nWill o The WispMany many years ago there lived an old blacksmith named Will. His father was very industrious and left him lots of money. It did not last long however because Will was a spend thrift. He was then very poor and hungry, and his friends shunned him. One day a gentleman called at the forge and Will told him his story. “If I give you plenty of money now for seven years will you come with me at the end of that time. Will said “Of course yes,” and the bargain was made.The gentleman went away, Will was no longer a poor man, and all his friends\n(continues on next page)\n", "school_info": "School: Cill Mhuire (C.), Oileán Ciarraí", "metadata": [{"Location:": "Kilmurry, Co. Kerry", "Teacher:": "\nMáiréad Pléimeann\n"}, {"Informant": "John O Leary", "Gender": "male", "Age": "81", "Occupation": "labourer", "Address": "Glanawaddra, Co. Kerry"}, {"Language": "English"}]}, "4798710/4792367/4927242": {"title": "A Tale of a Cruel Landlord", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0255, Page 070", "Page 070"], "url": "https://www.duchas.ie/en/cbes/4798710/4792367/4927242", "text": "\n(continued from previous page)\n[-]\n\n\n\nWillie, a blacksmith by trade spent all his time drinking and gambling and so he was always at a great short for money. This night he was talking to himself going along the road when lo!  the devil walked up to him and said\" Willie, what's wrong with you ?\" There's a whole lot wrong with me\" said Willie. I'm at a great short for money\" \" Well,\" says the Devil, \" if you agree to come with me at the end of seven years I'll give you now as much money as ever you can spend during the seven years Willie agreed and took the money and had a fine time drinking and gambling with all his comrade boys. When it came within a few days of the last of the seven years he began to get troubled and to think to himself and he used to walk out along the roads trying to console\n(continues on next page)\n", "school_info": "School: An Carraigín", "metadata": [{"Location:": "Carrigeen, Co. Roscommon", "Teacher:": "\nBean Mhic Oireachtaigh\n"}, {"Collector": "Sínéad P. Nígh Oireachtaigh", "Gender": "female"}, {"Language": "English"}]}, "4769976/4763678/4929070": {"title": "Willie the Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0781, Page 229", "Page 229"], "url": "https://www.duchas.ie/en/cbes/4769976/4763678/4929070", "text": "\nMr. Harry King of Ballybarna (Athy) was put astray one night. He was out counting the sheep. Willie the Wisp put him astray. Willie the Wisp is a big light. Harry King was going round the field looking for the gate. He could not find the gate until daybreak. When he thought he was at the gate he was at the ditch. He would not go into the field at night after that. My mammy told me this,\n", "school_info": "School: Skerries, Athy", "metadata": [{"Location:": "Skerries North, Co. Kildare", "Teacher:": "\nE. Tansey\n"}, {"Collector": "Frances Redmond", "Gender": "female", "Address": "Ardnagross, Co. Kildare"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "female", "Address": "Ardnagross, Co. Kildare"}, {"Language": "English"}]}, "4921947/4912421/4934501": {"title": "An Old Story - How Will-o'-the-Wisp Originated - A Limerick Version", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0484, Page 025", "Page 025"], "url": "https://www.duchas.ie/en/cbes/4921947/4912421/4934501", "text": "\nAN OLD STORYHow Will-o'-The-Wisp OriginatedA Limerick VersionThere was a man one time of the name of Will Cooper and he was very poor but was always a good living man. A good fairy was passing the way one day and gave Will three gifts, one was that whoever took up the sledge could not leave it down till Will would like to let him. Another was that anyone who sat in Will's arm-chair couldn't get up without Will telling him and a third was that anything going into his purse couldnot come out without Will giving leave. In spite of all the gifts Will got poorer and poorer and one morning he was standing in the forge door and he said \"I'd do anything for money\" On the minute a small man popped round the corner. \"Good morrow, Will,\" says he. \"Good morrow, your honour\" says Will\n(continues on next page)\n", "school_info": "School: Cill Cholmáin, Shanagolden", "metadata": [{"Location:": "Kilcolman, Co. Limerick", "Teacher:": "\nBean Uí Chriobáin\n"}, {"Informant": "Mrs Sheahan", "Gender": "female", "Age": "74", "Occupation": "labourer", "Address": "Dunmoylan, Co. Limerick"}, {"Language": "English"}]}, "4922043/4846871/4952310": {"title": "The Jewel of Ireland", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0510, Page 043", "Page 043"], "url": "https://www.duchas.ie/en/cbes/4922043/4846871/4952310", "text": "\n(continued from previous page)\nof Ireland,And allow three times three,Knocklong here's to thee,Knocklong the jewel of Ireland.\n\n\n\nLong ago there lived a man named Will Hooper. He was very poor, but a good working man. One day a little man popped up to the forge door and said you are in a bad way Will. Begorra an sure I am says Will, well says the little man I will give you three gifts if you will come with me at the end of seven years. Agreed says Will. The little man then said to Will  the first gift I will give you is that anyone who took up Will's sledge could not let it\n(continues on next page)\n", "school_info": "School: Cnoc Luinge (C.)", "metadata": [{"Location:": "Knocklong, Co. Limerick", "Teacher:": "\nSiobhán Ní Néill\n"}, {"Collector": "Teresa Curtis", "Gender": "female"}, {"Informant": "Mrs Twomey", "Gender": "female", "Address": "Knocklong, Co. Limerick"}, {"Language": "English"}]}, "4758546/4753618/5016059": {"title": "Will-O'-The-Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0857, Page 415", "Page 415"], "url": "https://www.duchas.ie/en/cbes/4758546/4753618/5016059", "text": "\nIn olden times people were lead astray when they met \"Will o' the Wisp\".  (\"Willie the wisp\" is written in Michael Coady's home excerise).  It is said that if you turned your coat inside out he would have no power over you.  One night a man was led astray by \"Will o' the Wisp\" and he could not find his way home.He saw a light in the distance and walked towards it.  At lenght he reached a house.  He knocked at the door, and a big ugly woman opened it.  He went in, but she never spoke.  He left the house and went on trying to find his own home.At last he found himself an a very queer, strange place.  He could\n(continues on next page)\n", "school_info": "School: Graiguenamanagh (B.)", "metadata": [{"Location:": "Graiguenamanagh, Co. Kilkenny", "Teacher:": "\nMicheál Ó Cuanáin\n"}, {"Collector": "Michael Coady", "Gender": "male", "Address": "Cottage Row, Co. Kilkenny"}, {"Informant": "Mrs Mary Hayden", "Gender": "female", "Age": "73", "Occupation": "widow", "Address": "Cottage Row, Co. Kilkenny"}, {"Language": "English"}]}, "5008811/4958236/5055951": {"title": "Will-o-the-Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0659, Page 127", "Page 127"], "url": "https://www.duchas.ie/en/cbes/5008811/4958236/5055951", "text": "\nLong ago there lived a blacksmith named Willie Wisdom. One winters morning a fairy boy came into his forge in his bare feet and asked Willie to let him warm himself at the hearth. The blacksmith said \"certainly\" and when the little fairy was leaving he said he would grant Willie any three wishes.Willie had a sledge and he wished that anybody who would take it would not be able to let it go until he would permit them. Secondly he wished that any person that would sit in a chair which he had in his kitchen could not rise till he would tell them. His next wish was that any money he would put in his purse could not be taken out until he himslef would take it. The little stranger merely remarked that pity he did not wish to go to Heaven, but the blacksmith would\n(continues on next page)\n", "school_info": "School: Muchgrange (C.), Greenore", "metadata": [{"Location:": "Muchgrange, Co. Louth", "Teacher:": "\nMrs. A. O' Dwyer\n"}, {"Collector": "Mary Clarke", "Gender": "female", "Address": "Muchgrange, Co. Louth"}, {"Informant": " Clarke", "Relation": "parent", "Gender": "male", "Address": "Muchgrange, Co. Louth"}, {"Language": "English"}]}, "5008832/4959539/5074044": {"title": "Willy the Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0664, Page 167", "Page 167"], "url": "https://www.duchas.ie/en/cbes/5008832/4959539/5074044", "text": "\nWilly the Wisp is a man who puts people astray. He has a light with him at night and when people see it they go astray.He sold himself to the devil for money and at the end of seven years the devil was to come for him. At the end of seven years the devil came and when Willy saw him coming he started to shoe a horse. Willy had three articles, and armchair a hammar and a purse. Whoever would sit in the armchair could not leave it till Willy would let him and whoever would hold the hammer could not let it out till Willy would take it. When the devil came in Willy told him to get the hammer and start shoeing the\n(continues on next page)\n", "school_info": "School: Courtbane", "metadata": [{"Location:": "Courtbane, Co. Louth", "Teacher:": "\nP. Mac Eochagáin\n"}, {"Collector": "Thomas Mc Kenna", "Gender": "male"}, {"Informant": "Bernard Meegan", "Gender": "male", "Address": "Drumboat, Co. Monaghan"}, {"Language": "English"}]}, "4922358/4873919/5075370": {"title": "Story - Jack the Tinker (Origin of Jack of the Lantern or Will o' the Wisp)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0614, Page 037", "Page 037"], "url": "https://www.duchas.ie/en/cbes/4922358/4873919/5075370", "text": "\nSean was a very poor tinker, who lived near Loughrea, and he was told that the tinker trade was great in America.  So one day he started off to walk to Cobh [?] with the budget on his back, and when he was passing the bridge of Portumna he said \"The devil will be with me when I come back here or I will have money.\"  He worked his way across to U.S.A.  He hired with a farmer for a year, and at the end of twelve months, he was only worth one shilling.  He was very much disappointed, and hired for another year.  He had the same story at the end of the second and third years, namely, he had only a shilling saved.  He concluded that if he stayed for twenty one years he would only have twenty one shilling, so he concluded to return home.  So he worked his way back again to Ireland.  He reached Ireland safely\n(continues on next page)\n", "school_info": "School: Boston, Tubber", "metadata": [{"Location:": "Boston, Co. Clare", "Teacher:": "\nThos. Noone\n"}, {"Collector": "Mary Noone", "Gender": "female", "Address": "Rockvale, Co. Clare"}, {"Informant": "Patrick Mullins", "Gender": "male", "Address": "Rockvale, Co. Clare"}, {"Language": "English"}]}, "5070801/5065411/5097924": {"title": "Banshee", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1004, Page 304", "Page 304"], "url": "https://www.duchas.ie/en/cbes/5070801/5065411/5097924", "text": "\n(continued from previous page)\nhouse.\n\n\n\nOnce upon a time there was a man named \"Willie the Wisp\" who sold himself to the devil. There came in an old man and he told him to put a shoe on his ass and he would give him any request he would ask for. He asked for three requests. One of them was that anything which would go into his purse could not leave it with his consent or any one that would sit in his\n(continues on next page)\n", "school_info": "School: Finternagh", "metadata": [{"Location:": "Finternagh, Co. Cavan", "Teacher:": "\nC. Ní Bhuachalla\n"}, {"Language": "English"}]}, "5009141/4990696/5101208": {"title": "Will o' the Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0751, Page 194", "Page 194"], "url": "https://www.duchas.ie/en/cbes/5009141/4990696/5101208", "text": "\nA long time ago there lived a blacksmith named Willie. While working in his forge one day in came a little red man with an axe to be mended. While the blacksmith was repairing the axe, he was asked by the little man how much would it cost, but Willie said he would not charge him anything. For being so kind to him the little red man said he would grant Willie three wishes. First the blacksmith wished that if anyone should take hold of his sledge he would not be able to leave it down, but should keep on working until Willie permitted them to stop. The second wish was that if anyone should sit in the blacksmith's shair he should be obliged to stay there until the blacksmith let him get up. The wish which Willie made last was that no money could be taken of his purse except by Willie himself. The little man then asked Willie why he did not wish to go to Heaven, but he said he would ge tthere east enough. But all the time the devil had been outside. When a few days had passed the devil came to the forge and told Willie he would have to come along with him. So Willie told him to be working with the sledge while he was\n(continues on next page)\n", "school_info": "School: Ballymahon (B.)", "metadata": [{"Location:": "Ballymahon, Co. Longford", "Teacher:": "\nEugene Conway\n"}, {"Collector": "Harry Flood", "Gender": "male"}, {"Language": "English"}]}, "5009147/4991682/5103360": {"title": "Will o' the Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0753, Page 351", "Page 351"], "url": "https://www.duchas.ie/en/cbes/5009147/4991682/5103360", "text": "\nOnce upon a time there lived a blacksmith named Billy Mooney. One day he was in his forge when a little man came in to get an axe pointed. When the point was put one the axe, the little man wanted to give Billy money, but he would not (give) take any. The little man was very thankful to get the job done, so he said when he would not take money he would give him three wishes. Billy wished that (1) Anyone who would take his sledge would not leave it down until he would tell them. (2) Anyone who would sit down in his armchair which was in the forge, would not get up of it until he would (take it out) tell them. (3) Anything he would put in his purse would not come out of it until he would take it out. One day the devil came into the forge to billy, and asked Billy would he come with him, and Billy asked him.\n(continues on next page)\n", "school_info": "School: Carnadough (B.), Newtowncashel", "metadata": [{"Location:": "Cornadowagh, Co. Longford", "Teacher:": "\nP. Eustace\n"}, {"Collector": "Séamus Ó Loingsigh", "Gender": "male", "Address": "Cashel, Co. Longford"}, {"Informant": "Bernard Farrell", "Gender": "male", "Address": "Cloonmee, Co. Longford"}, {"Language": "English"}]}, "5009142/4990880/5103449": {"title": "A Funny Story - Will o' the Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0751, Page 439", "Page 439"], "url": "https://www.duchas.ie/en/cbes/5009142/4990880/5103449", "text": "\nOnce upon a time there was a blacksmith by the name of Willy. One day while he was working in his forge, a little red man came to him with an axe to have it repaired.     When Willy had mended the axe, the little red man asked him what he would like for payment. Willy said he'd take nothing. So the little red man said he would grant him any three wishes he should ask. The first wish was that anyone who should take hold of the blacksmith's sledge should not be able to let it go but should keep on sledging till Willy should release him. The second wish was that the person who should sit in his chair should be obliged to remain there till Willy should release him. The third was that any money put into the blacksmith's purse could not be taken out except\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire, Baile Mathúna", "metadata": [{"Location:": "Ballymahon, Co. Longford", "Teacher:": "\nSr. M. Clement\n"}, {"Collector": "Carmel Conway", "Gender": "female", "Age": "12", "Address": "Ballymahon, Co. Longford"}, {"Language": "English"}]}, "5008982/4973595/5112332": {"title": "Another Old Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0706, Page 416", "Page 416"], "url": "https://www.duchas.ie/en/cbes/5008982/4973595/5112332", "text": "\n(continued from previous page)\nhe ran very quickly back to the house. As soon as he reached the door he exclaimed, \"The devil and St. Peter are dividing the contents of the graveyard between them.\" He would not go home for them that night.\n\n\n\nLong ago, there lived a black-smith named, \"Will Cooper\". He was very poor, so he said he would sell himself to the devil. One day, he was going to town, and he met the devil, so he agreed to sell himself, for a purse of gold. The devil said he would come for him in ten years time.The years went by, and the day before the devil would come, came. A boy came to the forge with a colter of a plough to be mended. Will told him his story. The boy said he could do nothing but when the colter was finished he said, \"Whatever three things you wish for, you will get them.\"Next day, the devil came. Will said he was not ready, so he asked the devil to help him to fix some colters for him. He took up  the sldege, and fixed six. Then he was about to leave it down, but he could'nt stop. Will wished that he could not stop. The devil said\n(continues on next page)\n", "school_info": "School: Maio", "metadata": [{"Location:": "Trohanny, Co. Meath", "Teacher:": "\nMáire Ní Chreaig\n"}, {"Collector": "Peggie Connor", "Gender": "female", "Address": "Corboggy, Co. Meath"}, {"Informant": "Rose Mc Cabe", "Gender": "female", "Address": "Carrigagh, Co. Meath"}, {"Language": "English"}]}, "5009011/4977055/5115651": {"title": "Will O The Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0715, Page 487", "Page 487"], "url": "https://www.duchas.ie/en/cbes/5009011/4977055/5115651", "text": "\nLong ago there lived in Ireland a man known as Billy. He was a blacksmith by trade. His forge was situated on a crossroads. He was working in his forge one day when a black man came in and said to him \"I will give you as much money as you will be able to spend if you will come with me at the end of seven years.\" \"All right,\" said Billy. At that the black man went away. From that on Billy had as much money coming to him as he was able to spend. The years rolled on very quickly and Billy never felt until the seven years were nearly up. One wet day and old man came to Billy's house, Billy brought him in and gave him food and shelter. When the rain was over the old man said to Billy, \"for your kindness to me I will give you three wishes. Billy commenced thinking and said, \"any\n(continues on next page)\n", "school_info": "School: Killallon", "metadata": [{"Location:": "Boherard, Co. Meath", "Teacher:": "\nStiophán Ó Scalaighe\n"}, {"Informant": "Mr J. Fagan", "Gender": "male", "Address": "Geehanstown, Co. Meath"}, {"Language": "English"}]}, "5009123/4988700/5122033": {"title": "Famine Times", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0746, Page 432", "Page 432"], "url": "https://www.duchas.ie/en/cbes/5009123/4988700/5122033", "text": "\n(continued from previous page)\nThe government gave out meal to the people and they wet it the way they could not sell it again. The people ate cakes made from turnips and meal.\n\n\n\nWillie the wisp was WIllie Dawson. He was always in the want of money. He worked in a forge shouing  horses Willie said that he would sell himself to the devil if he got money. One das as he was working very hard a Saint came to him and said\" I hear that you have yourself sold to the devil.\" Then the Saint said to him. I will give you three wishes now take the first one. Willie wished anyone that takes up that sledge that is there they shall not leave it down until I tell them Now take othe second one and Willie\n(continues on next page)\n", "school_info": "School: Lower Warren", "metadata": [{"Location:": "Warren Lower, Co. Westmeath", "Teacher:": "\nLiam Mac Coiligh\n"}, {"Collector": "Dora Mara", "Gender": "female", "Address": "Tullywood, Co. Westmeath"}, {"Informant": "Jimmie Walsh", "Gender": "male", "Address": "Cloonbonny, Co. Westmeath"}, {"Language": "English"}]}, "5009258/5002295/5131489": {"title": "Will o' the Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0881, Page 348", "Page 348"], "url": "https://www.duchas.ie/en/cbes/5009258/5002295/5131489", "text": "\nIn a field near Taghmon Co. Wexford, there is a particular light after seen there. Years ago, there was a man going home very late at night, and as he was crossing the field, a short cut home, the light suddenly appeared at the end of the field. He thought it was shining from his own window, which was not far away from the field.He walked towards it, but he could not get near, and so it kept him going around until dawn broke in the sky, and he fell exhausted, and his people found him the next morning and he was ill for a long time after.\n(continues on next page)\n", "school_info": "School: Clochar N. Muire, Loch gCarman", "metadata": [{"Location:": "Wexford, Co. Wexford", "Teacher:": "\nSr. Breandán\n"}, {"Collector": "Anna Mc Grath", "Gender": "female", "Address": "Wexford, Co. Wexford"}, {"Informant": "Mary Mc Grath", "Gender": "female", "Address": "Wexford, Co. Wexford"}, {"Language": "English"}]}, "5009254/5001879/5132040": {"title": "Will O' the Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0880, Page 390", "Page 390"], "url": "https://www.duchas.ie/en/cbes/5009254/5001879/5132040", "text": "\nI had remained in Wexford town one evening, longer than usual, and set out for home about nine o'clock in the evening, the time being early winter. I had the company of a neighbour on the road, and then had, in order to avoid a long way to my house to cross through many fields. I had not gone very far, when I saw a bright light before me, moving slowly. From the moment I saw it I became nervous, because it seemed to be coming nearer to me, and I thought I could see a shadow of a person holding it. Then it moved away again but never passed out of my sight. I went on, knowing that I was going in the direction of home but it was strange that my own roof was not to be seen, and at last the thought struck me that I was being led astray by the light, as I should have reached home in half the time. I stopped and turned my back on the light, but no matter which way I turned the light was before me. I thought of a plan which I heard my mother and Mrs Dalton talking about. She said \"One day as we were lost in a wood we turned our coats inside out because it was a way for keeping away the fairies, I did this too and on the minute, the lantern disappeared and I found\n(continues on next page)\n", "school_info": "School: Scoil na mBráthar, Loch Garman", "metadata": [{"Location:": "Wexford, Co. Wexford", "Teacher:": "\nAn Br. D. C. Ó hÉilighe\n"}, {"Collector": "Joseph Donohoe", "Gender": "male", "Address": "Ballytramon, Co. Wexford"}, {"Informant": "Mr Jordan", "Gender": "male", "Age": "81", "Address": "Kilmisten, Co. Wexford"}, {"Language": "English"}]}, "5009128/4989490/5136397": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0747, Page 635", "Page 635"], "url": "https://www.duchas.ie/en/cbes/5009128/4989490/5136397", "text": "\nOn one occasion there was a man named \"Willy the Wisp. This man was a blacksmith and he had a wish for everything. One day a gentleman went to Willy and said to him \"If you make three wishes I will give them to you\" Willy agreed to make the wishes and he the gentleman to come back after twelve months and he would make the wishes.The gentleman had two cloven claws and Willy didn't see them until he had the wishes made and then he got sorry.When the twelve months had expired the gentleman went back to Willy to see would he make the wishes. When the gentleman went to Willy the latter was shoeing a horse. When Willy saw he told to take up the sledge and make a horse shoe. The gentleman took up the sledge and started to make the shoe. When he had the shoe made the sledge was stuck to his hands and he stayed beating the shoe and could\n(continues on next page)\n", "school_info": "School: Drumraney", "metadata": [{"Location:": "Drumraney, Co. Westmeath", "Teacher:": "\nMl Mc Garry, Alice Mc Garry\n"}, {"Language": "English"}]}, "5044722/5034498/5137375": {"title": "Willy the Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0916, Page 478", "Page 478"], "url": "https://www.duchas.ie/en/cbes/5044722/5034498/5137375", "text": "\nOne night about midnight there was a man out in a field and he saw a light.  He went over to see what it was but it still remained the same distance away.  He followed the light for a short distance and when he would stop the light would keep going around in a circle.  Anyhow he kept following the light and he fell into a drain and could not get out of it.  A fairy came up riding a horse and he said to the man that if he would stay with the fairies he would pull him out, as he pulled him out and brought\n(continues on next page)\n", "school_info": "School: Baltinglas", "metadata": [{"Location:": "Baltinglass, Co. Wicklow", "Teacher:": "\nR. Barún\n"}, {"Collector": "Seasamh Mac Eochadha", "Gender": "male", "Age": "14", "Address": "Clogh Lower, Co. Wicklow"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "male", "Age": "58", "Address": "Clogh Lower, Co. Wicklow"}, {"Language": "English"}]}, "5044766/5036988/5138389": {"title": "Fairies", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0926, Page 155", "Page 155"], "url": "https://www.duchas.ie/en/cbes/5044766/5036988/5138389", "text": "\n(continued from previous page)\nThere is a little three-cornered field up the Green Road full of briars. It is said that if you dig up the field the fairies will come and do a great deal of damage to your house. This is supposed to have happened to people named Byrne.Several of the above corners of fields are to be seen in the Wicklow district. The local people call them \"Screens\". They are said to contain the bodies of unbaptized infants.\n\n\n\nThere was a fairy named Will o' the Wisp and he was very fond of all. The devil gave him money every day. This day the devil gave him a purse and concealed himself in it. Will o' the Wisp was a forge head. He was drunk one night and he took the purse from his pocket and began to hammer it. The devil cried out \"let me out\". Will died and he went to hell, but, the devil would not let him in. That is the reason he is wondering around the county to-day.\n", "school_info": "School: Wicklow (B.) (2)", "metadata": [{"Location:": "Wicklow, Co. Wicklow", "Teacher:": "\nAn Br. P. Ó Maolchalláin\n"}, {"Language": "English"}]}, "5044617/5026304/5141236": {"title": "Will-O'-The-Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0812, Page 059", "Page 059"], "url": "https://www.duchas.ie/en/cbes/5044617/5026304/5141236", "text": "\nWill O the WispOnce upon a time there was a blacksmith named Willie living in Cloniff near the Shannon and the ruins of his house are still to be seen.He was a very good Catholic and he was very rich, but as time went on he began to get poor and he also began to lose faith in God and he said to himself \"O if only I could get money I would sell myself to the Devil or anyone else\".   Accordingly one day the devil came in and said he would give him a purse which would always contain a half-crown for twenty years, and at the end of this time he would call for him, and he said he would have to go with him then.The man agreed and the devil went away but the twenty years were not long passing and after this\n(continues on next page)\n", "school_info": "School: Clonmacnoise", "metadata": [{"Location:": "Clonmacnoise, Co. Offaly", "Teacher:": "\nP. Ó Maolmhuaidh\n"}, {"Collector": "Angela Flannery", "Gender": "female"}, {"Informant": "Terry Callery", "Gender": "male", "Age": "65", "Address": "Clorhane, Co. Offaly"}, {"Language": "English"}]}, "5044618/5026571/5141763": {"title": "Will-O'-The-Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0812, Page 357", "Page 357"], "url": "https://www.duchas.ie/en/cbes/5044618/5026571/5141763", "text": "\nOnce upon a time there was a blacksmith named Willie living in Clonasera near Shannon and the ruins of his house are still to be seen there. He was a very good Catholic and he was very rich but as time went on he began to get poor and he also began to lose his faith, so he said to himself\" O if only I could get money I would sell myself to the devil or anyone else\".  Accordingly one day the devil came in and said he would give him a purse which would always contain a half crown for twenty years and at the end of this time he would call for him and he said he would have to go with him then. the man agreed and the devil went away, but twenty years were not long passing and after this time the devil came and said he would have to go with him. The man said \"all right\" and they started on their journey. The devil said he was very dry and he had better have a drink\n(continues on next page)\n", "school_info": "School: Clonfinlough, Athlone", "metadata": [{"Location:": "Clonfinlough, Co. Offaly", "Teacher:": "\nE. Ní Mhionacháin\n"}, {"Collector": "Rosie Corrigan", "Gender": "female", "Age": "13", "Address": "Clonfinlough, Co. Offaly"}, {"Informant": "Mick Kelly", "Relation": "grandparent", "Gender": "male", "Age": "85", "Address": "Carrowkeel, Co. Offaly"}, {"Language": "English"}]}, "5044686/5031954/5145778": {"title": "How Will O' the Wisp Originated", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0909, Page 121", "Page 121"], "url": "https://www.duchas.ie/en/cbes/5044686/5031954/5145778", "text": "\n\"There was a man one time of the name of Will Cooper, and he was very poor but was always a very good living man. A good fairy was passing the way one day and gave Will three gifts: one was that whoever took up the sledge couldn't lave it down till Will would like to let him. Another was that anyone sat down in Willie armchair couldn't get up without Will telling him the third was that anything went into his purse couldn’t come out without Will giving lave. In spite of all the gifts Will got poorer and poorer and one morning he was standing in the forge door and he said Id do anything for money. On the minute a little small man popped around the corner. Good morrow Will\" says he.  Good morrow your honour says Will. 'Will ' says he ' I think you are in a bad way.\" Begorra and sure I am 'says Will 'Well Will says he 'if you promise to come with me after seven years I’ll lay you well off for the seven years, Ill give you plenty of money for that time' 'Agreed 'says Will.\n(continues on next page)\n", "school_info": "School: Cluain Mór (1), Baile an Droichid", "metadata": [{"Location:": "Clonmore, Co. Carlow", "Teacher:": "\nSéamus Ó Laochdha\n"}, {"Informant": "Thomas Donnelly", "Gender": "male", "Age": "64", "Occupation": "farmer", "Address": "Knockatomcoyle, Co. Wicklow"}, {"Language": "English"}]}, "5044681/5031572/5147521": {"title": "Will-O'-The-Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0907, Page 488", "Page 488"], "url": "https://www.duchas.ie/en/cbes/5044681/5031572/5147521", "text": "\nAn old woman belonging to this Townsland told a story of Will o' the Wisp.  She said that she saw him every night for a whole week and on Saturday night her husband died suddenly.  She sent a neighbour to inform his brother and that the lights drew him astray and that he did not reach his destination for over three days.  When the brother came the funeral was over and he told the widow that Will o' the Wisp never led his family right.\n", "school_info": "School: Tinryland, Carlow", "metadata": [{"Location:": "Tinriland, Co. Carlow", "Teacher:": "\nPádraig Ó Seidhin\n"}, {"Language": "English"}]}, "5162177/5161147/5162410": {"title": "Ashypelt", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0960, Page 158", "Page 158"], "url": "https://www.duchas.ie/en/cbes/5162177/5161147/5162410", "text": "\n(continued from previous page)\nwater. When she went to lift the water Ashypelt pushed her into the well and she was drowned.  The giant then came to lift water but Ashypelt pushed him in too and he was drowned.She then got her sister from under the box.  They brought their mother to live in the castle and they all lived happily until they died.\n\n\n\nA long time ago there was a man and his name was Bill Cooper. He was a blacksmith and the devil had bought his soul. The devil promised to come for him in seven years. Some time after this a little boy came into the forge and asked to get warming himself. When he was leaving he asked the blacksmith what three whishes did he want. The blacksmith said, First any one who sits in my chair shall not rise until I tell them, second anyone who catches my hammer shall not be able to let it go until I tell them third anyone who goes into my purse shall\n(continues on next page)\n", "school_info": "School: An t-Éadan Mór", "metadata": [{"Location:": "Edenmore, Co. Monaghan", "Teacher:": "\nS. Mac Philib\n"}, {"Collector": "Bridie Mc Kenna", "Gender": "female", "Address": "Tamlat, Co. Monaghan"}, {"Informant": "Miss Mary Mc Kenna", "Gender": "female", "Age": "70", "Address": "Tamlat, Co. Monaghan"}, {"Language": "English"}]}, "5215788/5210780/5220222": {"title": "Scéalta - The Cakeen", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0121B, Page 01_020", "Page 01_020"], "url": "https://www.duchas.ie/en/cbes/5215788/5210780/5220222", "text": "\n(continued from previous page)\nThe fox said nothing, but ate the cakeen up.\n\n\n\nThere was once a blacksmith called Willie. He was a very wise man. He got three wishes. The first wish he had was that any one who would sit on his chair could not leave it until he would tell them to leave it. The next wish was that any one who would\n(continues on next page)\n", "school_info": "School: Sraithíní", "metadata": [{"Location:": "Sraheens, Co. Mayo", "Teacher:": "\nM. Ní Dhuinnshleibhe\n"}, {"Collector": "Josie Walsh", "Gender": "male", "Address": "Carrowkeel, Co. Mayo"}, {"Informant": "Michael Dunleavy", "Gender": "male", "Address": "Carrowkeel, Co. Mayo"}, {"Language": "English"}]}, "5215788/5210890/5220661": {"title": "Willie the Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0121B, Page 07_003", "Page 07_003"], "url": "https://www.duchas.ie/en/cbes/5215788/5210890/5220661", "text": "\nThere was once a blacksmith called Willie. He was a very wise man. He got three wishes. The first wish he had was that any one who would sit on his chair could not leave it until he would tell them to leave it. The next wish was that any one who would take his sledge he would not be able to stop sledging until Willie would tell him, and the third wish was that any money that would go into his purse could not leave it until he would take it out. He was telling his wife the wishes he made, and she said to him \"You foolish fellow why did you not wish for heaven.\"One fine morning he was going with the cows to the field and\n(continues on next page)\n", "school_info": "School: Sraithíní", "metadata": [{"Location:": "Sraheens, Co. Mayo", "Teacher:": "\nM. Ní Dhuinnshleibhe\n"}, {"Collector": "Jodie Walsh", "Gender": "female"}, {"Language": "English"}]}, "5235414/5235041/5235396": {"title": "A Story of Billie the Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1128, Page 154", "Page 154"], "url": "https://www.duchas.ie/en/cbes/5235414/5235041/5235396", "text": "\nOnce upon a time there was a man, a black-smith, he was doing a good trade and began to be poor and a little man came and to him he wanted to warm (himseff) himself and to boil some water.  After caling he said I will give you three wishes. The man was a fairy and the black-smith said I have a sledge I wish that whoever catches it cannot let it go I have a purse I wish that anything I put into it cannot be taken out until I release it.  I have a chair and I wish that anyone who sits down in it cannot get out of it until I release them.  The little man said \"Why did you not wish for heaven when you die.\"The blacksmith got poor and he sold himself to the devil.  He sold himself for two hundred pounds and the devil was to come for him in one year.  He eat and drank until all was spent and the devil came\n(continues on next page)\n", "school_info": "School: Scoil Cianóg Naofa, Tigh Mochua", "metadata": [{"Location:": "Timahoe, Co. Kildare", "Teacher:": "\nname not given\n"}, {"Language": "English"}]}, "5260470/5255832/5261099": {"title": "Will o' the Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0776C, Page 01_020", "Page 01_020"], "url": "https://www.duchas.ie/en/cbes/5260470/5255832/5261099", "text": "\nMy father told me that he saw Willie the Wisp in Mr. Clery's bog.  It was like a red ball of fire going very fast.  If you followed it, it would lead you astray.\n", "school_info": "School: Twomilehouse", "metadata": [{"Location:": "Twomilehouse, Co. Kildare", "Teacher:": "\nTomás Bineidh\n"}, {"Collector": "Tim Byrne", "Gender": "male", "Address": "Corbally, Co. Kildare"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "male"}, {"Language": "English"}]}, "5260470/5255922/5262682": {"title": "Will o' the Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0776C, Page 05_018", "Page 05_018"], "url": "https://www.duchas.ie/en/cbes/5260470/5255922/5262682", "text": "\nMr Murphy had to get milk in Mr Byrnes of Punchestown.  One night he went across the field for it.  Will o' the Wisp appeared to him and he was forced to follow it about the field till dawn. My Father was coming home from Naas one night and Will o' the Wisp appeared to him and brought him back to Naas.\n", "school_info": "School: Twomilehouse", "metadata": [{"Location:": "Twomilehouse, Co. Kildare", "Teacher:": "\nTomás Bineidh\n"}, {"Collector": "Patrick Hartigan", "Gender": "male"}, {"Language": "English"}]}, "5260470/5256047/5262932": {"title": "Will o' the Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0776C, Page 10_027", "Page 10_027"], "url": "https://www.duchas.ie/en/cbes/5260470/5256047/5262932", "text": "\nMy father said he saw a litle light like a candle or a small lamp on the Commons and it went around the big pond three or four times and then it went up in the air and then it went over to Mullacash hill and he said it was Willie the Wisp.\n", "school_info": "School: Twomilehouse", "metadata": [{"Location:": "Twomilehouse, Co. Kildare", "Teacher:": "\nTomás Bineidh\n"}, {"Collector": "Peter Cooley", "Gender": "male", "Address": "Mullacash North, Co. Kildare"}, {"Language": "English"}]}, "5260470/5256180/5263090": {"title": "Will o' the Wisp", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0776C, Page 12_037", "Page 12_037"], "url": "https://www.duchas.ie/en/cbes/5260470/5256180/5263090", "text": "\nMy father told me that when he was about fourteen years of age, he was crossing the limekiln of Harristown and he saw a little red ball of fire rolling along in front of him. He ran after it, but he could not catch it as when he would run it would roll quicker, and quicker, and when he would stop, it would stop.He followed it, all through Clarke's bottoms, across Major Mc Gees land and on to the railway and then it disappeared. He did not\n(continues on next page)\n", "school_info": "School: Twomilehouse", "metadata": [{"Location:": "Twomilehouse, Co. Kildare", "Teacher:": "\nTomás Bineidh\n"}, {"Collector": "James Curran", "Gender": "male", "Address": "Johnstown or Dunshane, Co. Kildare"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "male"}, {"Language": "English"}]}, "5286174/5285713/5286231": {"title": "Sean-Urnaí", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1057, Page 20", "Page 20"], "url": "https://www.duchas.ie/en/cbes/5286174/5285713/5286231", "text": "\n(continued from previous page)\nDílis Dé go rabh tú agam i n-am le h-ola chríosta chur ar m’anam dílis a cheannuigh Íosa ar an chrann. Íosa, Mhuire agus a Iosep go nd’imthigh m’anam in a siocán fríd do lamha beannuighthe. Amen a Íosa.Ceann Eile.Ceithre coirneáil ar mo leabaidh, ceithre h-aingle go rabh annsin. Dia amuigh agus Dia istuigh, Dia agus Críost go rabh fán teach. Ó a Mhaigdeán Mhuire má fheiceann tú a dhat ag teacht orm cuidigh liom.\n\n\n\nLiam a t-Sip.Bhí sean-lanamhain ann i bhfad ó shoin darbh ainm Liam a’s Máire. Bhí siad iongantach bocht agus ní rabh beo ar bith acú acht ceardcha beag a bhí acú agus bhí Liam na gabha, ach ní rabh sé [faghail]? morán le déanamh ann Lá amháin tháinig fear isteach, culaith [dubh]? agus hata air. Bhí Liam ag cur cruidhteach ar chapall. Thionntuigh sé thart agus dubhairt sé, “Cé seo agam ann”, “Tá an diabhal” arsa fear a hata, Agus tháinig mé a thabhairt cuididh duit má [theidhean]? tú liom-sa i gcionn seacht mbliadhna, agus bheirfidh mé saidhbreas an domhain duit ar feadh na seacht mbliadhna sin”. Druideadh an margadh agus dimthigh an diabhail. Ní rabh an diabhal i bhfad ar shiubhal nuair a nocht aingeal chuige. D’fiafruigh an t-aingeal do cá tuighe a dtug sé é fhéin suas dó’n diabhal. “Tá,” arsa seisean, “Mar bhí mé an bhocht agus shanntuigh mé an saidhbris. “Bhal”, ar seisean, “Ní thig liom a dhath a dheanamh duit\n(continues on next page)\n", "school_info": "School: Árd Cróna", "metadata": [{"Location:": "Annagary, Co. Donegal", "Teacher:": "\nÉamonn Mac Suibhne\n"}, {"Collector": "Máire Ruiseail", "Gender": "female"}, {"Informant": "Caitlín Bean Mhic Aodha", "Gender": "female", "Age": "60", "Address": "Crockacreaghan, Co. Donegal"}, {"Language": "Irish"}]}}