{"4427889/4354750/4449605": {"title": "Pisreoga a Bhaineas le Bainis", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0108, Page 165", "Page 165"], "url": "https://www.duchas.ie/en/cbes/4427889/4354750/4449605", "text": "\n(continued from previous page)\na hathar, agus bíonn ‘spraoi’ mhór ann de ghnáth.6. Is ceart an tlú agus seanbhróg a chaitheamh i ndiaidh cailín ar dul chun a pósta di, le rath agus séan a chur uirthi.7. Ní ceart do chailín gléas a pósta a thaispeáint d’éinne go dtí lá an phósta.8. Nuair a bhíonn an iníon is sine á pósadh is ceart don mháthair braitlíní nó éadaí cláir nó plaincéid a rinneadh sa mbaile a thabhairt mar bhronntanas di.9. Lastar punnán coirce ag déanamh áthais nuair a bhíonn lánúin nua-phósta ag filleadh abhaile ón séipéal.10. Má tharlaíonn go mbristear cuid ar bith de ghléas an chapaill nuair a bhíonn na carranna ag filleadh abhaile ón séipéal tar éis an phósta deirtear gur mí-ámharach an rud é.\n\n\n\n1. Is ceart cuid de shalann an bhaiste a fháil sa séipéal agus cuid de a thabhairt abhaile.2. Is cóir trí bhraon ola castair a thabhairt do leanbh sula ligtear amach as an teach é lá a bhaiste.3. Ní ceart ingne linbh a ghearradh go mbíonn an leanbh bliain d’aois. Má ghearrtar roimh an am\n(continues on next page)\n", "school_info": "School: Rusgaigh (2)", "metadata": [{"Location:": "Roosky, Co. Mayo", "Teacher:": "\nEibhlín Ní Chorraidhe\n"}, {"Collector": "Eibhlín Ní Chorraidhe", "Gender": "female", "Occupation": "múinteoir"}, {"Language": "Irish"}]}, "4427931/4358492/4457849": {"title": "Birth-Lore", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0117, Page 179", "Page 179"], "url": "https://www.duchas.ie/en/cbes/4427931/4358492/4457849", "text": "\nBirth - LoreSunday - lucky day.Monday's Child is fair of face.Tuesday's Child is full of grace.Wednesday's Child is loving and forgivingThursday's Child has to work for his livingFriday's Child is full of woe.Saturday's Child has far to go.The child born on the Sabbath day is bonny, blithe, and gay.It is supposed to be unlucky to leave a baby's clothes out on the line at nightThe day of the christening they should be back from the Church before night fall.\n(continues on next page)\n", "school_info": "School: Páirc Íseal (C.)", "metadata": [{"Location:": "Lowpark, Co. Mayo", "Teacher:": "\nSorcha Ní Dhumhnaigh\n"}, {"Language": "English"}]}, "4427955/4361150/4465015": {"title": "Christenings", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0123, Page 50", "Page 50"], "url": "https://www.duchas.ie/en/cbes/4427955/4361150/4465015", "text": "\nThere are many old saying about christenings. before the baby leaves the house to be christened somebody in the house ties a piece of a burned out coal to the ends of the christening dress.besides the woman and the man that are standing for the baby they always have another woman to carry it in and out because they say  it is not right for the woman that stands for it to carry it. It is said that if a baby dosent cry when the holy water is been poured on its head that it will die before it reaches twenty-one years. They say that it is not right to buy the christening dress for the first baby but to borrow one. They also say that those  who stand for baby should'nt get married for one year. A cradle is usually borrowed for the first baby and they wont give it back till the baby is a year old.\n", "school_info": "School: Coill Mhór", "metadata": [{"Location:": "Cuilmore, Co. Mayo", "Teacher:": "\nLiam Ua Claidhimh\n"}, {"Informant": "Mr Mick Devaney", "Relation": "unknown", "Gender": "male", "Age": "99", "Address": "Cloonlara, Co. Mayo"}, {"Language": "English"}]}, "4428050/4372270/4468900": {"title": "Local Birth Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0146, Page 235", "Page 235"], "url": "https://www.duchas.ie/en/cbes/4428050/4372270/4468900", "text": "\nWhen a child is christened it is left dressed in it's christening robes until it sleeps for a while and a rosary beads and a prayer book is placed in it's hand to make it fond of it's religion.In olden times when a woman had to leave the child alone for a while a tongs was placed across the child in the  cradle to prevent the fairies from taking the child and if they had to take the child out late at night they put a quenched coal in the child's dress also to prevent the fairies from taking the child.  When the seventh son of a family, without any girls in between, is born a worm is placed on the palm of the child's hand and this child from that on can cure a disease called ring-worm.  If a boy is born after his father dies he can\n(continues on next page)\n", "school_info": "School: Clochar na Trócaire, Béal Átha 'n Fheadha", "metadata": [{"Location:": "Ballina, Co. Mayo", "Teacher:": "\nJohn McGee\n"}, {"Informant": "Michael Ferguson", "Gender": "male", "Age": "60", "Occupation": "tailor", "Address": "Ardnaree or Shanaghy, Co. Mayo"}, {"Language": "English"}]}, "4428300/4392754/4476648": {"title": "Christenings", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1038, Page 302", "Page 302"], "url": "https://www.duchas.ie/en/cbes/4428300/4392754/4476648", "text": "\nFormerly christenings were much noisier affair  than they are at present. Four sponsors usually relatives of the child, accompanied the child to the church. The ceremony usually took place in the evening and then the sponsors and many friends and neighbours gathered to the christening. A generous dinner was served for the assembled party and whisky was liberally dispensed – very often poteen. The singing and story telling then began and often lasted through the night. Sometimes the participants quarreled and the surroundings were anything but conducive to the good health of mother and child. The name given to the child was usually that of a near relative and in some families the same name recurs again and again. Some names now looked on as old fashioned are still found in families of certain surnames e.g Tadgh, Turlogh are still to be found prefixed to Ó Gallochobhair\n(continues on next page)\n", "school_info": "School: Dún Ceann Fhaolaidh", "metadata": [{"Location:": "Dunkineely, Co. Donegal", "Teacher:": "\nSeaghan Mac Cuinneagáin\n"}, {"Language": "English"}]}, "4428263/4389561/4477742": {"title": "Pisreogas - Births", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1030, Page 212", "Page 212"], "url": "https://www.duchas.ie/en/cbes/4428263/4389561/4477742", "text": "\n1. If you are born in day time you will see no ghosts.2. Born on Monday fair of faceBorn on Tuesday full of grace.Born on Wednesday full of woeBorn on Thursday far to go.Born on Friday loving and givingBorn on Saturday work hard for your living.But the child that is born on the Sabbath Dayis bonney and wise and gay.3. If a woman in child meets a man with a hare with the tail on it, the child will have a hare’s lip.\t4. It is supposed to be unlucky for a woman in child to cross a grave-yard, it will have club-feet.5. If a woman in child is struck with anything that child will have the track of that thing on it.6. If a woman in child mocks a person on any deformity, the child will be afflicted with the same deformity.7. If a woman in child gets a fright the child will be afflicted.8. It is lucky to borrow a cradle for the first child.9. The mother should not attend a christening.\n", "school_info": "School: Lettercran", "metadata": [{"Location:": "Lettercran, Co. Donegal", "Teacher:": "\nPeadar S. Ó Duibhidhe\n"}, {"Language": "English"}]}, "4428296/4392332/4480560": {"title": "Old Time Customs - A Christening", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1037, Page 223", "Page 223"], "url": "https://www.duchas.ie/en/cbes/4428296/4392332/4480560", "text": "\nIt was the custom in the olden times, when all the neighbours from around a district were invited to a christening, to bring something to help out with the feast. One day Fionn Mac Cool and his wife were invited to a christening. The day of the christening Fionn's wife fell ill and was unable to go. She made a measgán of butter to send with Fionn. When Fionn was getting ready to go to the christening he never thought about the butter and went away without it. His wife was a very strong woman and so she lifted the butter up and flung it so far that it landed at Fionn's feet and then turned into a stone. When Fionn was returning home from the christening he saw the stone and taking it up in his hand he threw\n(continues on next page)\n", "school_info": "School: Leitir Mhór", "metadata": [{"Location:": "Lettermore, Co. Donegal", "Teacher:": "\nEilís Ní Bhaoghaill\n"}, {"Collector": "Mary Mc Loone", "Gender": "female", "Address": "Lettermore, Co. Donegal"}, {"Informant": "John Mc Loone", "Relation": "grandparent", "Gender": "male", "Age": "77", "Address": "Lettermore, Co. Donegal"}, {"Language": "English"}]}, "4497908/4344719/4507473": {"title": "Pisreoga - Births and Their Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0087, Page 120", "Page 120"], "url": "https://www.duchas.ie/en/cbes/4497908/4344719/4507473", "text": "\nNew born babies were carefully watched prior to Baptism as a superstition prevailed that they could and would, be stolen by the fairies1. Shortly before giving birth to a child, a woman was supposed to wear something belonging to her husband. 2. It was also believed that a woman could transfer the pains of childbirth to another person (either male or female) by giving them something to eat and drink prior to the time of childbirth.3. An upbaptized child and its mother should never be left\n(continues on next page)\n", "school_info": "School: Sraith Mór", "metadata": [{"Location:": "Srahmore, Co. Mayo", "Teacher:": "\nBríd Bean Mhic Ultaigh\n"}, {"Collector": "Brighid Bean Mhic Ultaigh", "Gender": "female", "Occupation": "múinteoir", "Address": "Newport, Co. Mayo"}, {"Language": "English"}]}, "4497908/4344725/4507487": {"title": "Pisreoga - Births", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0087, Page 126", "Page 126"], "url": "https://www.duchas.ie/en/cbes/4497908/4344725/4507487", "text": "\n1. If a person is asked to be sponsor for a child, it is not right to refuse. It is said the child will die if this is done.2. If a child dies, no other child of that family should be called by the same name as the dead child. If it is done it is believed the child will die. 3. If a child dies, no other child of that family should wear the dead child's clothes. If they do, they will take the illness the first child died with and die also from the same disease.\n", "school_info": "School: Sraith Mór", "metadata": [{"Location:": "Srahmore, Co. Mayo", "Teacher:": "\nBríd Bean Mhic Ultaigh\n"}, {"Collector": "Brighid Bean Mhic Ultaigh", "Gender": "female", "Occupation": "múinteoir", "Address": "Newport, Co. Mayo"}, {"Language": "English"}]}, "4493789/4420576/4536909": {"title": "Folklore", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1119, Page 171", "Page 171"], "url": "https://www.duchas.ie/en/cbes/4493789/4420576/4536909", "text": "\n(continued from previous page)\nbefore the boy. She was cured of her rheumatism from that day.Moira O'Donnell.Carrick HseMoville.This story was told by:-Mrs. McGonagle.CooleyMoville\n\n\n\nChristenings in Moville long ago were not like the Christenings we have now.Long ago after the baby was christened a party was given in the house of its parents.  At this party the people used to sing Irish songs and dance Irish dances. If there was any person in the village who could tell what the future would bring to the baby that person was invited to the party to tell the baby's fortune.This was the way the day of a christening was celebrated long ago.\n(continues on next page)\n", "school_info": "School: Convent of Mercy, Moville", "metadata": [{"Location:": "Moville, Co. Donegal", "Teacher:": "\nSr. Celestine Clarke\n"}, {"Collector": "Moira O' Donnell", "Gender": "female", "Address": "Moville, Co. Donegal"}, {"Informant": "Mrs G Orr", "Gender": "female", "Address": "Moville, Co. Donegal"}, {"Language": "English"}]}, "4493804/4422498/4539630": {"title": "The Sacrament of Baptism", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1123, Page 252", "Page 252"], "url": "https://www.duchas.ie/en/cbes/4493804/4422498/4539630", "text": "\nOnce upon a time there was a priest in this parish called Fr. McDevitt.  One night he got a \"message\" to go and attend a dying woman who was the mother of three children.  Her three children died at an early age but one of them unfortunatly had not received the sacrament of Baptism. On his way home after having administered the last sacrament to the dying woman, he saw coming towards him two little lights.  And as they drew near he saw three children going in the direction of the house he had\n(continues on next page)\n", "school_info": "School: St Boden's, Culdaff", "metadata": [{"Location:": "Culdaff, Co. Donegal", "Teacher:": "\nDoiminic Ó Duibhne\n"}, {"Collector": "Neil Mc Gee", "Gender": "male"}, {"Informant": "John Kearney", "Gender": "male", "Age": "80", "Address": "Culdaff, Co. Donegal"}, {"Language": "English"}]}, "4583338/4580847/4588110": {"title": "Baptisms, Local Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0057, Page 0014", "Page 0014"], "url": "https://www.duchas.ie/en/cbes/4583338/4580847/4588110", "text": "\nBaptism local culturea. Unlucky for expectant mother to make or buy clothes for first child before birth, this is done by friend generally (errors) mother or near friend of expectant mother - this applies for first born.b. If a child should die, no other child born afterwards to be called same name as dead childC. Three bearnig(sp?), the same xtian name (direct descent) not lucky, i.e. grand.father, son, grand.child in same housed. A person cannot be sponsor for two children in the same year, one of the children supposed to diee. A married women (pregnant) not to be sponsor, if it should happen misfortune is supposed to follow woman + child yet unborn.f. A child that does not cry at baptism supposed to get an early death.g. Not lucky to refuse to be sponsor at Baptism (not lucky for child).\n", "school_info": "School: Gort an Iomaire", "metadata": [{"Location:": "Gortanummera, Co. Galway", "Teacher:": "\nLiam Sabhaois\n"}, {"Collector": "W. F. Savage", "Gender": "male", "Occupation": "teacher"}, {"Informant": "Uí Meoran", "Gender": "female", "Age": "84", "Address": "Creggeen, Co. Galway"}, {"Language": "English"}]}, "4613725/4613110/4643374": {"title": "Marriages", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0409, Page 062", "Page 062"], "url": "https://www.duchas.ie/en/cbes/4613725/4613110/4643374", "text": "\n(continued from previous page)\nhouses.\n\n\n\nThe clothes the new born babies wore when taken to the chapel for Baptism were flannel petticoats, and cotton christening robes.\n", "school_info": "School: Dromclough (C.),", "metadata": [{"Location:": "Kilcarra Beg, Co. Kerry", "Teacher:": "\n-\n"}, {"Collector": "Bridie Flaherty", "Gender": "female"}, {"Language": "English"}]}, "4613719/4612389/4643758": {"title": "Sayings Concerning Marriage", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0407, Page 045", "Page 045"], "url": "https://www.duchas.ie/en/cbes/4613719/4612389/4643758", "text": "\nSomething old, something newSomething borrowed, something blue.Married in Red - You'll soon be dead.Married in Grey - You'll rue the day.Married in Green - Ashamed to be seen.Married in Blue - Your love proves true.\n\n\n\nMonday's Child is fair of face,Tuesday's Child is full of Grace,Wednesday's Child is loving and Giving,Thursday's Child must work hard for his living,Friday's Child is full of woe,Saturday's Child has a Journey to Go.\n", "school_info": "School: Cluain Meacan", "metadata": [{"Location:": "Cloonmackon, Co. Kerry", "Teacher:": "\nLiam Ó Catháin\n"}, {"Language": "English"}]}, "4666608/4666310/4666824": {"title": "Birth and Childhood", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0415, Page 005", "Page 005"], "url": "https://www.duchas.ie/en/cbes/4666608/4666310/4666824", "text": "\nI. It is not lucky to send a child to school on a Monday for the first time.II. You should never leave a child’s cradle outside a table.III. You should never shov (sp?)a child a looking glass, because he sees himself in his own hands.IV. A child that’s born on Good Friday, won’t live long.V. It isn’t right to take a child out when it is asleep.VI. If you go into a house with a child asleep in your arms, you should wait until the child wakes before you bring it out.VII. You should not let a child look into a looking glass, when he’s under one year old.VIII. You should never cut a child’s nails while he’s under one year, for fear he’d grow up a thief.IX. You should never let a child sleep in a headland.X. Dream of a birth and you’ll hear of a death.XI. It isn’t right for the father and mother to buy a cradle for the first baby. It should be made a present of.XII. It isnt right to buy a cradle before the first baby is born.XIII. A mother should never attend the funeral of the first child that dies.XIV. it isn’t right to give a cradle away when your family is reared.XV. You should never have two cradles in the one house.XVI. You should never rock an empty cradle, because it’s the devil you’d be rocking.XVII. You should never leave a child inside alone, or if you do you should put the tongs across the cradle.XVIII. You should always put something in a child’s hand, when you see him for the first time.\n(continues on next page)\n", "school_info": "School: Cashen, Baile Dubh, Tráighlí", "metadata": [{"Location:": "Ballyduff, Co. Kerry", "Teacher:": "\nMáire de Paor, Dd. Allman\n"}, {"Language": "English"}]}, "4701704/4694202/4742691": {"title": "Pisreoga - Births", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0170, Page 0217", "Page 0217"], "url": "https://www.duchas.ie/en/cbes/4701704/4694202/4742691", "text": "\nPisreógaBirths Sunday - lucky dayMonday's child is fair of face,Tuesday's child is full of grace, Wednesday's child is loving and forgiving, Thusday's child has to work for his living,Friday's child is full of woe,Saturday's child has far to go,The child born on the Sabbath day is bonny, blithe and gay. It is supposed to be unlucky to leave a baby's clothes on the line at night. The day of christening they should be back from the church before night-fall. It is supposed to be lucky two sponsors of the same name to stand for the child. It is not right to stand\n(continues on next page)\n", "school_info": "School: Cluaineach (C.)", "metadata": [{"Location:": "Coolrawer, Co. Sligo", "Teacher:": "\nBean Uí Chlaimhín\n"}, {"Collector": "Mamie Brennan", "Gender": "female", "Address": "Cloonagh, Co. Sligo"}, {"Informant": "Mrs M. Brennan", "Gender": "female", "Age": "80", "Address": "Cloonagh, Co. Sligo"}, {"Language": "English"}]}, "4742156/4740706/4782923": {"title": "Superstitions about Birthdays", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0772, Page 089", "Page 089"], "url": "https://www.duchas.ie/en/cbes/4742156/4740706/4782923", "text": "\nSuperstitions about birthdaysMonday for wealth.Tuesday for wealth.Wednesday the best day of all.Thursday for crosses.Friday for losses.And Saturday no good at all.Or.Monday's child is fair of face.Tuesday's child is full of grace.Wednesday's child is merry and glad.Thursday's child is sorry and sad.Friday's child is loving and giving.Saturday's child must work for its living.But the child that is born  on thee Sabbath day.Is bonny and bright and happy always.\n(continues on next page)\n", "school_info": "School: St. Brigid's Convent, Kildraught", "metadata": [{"Location:": "Celbridge, Co. Kildare", "Teacher:": "\nSr. Donatus\n"}, {"Collector": "Rosie Mulligan", "Gender": "female", "Address": "Celbridge, Co. Kildare"}, {"Language": "English"}]}, "4769972/4763453/4785481": {"title": "Birth Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0780, Page 326", "Page 326"], "url": "https://www.duchas.ie/en/cbes/4769972/4763453/4785481", "text": "\nPeople believe it is unlucky to get a new cradle, and the grand-father usually buys that. If a child is born with a caul it is considered very lucky. If a baby has been christened and then dies, the name is not usually given to a succeeding child. Clothes worn by a baby who dies, or in fact anything belonging to it are usually given away. When a baby dies it is usual to wake it in its christening robe. Nan O'Neill got above information. The first son should be called after its father's father and the first daughter after her mother's mother. Baby boys should be dressed in blue and little girls in pink. The seventh child is usually lucky and the seventh child is a priest or a doctor. Kitty BagnellTwo spoons in your tea-cup is a sign of a christening. Whoever finds out the child's first tooth gets a silver piece. Baby's nails should not be cut until its a year old. If the little knots that come on babies hair are cut off, the baby will be\n\n\n\nThe first son should be called after its father's father and the first daughter after her mother's mother. Baby boys should be dressed in blue and little girls in pink. The seventh child is usually lucky and the seventh child is a priest or a doctor.\n\n\n\nTwo spoons in your tea-cup is a sign of a christening. Whoever finds out the child's first tooth gets a silver piece. Baby's nails should not be cut until its a year old. If the little knots that come on babies hair are cut off, the baby will be\n(continues on next page)\n", "school_info": "School: Kilcullen (Convent)", "metadata": [{"Location:": "Kilcullen, Co. Kildare", "Teacher:": "\nNa Siúracha\n"}, {"Collector": "Nan O' Neill", "Gender": "female"}, {"Language": "English"}]}, "4769972/4763453/4785482": {"title": "Birth Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0780, Page 326", "Page 326"], "url": "https://www.duchas.ie/en/cbes/4769972/4763453/4785482", "text": "\nPeople believe it is unlucky to get a new cradle, and the grand-father usually buys that. If a child is born with a caul it is considered very lucky. If a baby has been christened and then dies, the name is not usually given to a succeeding child. Clothes worn by a baby who dies, or in fact anything belonging to it are usually given away. When a baby dies it is usual to wake it in its christening robe. Nan O'Neill got above information. The first son should be called after its father's father and the first daughter after her mother's mother. Baby boys should be dressed in blue and little girls in pink. The seventh child is usually lucky and the seventh child is a priest or a doctor. Kitty BagnellTwo spoons in your tea-cup is a sign of a christening. Whoever finds out the child's first tooth gets a silver piece. Baby's nails should not be cut until its a year old. If the little knots that come on babies hair are cut off, the baby will be\n\n\n\nThe first son should be called after its father's father and the first daughter after her mother's mother. Baby boys should be dressed in blue and little girls in pink. The seventh child is usually lucky and the seventh child is a priest or a doctor.\n\n\n\nTwo spoons in your tea-cup is a sign of a christening. Whoever finds out the child's first tooth gets a silver piece. Baby's nails should not be cut until its a year old. If the little knots that come on babies hair are cut off, the baby will be\n(continues on next page)\n", "school_info": "School: Kilcullen (Convent)", "metadata": [{"Location:": "Kilcullen, Co. Kildare", "Teacher:": "\nNa Siúracha\n"}, {"Collector": "Kitty Bagnall", "Gender": "female"}, {"Language": "English"}]}, "4769972/4763453/4785485": {"title": "Birth Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0780, Page 326", "Page 326"], "url": "https://www.duchas.ie/en/cbes/4769972/4763453/4785485", "text": "\nPeople believe it is unlucky to get a new cradle, and the grand-father usually buys that. If a child is born with a caul it is considered very lucky. If a baby has been christened and then dies, the name is not usually given to a succeeding child. Clothes worn by a baby who dies, or in fact anything belonging to it are usually given away. When a baby dies it is usual to wake it in its christening robe. Nan O'Neill got above information. The first son should be called after its father's father and the first daughter after her mother's mother. Baby boys should be dressed in blue and little girls in pink. The seventh child is usually lucky and the seventh child is a priest or a doctor. Kitty BagnellTwo spoons in your tea-cup is a sign of a christening. Whoever finds out the child's first tooth gets a silver piece. Baby's nails should not be cut until its a year old. If the little knots that come on babies hair are cut off, the baby will be\n\n\n\nThe first son should be called after its father's father and the first daughter after her mother's mother. Baby boys should be dressed in blue and little girls in pink. The seventh child is usually lucky and the seventh child is a priest or a doctor.\n\n\n\nTwo spoons in your tea-cup is a sign of a christening. Whoever finds out the child's first tooth gets a silver piece. Baby's nails should not be cut until its a year old. If the little knots that come on babies hair are cut off, the baby will be\n(continues on next page)\n", "school_info": "School: Kilcullen (Convent)", "metadata": [{"Location:": "Kilcullen, Co. Kildare", "Teacher:": "\nNa Siúracha\n"}, {"Collector": "Anna Coleman", "Gender": "female"}, {"Informant": "Mrs Coleman", "Relation": "parent", "Gender": "female"}, {"Language": "English"}]}, "4769972/4763454/4785487": {"title": "Birth Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0780, Page 327", "Page 327"], "url": "https://www.duchas.ie/en/cbes/4769972/4763454/4785487", "text": "\n(continued from previous page)\nlight-headed, and if its finger-nails are cut it will be light-fingered. If its a baby boy its bad to let it cry too much it tends towards inward convulsions.\n\n\n\nIf a baby's feet are tickled, he will grow up with a stammer in his speech. When a person turns out very lucky, its said she must have been born with a silver spoon in her mouth.\n\n\n\nWhen a baby is going to be christened, a cinder is tied to the christening shawl. The one christening shawl passes down through the family.\n\n\n\nIf a baby is crying very much a red cinder is taken out of the fire, and placed in a cup of hot water, - then the water is given to the child to drink - afterwards the child usually goes to sleep.The 18th May is considered a lucky day on which to be born, and the 13th May is an unlucky date.\n\n\n\nMonday's child is fair of face,Tuesday's child is full of grace,\n(continues on next page)\n", "school_info": "School: Kilcullen (Convent)", "metadata": [{"Location:": "Kilcullen, Co. Kildare", "Teacher:": "\nNa Siúracha\n"}, {"Collector": "Rosaleen Lallaway", "Gender": "female"}, {"Language": "English"}]}, "4769972/4763454/4785488": {"title": "Birth Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0780, Page 327", "Page 327"], "url": "https://www.duchas.ie/en/cbes/4769972/4763454/4785488", "text": "\n(continued from previous page)\nlight-headed, and if its finger-nails are cut it will be light-fingered. If its a baby boy its bad to let it cry too much it tends towards inward convulsions.\n\n\n\nIf a baby's feet are tickled, he will grow up with a stammer in his speech. When a person turns out very lucky, its said she must have been born with a silver spoon in her mouth.\n\n\n\nWhen a baby is going to be christened, a cinder is tied to the christening shawl. The one christening shawl passes down through the family.\n\n\n\nIf a baby is crying very much a red cinder is taken out of the fire, and placed in a cup of hot water, - then the water is given to the child to drink - afterwards the child usually goes to sleep.The 18th May is considered a lucky day on which to be born, and the 13th May is an unlucky date.\n\n\n\nMonday's child is fair of face,Tuesday's child is full of grace,\n(continues on next page)\n", "school_info": "School: Kilcullen (Convent)", "metadata": [{"Location:": "Kilcullen, Co. Kildare", "Teacher:": "\nNa Siúracha\n"}, {"Collector": "Kitty Bagnall", "Gender": "female"}, {"Language": "English"}]}, "4769972/4763454/4785491": {"title": "Birth Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0780, Page 327", "Page 327"], "url": "https://www.duchas.ie/en/cbes/4769972/4763454/4785491", "text": "\n(continued from previous page)\nlight-headed, and if its finger-nails are cut it will be light-fingered. If its a baby boy its bad to let it cry too much it tends towards inward convulsions.\n\n\n\nIf a baby's feet are tickled, he will grow up with a stammer in his speech. When a person turns out very lucky, its said she must have been born with a silver spoon in her mouth.\n\n\n\nWhen a baby is going to be christened, a cinder is tied to the christening shawl. The one christening shawl passes down through the family.\n\n\n\nIf a baby is crying very much a red cinder is taken out of the fire, and placed in a cup of hot water, - then the water is given to the child to drink - afterwards the child usually goes to sleep.The 18th May is considered a lucky day on which to be born, and the 13th May is an unlucky date.\n\n\n\nMonday's child is fair of face,Tuesday's child is full of grace,\n(continues on next page)\n", "school_info": "School: Kilcullen (Convent)", "metadata": [{"Location:": "Kilcullen, Co. Kildare", "Teacher:": "\nNa Siúracha\n"}, {"Collector": "Anna Coleman", "Gender": "female"}, {"Language": "English"}]}, "4769972/4763454/4785492": {"title": "Birth Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0780, Page 327", "Page 327"], "url": "https://www.duchas.ie/en/cbes/4769972/4763454/4785492", "text": "\n(continued from previous page)\nlight-headed, and if its finger-nails are cut it will be light-fingered. If its a baby boy its bad to let it cry too much it tends towards inward convulsions.\n\n\n\nIf a baby's feet are tickled, he will grow up with a stammer in his speech. When a person turns out very lucky, its said she must have been born with a silver spoon in her mouth.\n\n\n\nWhen a baby is going to be christened, a cinder is tied to the christening shawl. The one christening shawl passes down through the family.\n\n\n\nIf a baby is crying very much a red cinder is taken out of the fire, and placed in a cup of hot water, - then the water is given to the child to drink - afterwards the child usually goes to sleep.The 18th May is considered a lucky day on which to be born, and the 13th May is an unlucky date.\n\n\n\nMonday's child is fair of face,Tuesday's child is full of grace,\n(continues on next page)\n", "school_info": "School: Kilcullen (Convent)", "metadata": [{"Location:": "Kilcullen, Co. Kildare", "Teacher:": "\nNa Siúracha\n"}, {"Collector": "Rosaleen Lallaway", "Gender": "female"}, {"Language": "English"}]}, "4742082/4734003/4785583": {"title": "Old Sayings about Baptism", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0463, Page 201", "Page 201"], "url": "https://www.duchas.ie/en/cbes/4742082/4734003/4785583", "text": "\nSome children are born with a covering over their faces which is called a cawl, which is then removed by the doctor or nurse. If it is left it is supposed that it will save the person who is born with it in sickness or in drowning if worn around the neck. An instance of it happened around here.Once a man named Jim Sullivan from Ardea was in the crew of a trammel boat. They were hauling the trammel nets in Sneem Harbour and it was a very rough morning and a wave came and the rest were drowned because he was wearing the cawl.\n", "school_info": "School: Leithead", "metadata": [{"Location:": "Lehid, Co. Kerry", "Teacher:": "\nDiarmuid Ó Súilleabháin\n"}, {"Collector": "Mary Shea", "Gender": "female", "Address": "Lehid, Co. Kerry"}, {"Informant": "Patrick Shea", "Relation": "parent", "Gender": "male", "Age": "40", "Address": "Lehid, Co. Kerry"}, {"Language": "English"}]}, "4742085/4734513/4924739": {"title": "Birth Marks", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0464, Page 292", "Page 292"], "url": "https://www.duchas.ie/en/cbes/4742085/4734513/4924739", "text": "\nWhen Diarmuid Lane the far famed bone - setter lived in this part of the country as a young married man it happened about two or three months before one of his children was born that Mrs Lane by accident burnt her leg with very hot tea out of the tea pot and when baby arrived he had a burnt patch on the same spat in the leg as was on the mother's before his birth. And let us say that the mother's accident occurred in the month of October, the child's leg in the same spot got sore and burnt looking every October for seven years when it ceased.At present a McCarthy child from Escaudor, here in the parish of Tuosist is being attended to in the Kenmare hospital  for a red sore shaped like a sweet and coloured just as a red sweet was which was tossed at the mother a short time before this baby was\n(continues on next page)\n", "school_info": "School: Landsdowne (Cuar na gCoileach)", "metadata": [{"Location:": "Coornagillagh, Co. Kerry", "Teacher:": "\nEibhlín, Bean Uí Shúilleabháin\n"}, {"Collector": "Eibhlín Bean Uí Shúilleabháin", "Gender": "female", "Occupation": "múinteoir"}, {"Language": "English"}]}, "4769960/4762849/4924749": {"title": "Superstitions - Births", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0778, Page 023", "Page 023"], "url": "https://www.duchas.ie/en/cbes/4769960/4762849/4924749", "text": "\nA child born on Whit Monday or on Whit Tuesday was known as a \"Whitsuntide\" and was considered unlucky. In order to break the Spell, a small grave was made, and the baby was buried there, three times. This was supposed to break the Spell of \"the wicked hand\".\n", "school_info": "School: Mercy  Convent, Rathangan", "metadata": [{"Location:": "Rathangan, Co. Kildare", "Teacher:": "\nSr. M. Pádraig\n"}, {"Collector": "Ena Hanks", "Gender": "female", "Address": "Rathangan, Co. Kildare"}, {"Informant": "Thomas Kelly", "Gender": "male", "Age": "84", "Address": "Mullantine, Co. Kildare"}, {"Language": "English"}]}, "4921935/4911305/4932560": {"title": "Christenings", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0480, Page 322", "Page 322"], "url": "https://www.duchas.ie/en/cbes/4921935/4911305/4932560", "text": "\nChristenings.The christenings, about a half a century ago, were looked upon as great events.The christening was not held till the mother of the babe was up and about.Then all the aunts and uncles, cousins and neighbours came.  No body came empty.  The presents took the form of tea, sugar, butter, bakers bread, honey, whiskey and wine.  The meat was provided in the house.  The dinner and tea were pleasant meals.  Songs and dances and refreshments followed.  Sometimes the men indulged freely and then the neighbourhood astounded with \"The wearing of the green\", or some such air in loud voices.Jigs, reels and hornpipes were the usual dances.  All the married people danced on an occasion like this.  The  violen  was to be found in almost every house\n", "school_info": "School: Glin (C.)", "metadata": [{"Location:": "Glin, Co. Limerick", "Teacher:": "\nBean Mhic Cárthaigh\n"}, {"Language": "English"}]}, "4922004/4917348/4945739": {"title": "Old Customs at Births", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0499, Page 197", "Page 197"], "url": "https://www.duchas.ie/en/cbes/4922004/4917348/4945739", "text": "\nThe old people always spit on a Baby's face, and Said God Bless It or God Almighty bless it. This was to protect it from all evil influences. If the blessing was omitted it was considered a [?] offense, and some misfortune was sure to happen to the child.Parents never liked to leave a baby in a cradle alone. If obliged to leave it for a short time they put the tongs across the cradle.You should not buy a cradle for the first child and only the least possible amount of clothes should be made for it.It is customary to take a present when going to see a newly born baby or to put a bit of silver into its hand for luck.When a child is taken to the church to be baptised it is said you should give the Surname as well as the Christian name to the priest. This prevents the child from seeing the good people when it grows up.A child's finger nails should not be cut until it is a year old.\n", "school_info": "School: Granagh (C.), Brúgh Ríogh", "metadata": [{"Location:": "Granagh, Co. Limerick", "Teacher:": "\nMáire Ní Leidhin\n"}, {"Language": "English"}]}, "4922029/4920118/4948827": {"title": "Birth Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0506, Page 051", "Page 051"], "url": "https://www.duchas.ie/en/cbes/4922029/4920118/4948827", "text": "\nBirth Customs.1. Lucky to put silver in a baby's hand.(to cross the child with silver).2.  A baby born with a caul is a sign it will never be drowned.3.  Unlucky to buy a new cradle for the baby.4.  If a baby sneezes you must say \"God bless him\", or \"God bless her\".5.  A mole above a child's breath will never be drowned.6. A captain of a ship likes to secure a caul from someone to bring luck to his ship and save the crew from drowning.\n", "school_info": "School: Áth Dara (C.)", "metadata": [{"Location:": "Adare, Co. Limerick", "Teacher:": "\nMáire Boardman\n"}, {"Language": "English"}]}, "4922033/4920588/4953636": {"title": "Customs (on the Occasion of Deaths, Burials and Births) Still More or Less Prevalent in this District", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0507, Page 051", "Page 051"], "url": "https://www.duchas.ie/en/cbes/4922033/4920588/4953636", "text": "\nSection 56 of official handbook.Customs (on the occasion of deaths, burials and births) still more or less prevalent in this district.It is said that a person being \"given up\" by Priest and doctor should not be allowed to die in a feather bed.  The feather bed prolongs the (death) agony.  (The practice of changing the dying person to another sort of bed, if it ever obtained here, is gone, as far as I can ascertain, beyond living memory.  As well as I understand from my narrators, the agony in consideration, was a much spiritual as physical, and perhaps more so).When a person dies in a house every clock is stopped, and every looking glass is covered.  After death the corpse is left alone for an hour, (before it is washed).  If there are beehives, each one is covered with black cloth.  If they are not, the bees will die. (Almost generally observed here).The water in which the corpse is washed is kept under the bed on which the remains are laid out, until after the funeral from the house.  (Still rather generally observed here).The same men who carry the coffin with the remains from the house must carry it into the Church, and after the death Mass, must carry it from the Church, and finally carry it (Round the graveyard) to the grave, (First portion of this custom, still minutely observed, but portion within ( ) not always adhered.\n(continues on next page)\n", "school_info": "School: Cromadh (B.)", "metadata": [{"Location:": "Croom, Co. Limerick", "Teacher:": "\nDáithí Ó Ceanntabhail\n"}, {"Language": "English"}]}, "4922033/4920590/4953642": {"title": "Customs at Births etc", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0507, Page 053", "Page 053"], "url": "https://www.duchas.ie/en/cbes/4922033/4920590/4953642", "text": "\nCustoms at births etc.(Of the prevalence or otherwise of these beliefs and customs at childbirth, I cannot generally speak, but they are undoubtedly known here, and sometimes at least still observed.D.O.C.)A pregnant woman is not to enter a graveyard, at funeral, or otherwise.  If she should do so her child is like to be a cam-roilig.If a hare should cross the path of a pregnant woman there is danger that her child will have a hare lip.  She can avoid this calamity by making the sign of the cross on some concealed part of her person.In Tiob. Ár. long ago I used to hear that the proper place to make the sign of the Cross on such occasions was the back of the \"Shleesta\".  On public occasions this required a good deal of moral courage on the part of the poor woman concerned, but there was a story to prove that such a person had existed totally, had complied with the ritual suitable to the malcontre and had transferred the blemish thereby from the lip of her future baby to its sleestha.  That was the substance of it, but there were details which I cannot recall).The after birth was always buried in the soil.  This custom was vigorously observed until trained maternity nurses changed the procedure.\n(continues on next page)\n", "school_info": "School: Cromadh (B.)", "metadata": [{"Location:": "Croom, Co. Limerick", "Teacher:": "\nDáithí Ó Ceanntabhail\n"}, {"Language": "English"}]}, "4922063/4849047/5010831": {"title": "Flax", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0514, Page 272", "Page 272"], "url": "https://www.duchas.ie/en/cbes/4922063/4849047/5010831", "text": "", "school_info": "School: Coill Beithne (C.), Baile Mhistéala", "metadata": [{"Location:": "Kilbeheny, Co. Limerick", "Teacher:": "\n-\n"}, {"Language": "English"}]}, "4922063/4849057/5010877": {"title": "Tailors and Shoemakers", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0514, Page 282", "Page 282"], "url": "https://www.duchas.ie/en/cbes/4922063/4849057/5010877", "text": "\n(continued from previous page)\nTallow candles were made from the fat of the sheep, goats and cows.\n", "school_info": "School: Coill Beithne (C.), Baile Mhistéala", "metadata": [{"Location:": "Kilbeheny, Co. Limerick", "Teacher:": "\n-\n"}, {"Language": "English"}]}, "4770049/4769284/5015498": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0837, Page 223", "Page 223"], "url": "https://www.duchas.ie/en/cbes/4770049/4769284/5015498", "text": "", "school_info": "School: Loughteague, Stradbally", "metadata": [{"Location:": "Loughteeog, Co. Laois", "Teacher:": "\nBrigid Keane, Brighid Ní Chatháin\n"}, {"Language": "English"}]}, "4922168/4857877/5018871": {"title": "Character of the People", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0542, Page 316", "Page 316"], "url": "https://www.duchas.ie/en/cbes/4922168/4857877/5018871", "text": "\n(continued from previous page)\nare of average intelligence and great brilliancy is rare.The climate is extremely moist. Heavy rains are frequent. Winters are cold and snowstorms are often very severe.Since many strange customs may be unknown or untold to children, some of the following are written by myself and written at random as they have been heard. I take in the first case the life of a man or woman:\n\n\n\n(1) An expectant mother must not enter  a graveyard. If she does her baby will have what is locally called a  Cam  Roilig (crooked foot).(2) She must not enter  a corpse room or touch the dead. Her baby may be defective or perhaps be still born.(3) Great care must be taken not to let a hare cross her path. The mouth of the child will be peculiar.(4) If she has been struck by anything which, as is believed may result in a birth-mark all she has to do is touch the place struck, with her hand then rub her hand to her back or leg and the mark will thus be transferred from the face of the baby to the back or leg.(5) When the baby is taken to the Church for Baptism, salt is put under the mother's head or pillow. She\n(continues on next page)\n", "school_info": "School: Cill Chuimín, Durlas Éile", "metadata": [{"Location:": "Kilcommon, Co. Tipperary", "Teacher:": "\nDonnchadh Ó Cuinnéain\n"}, {"Language": "English"}]}, "5044803/5040088/5083387": {"title": "Cross-Roads", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0968, Page 389", "Page 389"], "url": "https://www.duchas.ie/en/cbes/5044803/5040088/5083387", "text": "\n(continued from previous page)\nunderstand the priests were terribly opposed to cross road dancing and put them down every place, and as people had great respect for their priests in those days, they let the priests stamp out the custom every place.\n\n\n\nA baby was christened the next day after it was born. All the neighbours would be invited: every woman brought a couple of cakes of oaten bread (oat meal cake for there was no flour then) and a messcaun of butter. Every man brought a bottle of whiskey (it only cost a couple of shillings then). There was a big dinner and they ate and drank, and talked and argued till ten oclock at night. The people nearly always went home at ten oclock: it was not considered lucky to stop out after ten o clock at night.Patrick McGovern was brought in to be christened forty nine years ago. The priest was away, and the sponsors were advised by the people of the village to wait till he did come that it would be unlucky to bring him home unchristened. This they did and the priest didn't come till long after night. He was in a rage at seeing them before him, but he baptised him.\n(continues on next page)\n", "school_info": "School: Tiercahan", "metadata": [{"Location:": "Tircahan, Co. Cavan", "Teacher:": "\nP. Ó Riain\n"}, {"Language": "English"}]}, "5009212/4998397/5105485": {"title": "Birth", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0770, Page 079", "Page 079"], "url": "https://www.duchas.ie/en/cbes/5009212/4998397/5105485", "text": "\n1. \"If a mother curses her child before ir's born, the child will have an \"evil eye.\"2. \"If a mother-to-be \"longs\" for anything and does not get it, she should take a pinch of salt, or the child will be born with its tongue out.\"3. \"If a pregnant woman meets a hare, she should put a tear in her petticoat or the child will have a \"hare's lip\"4. \"If a mother-to-be gets a fright she should clap her hand on the small of her back at once to prevent any harm to the child.\"5. \"When the seventh son is born two worms should be put in his hand -   a male and female - and\n(continues on next page)\n", "school_info": "School: Monedarragh, Mostrim", "metadata": [{"Location:": "Monadarragh, Co. Longford", "Teacher:": "\nBean Uí Mhealláin\n"}, {"Language": "English"}]}, "4922035/4920903/5116330": {"title": "Customs - Marriage Customs", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0507, Page 493", "Page 493"], "url": "https://www.duchas.ie/en/cbes/4922035/4920903/5116330", "text": "\n(continued from previous page)\ninto the kiln, holding the end of the thread.  He then begins to wind it up slowly until the thread is caught below and he can wind no further.  He then calls out \"Who holds my bottom\", and for answer he will get the Christian name of his future wife.  If the thread come freely to him until he has it all would up again he will never be married.  A \"cleas\" by which a girl finds out the man to whom she will be married is as follows.  The girl stays up until 12 o'clock on November night and washes an inside garment, putting it to dry before the fire.  The wraith of her future husband will come and turn it when it has dried on one side. To break anything (e.g. a glass\" at a wedding is unlucky for the bride.\n\n\n\nBirths.A woman who expects a baby should be careful not to let a hare cross her path.  If he does the baby when born will have a hare-lip.  Should the hare do so the woman can save the baby from the blemish by immediately tearing a little of some inside garment.  An expectant mother should be careful to get no stroke on the face or hands nor no splash of anything but water, because such might cause a mark in a similar part\n(continues on next page)\n", "school_info": "School: Cromadh (C.)", "metadata": [{"Location:": "Croom, Co. Limerick", "Teacher:": "\nBríd, Bean Mhic Eoin\n"}, {"Language": "English"}]}, "5009260/5002492/5131829": {"title": "Christenings", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0882, Page 085", "Page 085"], "url": "https://www.duchas.ie/en/cbes/5009260/5002492/5131829", "text": "\nWhen a baby is born it is not christened until the following day. If it is a wet day or if the people are wealthy the baby is brought to the church in a motor car but if the day is fine the baby is brought to the church by the nurse who walks accompanied by the sponsors.If the baby cries when the water is poured on its head it will die if not it will live. If a sponsor stands for two children in one year it is believed that one of them will die. Some of times the sponsors ask some request of God for the child and their request is certainly granted.When the party returns from the church there is usually a feast and the people present drink the baby's health. When the neighbours come in to see the child. They bring presents such as coats caps and dresses. The sponsors put silver into the child's hand.It is considered a very\n(continues on next page)\n", "school_info": "School: Faythe", "metadata": [{"Location:": "The Faythe, Co. Wexford", "Teacher:": "\nAn tSr. Columcille\n"}, {"Collector": "Eily O Donnell", "Gender": "female", "Address": "Faythe, Co. Wexford"}, {"Informant": "Mrs O Leary", "Gender": "female", "Address": "Faythe, Co. Wexford"}, {"Language": "English"}]}, "5044617/5026380/5141345": {"title": "Christenings", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0812, Page 135", "Page 135"], "url": "https://www.duchas.ie/en/cbes/5044617/5026380/5141345", "text": "\n1. It is said when a baby is being baptised, if it cries when the priest is pouring the water on its head, it can never drink and it will always be crying. 2. If a child is born with a crooked finger, it is said that the child has a charm of some kind. 3. It is also said, that when a baby girl is born with a birth-mark on her forehead. That will be a rich and a lucky child. 4. If a person is born at night he will always see ghosts. 5. If a child does not cry when it is being baptized, it will not be a long liver.6. If people go to get a child christened and they see a man with no hair on his head, it is a sign that the child will live as long as its hair stays\n(continues on next page)\n", "school_info": "School: Clonmacnoise", "metadata": [{"Location:": "Clonmacnoise, Co. Offaly", "Teacher:": "\nP. Ó Maolmhuaidh\n"}, {"Informant": "Ann Kilmartin", "Gender": "female", "Age": "90", "Address": "Creevagh, Co. Offaly"}, {"Language": "English"}]}, "4921643/4887366/5153502": {"title": "Religious Stories", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0313, Page 219", "Page 219"], "url": "https://www.duchas.ie/en/cbes/4921643/4887366/5153502", "text": "\n1.It is unlucky to refuse to stand sponsor for a child. The child would die.2.It is unlucky to stand sponsor for two children in the same year.The following is a rhyme which foretells the destiny of a child born on each day.\"Monday for healthTuesday for wealthWednesday the best day of allThursday for crossesFriday for lossesSaturday no luck at all.But the child who is born on the Sabbath dayIs bonny and happy and bight and gay.\"Another rhyme says.Monday's child is fair of faceTuesday's child is full of grace.\n(continues on next page)\n", "school_info": "School: Raharoon, Droichead Banndan", "metadata": [{"Location:": "Ratharoon West, Co. Cork", "Teacher:": "\nMáiréad Ní Shúilleabháin\n"}, {"Language": "English"}]}, "4921764/4904825/5172000": {"title": "Christenings", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0358, Page 394", "Page 394"], "url": "https://www.duchas.ie/en/cbes/4921764/4904825/5172000", "text": "\nChristeningsAs at the wedding the christening was another occasion for rejoicing and merrymaking.The young wife's mother was sent for or of she was dead or incapacitated an elder sister was summoned. The husband's people no matter how friendly they were with the wife would not hold themselves responsible. The mother arrived and on her devolved all responsibility for her daughter's welfare. She had the ordering of the \"Midwife\". The midwife was an unqualified person but she was very 'Knowing'. In this district there were two such women. Mrs Judy Sheehan and Mrs Peig Collins both of Scrahan. Peig was known as [Peig a Coic] - she was a bold brazen and quick-tempered woman but a very successful midwife. There was no question of a doctor and when a doctor was summoned among the fairly well-to-do in those days people threw up their heads - there was no hope. Often, indeed, in serious cases the priest was summoned before the doctor.After the birth the glad news was soon circulated - if a son, there was general rejoicing and the father received hearty congratulations - if the 'weeney' one was a daughter - well 'I wish you joy' would be heard\n(continues on next page)\n", "school_info": "School: Cnoc na Groighe (B.), Ráth Mhór", "metadata": [{"Location:": "Knocknagree, Co. Cork", "Teacher:": "\nDíarmuid Ó Muimhneacháin\n"}, {"Collector": "Díarmuid Ó Múimhneacháin", "Gender": "male", "Occupation": "príomhoide"}, {"Language": "mixed"}]}, "4921885/4898902/5189804": {"title": "Superstitions", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0389, Page 285", "Page 285"], "url": "https://www.duchas.ie/en/cbes/4921885/4898902/5189804", "text": "\n(continued from previous page)\nTrees.Palm: You will be useful.Walnut: You will meet a talkative foreigner.Oak is a long life.Ducks: If swimming in numbers means increased work but if foraging in a ditch it means prolonged labour.Signs of Rain:The crows flying low.A circle around the moon.\n\n\n\nThe belief is current in this district that a child born with a caul or thin membrane covering head, will be lucky. One such child was born recently in this parish, Nurse informs me. The parents preserve and keep the caul.It is held that people who were not properly baptised can see spirits.\n", "school_info": "School: Ráth an Tóiteáin (Burnfort), Malla", "metadata": [{"Location:": "Burnfort, Co. Cork", "Teacher:": "\nDomhnall Mac Óda (Archdeacon)\n"}, {"Collector": "Donal Archdeacon", "Gender": "male", "Occupation": "teacher", "Address": "Drommahane, Co. Cork"}, {"Informant": "Mrs Fitzgibbon", "Gender": "female", "Age": "76", "Address": "Drommahane, Co. Cork"}, {"Language": "English"}]}, "4921880/4898253/5195630": {"title": "Births", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0387, Page 300", "Page 300"], "url": "https://www.duchas.ie/en/cbes/4921880/4898253/5195630", "text": "\nBIRTHS\n(continues on next page)\n", "school_info": "School: Dungourney", "metadata": [{"Location:": "Dungourney, Co. Cork", "Teacher:": "\nPádraig Ó Rignigh\n"}, {"Language": "English"}]}, "5177641/5175603/5196620": {"title": "Birthmarks", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0596, Page 038", "Page 038"], "url": "https://www.duchas.ie/en/cbes/5177641/5175603/5196620", "text": "\nThe old people say it is a very bad thing for the unborn child to 'pelt' anything at a woman in the 'family way'.  They also say that if the woman who is struck, immediately touches any part of her own body that it is exactly on the same part of the unborn child's body the birthmark will appear.Mrs M -, Ennis, who was carrying child at the time, was sitting at the table one day having her dinner and out of fun, one of the others diners threw a skin of a potato at her and stn? her in the face.  When her child, a boy, was born there was a birthmark about the size of the potato skin that was thrown at her at the dinner on the child's hip.Mrs. R -, Limerick City, who was near having a baby, was going up the stairs one day.  Somebody threw a dishcloth which struck Mrs. R -, on the small of the back.  When the baby, a boy, was born, a birthmark, the shape of a dishcloth was on the back of the child.Told by Mrs. William Macnamara, Corbally, Quin\n", "school_info": "School: An Daingean, Cuinche", "metadata": [{"Location:": "Dangan, Co. Clare", "Teacher:": "\nStiofán Mac Clúin, Treasa Ní Chonmara\n"}, {"Informant": "Mrs William Macnamara", "Gender": "female", "Address": "Corbally, Co. Clare"}, {"Language": "English"}]}, "5177641/5175604/5196633": {"title": "Birthmarks", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0596, Page 039", "Page 039"], "url": "https://www.duchas.ie/en/cbes/5177641/5175604/5196633", "text": "\nMrs G - , Rosroe, Sixmilebridge, Co Clare was carrying a child at the time. One day a man came to the shop to buy a handle for a hayfork  The handles were hanging down from the ceiling of the shop, when Mrs G was taking down the handles one of them fell down and struck her on the front of the head and raised a lump.When the child, a girl was born , there was a small lump exactly on the same part of the front where the handle had struck her mother.  The lump grew large as the child grew older, and when she was strong enough her parents got a doctor in Limerick to ‘ Cut “ out the lump. But after a short time the lump grew again.The above was told by Miss Jessie Gillian, Rosroe Sixmilebridge.\n\n\n\nMrs. G-. Quin, Co.Clare, got her teeth taken out in Ennis, while she was carrying a baby.When the child ,a girl was born,her face was very much disfigured,especially about the  mouth.A policeman's wife was skinning a rabbit one day.She was carrying a child at the time.\n(continues on next page)\n", "school_info": "School: An Daingean, Cuinche", "metadata": [{"Location:": "Dangan, Co. Clare", "Teacher:": "\nStiofán Mac Clúin, Treasa Ní Chonmara\n"}, {"Informant": "Miss Jessie Gilligan", "Gender": "female", "Address": "Rosroe, Co. Clare"}, {"Language": "English"}]}, "5177641/5175604/5196639": {"title": "Birthmarks", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0596, Page 039", "Page 039"], "url": "https://www.duchas.ie/en/cbes/5177641/5175604/5196639", "text": "\nMrs G - , Rosroe, Sixmilebridge, Co Clare was carrying a child at the time. One day a man came to the shop to buy a handle for a hayfork  The handles were hanging down from the ceiling of the shop, when Mrs G was taking down the handles one of them fell down and struck her on the front of the head and raised a lump.When the child, a girl was born , there was a small lump exactly on the same part of the front where the handle had struck her mother.  The lump grew large as the child grew older, and when she was strong enough her parents got a doctor in Limerick to ‘ Cut “ out the lump. But after a short time the lump grew again.The above was told by Miss Jessie Gillian, Rosroe Sixmilebridge.\n\n\n\nMrs. G-. Quin, Co.Clare, got her teeth taken out in Ennis, while she was carrying a baby.When the child ,a girl was born,her face was very much disfigured,especially about the  mouth.A policeman's wife was skinning a rabbit one day.She was carrying a child at the time.\n(continues on next page)\n", "school_info": "School: An Daingean, Cuinche", "metadata": [{"Location:": "Dangan, Co. Clare", "Teacher:": "\nStiofán Mac Clúin, Treasa Ní Chonmara\n"}, {"Informant": "M.K. Carmody", "Address": "Quin, Co. Clare"}, {"Language": "English"}]}, "5177641/5175606/5196650": {"title": "Birthmarks", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0596, Page 041", "Page 041"], "url": "https://www.duchas.ie/en/cbes/5177641/5175606/5196650", "text": "\n41.26.5 38.The touch of a dead man's hand is said to remove a birthmark is said to remove a birthmark.To rub the afterbirth of the child to the birthmark is also said to take it away.The old people say it is not right to interfere with a birthmark,that it is a lucky thing to be born in a child.They also say that a hares lip in a child is caused by a hare crossing the path of a woman in child.It is not right for a woman in child to make jam especially currant or blackberry jam.A woman in child to touch a gooseberry is said to be the cause of a birthmark the shape of a gooseberry on the child's head.Mrs J .S - Quin Co. Clare ,says she was 'making pigs puddings carrying Madge who had a very large birthmark on her face .She blames the making of the puddings for the birthmark to this day.Tole by Mrs Pat Kelly ,Quin. Co.Clare.\n", "school_info": "School: An Daingean, Cuinche", "metadata": [{"Location:": "Dangan, Co. Clare", "Teacher:": "\nStiofán Mac Clúin, Treasa Ní Chonmara\n"}, {"Informant": "Mrs Pat Kelly", "Gender": "female", "Address": "Quin, Co. Clare"}, {"Language": "English"}]}, "5260470/5256048/5262940": {"title": "Customs at Baptism", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0776C, Page 10_028", "Page 10_028"], "url": "https://www.duchas.ie/en/cbes/5260470/5256048/5262940", "text": "\nIt is a custom to bring teh Godfather and the Godmother to the home after the baptism and there is a cake taken down and the Godmother is to cut the first cut off the cake.  There is a drink of milk and sugar made for the child and the Godfather is to take a spoonful of it.\n", "school_info": "School: Twomilehouse", "metadata": [{"Location:": "Twomilehouse, Co. Kildare", "Teacher:": "\nTomás Bineidh\n"}, {"Collector": "Peter Cooley", "Gender": "male", "Address": "Mullacash North, Co. Kildare"}, {"Language": "English"}]}}