{"4428211/4386100/4450331": {"title": "Cures", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0793, Page 14", "Page 14"], "url": "https://www.duchas.ie/en/cbes/4428211/4386100/4450331", "text": "\n11) Wart weed is a cure for warts break the weed and rub the juice to the wart.12) Marshmallows are a cure for a sprain tie the marshmallow to the sprain13) Healing leaf is acure for a sore out Reel the leaf to the cut to cure it.14) To cure a wart til a snail to the wart hang the snail on a torn lash as the snail withers the wart withers 15) To cure a boil boil Blackheart and drink the juice of them16) To cure chilllains rub raw turnips and salt to them\n(continues on next page)\n", "school_info": "School: Saggart", "metadata": [{"Location:": "Saggart, Co. Dublin", "Teacher:": "\nE. Ó Monacháin\n"}, {"Collector": "Seamús Mac Cionnaigh", "Gender": "male"}, {"Language": "English"}]}, "4428212/4386330/4450378": {"title": "Hidden Treasure", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0793, Page 63", "Page 63"], "url": "https://www.duchas.ie/en/cbes/4428212/4386330/4450378", "text": "\nIn the Demesne in Lucan there is a very old and historical castle in which Sarsfield the great was born. Many weird tales are often told about this famous castle. It is said that many years after Sarsfield was killed the caretaker of the house saw Sarsfield riding around the grounds on a white horse. This famous castle is now in ruins but three rooms still remain. When the Demesne was open to the public I explored every bit of it except one room.Nobody could ever open this door it is said that there is a lot of ammunition enclosed in this room.In Lucan Demesne there is\n(continues on next page)\n", "school_info": "School: Presentation Convent, Lucan", "metadata": [{"Location:": "Lucan, Co. Dublin", "Teacher:": "\nSr Gabriel\n"}, {"Collector": "Alice Neary", "Gender": "female", "Address": "Lucan, Co. Dublin"}, {"Informant": "Mr J. Neary", "Gender": "male", "Occupation": "electrician", "Address": "Lucan, Co. Dublin"}, {"Language": "English"}, {"Location": "Lucan Demesne"}]}, "4428214/4386523/4456517": {"title": "Sarsfield's Dog", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0794, Page 263", "Page 263"], "url": "https://www.duchas.ie/en/cbes/4428214/4386523/4456517", "text": "\nLong ago when Patrick was a chap he had a dog and a pony.  Every morning, he used to ride from the Castle in Lucan Demensne to the garden.  The dog would be in a kennel, at the end of the garden.  When he would hear the rattle of the gate he would run down whining and barking to meet Patrick.  When Patrick had grown to be a man and left Ireland for ever, the dog died and it is said that the dogs spirit comes every thirty three years and loves going back and forward from the place where the kennel was to the garden gate.  He does this for a whole fortnight and always after midnight.\n", "school_info": "School: Lucan (B.)", "metadata": [{"Location:": "Lucan, Co. Dublin", "Teacher:": "\nM. Mac Rois\n"}, {"Collector": "Desmond Kelly", "Gender": "male", "Age": "13", "Address": "Lucan, Co. Dublin"}, {"Informant": "Patrick Mc Cormack", "Gender": "male", "Age": "over 70", "Occupation": "road worker", "Address": "Beaumont, Co. Dublin"}, {"Language": "English"}]}, "4428214/4386524/4456518": {"title": "Hidden Treasure", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0794, Page 264", "Page 264"], "url": "https://www.duchas.ie/en/cbes/4428214/4386524/4456518", "text": "\nThis is an old story about Patrick Sarsfield.  It is said that every three years, Patrick comes out on top of the old castle in Lucan Demense and fires a shot out of a blunderbuss in the direction of Limerick.  It is said that the person who finds the bullet may find a treasure if he digs under where the bullet lands.  Plenty of people have dug there but had no luck.The old garden site can still be traced from the remains of the garden shrubs that still grow there on the slope S.W of Lucan House.  \"Sarsfields Tree\" is still pointed out with its inverted bough and tulip shaped flowers showing great age.  The new garden is opposite and is the south of the county road, and is reached by a tunnel under the road.\n", "school_info": "School: Lucan (B.)", "metadata": [{"Location:": "Lucan, Co. Dublin", "Teacher:": "\nM. Mac Rois\n"}, {"Language": "English"}]}, "4583326/4580007/4588264": {"title": "Local Tradition about Sarsfield", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0054, Page 0188", "Page 0188"], "url": "https://www.duchas.ie/en/cbes/4583326/4580007/4588264", "text": "\nThe local tradition is that Patrick Sarsfield passed up through Kilbrickle village on his way to Limerick from the battle of Aughrim. He got the horses' shoes changed backwards in Cooliney so that the English soldiers would think that he was gone the opposite direction. Some of the soldiers that fought at the battle are buried in Doon. There are also two graves in Ballydonelan. It is also said that there are six or seven people buried in each grave. The graves in Doon and the graves in Ballydonelan are about 10 feet long and 6 feet broad.\n", "school_info": "School: Cill Ríchill", "metadata": [{"Location:": "Kilreekill, Co. Galway", "Teacher:": "\nMícheál S. Ó Gaoithín\n"}, {"Collector": "Michael Cormican", "Gender": "male", "Address": "Newgrove, Co. Galway"}, {"Language": "English"}]}, "4583331/4580348/4591984": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0055, Page 0220", "Page 0220"], "url": "https://www.duchas.ie/en/cbes/4583331/4580348/4591984", "text": "\nSarsfield, when retreating after the 'Battle of Aughrim' passed within half a mile of Laurencetown.  A man - Pat Kelly - is able to trace the way he passed, near Ochil and through Belview on to Limerick.We have two bullets which were fired at the battle of Aughrim.  They were found by a man recently while digging his field, which is near the hill of Aughrim.  This man gave them to his nephew, Thomas Dolan, Sycamore Hill, Laurencetown, who brought them to the school.\n", "school_info": "School: Baile Mór Síl Anmchadha (Laurencetown)", "metadata": [{"Location:": "Laurencetown, Co. Galway", "Teacher:": "\nSeán Ó Cogaidhín\n"}, {"Language": "English"}]}, "4583331/4580349/4591985": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0055, Page 0221", "Page 0221"], "url": "https://www.duchas.ie/en/cbes/4583331/4580349/4591985", "text": "\nIt is told that after the fall of St. Ruth in the Battle of Aughrim, the British advanced from their position at Urrachree and crossed the Bridge of Aughrim and advanced southwards where they encountered the Irish army, at a place now called Glenafula (The Bloody Hollow) where fierce killing was done.  Sarsfield having no hope of holding his position ordered a retreat and crossed the hill of Aughrim.  The Irish army was so closely pursued that they had to hide the treasure which they are said to have carried.  It consisted of 16 thousand gold sovereigns.  It is said to have been put about ten inches under the\n(continues on next page)\n", "school_info": "School: Baile Mór Síl Anmchadha (Laurencetown)", "metadata": [{"Location:": "Laurencetown, Co. Galway", "Teacher:": "\nSeán Ó Cogaidhín\n"}, {"Language": "English"}]}, "4602725/4598540/4626779": {"title": "The Penal Days", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0190, Page 106", "Page 106"], "url": "https://www.duchas.ie/en/cbes/4602725/4598540/4626779", "text": "\n(continued from previous page)\ntaken it off.\n\n\n\nAbout a hundred a priest used to say mass in John McGloins field of Gangrim beside holly trees. Every other Sunday he used to go over to Kerney's field in Wardhouse and say mass. The place he used to say mass was sheltered by a hill. The name of the place is Poul an Aifrinn. There is an old graveyard beside it.\n\n\n\nThere is an old castle situated near Tullaghan in the townland of Duncarbery meaning the fort of Carbery. To the west of the castle there is a big hill it is called Carraigh Mór because there is a great big rock on it. The McClancys soldiers used to watch from that rock for Duncarbery castle Tullaghan situated near the sea means little Hills. Magheracar is situated near the Drowes river meaning the plain of slaughter. The O Donnells and the O Connors fought there. Sarsfield and the English\n(continues on next page)\n", "school_info": "School: Tulchán", "metadata": [{"Location:": "Tullaghan, Co. Leitrim", "Teacher:": "\nSeosamh Mac Guidhir\n"}, {"Informant": "John Meehan", "Gender": "male", "Age": "68", "Address": "Agharroo, Co. Leitrim"}, {"Language": "English"}]}, "4602725/4598540/4626780": {"title": "The Penal Days", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0190, Page 106", "Page 106"], "url": "https://www.duchas.ie/en/cbes/4602725/4598540/4626780", "text": "\n(continued from previous page)\ntaken it off.\n\n\n\nAbout a hundred a priest used to say mass in John McGloins field of Gangrim beside holly trees. Every other Sunday he used to go over to Kerney's field in Wardhouse and say mass. The place he used to say mass was sheltered by a hill. The name of the place is Poul an Aifrinn. There is an old graveyard beside it.\n\n\n\nThere is an old castle situated near Tullaghan in the townland of Duncarbery meaning the fort of Carbery. To the west of the castle there is a big hill it is called Carraigh Mór because there is a great big rock on it. The McClancys soldiers used to watch from that rock for Duncarbery castle Tullaghan situated near the sea means little Hills. Magheracar is situated near the Drowes river meaning the plain of slaughter. The O Donnells and the O Connors fought there. Sarsfield and the English\n(continues on next page)\n", "school_info": "School: Tulchán", "metadata": [{"Location:": "Tullaghan, Co. Leitrim", "Teacher:": "\nSeosamh Mac Guidhir\n"}, {"Language": "English"}, {"Location": "Tullaghan"}]}, "4758476/4747244/4779903": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0250, Page 263", "Page 263"], "url": "https://www.duchas.ie/en/cbes/4758476/4747244/4779903", "text": "\nThe local tradition of Fionn makes him out as a giant and kind of a buffoon. There is a story which I heard as a child where Fionn challenged the Scotch Giant, and seeing his size lost courage (the Giants' Causeway is said to have been built by these two).His wife, seeing his quandary, put him in the cradle and pretended that it was the child. She fed the Scotch Giant with oatbread in which sandstone flags were placed. He asked was that Fionn's usual food, and on being told that it was, got frightened in turn and left.\n\n\n\nThere is a tradition of Sarsfield around here. He was supposed to stay at the Castle of OFarrel at Ballintubber during the War of the Revolution as visitor. The same O'Farrel was killed at Auqhrim and his dog remained at his side till he died.There is also a tradition St Ruth at Aughrim. He was apparently a dandy and loved to appear in different uniform during the day. He once appeared on a White Horse dressed in Green, and then on Black Steed dressed in white etc.A spy who deserted his camp told the English\n(continues on next page)\n", "school_info": "School: Cluain Uí Chuinn", "metadata": [{"Location:": "Cloonyquin, Co. Roscommon", "Teacher:": "\nMícheál Mac Floinn\n"}, {"Informant": "F. Mc Glynn", "Age": "75", "Address": "Rathcroghan, Co. Roscommon"}, {"Language": "English"}]}, "4922100/4852284/4948075": {"title": "Legend Connected with the District of Cullen Co. Limerick", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0524, Page 191", "Page 191"], "url": "https://www.duchas.ie/en/cbes/4922100/4852284/4948075", "text": "\n191(page 45)Legend connected witht the district of Cullen Co LimerickIn the disctrict of Cullen in the County of Limericker there was a hill name the \"Venthor\"  The reason the hill got his name is as follows.When Sarsfield and his soldiers were going to Ballyneety to blow up the Williamite siege train, they stopped at the top of this hill about a quarter of a mile from Ballyneety.  Some of Sarsfield's soldiers were told off to kill the English sentries who were on guard.  It is said that one of the soldiers was not going to run the risk but the other said \"We'll Venture\".  So off they went and hid inside the ditches and when a cloud covered the moon jumped on the sentries and killed them.  So that is the reason that the hill of Cullen is called the \"Venthor\" today.Got from Michael Ryan of Garrydoolis, who heard it from the late Rev Canon Powere, Kilteely, Co Limerick\n", "school_info": "School: Caherelly, Grange, Kilmallock", "metadata": [{"Location:": "Caherelly, Co. Limerick", "Teacher:": "\nJohn Raleigh\n"}, {"Informant": "Michael Ryan", "Gender": "male", "Address": "Garrydoolis, Co. Limerick"}, {"Language": "English"}]}, "4922082/4850624/4949622": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0519, Page 289", "Page 289"], "url": "https://www.duchas.ie/en/cbes/4922082/4850624/4949622", "text": "\n(continued from previous page)\nand for the battle of the Boyne we had revenge that night\n\n\n\nTithe War.The Tithe War was fought in Doon with splendid vigour and determination. The Protestant clergyman was the Rev. Charles Coote and up to this date 1831, he had been on the most friendly terms with Fr. Hickey the Parish Priest, who though he held a considerable farm was never asked to pay tithe.Early in the agitation Coote had been taking active measures to enforce the payment of his tithes. He felt he had at his back the power of the English Government and of Dublin Castle and he decided to take a brave and determined course. Like many of his class he had yet to learn that the strongest government, unless so founded in principles of justice, and sustained by the sanction of the governed, goes down before the organised resistance of an oppressed, resentful and determined people.\n\n\n\nFr Hickey's Cow Sold.One Sunday Fr. Hickey preached a fierce sermon in which he denounced both Mr. Boote and his tithes, and told the people that \"any man who paid a farthing of that blood-stained import was\n(continues on next page)\n", "school_info": "School: Scoil na mBráthar, Doon", "metadata": [{"Location:": "Doon, Co. Limerick", "Teacher:": "\nAn Br. Ó Cathasaigh\n"}, {"Language": "English"}]}, "4922034/4920868/4955752": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0507, Page 459", "Page 459"], "url": "https://www.duchas.ie/en/cbes/4922034/4920868/4955752", "text": "\n(continued from previous page)\na ghost or a live Christian?. Getting no answer, he took up a stone and flung it at the ghost hitting him.  The next moment the man in the white sheet fell down dead.  That happened in Bruff. (Micilin O'Ciarain).\n\n\n\nThis is true.  There was a man in Banogue, and he had a good farm of land, but all his horses and cattle were dying on him.  It came so hard on him that he could not stand it any longer.  He went out to Biddy Early's house in the Co. Clare, and he told her his story.  She told him (rest easy) and walk up and down the road near his house after night, and he would meet a woman in white.  He did so and he met her. The next thing he knew the following morning was that a neighbouring woman was dead.  It was she who used to be doing him the harm.  (Micilin O'Ciarain ó na shean-mháthair)\n\n\n\nOne day as Sarsfield and his man rode out along the road, an English cavalry man came towards them. Bel (or Bal) was the cavalry-man's name. Sarsfield and Bel began to fight and Bel was beating Sarsfield back along the road. Sarsfields man was with\n(continues on next page)\n", "school_info": "School: Cromadh (B.)", "metadata": [{"Location:": "Croom, Co. Limerick", "Teacher:": "\nDáithí Ó Ceanntabhail\n"}, {"Collector": "Micilín O Ciaráin", "Gender": "male"}, {"Informant": "(name not given)", "Relation": "grandparent", "Gender": "female"}, {"Language": "English"}]}, "4922152/4856621/5012323": {"title": "Sarsfield's Visit to Glown", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0538, Page 149", "Page 149"], "url": "https://www.duchas.ie/en/cbes/4922152/4856621/5012323", "text": "\nSarsfields visit to Glown.In the year 1690 when Limerick was besieged by King Williams army a great siege train was on the way to Limerick with fresh artillery to the English army. \"Galloping\" O' Hogan, the famous North Tipperary raparaee brought news of the approaching siege train to Sarsfield. Sarsfield with 500 picked horsemen stole out of Limerick at the Clare side in the dead of night on to Killaloe where they crossed a dangerous ford at Ballyvalley on through Killoscully, down into Glowen which they reached at dawn. Here they hid and rested all day. When darkness fell they skirted Keeper and spurred towards Ballyneety where they expected to intercept the siege train. It is handed down in this locality that they got hospitality from some Mrs Meagher in Ballinouse.Kitty Hickey (13)GlencullooKilloscullyNewportCo Tipp.Got fromBridget Madden (40)GlencullooKilloscullyNewport.\n", "school_info": "School: Glenculloo, Killoscully", "metadata": [{"Location:": "Glanculloo, Co. Tipperary", "Teacher:": "\nMáiréad Ní Ogáin\n"}, {"Collector": "Kitty Hickey", "Gender": "female", "Age": "13", "Address": "Glenculloo, Co. Tipperary"}, {"Informant": "Bridget Madden", "Gender": "female", "Age": "40", "Address": "Glenculloo, Co. Tipperary"}, {"Language": "English"}]}, "4922143/4856166/5015379": {"title": "Sarsfield's Return to Ballyneety", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0537, Page 003", "Page 003"], "url": "https://www.duchas.ie/en/cbes/4922143/4856166/5015379", "text": "\nThe local tradition concerning the above is that Sarsfield remained in hiding in Glenculoo till the siege train passed by. From there he followed it on being shaded by the hills of Failldubh, Shanagorth, Coumnagella & Kilcommon. In Shanagorth he reversed the shoes on the latter part of his cavalry to give the impression to the English that he had returned to Limerick, while in reality he had gone on to Ballyneety.\n", "school_info": "School: Curreeny, Dolla, Nenagh", "metadata": [{"Location:": "Curreeny, Co. Tipperary", "Teacher:": "\nJames Conlon\n"}, {"Language": "English"}]}, "4922147/4856419/5017287": {"title": "Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0537, Page 253", "Page 253"], "url": "https://www.duchas.ie/en/cbes/4922147/4856419/5017287", "text": "\nSome time ago when Sarsfield and his men were travelling through Ireland, they hid some gold in a place which they thought very safe.  One night while Sarsfield was hiding the gold one of my forefathers was looking at his cattle, he saw him hiding it in a two acre field south from my house.  The next night my forefather went out to the field where he saw Sarsfield hiding the gold.  The first thing he saw when he came near the place was a light.  A few nights after he went up to the place, he heard a terrible noise behind him, he looked back and saw a fierce bull behind him.  It was said that the bull was minding the gold.  So my forefather dug a little way but did not find the gold.\n", "school_info": "School: Béal Átha Gabhann (Silvermines), Nenagh", "metadata": [{"Location:": "Silvermines, Co. Tipperary", "Teacher:": "\nPádraig Ó Floinn\n"}, {"Collector": "Annie Gleeson", "Gender": "female", "Address": "Garryard East, Co. Tipperary"}, {"Informant": "Mr William Gleeson", "Relation": "parent", "Gender": "male", "Age": "52", "Address": "Garryard East, Co. Tipperary"}, {"Language": "English"}]}, "4922168/4857925/5019057": {"title": "Scotch Clan", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0542, Page 364", "Page 364"], "url": "https://www.duchas.ie/en/cbes/4922168/4857925/5019057", "text": "\n(continued from previous page)\nand  that in that way it was Tipperarymen lost the Rebellion.Sarsfield is said to have passed here on his way to Ballyneety. There is a well on the old Road Kilcommon to Hollyford known to this day as Sarsfield’s Well. There is a tradition that he watered his horses there on his way to Ballyneety.\n\n\n\nHoly WellsOf these there is no example in the area. The only one which might have been some time regarded as one is the present Parochial Well. There is a tradition that it dates to the Benedictine Monks 1184. I can find no trace of its waters ever having been used for other than household purposes.\n", "school_info": "School: Cill Chuimín, Durlas Éile", "metadata": [{"Location:": "Kilcommon, Co. Tipperary", "Teacher:": "\nDonnchadh Ó Cuinnéain\n"}, {"Language": "English"}]}, "4922303/4868607/5054219": {"title": "The Wren Song", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0581, Page 209", "Page 209"], "url": "https://www.duchas.ie/en/cbes/4922303/4868607/5054219", "text": "\nThe Wren, The Wren the king of all birdsSt. Stephen's day she was caught on the furzeAlthough she was little her family was greatRise up lan laddy and give us a trateWe're following this wren all day, all day.Through mucky water and yellow clayFrom bush, to bush, from tree to tree.Against Corrigeen Rock I broke my knee.Up with the kettle and down with the pan. Give us our answer and let us be gone. Give us the money and keep the beer, and I wish your all happy New YearIf your money is slack, give us a slice of Barm Brack.Up with the kettle and down with the pan.Give us our answer and let us be gone.\n", "school_info": "School: Eatharlach (Aherlow)", "metadata": [{"Location:": "Aherlow, Co. Tipperary", "Teacher:": "\nÉnrí Mac Eochaidh\n"}, {"Collector": "Pat Noonan", "Gender": "male", "Address": "Stonepark, Co. Tipperary"}, {"Language": "English"}]}, "4922304/4868668/5054452": {"title": "Stories About Sarsfield", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0581, Page 269", "Page 269"], "url": "https://www.duchas.ie/en/cbes/4922304/4868668/5054452", "text": "", "school_info": "School: Cullen, Tiobraid Árann", "metadata": [{"Location:": "Cullen, Co. Tipperary", "Teacher:": "\nSeosamh Mainséal\n"}, {"Informant": "Michael Neligan", "Gender": "male", "Age": "77", "Address": "Cullen, Co. Tipperary"}, {"Language": "English"}]}, "4922304/4868669/5054459": {"title": "Stories About Sarsfield", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0581, Page 270", "Page 270"], "url": "https://www.duchas.ie/en/cbes/4922304/4868669/5054459", "text": "", "school_info": "School: Cullen, Tiobraid Árann", "metadata": [{"Location:": "Cullen, Co. Tipperary", "Teacher:": "\nSeosamh Mainséal\n"}, {"Informant": "Edward Griffin", "Gender": "male", "Address": "Cullen, Co. Tipperary"}, {"Language": "English"}]}, "4922304/4868670/5054460": {"title": "Stories About Sarsfield", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0581, Page 271", "Page 271"], "url": "https://www.duchas.ie/en/cbes/4922304/4868670/5054460", "text": "", "school_info": "School: Cullen, Tiobraid Árann", "metadata": [{"Location:": "Cullen, Co. Tipperary", "Teacher:": "\nSeosamh Mainséal\n"}, {"Language": "English"}]}, "4922169/4858050/5130191": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0543, Page 075", "Page 075"], "url": "https://www.duchas.ie/en/cbes/4922169/4858050/5130191", "text": "\nIt is said that when the Cromwellians were about to take possession of Borris Castle that the Burkes hid all their gold in room deep in the Castle. They killed six of their servants who were sworn to mind the treasure dead or alive which probably lies there to this day. The Burkes were also good soldiers and fighters. One of the Pallas family was with Sarsfield at Ballynetty and when the convoy was captured each soldier got as much gold as he could raise in one hand. Burke took off his boot and filled it with the gold. He parted company with the main army and came back by Inch-a-valla where he hid the gold and had such a swift horse that he was able to rejoin the party before they reached Limerick. When Burke came for the gold he could not find it and it is said that the treasure lies there to this day.\n", "school_info": "School: Garrdha na Cailce (Garnakilla)", "metadata": [{"Location:": "Garranakilka, Co. Tipperary", "Teacher:": "\nSéamus Ó Riain\n"}, {"Informant": "Bridie Bourke", "Gender": "female", "Age": "17", "Address": "Shevry, Co. Tipperary"}, {"Language": "English"}]}}