{"4427832/4348441/4434363": {"title": "Séaghan na Sagart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0095, Page 1", "Page 1"], "url": "https://www.duchas.ie/en/cbes/4427832/4348441/4434363", "text": "\nThere lived in Ballyheane a man named John Mollowney. When John was a young man he was a horse stealer. In those days it was a hanging crime to steal a horse.The hangman who was named Bingham lived in Newbrook.Bingham heard of John and was going to hang him but he changed his mind and gave him the job of priest hunting.Every priest that John would kill he was to cut the head off him and to bring it to Bingham. Bingham would give him a reward of five pounds for it.Bingham would give back the head to John and John would throw it into a lake. This lake is now called Lochán na Gceann. It is near Aille, within a few hundred yards of the road going from here to Westport.\n(continues on next page)\n", "school_info": "School: Clochar", "metadata": [{"Location:": "Clogher, Co. Mayo", "Teacher:": "\nM. Ó Gealbháin\n"}, {"Collector": "Micheál Ó Gealbháin", "Gender": "male"}, {"Informant": "Pat Keaverey", "Relation": "grandparent", "Gender": "male", "Age": "80", "Address": "Ballintober, Co. Mayo"}, {"Language": "English"}]}, "4427866/4351988/4435439": {"title": "Seán na Sagart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0102, Page 208", "Page 208"], "url": "https://www.duchas.ie/en/cbes/4427866/4351988/4435439", "text": "\nSeán na Sagart was the name of a man who lived in Mayo a hundred years ago. In those days there was a law against the priests and anybody who would kill a priest would get five pounds. Seán na Sagart was killing a great many priests. One day there was a man going to be buried in Ballinrobe, and Seán na Sagart knew there would be a priest there, so he went to the funeral. When the priest was going home he followed him. The priest began to run across a bog where there were drains. When the priest was crossing a drain, Seán na Sagart threw a knife at him, but he missed it. The priest caught the knife, and threw it back at him, and killed him. He was buried at Ballintobbor, and some people say that a tree grew over the grave, and when it was a certain height, it grew down into the ground. Seán na Sagart's real name was John Moloney, and there was not a priest of that name in Ireland for a good while after-wards.\n", "school_info": "School: Sruthar (C.)", "metadata": [{"Location:": "Shrule, Co. Mayo", "Teacher:": "\nBríd, Bean Uí Éanacháin\n"}, {"Collector": "Máire Ní Mhaoláin", "Gender": "female", "Address": "Shrule, Co. Mayo"}, {"Informant": "Andy Kain", "Relation": "unknown", "Gender": "male", "Age": "65", "Address": "Shrule, Co. Mayo"}, {"Language": "English"}]}, "4427867/4352090/4435583": {"title": "Seán an tSagairt", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0102, Page 314", "Page 314"], "url": "https://www.duchas.ie/en/cbes/4427867/4352090/4435583", "text": "\nFadó, fadó i n-aimair an droch-shaogha bhí fear i n-a chómhnuidhe san Chill agus an t-ainm a tugtaí air An Brúnach.Bhí fear eile i n-a chómhnuidhe i nDún na Géige agus an t-ainm a bhí An Brúnach freisin.La amháin bhí \"Sean\" i ndidiah sagairt acht d'ionthigh and sagart uaidh. Chuaidh an sagart bocht go dtí Brúnach na h-Chille ag iarraidh air é shabhail, mar bhí sé i n-a Ghúistís. Acht céard a dhéanfadh An Brúnach acht é a chur isteach sa gcarráiste agus é a thabhair leis go dtí dún na Geige.Nuair a shroich sé Dún na Géige glaoidh sé ar \"Sheán an t-Sagairt\". Tháinic seisean amach as a theach fhéin agus dubhairt Brúnach na h-Chille leis; \"Seo sagart dhuit anois\".Nuair chuala \"Seán\" é sin bhí sé an ríméadach agus bhí sé ag braith ar an sagart a thabhairt leis nuair a dubhairt Brúnach na h-Chille leis; \"Stop, tóg  [?] do ghunna phíca agus fheachfa muid ce an\n(continues on next page)\n", "school_info": "School: Gleann Coirib", "metadata": [{"Location:": "Glencorrib, Co. Mayo", "Teacher:": "\nSeán Ó Hargadáin\n"}, {"Collector": "Tomás Ó Nuadháin", "Gender": "male", "Address": "Bunnafollistran, Co. Mayo"}, {"Informant": "(name not given)", "Relation": "grandparent", "Gender": "male", "Address": "Bunnafollistran, Co. Mayo"}, {"Language": "Irish"}]}, "4427834/4348587/4435590": {"title": "Old Sayings of the District", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0095, Page 229", "Page 229"], "url": "https://www.duchas.ie/en/cbes/4427834/4348587/4435590", "text": "\n(continued from previous page)\nA short visit is the best one.\n\n\n\nHis real name was John Malowney. He used to go around killing priests in the hard times.  He got five pounds for the head of every priest.  One day a man followed him with a knife and he lay down and pretended he wanted the priest.  When the priest came, he attacked him and took of his head and sold it.  There was a piece of poetry written over his grave:Here lies John the unruly manWho rebelled against rope and friarSuch another man never filled a graveOr such a notorious liarNo man of the name Malowney could be ordained a priest and so the name was\n(continues on next page)\n", "school_info": "School: Manulla", "metadata": [{"Location:": "Manulla, Co. Mayo", "Teacher:": "\nSeán Mac an Adhastair\n"}, {"Collector": "Patrick Masterson", "Gender": "male", "Address": "Manulla, Co. Mayo"}, {"Informant": "Patrick Masterson", "Gender": "male", "Age": "40", "Address": "Manulla, Co. Mayo"}, {"Language": "English"}]}, "4427835/4348717/4436150": {"title": "Seán na Sagart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0095, Page 346", "Page 346"], "url": "https://www.duchas.ie/en/cbes/4427835/4348717/4436150", "text": "\nAbout eighty years ago there lived in Ballintubber a notorious man named John Maloney but because he was always killing priests he was nicknamed \"Sean na Sagart\"For every priests head given to him -- he gave as a reward -- five pounds to those who committed the deed. He, Himself followed every priest who forgot to disguise himself before leaving his hideout and often he would disguise in female dress and would pretend to be the priests friend - for a time only. In those days the\n(continues on next page)\n", "school_info": "School: Manulla (Cailíní)", "metadata": [{"Location:": "Manulla, Co. Mayo", "Teacher:": "\nMáire Bairéad\n"}, {"Collector": "Teresa Murphy", "Gender": "female", "Address": "Manulla, Co. Mayo"}, {"Informant": "Mrs Murphy", "Gender": "female", "Age": "65", "Address": "Manulla, Co. Mayo"}, {"Language": "English"}]}, "4427880/4353977/4444622": {"title": "Seán na Sagart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0106, Page 576", "Page 576"], "url": "https://www.duchas.ie/en/cbes/4427880/4353977/4444622", "text": "", "school_info": "School: Gort an tSiúrdáin", "metadata": [{"Location:": "Gortjordan, Co. Mayo", "Teacher:": "\nSeán Ó Módhráin\n"}, {"Collector": "Mary Murphy", "Gender": "female", "Address": "Cahermaculick, Co. Mayo"}, {"Informant": "John Mellete", "Relation": "unknown", "Gender": "male", "Address": "Cahermaculick, Co. Mayo"}, {"Language": "English"}]}, "4427829/4348087/4455880": {"title": "Seán na Sagart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0094, Page 242", "Page 242"], "url": "https://www.duchas.ie/en/cbes/4427829/4348087/4455880", "text": "\nOnce upon a time there was a man who was cutting all the heads of all the priests.  There was one priest whom he could not catch because he was a good runner and he could jump any river wide or narrow.One day the man said that he was sick and that he wanted the priest to anoint him.  He had a sharp knife in the bed beside because he wanted to cut the head off the priest.  When the priest came into the house he saw a woman beside the fire and a child in her arms. The woman said in Irish \"Be careful he has a knife in the bed with which to cut off your head.\"  The priest knew Irish but the man did not.  The man jumped out of the bed but he tripped on something and the knife went from him and the priest got it and cut the head of the man.Bridie RowlandGortCastlebarI got this information from my mother Bridget Rowland\n", "school_info": "School: Grianán", "metadata": [{"Location:": "Greenans, Co. Mayo", "Teacher:": "\nMáiréad Bean Uí Riagáin\n"}, {"Collector": "Bridie Rowland", "Gender": "female", "Address": "Gort, Co. Mayo"}, {"Informant": "Bridget Rowland", "Relation": "parent", "Gender": "female"}, {"Language": "English"}]}, "4427829/4348088/4455881": {"title": "Seán na Sagart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0094, Page 243", "Page 243"], "url": "https://www.duchas.ie/en/cbes/4427829/4348088/4455881", "text": "\nLong ago in the penal time Sean a Sagart ran after a priest to kill him and to cut off his head and send it to England so that he would get five pounds for it.  They saw a man cutting turf.  The man gave a knife to the priest, they had a bank of turf to jump and when Sean was jumping it he jumped into a bog hold.  The priest stuck the knife through his body but they did not see the blood coming.  The man told the priest to take out the knife.  Sean a Sagart was buried at béal an tabar between Largan and Tirawley.Eight years after that a tree grew up out of the It kept growing for twenty years.  Then it turned down towards the ground again.  A cupla of years ago it rotted away.\n", "school_info": "School: Grianán", "metadata": [{"Location:": "Greenans, Co. Mayo", "Teacher:": "\nMáiréad Bean Uí Riagáin\n"}, {"Collector": "Eillie Gibbons", "Gender": "female", "Address": "Gort, Co. Mayo"}, {"Informant": "Owen Mac Cormack", "Relation": "grandparent", "Gender": "male"}, {"Language": "English"}]}, "4427810/4346121/4458793": {"title": "In Penal Times - Seán an tSagairt", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0090, Page 058", "Page 058"], "url": "https://www.duchas.ie/en/cbes/4427810/4346121/4458793", "text": "\nSean a' sagart was a noted priest - hunter.His real name was John Molloney and he lived his sister near Ballintubber a few miles from here.He used to get five pounds for every priests head from the English and he also used to kill monks and nuns. One day Seán told his sister he was dying and to go for the priest.She went to the middle - aged priest at the (Abby) Abbey and told him to go to him.The priest got ready and went first to a young priest to tell him he was going. The young priest said \"I will go instead because if there is any danger I will be able to run faster than you\". When Seán got his sister gone he got the knife ready and went back to bed again. When the priest entered the room Sean jumped out of the bed and made for the priest with the knife and the priest ran till he came to a river which he could not cross and he turned back on Sean. The priest caught hold of him and knocked him. There was a beggar man coming along and he told the priest to hold Sean till he would cut his head off. So he cut the head of and that was the end of Sean a' Sagairt. He was buried in Ballintobber graveyard and white thorn bush grew over his grave and it grew down to the ground again and withered.\n", "school_info": "School: Errew (Mainistir)", "metadata": [{"Location:": "Errew, Co. Mayo", "Teacher:": "\nAn Br Ó Broin\n"}, {"Language": "English"}]}, "4427811/4346158/4458840": {"title": "Seán na Sagart - The Priest-Hunter", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0090, Page 095", "Page 095"], "url": "https://www.duchas.ie/en/cbes/4427811/4346158/4458840", "text": "\n95\"Sean na Sagart\":- The Priesthunter\"Sean na Sagart\" was a priest who lived in Ballyheane during the penal days. His real name was John Mallowney. And tho' born and reared a Catholic he became a terror to the Catholicks and priests of this district. He was employed as a priesthunter by Bingham of Newbrook house. This house is now in ruins. Sean got £5 for every priests head and £2:10 for a teacher's head. He threw all the heads into a small lake called \"Locán na gCeann\" which is near Killawalla midway between Ballyglass and Westport in the parish of Carnacon.Sean lived in Ballyheane and his sister Nancy was married to a man named Loftus who lived in Ballintubber. Sean heard that there were two priests hiding in Ballintubber. He went to visit his site Nancy so that he might an opportunity to kill them. A few days after his\n(continues on next page)\n", "school_info": "School: Cnoc Aoibhinn (Mount Pleasant)", "metadata": [{"Location:": "Mountpleasant, Co. Mayo", "Teacher:": "\nPeadar Ó Longáin\n"}, {"Collector": "John Burke", "Gender": "male", "Address": "Carrowhall, Co. Mayo"}, {"Informant": "Michael Looskan", "Gender": "male", "Age": "65", "Address": "Rathnacreeva, Co. Mayo"}, {"Language": "English"}]}, "4427812/4346257/4458931": {"title": "A Priest-Hunter - Seán na Sagart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0090, Page 194", "Page 194"], "url": "https://www.duchas.ie/en/cbes/4427812/4346257/4458931", "text": "\n\"Seán na Sagart\" was a priesthunter who lived in Mayo during the penal days. His real name was John Mallowney. He was employed as a priesthunter by Bingham of Newbrook house. This house is now in ruins. Seán got £5 for every priest's head and £2..10' for a teacher's head. He threw all the heads into a small lake called \"Locán na gCeann\" which is near\n(continues on next page)\n", "school_info": "School: Cnoc Aoibhinn (Mount Pleasant) (C.)", "metadata": [{"Location:": "Mountpleasant, Co. Mayo", "Teacher:": "\nBean Mhic Géaraidh\n"}, {"Collector": "Eileen Prendergast", "Gender": "female", "Address": "Ballyglass, Co. Mayo"}, {"Informant": "Michael Looskan", "Gender": "male", "Address": "Rathnacreeva, Co. Mayo"}, {"Language": "English"}]}, "4427943/4360034/4462789": {"title": "The Penal Times - Seán na Sagart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0120, Page 95", "Page 95"], "url": "https://www.duchas.ie/en/cbes/4427943/4360034/4462789", "text": "\nSeán na Sagart was a priest hunter.  He got five pounds for a priest.  Once he failed to get a priest anywhere.  He had a sister who was a great Catholic. He went to her house and said he was feeling sick and that he would give anything to her if she would get a priest to hear his confession after all the bad deeds he had done.  His sister told he she would get a priest for him if he promised her that if he got better he would never do anything bad to a priest again.  Seán na Sagart was not sick at all, he was only waiting for the priest to come until he would kill him.  So his sister sent for the priest thinking Seán  was dying.  The priest came; Seán was waiting for him\n(continues on next page)\n", "school_info": "School: Loughkeeren", "metadata": [{"Location:": "Knockatemple, Co. Mayo", "Teacher:": "\nAnna M. Warde\n"}, {"Collector": "Teresa Hyland", "Gender": "female", "Address": "Loughkeeraun Well, Co. Mayo"}, {"Language": "English"}]}, "4427960/4361022/4465518": {"title": "Seán na Sagart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0123, Page 249", "Page 249"], "url": "https://www.duchas.ie/en/cbes/4427960/4361022/4465518", "text": "\nA long time ago during the religious war the priests were not allowed to say Mass. A certain man by the name of Jack Maloney was very much against priests and he murdered every one he would catch.At that time five pounds was the price of a priest's head and Jack was getting rich very quickly.When Jack died he was laid in the coffin and the coffin was laid in the hearse. Two of Jack's best horses were yoked to the hearse but they could not move it; they yoked two others but it was all in vain. When all failed someone proposed to send for the priest who lived some distance away. The Priest arrived, took out his prayer book and began to read aloud.To the wonder and surprise of the people looking on, four enormous rats rushed from the coffin and disappeared.The hearse was then easily drawn and Jack was buried without any more trouble.Ever afterwards the people called Jack \"Seán na Sagart\"\n", "school_info": "School: Culleens", "metadata": [{"Location:": "Cullin, Co. Mayo", "Teacher:": "\nJs. P. Rowley\n"}, {"Collector": "Teresa Mulroy", "Gender": "female", "Address": "Laghtmacdurkan, Co. Mayo"}, {"Informant": "Martin Mulroy", "Gender": "male", "Age": "59", "Address": "Laghtmacdurkan, Co. Mayo"}, {"Language": "English"}]}, "4427963/4361424/4466593": {"title": "Seán an tSagairt", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0124, Page 302", "Page 302"], "url": "https://www.duchas.ie/en/cbes/4427963/4361424/4466593", "text": "", "school_info": "School: Páirc na Cille", "metadata": [{"Location:": "Boherhallagh, Co. Mayo", "Teacher:": "\nP. Ó Tóláin\n"}, {"Collector": "Máire Ní Níoláin", "Gender": "female"}, {"Informant": "Micheál Ó Níoláin", "Gender": "male", "Address": "Larganmore, Co. Mayo"}, {"Language": "Irish"}]}, "4427963/4361426/4466595": {"title": "Scéal Eile Faoi Shéan an tSagairt", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0124, Page 304", "Page 304"], "url": "https://www.duchas.ie/en/cbes/4427963/4361426/4466595", "text": "", "school_info": "School: Páirc na Cille", "metadata": [{"Location:": "Boherhallagh, Co. Mayo", "Teacher:": "\nP. Ó Tóláin\n"}, {"Collector": "Máire Ní Níoláin", "Gender": "female"}, {"Informant": "Micheál Ní Níoláin", "Gender": "male", "Address": "Larganmore, Co. Mayo"}, {"Language": "Irish"}]}, "4427971/4362406/4466797": {"title": "Seaghán na Sagart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0126, Page 532", "Page 532"], "url": "https://www.duchas.ie/en/cbes/4427971/4362406/4466797", "text": "\nFadó bhí fear ann agus bhí ag marbughadh na sagart agus bhí na sasnaigh ag tabiairt cúig púine dhó ar gach Sagart ar mharbhuig sé agus tugad Seaghán na Sagart air.Bhí searbhfhoghantaidhe aige agus uair amháin bhí an bhuachaill agu dul ar Aifreann agus tháinig bord agus paca cartai air rosmhe agus bean in-a suidhe ag an mbord. Nuair tháinig sé cómh fada lai d'íarr sí air suidhesíos agus cluiche a imirt lei. Dhubhairt sé go raibh sé ag dul ar Aifreann agus dubhairt sí leis; \"Níl duine ar bith ins an séipéil go póill, tá séna daoine ag teacht abhaile dubhairt sé go gcaithfheadh sé dul abhaile agus nuair dpéac sé uirri bhí rópa ar a ceann. Chuaidh sé abhaile agus bhí sí leis i ngach áit a ndeachaidh sé.Chuaidh sé go drí an sagart agus dubairt seisin go gcaithfeadh dul chuig an easbog. Chuaidh sé agus dubhairt an an t-Pasbog go gcaithfeadh sé dul go dtí an Papa. Nuair a chaidh sé thúg an Pápa litir dhó chun tabhairt chuig an diabail ag geata Ifrinn. Chuaidh sé go dtí an\n(continues on next page)\n", "school_info": "School: Corr Odhar", "metadata": [{"Location:": "Corrower, Co. Mayo", "Teacher:": "\nAibhistín Ó Coinnigh\n"}, {"Collector": "Pádhruig Ó Náraidhe", "Gender": "male", "Address": "Cartron, Co. Mayo"}, {"Informant": "Bean Uí Náraidhe", "Gender": "female", "Age": "82", "Address": "Cartron, Co. Mayo"}, {"Language": "Irish"}]}, "4427985/4364350/4466977": {"title": "Amhrán - Seán an tSagairt", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0130, Page 34", "Page 34"], "url": "https://www.duchas.ie/en/cbes/4427985/4364350/4466977", "text": "", "school_info": "School: Gleann Caisil", "metadata": [{"Location:": "Glencastle, Co. Mayo", "Teacher:": "\nAntoine Ó Donnchadha\n"}, {"Collector": "Mártan Ó Giobúin", "Gender": "male", "Address": "Atticonaun, Co. Mayo"}, {"Informant": "Micheál Ó Giobúin", "Relation": "unknown", "Gender": "male", "Address": "Atticonaun, Co. Mayo"}, {"Language": "Irish"}]}, "4428052/4372612/4475868": {"title": "Seán na Sagart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0146, Page 543", "Page 543"], "url": "https://www.duchas.ie/en/cbes/4428052/4372612/4475868", "text": "\nThere was an old man called Séán na Sagape. He was a priest hunter. The Ormsby's of Runagry used to give this old villain five pounds for every priests head he would bring to them. He was going around the country. Whatever, he happened to come to this village and all the people were in terror of him. So he got lodgings in this house and after he went to bed he started to roar with pain and call for the priest that he was dying. So the people of the house thought it right to send for the priest to anoint him. So the priest came and when he did he thought the man was dying. He went to hear his confessions and whenever he did, he jumped up and caught the priest by the neck and tried to kill him. The poor priest got away. He was following the priest an trying to get him. There was an old beggar man that used to go from house to house on the scene, so he made for Seán and crossing a fence he pulled the knife off him and stabbed Seán and killed him. So that put an end to\n(continues on next page)\n", "school_info": "School: Béal Átha 'n Fheadha (B.)", "metadata": [{"Location:": "Ballina, Co. Mayo", "Teacher:": "\nD. P. Ó Cearbhaill\n"}, {"Collector": "Vincent Ginty", "Gender": "male", "Address": "Ardnaree or Shanaghy, Co. Mayo"}, {"Informant": "Thomas Kilgallon", "Gender": "male", "Address": "Ardnaree or Shanaghy, Co. Mayo"}, {"Language": "English"}]}, "4498081/4351246/4502405": {"title": "Seán na Sagart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0101, Page 009", "Page 009"], "url": "https://www.duchas.ie/en/cbes/4498081/4351246/4502405", "text": "", "school_info": "School: Scoil na mBráthar, Baile ‘n Ródhba", "metadata": [{"Location:": "Ballinrobe, Co. Mayo", "Teacher:": "\nM. A. Ó Mathghamhna\n"}, {"Informant": "Paitsín Ó Cadhain", "Gender": "male", "Address": "Ballinrobe, Co. Mayo"}, {"Language": "Irish"}]}, "4498081/4351253/4502420": {"title": "Seán na Sagart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0101, Page 016", "Page 016"], "url": "https://www.duchas.ie/en/cbes/4498081/4351253/4502420", "text": "", "school_info": "School: Scoil na mBráthar, Baile ‘n Ródhba", "metadata": [{"Location:": "Ballinrobe, Co. Mayo", "Teacher:": "\nM. A. Ó Mathghamhna\n"}, {"Informant": "Mrs T. Glynn", "Gender": "female", "Address": "Ballinrobe, Co. Mayo"}, {"Language": "Irish"}]}, "4427830/4348142/4507890": {"title": "Seán na Sagart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0094, Page 291", "Page 291"], "url": "https://www.duchas.ie/en/cbes/4427830/4348142/4507890", "text": "\nWhen Sean a Sagart grew too old to kill priests, he tried another plan.  One day he let on that he was dying, he told his sister to get him a priest, she said she wouldn't, because he would kill him.  He promised her that he would not.  So she began to make his bed she stole the sword from under his pillow.  So she sent a mesenger for the priest.  When he arrived, Sean jumped out of the bed, he began to search under his pillow for the sword.  When the sister saw this she shouted to the priest to run for his life.  The priest ran and Sean after him. He kept runing until he came to this drain and he tripped.  There happened to be a begger passing and he took a big stick and killed him.  He is berried in Ballintubber Abbey.  A  boltree bush grew on his grave.  It drooped down into his grave in the form of a horse shoe, that is the last of Sean na sagart.\n", "school_info": "School: Belcarra (Buachaillí)", "metadata": [{"Location:": "Ballycarra, Co. Mayo", "Teacher:": "\nSeosamh Ó Heireamhóin\n"}, {"Collector": "Charles A. Daly", "Gender": "male", "Address": "Ballycarra, Co. Mayo"}, {"Language": "English"}]}, "5215809/5213932/5221619": {"title": "Sean na Sagart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137F, Page 03_019", "Page 03_019"], "url": "https://www.duchas.ie/en/cbes/5215809/5213932/5221619", "text": "\nSean na Sagart was a bad cruel man that was working for a man named Bingham in Castlebar. He was hated by all the people of that time. He used to go about killing priests and schoolmasters When he had them killed he used to bring their heads to Castlebar for his money.Bingham used to give him £5 for a priest's head and he'd get £3 for a schoolmaster's head.He'd take them then to a little lake outside Ballinrobe and bury them there.\n", "school_info": "School: Lankill", "metadata": [{"Location:": "Lankill, Co. Mayo", "Teacher:": "\nSeán Ó Cibhil\n"}, {"Collector": "Nora O Boyle", "Gender": "female", "Address": "Ballyballinaun, Co. Mayo"}, {"Informant": "Timothy O Boyle", "Gender": "male", "Address": "Ballyballinaun, Co. Mayo"}, {"Language": "English"}]}, "5215809/5214074/5221683": {"title": "Death of Seán na Sagart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137F, Page 05_056", "Page 05_056"], "url": "https://www.duchas.ie/en/cbes/5215809/5214074/5221683", "text": "\nIn the Penal days when the priest used to get killed for saying mass there was a priest named Father O Malley who lived near Ballintubber and who used to say mass out in the mountains. One day Seán na Sagart came riding on his big horse. The priest saw him coming and he got his own horse and he galloped off. There was a very big river and the priest had to cross it before he would be caught. Seán na Sagart was very close on him by this time. The priest's horse jumped the  river and was across the other side Seán na Sagart's\n(continues on next page)\n", "school_info": "School: Lankill", "metadata": [{"Location:": "Lankill, Co. Mayo", "Teacher:": "\nSeán Ó Cibhil\n"}, {"Collector": "Mary Keane", "Gender": "female", "Address": "1419645"}, {"Informant": "Mr Hugh Keane", "Gender": "male", "Address": "1419645"}, {"Language": "English"}]}, "5215809/5214363/5221789": {"title": "Seán na Sagart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137F, Page 09_018", "Page 09_018"], "url": "https://www.duchas.ie/en/cbes/5215809/5214363/5221789", "text": "\nIn the penal days the priests used not be allowed to say mass in their churches.  Sometimes they used to say mass out by rocks in the mountains and other times they used to have a secret hut built for themselves to read mass in.A very bad man who lived at that time was a man called Seán na Sagart who used to kill priests.  He used to go to bed and pretend he was sick and send for a priest.  He used to have his sword inside him in the bed and when the priest would come he would kill him with it.He killed many priests\n(continues on next page)\n", "school_info": "School: Lankill", "metadata": [{"Location:": "Lankill, Co. Mayo", "Teacher:": "\nSeán Ó Cibhil\n"}, {"Collector": "Michael Lavelle", "Gender": "male", "Address": "Cordarragh North, Co. Mayo"}, {"Language": "English"}]}, "5215813/5214827/5237391": {"title": "Seán na Sagart - Penal Days", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138D, Page 05_039", "Page 05_039"], "url": "https://www.duchas.ie/en/cbes/5215813/5214827/5237391", "text": "\nThere was a man called Mulowney. He had a nick name Seán na Sagart. He used be always following priests and killing them. He used get £5 from the English for every priest’s head. One time he was in his sister’s house and he let on he was dying and he told her to send for the priest. She asked him was (he) it going on with his devilment and he said “no”. There was two priest in the place, one was young, the other was old. The young priest said he would got [?] but the old priest said he would because Seán\n(continues on next page)\n", "school_info": "School: St Bridget's", "metadata": [{"Location:": "Derrymore, Co. Mayo", "Teacher:": "\nMáire Uí hOistín\n"}, {"Collector": "Seán M. Ó hOistín", "Gender": "male"}, {"Language": "English"}]}, "5215813/5214976/5237797": {"title": "Sean na Sagart - Penal Times", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0138D, Page 08_034", "Page 08_034"], "url": "https://www.duchas.ie/en/cbes/5215813/5214976/5237797", "text": "\nThere was a man in Co. Mayo called Mulowney. They had a neck name on him Sean na Sagart.He used to be going around after the priests to kill them. He used to get £5 for every priests head. There is a place over in Seanbhaile beag hill called Cathaoir an Easbuigh. And every place he used to go he used to leave a course. The course was that their would be no children in that place. When he died he was buired in Ballintobar and a strange three grew over\n(continues on next page)\n", "school_info": "School: St Bridget's", "metadata": [{"Location:": "Derrymore, Co. Mayo", "Teacher:": "\nMáire Uí hOistín\n"}, {"Collector": "Tomás Ó Tónra", "Gender": "male"}, {"Language": "English"}]}, "5236078/5218023/5240371": {"title": "Seán na Sagart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0088E, Page 02_005", "Page 02_005"], "url": "https://www.duchas.ie/en/cbes/5236078/5218023/5240371", "text": "\nDuring the Penal Laws there was a price on every priests head. There used to be people killing them and getting five pounds for their heads. Seán na Sagart used to kill the priests and get money for their heads. Séan hadn't any priests killed once and he made up a plan. He told his old sister he was dying and asked her to get a priest for him. His sister was a very pious old lady and she was glad to see him repenting his sins. She went for a priest and there was an old priest and a young priest in the place. The old priest said he would go that he was the wisest. The young priest said he would go that he was the quickest runner. But the old priest insisted on going and the young priest followed him. When he came as far as Séans\n(continues on next page)\n", "school_info": "School: Achadh Fobhair", "metadata": [{"Location:": "Aghagower, Co. Mayo", "Teacher:": "\nHannah T. Kevilla\n"}, {"Collector": "Agnes Noonan", "Gender": "female"}, {"Language": "English"}]}, "5236078/5218084/5240442": {"title": "Seán na Sagart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0088E, Page 03_033", "Page 03_033"], "url": "https://www.duchas.ie/en/cbes/5236078/5218084/5240442", "text": "\nSeán na Sagart was a man who was paid by the government for every priest he killed. He got five pounds for every priest's head. The government got displeased with him because they thought he was not killing enough of priests. Seán thought of a plan to kill the priests in the parish. He stayed in bed one day and told his wife that he was very ill. He sent for one of the priests of the parish. The parish priest went to Seán's house and the curate went after him. When the parish priest went in Seán killed him. When the curate heard the roaring he ran and Seán followed him. They came to a river and the curate jumped across but Seán was not able to jump across. He threw his spear across at the curate but the spear missed the curate. The curate then took up\n(continues on next page)\n", "school_info": "School: Achadh Fobhair", "metadata": [{"Location:": "Aghagower, Co. Mayo", "Teacher:": "\nHannah T. Kevilla\n"}, {"Collector": "Martin Sheridan", "Gender": "male", "Address": "Aghagower, Co. Mayo"}, {"Language": "English"}]}, "5236078/5218175/5240648": {"title": "Seán na Sagart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0088E, Page 06_015", "Page 06_015"], "url": "https://www.duchas.ie/en/cbes/5236078/5218175/5240648", "text": "\nLong ago in the Penal Days priests were not allow to said mass in churches. The English Government paid men to kill the priests and for every priests head they got five pounds. There was a man in this district whose name was Seán a Sagart who whas paid for killing priest The Government was not satisfied with him when he was not getting more priest's heads for them and one day he thought of a plan. He told his wife that he was going to die and he wished to see the priest His wife went to the nearest priest When the parish priest came into his room he killed him and the curate waited outside the house. He ran\n(continues on next page)\n", "school_info": "School: Achadh Fobhair", "metadata": [{"Location:": "Aghagower, Co. Mayo", "Teacher:": "\nHannah T. Kevilla\n"}, {"Collector": "Thomas Reilly", "Gender": "male", "Address": "Lackaun, Co. Mayo"}, {"Language": "English"}]}, "5236078/5218204/5240691": {"title": "Seán na Sagart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0088E, Page 07_021", "Page 07_021"], "url": "https://www.duchas.ie/en/cbes/5236078/5218204/5240691", "text": "\nSeán na Sagart was a man who was paid by the English for killing priests. The English used to give Seán five pounds for every priest's head he used to give them. One day Seán followed a priest and the priest ran as fast as he could. There was a beggar man passing by and he told the priest to stand and the priest got courage. Seán fired his knife and it stuck in the heel of the priest's shoe. The priest turned around and he took the knife and Seán na Sagart and the priest caught each other and the priest knocked him down. The priest would not have killed Seán na Sagart but for the beggar\n(continues on next page)\n", "school_info": "School: Achadh Fobhair", "metadata": [{"Location:": "Aghagower, Co. Mayo", "Teacher:": "\nHannah T. Kevilla\n"}, {"Collector": "Thomas O Malley", "Gender": "male", "Address": "Lackaun, Co. Mayo"}, {"Language": "English"}]}, "5236078/5218230/5240713": {"title": "Giants", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0088E, Page 08_020", "Page 08_020"], "url": "https://www.duchas.ie/en/cbes/5236078/5218230/5240713", "text": "\nThere were two giants in Murrish and they lived in a small house. They used to go out fighting every day. They used to take a big rock in their hands and break it. They used to kill the people and eat them. When they died they put a big rock over them\n\n\n\nThere was a man once and he used to kill priests. One day he told his wife that he was dying. His wife told the priest to come to anoint him. There was a parish priest and a curate in the parish. The curate said he would but the parish priest would not let him. When the parish priest was gone the curate followed him. When the parish priest went into the house\n(continues on next page)\n", "school_info": "School: Achadh Fobhair", "metadata": [{"Location:": "Aghagower, Co. Mayo", "Teacher:": "\nHannah T. Kevilla\n"}, {"Collector": "Mary Reilly", "Gender": "female", "Address": "Lackaun, Co. Mayo"}, {"Language": "English"}]}, "5236078/5218232/5240722": {"title": "Giant", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0088E, Page 08_022", "Page 08_022"], "url": "https://www.duchas.ie/en/cbes/5236078/5218232/5240722", "text": "\nThere was a giant who lived on a tree. He used to eat dogs and people. When he used to be hungry he used to come down. There was a son and his mother living in a house and they were afraid he would kill them. The boy went up on the tree and he got him sleeping and killed him.\n\n\n\nOne day Seán na Sagart was searching for priests. There were three or four priests saying mass on the hill side and a number of people round them. When he was coming near one of the priests the priest flung a knife and it stuck in him and a beggar was passing by and he told the priest to pull the knife and he pulled the knife and all his blood came\n", "school_info": "School: Achadh Fobhair", "metadata": [{"Location:": "Aghagower, Co. Mayo", "Teacher:": "\nHannah T. Kevilla\n"}, {"Collector": "Mary Reilly", "Gender": "female", "Address": "Lackaun, Co. Mayo"}, {"Language": "English"}]}, "5236078/5218253/5240755": {"title": "Seán na Sagart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0088E, Page 09_010", "Page 09_010"], "url": "https://www.duchas.ie/en/cbes/5236078/5218253/5240755", "text": "\nThere lived a man named Seán na Sagart. He was paid by the English to kill priests and for every priest's head he got five pounds. One day he said to his mother he was very ill and he told her to bring him the priest. She went for the priest and the priest said he would come. The curate told the parish priest not to go he was too old. The parish priest went and the curate followed him. When he went into the house the woman told him the patient was in the room. When he went up Seán na Sagart got his spear and killed him. He followed the curate and he came to a river and he threw the spear to strike the priest but it failed to strike the priest who got it and killed Seán. There is a tree growing over\n(continues on next page)\n", "school_info": "School: Achadh Fobhair", "metadata": [{"Location:": "Aghagower, Co. Mayo", "Teacher:": "\nHannah T. Kevilla\n"}, {"Collector": "Sadie Gibbons", "Gender": "female", "Address": "Corveagh Upper, Co. Mayo"}, {"Language": "English"}]}, "5236078/5218254/5240757": {"title": "Seán na Sagart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0088E, Page 09_011", "Page 09_011"], "url": "https://www.duchas.ie/en/cbes/5236078/5218254/5240757", "text": "\n(continued from previous page)\nSeán's grave and the leaves curled and grew down into the ground on the other side to prevent anybody from kneeling on his grave.\n\n\n\nOne day Seán was looking for priests and he came to a mountain. He saw four priests saying mass and people around them. When Séan came near them the priest threw the knife and it stuck in Seáns chest. A beggar was passing and he told the priest to pull it out again. He pulled out the knife again and the blood came and Seán died immediately\n", "school_info": "School: Achadh Fobhair", "metadata": [{"Location:": "Aghagower, Co. Mayo", "Teacher:": "\nHannah T. Kevilla\n"}, {"Collector": "Sadie Gibbons", "Gender": "female", "Address": "Corveagh Upper, Co. Mayo"}, {"Language": "English"}]}, "5236078/5218300/5240829": {"title": "Sean na Sagart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0088E, Page 10_024", "Page 10_024"], "url": "https://www.duchas.ie/en/cbes/5236078/5218300/5240829", "text": "\nThere was once a man named Seán na Sagart and he was paid by the government for every priest's head he brought it. There was one priest whom he could not get, so he made up a plan. He said to his wife that he was sick and told her to go for the priest. When the woman arrived at the priest's house the curate wanted to go instead of the other priest but the other priest would not let him go. Then the curate followed the parish priest. When they arrived at the house the parish priest went in and Seán na Sagart killed him. When the curate heard the roaring inside he made off running and Seán na Sagart followed him. It was not long until they came to a river Seán Sagart's spear fell\n(continues on next page)\n", "school_info": "School: Achadh Fobhair", "metadata": [{"Location:": "Aghagower, Co. Mayo", "Teacher:": "\nHannah T. Kevilla\n"}, {"Collector": "Jack Sheridan", "Gender": "male", "Address": "Aghagower, Co. Mayo"}, {"Language": "English"}]}, "5236078/5218339/5240918": {"title": "Seán na Sagart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0088E, Page 11_018", "Page 11_018"], "url": "https://www.duchas.ie/en/cbes/5236078/5218339/5240918", "text": "\nSeán na Sagart used to be killing all the priests he could and he used to get five pounds for every priest's head. The goverment was not satisfied with him because he was not killing more priests so he thought of a plan to kill the priest of the parish. He said to his wife one day that he was going to die and he told her to go for the priest. When he came Seán jumped out of bed and followed him with a spear. The priest was a good supple man and he got away. There was a man lying under a bank. Seán fired his spear at the priest and it stuck in the bank. Sean tripped and fell and they jumped ontop of him and killed him. He was buried in Ballintubber and there is a big tree growing over his grave.\n", "school_info": "School: Achadh Fobhair", "metadata": [{"Location:": "Aghagower, Co. Mayo", "Teacher:": "\nHannah T. Kevilla\n"}, {"Collector": "James Noonan", "Gender": "male", "Address": "Aghagower, Co. Mayo"}, {"Language": "English"}]}, "5236078/5218363/5240950": {"title": "Seán na Sagart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0088E, Page 12_016", "Page 12_016"], "url": "https://www.duchas.ie/en/cbes/5236078/5218363/5240950", "text": "\nSeán na Sagart used to behead priests. He used to get five pounds for the priests heads. The priests used to go in backward places to say mass. He sent his wife for the parish priest and when the parish priest came into the room he killed him. The curate was outside watching and Seán na Sagart followed the curate and his knife fell. The priest got it and fired it at Seán na Sagart and killed him.\n", "school_info": "School: Achadh Fobhair", "metadata": [{"Location:": "Aghagower, Co. Mayo", "Teacher:": "\nHannah T. Kevilla\n"}, {"Collector": "Thomas Derrig", "Gender": "male", "Address": "Mountbrown, Co. Mayo"}, {"Language": "English"}]}, "5236078/5218396/5240993": {"title": "Giants", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0088E, Page 13_017", "Page 13_017"], "url": "https://www.duchas.ie/en/cbes/5236078/5218396/5240993", "text": "\n(continued from previous page)\ncame to the prince's house and the prince was standing before the giant and he cut the head off the giant with a sword and buried him under two rocks\n\n\n\nThere was a man once and he used to kill priests. One day he told his wife that he was dying. His wife told the priest to come and anoint him. There was a parish priest and curate in the place. The curate said he would go but the parish priest would not let him. When the parish priest was gone the curate followed him. When the priest went into the room Seán killed him. He came out then and followed the curate and when he was crossing a river he flung a\n(continues on next page)\n", "school_info": "School: Achadh Fobhair", "metadata": [{"Location:": "Aghagower, Co. Mayo", "Teacher:": "\nHannah T. Kevilla\n"}, {"Collector": "Jack Reilly", "Gender": "male", "Address": "Lackaun, Co. Mayo"}, {"Language": "English"}]}, "5236078/5218425/5241064": {"title": "Marriages", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0088E, Page 14_019", "Page 14_019"], "url": "https://www.duchas.ie/en/cbes/5236078/5218425/5241064", "text": "\n(continued from previous page)\nand round their waists and they have their faces covered with something so that they would not be known. There is a captain over them and he has them numbered. When they go into the house they wish the married couple luck and prosperity. The captain makes a speech and then he calls each strange boy on turn to sing or dance. If they dont get tea or porter or whiskey or if they are insulted they will go outside and do some damage outside\n\n\n\nOnce upon a time there was a man and his name was Séan na Sagart. He used to kill priests and give the heads of the priests to the government. One time he was short of money and he could not get any priests to kill and he thought of a plan. He told his sister that he was dying and asked her to bring\n(continues on next page)\n", "school_info": "School: Achadh Fobhair", "metadata": [{"Location:": "Aghagower, Co. Mayo", "Teacher:": "\nHannah T. Kevilla\n"}, {"Collector": "Kathleen Mc Donagh", "Gender": "female", "Address": "Mountbrown, Co. Mayo"}, {"Language": "English"}]}, "5235182/5227579/5243862": {"title": "Scéal", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0086F, Page 03_008", "Page 03_008"], "url": "https://www.duchas.ie/en/cbes/5235182/5227579/5243862", "text": "\n(continued from previous page)\nisteach san smután, Nuair a chuaidh se abaile bhí sé ag innseacht do na cómgursanna agus dubhairt siad go raibh faitchíos air agus níor fhág se an teach aon oidhche ó shoin\"O bhéal Antoine Mac Fionnact aig\"\n\n\n\nBhí fear ann uair amhain dárbh ainm Seán Na Sagairt. Aon áit a cloinfeadh sé go raibh sagart ina  rachaidh sé go dtí an áit agus nuair a gheobhfad sé seans marbúigheadh sé é.\n(continues on next page)\n", "school_info": "School: An Mhainistir", "metadata": [{"Location:": "Bunnacurry, Co. Mayo", "Teacher:": "\nname not given\n"}, {"Collector": "Pádraig Mac Fionnachtaigh", "Gender": "male"}, {"Informant": "Antoine Mac Fionnachtaigh", "Gender": "male"}, {"Language": "Irish"}]}, "5215809/5231381/5264225": {"title": "Seán na Sagart and Bingham", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137F, Page 11_051", "Page 11_051"], "url": "https://www.duchas.ie/en/cbes/5215809/5231381/5264225", "text": "\nSean na Sagart and Bingham Sean na Sagart used to help their heads and give them to a man named Bingham who was living near bastlebar. He was a long time gathering priest's heads so at last he had the roofs of live barns full with heads. When he was a year or so at this work god puli a plaguer of lice on him. He body was covered over with licer so at last he could not have clothes on him.\n(continues on next page)\n", "school_info": "School: Lankill", "metadata": [{"Location:": "Lankill, Co. Mayo", "Teacher:": "\nSeán Ó Cibhil\n"}, {"Collector": "Nora King", "Gender": "female", "Address": "Lanmore, Co. Mayo"}, {"Informant": "James O' Donnell", "Gender": "male", "Address": "Derrycooraun, Co. Mayo"}, {"Language": "English"}]}, "5215809/5231457/5265044": {"title": "Sean na Sagart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137F, Page 12_073", "Page 12_073"], "url": "https://www.duchas.ie/en/cbes/5215809/5231457/5265044", "text": "\nIt is said that Seán na Sagart was working for Denis Brown. Denis Brown lived in Mountbrown. Sean na Sagart used to have hounds with him sometimes. Anyhow one day a priest passed by this castle and he went into it to see it. Sean na Sagart was in bed and he told the priest to come up to see him The priest did so and before the priest was outside the door Sean na Sagart had him. He put the priests head on a rock and cut it off with a spear. He used to get £5 for every head and every day he used to be on the look out of priests. That castle fell a few years ago and many people went to see it. The ruins of it are there yet.\n", "school_info": "School: Lankill", "metadata": [{"Location:": "Lankill, Co. Mayo", "Teacher:": "\nSeán Ó Cibhil\n"}, {"Collector": "Eileen King", "Gender": "female", "Address": "Lanmore, Co. Mayo"}, {"Informant": "Thomas King", "Gender": "male", "Address": "Lanmore, Co. Mayo"}, {"Language": "English"}, {"Location": "Mountbrown"}]}, "5215809/5231458/5265045": {"title": "Sean na Sagart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137F, Page 12_074", "Page 12_074"], "url": "https://www.duchas.ie/en/cbes/5215809/5231458/5265045", "text": "\nThe people now say that Sean na Sagart used to be over at Carnacon and that he used to have very big hounds with him. He used to work over there for people and stay in their houses. He used always have a big knife with him and any priest he would see passing by he would attack him and kill him. Anyhow one day the people that he was working for found out that he had a knife with him so they began to put him out. He took no talk from them but cut their heads off. So when he had this deed done he could ramble about again and try to get a place.\n", "school_info": "School: Lankill", "metadata": [{"Location:": "Lankill, Co. Mayo", "Teacher:": "\nSeán Ó Cibhil\n"}, {"Collector": "Eileen King", "Gender": "female", "Address": "Lanmore, Co. Mayo"}, {"Informant": "Thomas King", "Gender": "male", "Address": "Lanmore, Co. Mayo"}, {"Language": "English"}]}, "5215809/5231460/5265053": {"title": "Sean na Sagart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137F, Page 12_076", "Page 12_076"], "url": "https://www.duchas.ie/en/cbes/5215809/5231460/5265053", "text": "\nWhen Sean na Sagart was in Ballintubber he had a sister living with him. One day he knew that there was a curate living near by so he went to bed and pretended he was sick. He began roaring with the pain he had and his sister thought he was fit for a priest. Then she went up to the room where he was in and asked him would she bring him the priest and he told her to do so. So she got prepared and went for the priest. It was not long until the priest came and went up to the room to annoint Sean na Sagart. He stood out a good bit from the bed because he knew that Sean na Sagart had something inside him in the bed, because he heard when he came into the parish that Sean na Sagart used to\n(continues on next page)\n", "school_info": "School: Lankill", "metadata": [{"Location:": "Lankill, Co. Mayo", "Teacher:": "\nSeán Ó Cibhil\n"}, {"Collector": "Eileen King", "Gender": "female", "Address": "Lanmore, Co. Mayo"}, {"Informant": "Austin Mc Ging", "Gender": "male", "Address": "Lanmore, Co. Mayo"}, {"Language": "English"}]}, "5215809/5231467/5265059": {"title": "Sean na Sagart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137F, Page 12_083", "Page 12_083"], "url": "https://www.duchas.ie/en/cbes/5215809/5231467/5265059", "text": "\nWhen Sean na Sagart was living in Ballintubber he had a little house of his own. One day he pretended he was sick and he went to bed and began roaring with a pain. The people living near him heard him so they came in to see what was wrong with him. When they went in they got him sick in bed so the went for the priest.  When the priest came he went up to the room and asked him how he was. He got no answer from Seán. So he thought he was not able to talk.Then the priest started to annoint him but before the priest had him half annointed he jumped out of the bed and followed him\n(continues on next page)\n", "school_info": "School: Lankill", "metadata": [{"Location:": "Lankill, Co. Mayo", "Teacher:": "\nSeán Ó Cibhil\n"}, {"Collector": "Eileen Walsh", "Gender": "female", "Address": "Lanmore, Co. Mayo"}, {"Informant": "John Walsh", "Gender": "male", "Address": "Lanmore, Co. Mayo"}, {"Language": "English"}]}, "5215809/5231522/5265196": {"title": "Death of Seán na Sagart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137F, Page 14_011", "Page 14_011"], "url": "https://www.duchas.ie/en/cbes/5215809/5231522/5265196", "text": "\nThere was once a man named Sean na Sagart. He was a very bad man but his wife was a good woman.Denis Brown was his master and Sean na Sagart was ordered by him to kill every priest and lay-man he saw. One day he pretented he was very ill and began moaning very loudly. His wife heard him and she asked him would he like her to bring the priest to him before he would die. He said he would and she ran for the priest. The old priest wanted to go first but the young priest said that he would go.He then went and when he got to Sean's house the woman\n(continues on next page)\n", "school_info": "School: Lankill", "metadata": [{"Location:": "Lankill, Co. Mayo", "Teacher:": "\nSeán Ó Cibhil\n"}, {"Collector": "Lena Keville", "Gender": "female", "Address": "Knappagh Beg, Co. Mayo"}, {"Informant": "Richard Walsh", "Gender": "male", "Address": "Lanmore, Co. Mayo"}, {"Language": "English"}]}, "5215809/5231536/5265211": {"title": "Seán na Sagart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137F, Page 14_025", "Page 14_025"], "url": "https://www.duchas.ie/en/cbes/5215809/5231536/5265211", "text": "\nLong ago a priest was going to say mass in Poll na gCon. When he was going to the place he met Seán na Sagart and Sean na Sagart wanted to prevent him from saying mass. But the priest made the sign of the cross on Seán and told him to stand there till he would be coming back again. The priest went his way and Seán had to stand there until he came back again. When the priest came back he let Sean go. Then Seán ran after the priest until they came to a big river which Seán could not cross but the priest got over easily. Seán threw his dagger after the priest but it missed him and the priest threw at Sean and killed him.\n", "school_info": "School: Lankill", "metadata": [{"Location:": "Lankill, Co. Mayo", "Teacher:": "\nSeán Ó Cibhil\n"}, {"Collector": "Lena Keville", "Gender": "female", "Address": "Knappagh Beg, Co. Mayo"}, {"Informant": "Richard Walsh", "Gender": "male", "Address": "Lanmore, Co. Mayo"}, {"Language": "English"}]}, "5215809/5231584/5265418": {"title": "Seán na Sagart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137F, Page 15_026", "Page 15_026"], "url": "https://www.duchas.ie/en/cbes/5215809/5231584/5265418", "text": "\nSean na Sagart       24.1.38There was a man living in Ballyburke and his name was Sean Sagart. The trade he had was killing every priest he could find. He used to go to bed and pretend he was unable to speak or eat so that somebody would go for the priest for him. When the priest would come Sean was usually ready to attach him. One day however he pretended to be sick so he got a man to go for a priest. The priest came iarnestly enough but the woman of the house spoke to him in Irish and said to beward of Sean that he had a knife in bed with him. Anyway the priest walked over to him and asked how he was feeling. Sean jumped out of the bed and followed the priest. He\n(continues on next page)\n", "school_info": "School: Lankill", "metadata": [{"Location:": "Lankill, Co. Mayo", "Teacher:": "\nSeán Ó Cibhil\n"}, {"Collector": "Ena Heneghan", "Gender": "female", "Address": "Lankill, Co. Mayo"}, {"Informant": "Mary Gibbons", "Gender": "female", "Address": "Kiltarsaghaun, Co. Mayo"}, {"Language": "English"}]}, "5215809/5231586/5265426": {"title": "Seán na Sagart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137F, Page 15_028", "Page 15_028"], "url": "https://www.duchas.ie/en/cbes/5215809/5231586/5265426", "text": "\nSean na Sagart              25.1.38There was a funeral of a priest who was killed by Seand na Sagart. Sean knew that there would be a priest at the grave to bless it so he went to the funeral. When the priest had the grave blessed he saw Sean and started to run for his life. Sean ran after him. Out of the crowd only one man a tailor ran after Sean. The priest crossed the fence and Sean crossed the fence too. He knocked the priest on the ground and as he was holding him down the tailor crossed the fence. The priest shouted to the tailor to take the dagger out of Sean's pocket. The tailor did so and with the dagger killed Sean.I heard this from T. Cusack,John's Row, Westport\n", "school_info": "School: Lankill", "metadata": [{"Location:": "Lankill, Co. Mayo", "Teacher:": "\nSeán Ó Cibhil\n"}, {"Collector": "Ena Heneghan", "Gender": "female", "Address": "Lankill, Co. Mayo"}, {"Informant": "T. Cusack", "Gender": "male", "Address": "Westport, Co. Mayo"}, {"Language": "English"}]}, "5215809/5231648/5265497": {"title": "Seán na Sagart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137F, Page 16_019", "Page 16_019"], "url": "https://www.duchas.ie/en/cbes/5215809/5231648/5265497", "text": "\nIn the Penal days the priests used not be allowed to say mass in their churches. Sometimes they used to say mass out by the rocks int he mountains and other times they used to have a secret hut built for themselves to read mass in.A very bad man who lived about the time called Séan na Sagart used to kill priests. He used to go to bed pretend he was sick and send for a priest. He used to have is sword inside him in the bed and when the priest would come he would kill him with it.He killed many priests this way but at last he was captured and killed himself near Mayo Abbey.\n", "school_info": "School: Lankill", "metadata": [{"Location:": "Lankill, Co. Mayo", "Teacher:": "\nSeán Ó Cibhil\n"}, {"Collector": "Patrick Lavelle", "Gender": "male", "Address": "Cordarragh North, Co. Mayo"}, {"Language": "English"}]}, "5215809/5231768/5265837": {"title": "Seán na Sagart", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0137F, Page 19_051", "Page 19_051"], "url": "https://www.duchas.ie/en/cbes/5215809/5231768/5265837", "text": "\nOnce upon a time there lived a man name Seán na Sagart and he used to kill every priest he would get a chance of. This is how he used to manage it. He used to pretend that he was sick and tell some person to go for the priest. One day he pretended to be sick and some one was told to go for the priest. When the priest came the servant whispered to the priest in a way that Seán could not hear her. She said to the priest that he had a knife under the bed. The priest did not hear her and he went up to Seán in the room where he was in bed. The priest asked him how he was feeling Seán\n(continues on next page)\n", "school_info": "School: Lankill", "metadata": [{"Location:": "Lankill, Co. Mayo", "Teacher:": "\nSeán Ó Cibhil\n"}, {"Collector": "Kitty Duffy", "Gender": "female", "Address": "Lanmore, Co. Mayo"}, {"Informant": "Charles O' Malley", "Gender": "male", "Address": "Lanmore, Co. Mayo"}, {"Language": "English"}]}}