{"4427909/4357261/4451443": {"title": "Folklore - The Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0113, Page 60", "Page 60"], "url": "https://www.duchas.ie/en/cbes/4427909/4357261/4451443", "text": "\nThere is a valley in Esker about a quarter of a mile from Kilkelly known as the valley of the \"Black Pig\". People who pass this way at night see this pig.One night a dentist who was leaving Kilkelly and motoring to Ballghadreen saw the pig. He could not go any further. The cold sweat ran down his face, and he was very frightened and after some time he drove back again to Kilkelly and stayed there for the night.\n", "school_info": "School: Cill Cheallaigh (C.)", "metadata": [{"Location:": "Kilkelly, Co. Mayo", "Teacher:": "\nEithne de Buitléir\n"}, {"Language": "English"}]}, "4428251/4388448/4465732": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1027, Page 023", "Page 023"], "url": "https://www.duchas.ie/en/cbes/4428251/4388448/4465732", "text": "\n(continued from previous page)\nat the door or window of the house on the evening before May Day. The Mayflower is a big yellow flower that grows in marshes. This was done to prevent evil spirits from coming into the house.\n\n\n\nThere are three forts in Rathmore. One of them is much bigger than the rest. It is in a field belonging to Jack Madden. It is from this fort Rathmore got its name, which means the big fort.\n\n\n\nThe townland of Dunmuckrim is situated about a mile to the south of Ballyshannon St Colmcille said that a black pig would run through Dunmuckrim. By the\n(continues on next page)\n", "school_info": "School: St Joseph's, Béal Átha Seanaigh", "metadata": [{"Location:": "Ballyshannon, Co. Donegal", "Teacher:": "\nAn Br. S. Ó Murchadha\n"}, {"Collector": "Danny Breslin", "Gender": "male", "Address": "Rathmore, Co. Donegal"}, {"Informant": "Mr P. Loughlin", "Gender": "male", "Address": "Rathmore, Co. Donegal"}, {"Language": "English"}, {"Location": "Dunmuckrum"}]}, "4427971/4362372/4466765": {"title": "Muc Dhubh", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0126, Page 501", "Page 501"], "url": "https://www.duchas.ie/en/cbes/4427971/4362372/4466765", "text": "\nMuch Dubh is a low lying valley South East of Enniscrone, Co Sligo, in a very remote part of the country. One the hill above it is a grave yard called \"Lag na gCailleach.\"This grave yard is said to be the oldest christian burial place in Ireland and is first place on the list of grave yards called out in Rome. Beside this grave yard is a high ridge crossing the valley and when the engineers of the All Red Route came marking out their Railway line they hit on this ridge which meant the saving of thousands of pounds for them, besides having to fill the valley below. This is how the place got its name. It was here the \"Black Pig\" was killed. The story is told that the Saint and the witch had a quarrel at Nephin. Some people say it\n(continues on next page)\n", "school_info": "School: Corr Odhar", "metadata": [{"Location:": "Corrower, Co. Mayo", "Teacher:": "\nAibhistín Ó Coinnigh\n"}, {"Collector": "Mary Mullaney", "Gender": "female", "Address": "Corrower, Co. Mayo"}, {"Informant": "William Mullaney", "Gender": "male", "Age": "62", "Address": "Corrower, Co. Mayo"}, {"Language": "English"}]}, "4428058/4373590/4476057": {"title": "The Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0148, Page 25", "Page 25"], "url": "https://www.duchas.ie/en/cbes/4428058/4373590/4476057", "text": "\nOnce there was a man named Geraghty who lived in Cloghans. One night he went a long journey with a priest. It happened that when returning it was very late and at the white gates of Newtown he saw a black lump coming towards him. He first thought it was a fog but as it came close to him he found it was a lot of men on horseback. They crushed him and put him up against a big wall.There was another man from the neighbourhood passing by and he found Geraghty leaning against the wall with his horse and car. He had lost his feeling and the horse was jumping in the air. The man calmed down the horse and got him up as far as Garracloon school and Geraghty made his way home from that.On the man's return home again at the same place he saw nothing but a black pig.\n", "school_info": "School: Garracloon", "metadata": [{"Location:": "Garrycloonagh, Co. Mayo", "Teacher:": "\nJames J. Clarke\n"}, {"Collector": "Beatrice Brown", "Gender": "female", "Address": "Carrowmore, Co. Mayo"}, {"Informant": "Mrs Browne", "Gender": "female", "Address": "Carrowmore, Co. Mayo"}, {"Language": "English"}]}, "4481744/4408427/4481190": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1083, Page 167", "Page 167"], "url": "https://www.duchas.ie/en/cbes/4481744/4408427/4481190", "text": "\n(continued from previous page)\nnot go near the black pig. The man said if you hadn't to tell me to go to the black pig, I would not go near it, the man said he wasnt afraid of it and when he went to it the man and pig started to fight, and the sister heard the noise. She ran out, she couldnt see anything, she lifted three very large stones in her apron, she travelled across the lough and she couldn't see anything. When she would come to this side the noise was on the other side, and she travelled round the lough, and at last she found her brother killed, The man killed the pig and the pig killed the man.\n\n\n\nThere was a man going to the fair of Kilmacrenn one time, and as he was going along the road he met a black pig. It wasn't clear so he mad a ring round and round and made the sign of the cross on the road before it came near him. The pig went away in a big fire.\n\n\n\nThe people say that it is not lucky to meet a red haired woman in the\n(continues on next page)\n", "school_info": "School: Teampull Dubhglaise", "metadata": [{"Location:": "Drumbologe, Co. Donegal", "Teacher:": "\nSeán C. Ó Dómhnaill\n"}, {"Collector": "Katie Murray", "Gender": "male", "Age": "12"}, {"Language": "English"}]}, "4498043/4345571/4498060": {"title": "The Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0089, Page 022", "Page 022"], "url": "https://www.duchas.ie/en/cbes/4498043/4345571/4498060", "text": "\nThere was once a croud of boys card playing. One of them was cheating and tricking. They waited very late. When the boy who was tricking was goning home he met a big black pig on the road. The pig went across the road before him and the boy stopped still. After a while the pig went to the side of the road and the boy went home. He fainted just goning in the door. The old people that if you ever see a bad thing you are sure to faint on the door step. People also say it is good to met a white pig but it is very bad to met a black pig\n\n\n\nTwo brothers we are together do go.We are full in the day and empty at nightTwo shoes.\n(continues on next page)\n", "school_info": "School: Eaglais", "metadata": [{"Location:": "Burren, Co. Mayo", "Teacher:": "\nS. Ó Mongaigh\n"}, {"Collector": "Nóra Ní Chuinneóghain", "Gender": "female", "Occupation": "pupil", "Address": "Commauns, Co. Mayo"}, {"Informant": "Mrs Cunningham", "Relation": "unknown", "Gender": "female", "Age": "60", "Address": "Commauns, Co. Mayo"}, {"Language": "English"}]}, "4428250/4388411/4499011": {"title": "Fairy Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1026, Page 224", "Page 224"], "url": "https://www.duchas.ie/en/cbes/4428250/4388411/4499011", "text": "\n(continued from previous page)\nOne the ten half-crowns. The fairies were supposed to get back the money for him.\n\n\n\nArtie Connelly was carrying a Protestant corpse one day. At the foot of the Mill Hill a black pig crossed the road and struck him and knocked him down. From that day till the day he died he was a cripple.\n", "school_info": "School: Loughill", "metadata": [{"Location:": "Ballymunterhiggin, Co. Donegal", "Teacher:": "\nEibhlis Ní Mhathghamhna\n"}, {"Informant": "Eugene Mac Mahon", "Gender": "male", "Age": "22", "Address": "Bundoran, Co. Donegal"}, {"Language": "English"}]}, "4498043/4345594/4502037": {"title": "The Monk's Ghost", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0089, Page 045", "Page 045"], "url": "https://www.duchas.ie/en/cbes/4498043/4345594/4502037", "text": "\nIf you would go up to Cloncurra there are two crossroads. Once a monk was coming from town. His horse wanted to go down down one cross-road but it was not the right road for home. The monk tried to put the horse on the right road but he was killed. Often when people are passing by that place at night they see the monk's ghost standing at the spot where he was killed. Once when the people were going to the reek early in the morning, they saw him standing at the cross roads.\n\n\n\nOne night a card player was coming home about [?] o'clock. His mother had told him not to be out so late at night and she often said she wished something would stop him. As he was going he had 7/0 in his pocket and a pack of cards. He had rogued in the money and he kept it. All at once he saw a black pig walking across the road. The pig was grunting and he said \"You will not cross till you leave the money and the cards and the money on the road.\" The man said he would not. When it was near 3 o clock the man got tired of standing in the road and he threw the money and the cards down and he was let home. The next\n(continues on next page)\n", "school_info": "School: Eaglais", "metadata": [{"Location:": "Burren, Co. Mayo", "Teacher:": "\nS. Ó Mongaigh\n"}, {"Collector": "Nora Cunningham", "Gender": "female"}, {"Informant": "Martin Cunningham", "Gender": "male", "Age": "60", "Address": "Commauns, Co. Mayo"}, {"Language": "English"}]}, "4498043/4345661/4504750": {"title": "The Strange Sheep", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0089, Page 112", "Page 112"], "url": "https://www.duchas.ie/en/cbes/4498043/4345661/4504750", "text": "\nOnce there was a man coming home from a fair. It was about 7.30 oclock in the evening. He had one sheep with him which he had bought at the fair. The sheep came along quietly enough until he was about a mile from his home. Then all at once the sheep turned and ran up the road like a puff of wind. He was out of the man's sight in three minutes. The man stood and looked after him and he said \"That you may never come back!\" Then the man walked along home but when he was about ten yards from the house the sheep stood before him.\n\n\n\nThere was once a man coming home from cardplaying. He had to pass by a lonely bridge. When he was at it a black pig came out before him and would not go until he threw his money on the road. The man threw the money on the road and the pig went away then. There was a dog standing beside the pig. Only for the dog the pig would have torn the man.\n", "school_info": "School: Eaglais", "metadata": [{"Location:": "Burren, Co. Mayo", "Teacher:": "\nS. Ó Mongaigh\n"}, {"Collector": "P. Malley", "Gender": "male"}, {"Informant": "Anthony Malley", "Gender": "male", "Age": "65", "Address": "Burren, Co. Mayo"}, {"Language": "English"}]}, "4493674/4409770/4520494": {"title": "The Valley of the Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1087, Page 144", "Page 144"], "url": "https://www.duchas.ie/en/cbes/4493674/4409770/4520494", "text": "\nAbout two and a half centuries ago a battle was fought near the little bridge entering Letterkenny and it was known as the Battle of Sprigburn. Shortly after this battle a \"black pig\" was seen crossing Lifford Bridge. It was seen off and on again till it reached Letterkenny but it did not stop there. It was said that it passed on the outskirts of Ramelton, later seen making its way through this district, past Milford. It was last seen near Fanad. The line or route this clever pig took is known as the Valley of\n(continues on next page)\n", "school_info": "School: Tulach Beag", "metadata": [{"Location:": "Tully Beg, Co. Donegal", "Teacher:": "\nAnna Stamhbridge\n"}, {"Collector": "Mollie Mc Hugh", "Gender": "female"}, {"Informant": "John Kilpatrick", "Gender": "male", "Age": "40", "Address": "Tully Mountain, Co. Donegal"}, {"Language": "English"}]}, "4493703/4413049/4528104": {"title": "The Valley of the Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1096, Page 41", "Page 41"], "url": "https://www.duchas.ie/en/cbes/4493703/4413049/4528104", "text": "\nA local school-master had in his possession a book of witch-craft. With the aid of this book it was his custom to change his scholars into hounds and hares at play-time. One evening a scholar came home his father asked him what happened to his foot. He said that Michael Kelly's son bit him when they were playing \"hounds and hares\". The father did not know what was the meaning of this. He told the master to change himself into a black pig and there he stayed. A valley that was near was called \"The valley of the Black Pig\".\n", "school_info": "School: Stranorlar", "metadata": [{"Location:": "Stranorlar, Co. Donegal", "Teacher:": "\nBean Mhic Giolla Chomhghaill\n"}, {"Collector": "Mary O' Callaghan", "Gender": "female", "Age": "11", "Address": "Stranorlar, Co. Donegal"}, {"Informant": "Francis O' Callaghan", "Gender": "male", "Age": "82", "Occupation": "farmer", "Address": "Castlebane, Co. Donegal"}, {"Language": "English"}]}, "4493703/4413124/4528138": {"title": "Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1096, Page 51", "Page 51"], "url": "https://www.duchas.ie/en/cbes/4493703/4413124/4528138", "text": "\nThe Valley of the Black Pig in Country Fermanagh got its name thus - The local school-master had in his possession a book of witch-craft. With the aid of this book it was his custom to change his scholars into hounds and hares at play-time. One evening a scholar came home from school all cut. His father asked him what happened to his foot. He said that Micky Kelly's son bit him when they were playing \"hounds and hares\".The father asked the master if this\n(continues on next page)\n", "school_info": "School: Stranorlar", "metadata": [{"Location:": "Stranorlar, Co. Donegal", "Teacher:": "\nBean Mhic Giolla Chomhghaill\n"}, {"Collector": "Mary O' Callaghan", "Gender": "female", "Address": "Stranorlar, Co. Donegal"}, {"Informant": "James Mc Menemin", "Gender": "male", "Age": "80", "Occupation": "farmer", "Address": "Gortletteragh, Co. Donegal"}, {"Language": "English"}]}, "4493736/4415182/4529001": {"title": "Old Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1105, Page 112", "Page 112"], "url": "https://www.duchas.ie/en/cbes/4493736/4415182/4529001", "text": "\n(continued from previous page)\nremoved. Old residents warned him not to touch it but he only laughed at them. He employed two horses for the work and both died in a fortnight afterwards. His two children died at the same time being buried on the same day. This happened about 60 years ago.\n\n\n\nOn the road between Mr. Rankin's of the Cloon and Carrigan's via Killea rectory there is a place near said rectory where a black pig used to be seen on certain nights of the year. It appeared quite suddenly apparently from nowhere and ran along the road in front of the persons who saw it.\n(continues on next page)\n", "school_info": "School: Monreagh", "metadata": [{"Location:": "Monreagh, Co. Donegal", "Teacher:": "\nR. J. James\n"}, {"Collector": "R. J. James", "Gender": "male", "Address": "Monreagh, Co. Donegal"}, {"Informant": "Robert Smyth", "Gender": "male", "Age": "70", "Occupation": "milkman", "Address": "Monreagh, Co. Donegal"}, {"Language": "English"}]}, "4427885/4354358/4552398": {"title": "Local Ghost Stories", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0107, Page 236", "Page 236"], "url": "https://www.duchas.ie/en/cbes/4427885/4354358/4552398", "text": "\n(continued from previous page)\nfainted\n\n\n\nOne night about half past twelve as Mr. James Ruane, Mr. John Caulfield and Mr. Thomas Kenny were returning home from card playing Mr Ruane saw a black pig walking before him on the road.  He told his companions and they  looked and searched about but they could not see or hear anything.  When he reached home he told his story and next morning when he rose from his bed he found his father dead in bed.\n\n\n\nOne night as Mr. James Morley was returning home from town a big man passed him quickly and hit him a blow on the back of the head and knocked him, when he reached his residence he found all his  stock\n(continues on next page)\n", "school_info": "School: Scoil Mhuire, Béal Átha hAmhnais", "metadata": [{"Location:": "Ballyhaunis, Co. Mayo", "Teacher:": "\nS.T. Ó Maolagáin\n"}, {"Collector": "Thomas Patrick Caulfield", "Gender": "male", "Address": "Devlis, Co. Mayo"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "female", "Address": "Devlis, Co. Mayo"}, {"Language": "English"}]}, "4562128/4561931/4570468": {"title": "Sprideanna i nDeilbh Ainmhithe - A Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0022, Page 0480", "Page 0480"], "url": "https://www.duchas.ie/en/cbes/4562128/4561931/4570468", "text": "\nOnce upon a time there was a man going to a far off fair at about three o'clock in the morning. As he was passing a graveyard he saw a black pig walk out of it. It jumped on the cart and he gave it a crack of his whip, but it remains there all the time. It tormented him in this way until he was a mile or so from home. THen he had to cross a river, and as was going over the bridge he remembered that he had medals around his neck. He took them off and threw them into the river, and as he did the black pig disappeared, and at that moment he heard a splashing in the water. He looked behind him, and as he did, the horse began to sweat and pulled up to the side of the road. He turned round to fix the horse, and. He looked behind him again, but the horse did the same thing.  H did not look behind him again until he reached the town. He returned another road home, and it was said that if he looks behind him a third time, that he would never see home again.\n", "school_info": "School: Cathair Loisgreáin (C)", "metadata": [{"Location:": "Caherlustraun, Co. Galway", "Teacher:": "\nMáire Nic Aodha\n"}, {"Collector": "Katie Reilly", "Gender": "female"}, {"Informant": "John Reilly", "Gender": "male", "Age": "61", "Address": "Killamanagh, Co. Galway"}, {"Language": "English"}]}, "4562128/4561932/4570471": {"title": "Sprideanna i nDeilbh Ainmhithe - A Priest and a Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0022, Page 0481", "Page 0481"], "url": "https://www.duchas.ie/en/cbes/4562128/4561932/4570471", "text": "\nOnce upon a time there lived a priest in Kilmaine but the name of Fr. Prendergast. He was invited to a party in poll a Capall (near Shrule) at the house of P. J. Costello. He got there at an early hour on Saturday night, but he had to be home to read Mass in the morning. He got P.J. Costello's boy to drive him home. The boy did not like to go at that hour of the night, but at last he consented to go. When they got to the poll a Puca a pig came out before them. THe boy tried to come out of the car, but the priest would not let him. The priest told the pig to come to him the next-day. THen he began reading out of his book, and all went away in coals of fire. The next-day it came to the priest in the form of a woman. She spat into his face, and he could never shave after that.\n\n\n\nOnce upon a time, a man from the village of Brackloon went reaping wheat in a field not far from his home. As he looked around, he saw a hare crossing the field in which he was reaping. He flung the hook after her and it stuck in her side and the man followed her and he saw her going into a small little house. He went in\n(continues on next page)\n", "school_info": "School: Cathair Loisgreáin (C)", "metadata": [{"Location:": "Caherlustraun, Co. Galway", "Teacher:": "\nMáire Nic Aodha\n"}, {"Collector": "Delia Mc Dermott", "Gender": "female"}, {"Informant": "Thomas Mulryan", "Gender": "male", "Age": "67", "Address": "Killamanagh, Co. Galway"}, {"Language": "English"}]}, "4569060/4567683/4583490": {"title": "The Black Sow", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0037, Page 0234", "Page 0234"], "url": "https://www.duchas.ie/en/cbes/4569060/4567683/4583490", "text": "\nA man called Micheal Disken of Castle Farm next townland to Clooneen told me of an experience which he had on one occasion about thirty years ago.Accompanied by a neighbouring lad about his own age (18 years) he went to Z Quinaltagh to the wake of a friend. he remained at the wake until\n(continues on next page)\n", "school_info": "School: Baile an Leasa", "metadata": [{"Location:": "Ballinlass, Co. Galway", "Teacher:": "\nTreasa Bean Uí Mhathghamhna\n"}, {"Collector": "Peggy Mahon", "Gender": "female", "Age": "11", "Address": "Sion Hill, Co. Galway"}, {"Informant": "Michael Disken", "Gender": "male", "Age": "60", "Address": "Castlefarm, Co. Galway"}, {"Language": "English"}]}, "4569064/4568221/4584711": {"title": "The Black Sow", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0038, Page 0312", "Page 0312"], "url": "https://www.duchas.ie/en/cbes/4569064/4568221/4584711", "text": "\nV Story \"The Black Sow\".(Told by M. Disken of Castle Farm ???? which adjoins our village Clooneen.)The above named told me sometime ago of an experience (very strange to say the least of it) which he had on one occasion. Accompanied by a neighbouring lad of about 17 or 18 yrs of age, he went one night to Guinaltagh, (a townland about four miles from his home at Castle Farm) to the wake of a friend. He remained at the wake until midnight, and then in company with his pal, he set out for home about 1.30am. The night wasn't very dark as the moon was full, but was however parted clouded as it was threatening rain. However, they could easily make their way without a light in the shape of a flash lamp or lantern.\n(continues on next page)\n", "school_info": "School: Luachra", "metadata": [{"Location:": "Lisduff, Co. Galway", "Teacher:": "\nEamonn Mac Giolla Choinnigh\n"}, {"Informant": "Michael Disken", "Gender": "male", "Address": "Castlefarm, Co. Galway"}, {"Language": "English"}]}, "4583330/4580190/4587611": {"title": "Story of the Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0055, Page 0062", "Page 0062"], "url": "https://www.duchas.ie/en/cbes/4583330/4580190/4587611", "text": "\nStory of the Black Pig   It is said that when the war would start a Black Pig would start also from a place called the Valley of he Black Pig.  It is believed that this pig will that this pig will cross the Suck and travel around and in his travells he would cross over Red Mount Hill.  Then would also go around a red haired woman.  Both of those would meet and not until they would be killed would the war (?) end.  In the Valley of the Black Pig a battle would be fought when the war would be over this valley would be flowing with blood.Eilish ReillyOct 4th 1938Heard from my father William Reilly, Clonfert, Eyrecourt, Co. Galway.  Age 50\n", "school_info": "School: Cluain Fearta", "metadata": [{"Location:": "Clonfert, Co. Galway", "Teacher:": "\nC. Ó Ríoghbhardáin\n"}, {"Collector": "Eilish Reilly", "Gender": "female"}, {"Informant": "William Reilly", "Relation": "parent", "Gender": "male", "Age": "50", "Address": "Clonfert, Co. Galway"}, {"Language": "English"}]}, "4583308/4578366/4587753": {"title": "The Black Sow", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0050, Page 0128", "Page 0128"], "url": "https://www.duchas.ie/en/cbes/4583308/4578366/4587753", "text": "\nA long time ago there lived a black sow in a road near a lake in Clare. On this lake there were many islands. Anyone that passed near this place at night was killed.   One night a certain man had to go for the nurse for his wife. As he was in a great hurry he said he would risk his life and go the short road by the lake. On his way he met the black sow. \"I must kill you\" said the sow The man begged of the sow not to kill him and said that he killed him he would not kill one one but three meaning himself his wife and her baby. The sow said that he would let him go if he promised to come back the night after and at the same\n(continues on next page)\n", "school_info": "School: Réidh Reamhar", "metadata": [{"Location:": "Reyrawer, Co. Galway", "Teacher:": "\nSeán A. Mac Fhloinn\n"}, {"Collector": "Mary Broderick", "Gender": "female", "Address": "Derrywee West, Co. Galway"}, {"Informant": "Mr Broderick", "Relation": "parent", "Gender": "male", "Address": "Derrywee West, Co. Galway"}, {"Language": "English"}]}, "4605938/4603963/4644487": {"title": "The Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0204, Page 254", "Page 254"], "url": "https://www.duchas.ie/en/cbes/4605938/4603963/4644487", "text": "\nSome say the black pig is the devil, others say that it is a pig who will warn the people of the Last day. However we know for certain that the black pig will appear on the Last day. Some say the black pig was killed by a woman who was spreading out clothes - she hit him on the head and killed him. An old legend says that the black pig changed himself into a master. He used to go up and down the school and beat the children and then change himself into a pig. One of the children was so badly beaten that she had to be brought to the priest. She told the priest what had happened. He went to the school and prayed and the pig came out. The pig took the school on his back and ran away with it. He let it fall and formed the Shannon Pot. Others say it rebounded three times and formed Lough Allen, Lough Ree, and Lough Derg.\n", "school_info": "School: Kilmore", "metadata": [{"Location:": "Kilmore, Co. Leitrim", "Teacher:": "\nEilís, Bean Uí Cheallaigh\n"}, {"Collector": "T. Mc Loughlin"}, {"Informant": "T. Mc Loughlin"}, {"Language": "English"}]}, "4658436/4655415/4660314": {"title": "The Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0222, Page 288", "Page 288"], "url": "https://www.duchas.ie/en/cbes/4658436/4655415/4660314", "text": "\nCenturies ago there lived a Schoolmaster some-where in the North of Ireland. This man had magic power and he often changed himself into a hare, a rabbit, a cat or a pig.     The man used to change himself into some of the shapes each day when his pupils were at play and the pupils had great fun running after him.     At that time a pup off the first litter which a bitch had was supposed to be enchanted.     A boy lived in the townland owned a pup of this kind and on one occasion when the man had changed himself into a black pig the boy encouraged the pup and away went the pig with the pup at his heels. The pup kept so near to the pig that the pig had not time to change himself back into his natural shape.     W hen the pig came as far as Sliab an Iaran the pup was close behind and he crossed Moynahan hill. He the crossed Graffy hill and went on through Cloone. The pup killed the pig on a bridge which crossed the Shannon. \"Woe be it for him who lives in the valley of the Black Pig when the World War is in progress\" is an old Sentence which is handed down to us from our fore-fathers.\n\n\n\nSome years before the Great Famine there was a disease raging in the country called Cholera. There were two brother living in a hut at the foot of Graffy hill\n(continues on next page)\n", "school_info": "School: Adoon", "metadata": [{"Location:": "Adoon, Co. Leitrim", "Teacher:": "\nCharles Flynn\n"}, {"Language": "English"}]}, "4649705/4648856/4661610": {"title": "The Half Set", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0214, Page 350", "Page 350"], "url": "https://www.duchas.ie/en/cbes/4649705/4648856/4661610", "text": "\n(continued from previous page)\nSeems now an accomplishment worthy of praiseThe habits of people have got so much changed That there's nothing so good as to look half-derangedWhen the brutes of the field are let loose from their stakesThey cut many wild capers, frolicsomes and freaksBut a man that has reason and sense in his headAnd that acts like a brute must be greatly misledThese acts, I imagine, are not very grandIn any refined, civilized or Christianized land.It appeared the whole frolic was learned or borrowedFrom lunatics embellished or something more horrid So no matter what luminaries or chroniclers paint.This land is no longer an Island of Saints.So I saw to it that the half-set ear(?) that I concludeThe dance is both awkward, disgustful and rude\n\n\n\nLong ago in pagan Ireland the kings sent their sons to a magician in the North of Ireland to get them taught magic. At that time a king lived in Tara and he sent his son to this man.Some time after the boy had gone he wrote to his father that he was being treated badly and that when recreation came the magician turned him into a hare and the other boys into hounds. He then sent the hare away and made the hounds follow it. When recreation was over the hare was naturally very tired.\n(continues on next page)\n", "school_info": "School: Gort Leitreach", "metadata": [{"Location:": "Gortletteragh, Co. Leitrim", "Teacher:": "\nSeosamh Mac Cionnaith\n"}, {"Collector": "Catherine Higgins", "Gender": "female", "Age": "76", "Address": "Clooncose, Co. Leitrim"}, {"Language": "English"}]}, "4658446/4656390/4661671": {"title": "Valley of the Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0224, Page 284", "Page 284"], "url": "https://www.duchas.ie/en/cbes/4658446/4656390/4661671", "text": "\n3rd December 1937     St. Columcille was a prince of the royal race of Nial, and was born at Gartan, in County Donegal, on the 7 th December, 521. His real name was Crieuhan. From early youth he was endowed with gift of prophesy. Having been instrumental in causing a war, which was fought for the possession of a book which he transcribed from the Four Gospels ; and (bloodshed was very deep) being a dignitary of the Church, his sorrow and remorse for so much blood-shed, was very deep. he visited his confessor St. Molaise, (sometimes called Lasserin, meaning the lesser light, St Patrick being the greater light) in Inishmurray, County Donegal. St. Molaise imposed on him the penance of perpetual exile, never more to see Ireland. St. Columcille was returning to his home in Derry, after receiving his penance, and when travelling on the shore in Leitrim he wrote a prophesy of the invasions wars, and conquest of Ireland - the land he loved so well. He said that Erin would bleed from every pore for centuries, and that no part of the Island would suffer as much as Leitrim on account of her undying devotion to Faith and Freedom. He wrote :- \" A monster shall arise in the North, and from Skreen in Sligo through the valleys of Breffni, on by Fenagh and South-west Cavan, till is touches Slane in Meath. The monster shall gloat over his victims, and no person shall escape along the track of the horses' shoes   Erin shall pine in twi-light, but her lamp shall be replenished and shall never be extinguished\". Ireland was subdued in Elizabeth's reign.\n(continues on next page)\n", "school_info": "School: An Clochar, Béal an Átha Móir", "metadata": [{"Location:": "Ballinamore, Co. Leitrim", "Teacher:": "\nAn tSr. Áthracht\n"}, {"Collector": "Carmel Conlon", "Gender": "female", "Address": "Ballinamore, Co. Leitrim"}, {"Language": "English"}]}, "4658446/4656414/4661939": {"title": "The Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0224, Page 308", "Page 308"], "url": "https://www.duchas.ie/en/cbes/4658446/4656414/4661939", "text": "\nIt is said than in a county in the North of Ireland, there was a school master who was fond of treating his pupils very cruelly.It is said that a catholic priest on hearing of his wicked acts, got him banished from the school and tradition tells us that he was changed into a pig and was of a black colour. It is said that this pig came past Carrigallan, and travelled three miles past Ballinamore, always keeping to the valley of the country, but when he went some distance below Fenagh, a woman who was washing clothes on a the bank of a river was surprised when she saw him approaching and she killed him with a stroke of a beetle, she had in her hand.\n", "school_info": "School: An Clochar, Béal an Átha Móir", "metadata": [{"Location:": "Ballinamore, Co. Leitrim", "Teacher:": "\nAn tSr. Áthracht\n"}, {"Collector": "Maisie Mc Teague", "Gender": "female", "Age": "16", "Address": "Moher, Co. Leitrim"}, {"Informant": "Mr Peter Dolan", "Gender": "male", "Age": "76", "Address": "Moher, Co. Leitrim"}, {"Language": "English"}]}, "4658443/4656072/4662501": {"title": "The Valley of the Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0223, Page 300", "Page 300"], "url": "https://www.duchas.ie/en/cbes/4658443/4656072/4662501", "text": "\nIn the northern part of Ireland there was a school-master who was very fond of treating his pupils very cruelly. It is said that a Catholic priest on hearing of his wicked deeds got him banished from the school, and tradition tells us that he was changed into a a pig, and was a black colour. It is isaid tht the pig travelled three miles east of Ballinamore always keeping to the valley of the country; and past Carrigallen in County Leitrim, but when he went some distance below Fenagh a woman who was washing clothes on the bank of a river, was surprised when she saw him approaching, killed him with a stroke of a beetle she had in  her hand. Told by Peter Dolan (age 75) Ballinamore, Co Leitrim\n", "school_info": "School: Drumbibe", "metadata": [{"Location:": "Drumbibe, Co. Leitrim", "Teacher:": "\nTomás Searplaigh\n"}, {"Collector": "Kathleen Mc Teigue", "Gender": "female", "Address": "Aughnasheelan, Co. Leitrim"}, {"Informant": "Peter Dolan", "Gender": "male", "Address": "Moher, Co. Leitrim"}, {"Language": "English"}]}, "4658438/4655678/4662653": {"title": "A True Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0222, Page 572", "Page 572"], "url": "https://www.duchas.ie/en/cbes/4658438/4655678/4662653", "text": "\nIn 1919 there lived a young girl in Leer named Mary Bohan.  She was very handsome.  She came to this school for a few years.  She died when she was about 19 years of age.  The people of that time believed in fairies.  Her mother said that she heard her talking in the forth that was beside the house.\n\n\n\nThere lived a man named Johny Morris in the townland of Clonee in the parish of Gortlettragh which is in the south of Co. Leitrim.One winter's morning he was going to the fair with pigs.  It was dark.  When he came out on the road out of his own lane a big black pig stood before him on the road.  He went on and the pig before him.  When he went to the top of the Trean Hill the black pig went into Reynolds fields.\n\n\n\nMrs Higgins gave me this story which she says is time.One night Jessie McKenna and her little brother Matt were playing in a neighbours house.  She was about seven years and Matt was about four years.\n(continues on next page)\n", "school_info": "School: Drumgownagh", "metadata": [{"Location:": "Drumgownagh, Co. Leitrim", "Teacher:": "\nDominic Ó Huiginn\n"}, {"Collector": "Máire Ní Bhrádaigh", "Gender": "female", "Address": "Keeldra, Co. Leitrim"}, {"Informant": "Mrs Higgins", "Gender": "female", "Address": "Anskert, Co. Leitrim"}, {"Language": "English"}]}, "4672113/4671346/4672309": {"title": "The Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0172, Page 028", "Page 028"], "url": "https://www.duchas.ie/en/cbes/4672113/4671346/4672309", "text": "", "school_info": "School: Corr-Shaileach", "metadata": [{"Location:": "Corsallagh, Co. Sligo", "Teacher:": "\nTomás Ó Ceallaigh\n"}, {"Collector": "Annie Donohoe", "Gender": "female", "Address": "Corsallagh, Co. Sligo"}, {"Informant": "Henry Donohoe", "Relation": "parent", "Gender": "male", "Age": "circa 50", "Address": "Corsallagh, Co. Sligo"}, {"Language": "English"}]}, "4672107/4670871/4672755": {"title": "Valley of The Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0171, Page 031", "Page 031"], "url": "https://www.duchas.ie/en/cbes/4672107/4670871/4672755", "text": "\nOne fair morning about thirty years ago there was a man in the townland of Derrings going to the fair with pigs. His daughter went with him part of the way, for those times people used to walk the pigs to the fair. On her return home she saw a woman after a pig up and down inside the ditch at the bridge. She thought it was one of her neighbours and was just about to go into help her, when she saw a fire out of the pig's mouth and as soon as she would have the pig at the ditch ready to put him out he would rush off again.\n", "school_info": "School: Cloonacool", "metadata": [{"Location:": "Cloonacool, Co. Sligo", "Teacher:": "\nSeán Ó Blioscáin\n"}, {"Language": "English"}]}, "4672088/4669134/4678522": {"title": "Muc Duff", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0164, Page 090", "Page 090"], "url": "https://www.duchas.ie/en/cbes/4672088/4669134/4678522", "text": "\nMuc Duff was so called because the time of the Rebellion the Orangemen invaded Co Sligo as they were marching on Muc Duff, they were encountered by a Big Black Pig at Devlin Bridge that met them face to face and they put up an awful battle with her. They had to put twelve shots in in her side, before she was slain, and since that day the place is so called Muc Duff.\n", "school_info": "School: Enniscrone (G.)", "metadata": [{"Location:": "Inishcrone, Co. Sligo", "Teacher:": "\nBean de Búrca\n"}, {"Collector": "Sadie Tuffy", "Gender": "female", "Address": "Loughtee Upper, Co. Cavan"}, {"Language": "English"}]}, "4672093/4669356/4679088": {"title": "Legend - The Black Pig of Mucduff", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0164, Page 310", "Page 310"], "url": "https://www.duchas.ie/en/cbes/4672093/4669356/4679088", "text": "\nLong, long, ago, Children of Ulaidh who went to school often complained of being tired. One day their parents asked them \"Why were they so tired,\" they said \"When we go to school the teacher turns into a hare and we turn into hounds and we have to chase after him. \"The people of the town agreed to have hunters to chase him. Next day the hunters chased him into the sea. When he got into the sea he turned into a black pig and he swam up the Bellawady River which means broken stick = because St. Patrick hit him with a stick on the back. One of the men touched the pig and got fits. A man in the field ran to a bundle of rushes and tired to get some water. He tired to bring some in his cap and his hands but he could not. One little woman ran and put her hands together and brought the water to him. It is a saying since that \"A woman can put her hands tighter together than a man.\"\n", "school_info": "School: Mairnéulaigh", "metadata": [{"Location:": "Inishcrone, Co. Sligo", "Teacher:": "\nAnn, Bean Uí Blachnaigh\n"}, {"Collector": "Constance Carroll", "Gender": "female", "Address": "Frankford, Co. Sligo"}, {"Language": "English"}]}, "4672093/4669357/4679089": {"title": "Legend - The Black Pig of Ben Bulbin", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0164, Page 311", "Page 311"], "url": "https://www.duchas.ie/en/cbes/4672093/4669357/4679089", "text": "\nLegend - The Black pig of Ben BulbinAbout five miles to the north of the town of Sligo lies a mountain called Ben Bulbin. In the centuries gone by this mountain was called Ben Gullan. On this dreary mountain a black wild boar used to roam over. He was the terror of the district as he was not an ordinary pig but one changed by the magical arts of the Dedannans who lived long ago in Ireland.At one time a child was placed with a warrior to be trained up as a hero and to learn the arts of war and fighting. It happened there was another child receiving education and training, which was the custom in these far distant ages with the same warrior teacher. The servants of the warrior teacher loved the second child more than the first child. When the father of the first child discovered this he slew the second child. When the father found out his child was killed he called to see him and finding his child dead he changed the murderer into a wild bristly boar without ears or tail and said in the future he was to kill the first child when grown up to be a man.The black boar was to live to the same age as the man and there was strife to exist between the grown up child and the black pig during their lives.On the mountain the black pig was pursued by hounds and the pig was far ahead of\n(continues on next page)\n", "school_info": "School: Mairnéulaigh", "metadata": [{"Location:": "Inishcrone, Co. Sligo", "Teacher:": "\nAnn, Bean Uí Blachnaigh\n"}, {"Collector": "Constance Carroll", "Gender": "female", "Address": "Frankford, Co. Sligo"}, {"Language": "English"}]}, "4701754/4699557/4708846": {"title": "A Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0185, Page 0070", "Page 0070"], "url": "https://www.duchas.ie/en/cbes/4701754/4699557/4708846", "text": "\n(continued from previous page)\nleft the two children beside the ghost screaming and crying. He almost broke the door in. He couldn't tell his wife what had happened he was so frightened but she heard the children crying and came to them. Of course she saw the fake ghost and then she realised what was the matter.\n\n\n\nIn olden days there was such a thing as witchcraft. There was an old druid schoolmaster here in Ireland. He could turn people into anything he wanted. At recreation time everyday he changed the children into hares and hounds. One day a little boy got killed in the chase. He had another brother and he didn't get killed. When he went home he told his mother all that happened so she was very angry and swore revenge. She went to a druid who had higher powers\n(continues on next page)\n", "school_info": "School: Carrowreagh", "metadata": [{"Location:": "Carrowreagh, Co. Sligo", "Teacher:": "\nElizabeth Benson\n"}, {"Collector": "Nancy Deehan", "Gender": "female", "Address": "Deechomade, Co. Sligo"}, {"Informant": "Mrs Annie Deehan", "Relation": "parent", "Gender": "female", "Address": "Deechomade, Co. Sligo"}, {"Language": "English"}]}, "4701679/4692148/4725907": {"title": "The Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0160, Page 087", "Page 087"], "url": "https://www.duchas.ie/en/cbes/4701679/4692148/4725907", "text": "\nNear my home is a large hill called \"The Blackmud Hill.\" It is lined with trees on each side and at night it appears very dark. One night a man was coming along the road about a quarter of an hour past twelve o'clock and there was no moon. When he came to the hill it was very dark. Near the top of the hill, a huge black pig emerged from the hedge in front of him, crossed the road, and vanished into the wall on the other side. The man fainted and revived after having been lying on the road for some time. He died shortly after this incident happened. At the foot of the hill is a well sunk down in the ditch, at the side of the road. It is dry now and\n(continues on next page)\n", "school_info": "School: Dunally", "metadata": [{"Location:": "Doonally, Co. Sligo", "Teacher:": "\nFlorence Egan\n"}, {"Collector": "Peter Conan Casey", "Gender": "male", "Address": "Hazelwood Demesne, Co. Sligo"}, {"Informant": "Mrs Bridget Mc Guinn", "Relation": "grandparent", "Gender": "female", "Address": "Hazelwood Demesne, Co. Sligo"}, {"Language": "English"}]}, "4701728/4696726/4758972": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0179, Page 448", "Page 448"], "url": "https://www.duchas.ie/en/cbes/4701728/4696726/4758972", "text": "\n(continued from previous page)\nbig I will visit it, please God.\n\n\n\nThis is a story about the Valley of the Black Pig.The pig was first seen at Drumkeeran, and then came by the Black Road down to Tulnasereena, and on to Carnaguilty where she had a drink in a well. From that day to this day it is called \"Tobar na Muc\". It rested there for a few hours and then came on to Conway's Cross. She went on the road to Rockbrook and Rineullew. She followed on the old road through Sooey, down to Doonally and Ballygrania, into Collooney.She swam a river, and over by Camphill on to Coolaney, and Tubercurry, and to Claremorris.It is said that the railway line from\n(continues on next page)\n", "school_info": "School: Sooey", "metadata": [{"Location:": "Sooey, Co. Sligo", "Teacher:": "\nSeán Ó Hóráin\n"}, {"Collector": "Mae Brennan", "Gender": "female", "Address": "Sooey, Co. Sligo"}, {"Informant": "Michael Burke", "Gender": "male"}, {"Language": "English"}]}, "4758473/4746994/4760049": {"title": "The Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0250, Page 014", "Page 014"], "url": "https://www.duchas.ie/en/cbes/4758473/4746994/4760049", "text": "\nA black pig was supposed to exist at Kiltrustan school.  It is now about 21 years since it was seen last.  It was at the spring well for fourteen hundred years.  Two children going to school saw him.  People said that he used to have young pigs with him numbering about seven.  It also appeared like a red woman with small children numbering the same as the pigs.  It also appeared like a black rabbit.  It is said that no hound would catch it but a hound as black as paint with no white spot on it.  The place where he was seen is called the \"Valley of the black pig\". People came from all places to see him but none of these saw him.  He also resided in the trunk of a large tree.  One morning as two men were going to the fair they saw him in the shape of a woman with one side of her face red and the other half black.  When passing by the front of the school she was standing inside looking out on the window and when they went up farther above the school she was looking out on the back window.  Two men more went on and found her picking haws off the bushes.\n", "school_info": "School: Kiltrustan", "metadata": [{"Location:": "Kiltrustan, Co. Roscommon", "Teacher:": "\nM. Mac Tighearnáin\n"}, {"Collector": "Thomas Flanagan", "Gender": "male", "Address": "Cloonahee, Co. Roscommon"}, {"Language": "English"}]}, "4758473/4746995/4760055": {"title": "The Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0250, Page 015", "Page 015"], "url": "https://www.duchas.ie/en/cbes/4758473/4746995/4760055", "text": "\nThe Black Pig.The story of the Black Pig is well known for many years back. It is believed that it was around Dowd's turn at the corner of Creta old road that this animal was seen. It was seen by two girls named Dowd and Kelly both of whom lived beside other. When they used to be passing they used to hear the pig grunting and they looked and saw it was a queer class of a pig. They used to see it every morning and the scholars waited for those girls to see him but no others could see him. At last the children got afraid to pass and the school had to be closed. It was in the year 1918 he was first seen. It is said he was lying at St. Patrick's Well for 1,400 years. It spread far and near and severals came to see the scene but no others could see it. One morning she met one of the girls coming to school without her pal. She asked her \"Where is your pal.\" She said \"She is at home to-day.\" The woman gave her a slide for herself and another for the one that was at home. She would not take them as the priest had told her not to take any-\n(continues on next page)\n", "school_info": "School: Kiltrustan", "metadata": [{"Location:": "Kiltrustan, Co. Roscommon", "Teacher:": "\nM. Mac Tighearnáin\n"}, {"Collector": "Bridget Murphy", "Gender": "female", "Address": "Grange, Co. Roscommon"}, {"Language": "English"}]}, "4723877/4721452/4780349": {"title": "A Hunting Song", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0961, Page 205", "Page 205"], "url": "https://www.duchas.ie/en/cbes/4723877/4721452/4780349", "text": "\n(continued from previous page)\nFairwell Captain Johnston for shortly I will dieTo never a sportsman on earth would I yield,But to you Captain Johnston of sweet Killaneil.Chorus: With my hark tally-ho,With my hark tally-ho,Hark over, Hark over.With my hark tally-ho.\n\n\n\nThe black pig was said to be seen in Donagh bog by James Steward. It was said to have done much damage. The black pig was said to be a very cruel man in time of the war, and was turned into a pig. He was also seen in Tully and round Tully lake and he was seen going into the lake.\n", "school_info": "School: Cluain Cátha", "metadata": [{"Location:": "Cloncaw, Co. Monaghan", "Teacher:": "\nP. Ó Hanluain\n"}, {"Collector": "John Treacy", "Gender": "male", "Address": "Pullis, Co. Monaghan"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "male", "Age": "50"}, {"Language": "English"}]}, "4658438/4655767/4782467": {"title": "A Ghost Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0222, Page 661", "Page 661"], "url": "https://www.duchas.ie/en/cbes/4658438/4655767/4782467", "text": "\nAbout two years ago there was a man coming off his ceilidhe at night.  He had to pass by the little bridge in Annaghmore.When he passed the little bridge and came to the turn of the road a little black dog ran out on the road before him.  He had a stick in his hand and he struck the dog.  When he struck him he changed to a different colour and followed the man.  He struck him again and he changed to another colour. He pursued him part of the road and then made a dash into the hedge and the man did not see him more.\n\n\n\nOnce upon a time there was a King in Ireland and he had only son whom he wanted to get a good education.  So he sent him to school to Donegal which he thought was good.Every day the teacher of that school brought them children out to a field.  He could work majic.  He turned the Kings son into a hare and the rest of the boys into hounds\n(continues on next page)\n", "school_info": "School: Drumgownagh", "metadata": [{"Location:": "Drumgownagh, Co. Leitrim", "Teacher:": "\nDominic Ó Huiginn\n"}, {"Collector": "Máire Ní Bhrádaigh", "Gender": "female"}, {"Informant": "Mrs Moran", "Gender": "female", "Address": "Keeldra, Co. Leitrim"}, {"Language": "English"}]}, "4742167/4741555/4814653": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0775, Page 035", "Page 035"], "url": "https://www.duchas.ie/en/cbes/4742167/4741555/4814653", "text": "\nA game called \"Beat out the bull\" used to be played at wakes. This is how it was played. Five or six fellows would get pieces of rope and plait them and at the end of each they would put a big knot. They would then get out some other person on the floor and they would give him a terrible beating.Told by Patrick Lyons, aged 72 to Eileen Connelly, Allenwood NS, Naas, Co. Kildare\n\n\n\nThere is well in Mr Thorton's field and it is called the \"Fuaran\". Another game they used to play at wakes was called \"Box the Fox\". Patrick Lyons.\n\n\n\nA black pig is supposed to have run across the bog before the '98 rising and nobody could catch it. The old people say that when the black pig runs across the bog, something bad is going to happen.Told by Patrick Lyons, aged 72, to Eileen Connolly, Allenwood NS Robertstown Naas.\n", "school_info": "School: Allenwood, Robertstown", "metadata": [{"Location:": "Allenwood, Co. Kildare", "Teacher:": "\nSeán Ó Clúmháin\n"}, {"Collector": "Eileen Connolly", "Gender": "female"}, {"Informant": "Patrick Lyons", "Gender": "male", "Age": "72"}, {"Language": "English"}]}, "4769963/4763081/4924143": {"title": "The Race of the Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0779, Page 055", "Page 055"], "url": "https://www.duchas.ie/en/cbes/4769963/4763081/4924143", "text": "\nThe Race of the Black PigThe Race of the Black Pig is said to be the track of an ancient road running across the Curragh in the direction of the great Rath of Ailleann.  It runs through a vale of the Curragh; it would be now difficult to form an idea of its original breadth as the rains have much altered the surface by washing down its banks and disfiguring it by its deposits.  It is mentioned in the prophecy of St. Columcille as a place that is to be the scene of dreadful slaughter towards the end of the world.  A black pig will run over that track and destroy all before it.\n", "school_info": "School: Cill Dara (Pres. Convent)", "metadata": [{"Location:": "Kildare, Co. Kildare", "Teacher:": "\nSr. Philomena\n"}, {"Language": "English"}]}, "4798715/4792793/4925123": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0256, Page 052", "Page 052"], "url": "https://www.duchas.ie/en/cbes/4798715/4792793/4925123", "text": "\nOne time a man went to cut a tree that the black pig used to sleep under. As he was cutting it the tree began to bleed. He kept on cutting it and did not take any notice of the blood. When it was cut he brought it down and laid it in the garden. In the evening, when the cattle were coming home two of them jumped across the tree and died. Next morning the man's arms were all swollen and he also felt very sick. One night when he was groaning with pain a figure appeared to him in the room and told him to leave back the tree where he cut it. In the morning he left back the tree and he had no more pains after that.\n", "school_info": "School: Slattagh", "metadata": [{"Location:": "Moher, Co. Roscommon", "Teacher:": "\nBrian Ó Baoighill\n"}, {"Collector": "Jack Mullaney", "Gender": "male", "Address": "Culleenaghamore, Co. Roscommon"}, {"Informant": "W. Mullaney", "Address": "Culleenaghamore, Co. Roscommon"}, {"Language": "English"}]}, "4758567/4755301/4926739": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0862, Page 443", "Page 443"], "url": "https://www.duchas.ie/en/cbes/4758567/4755301/4926739", "text": "\nOnce upon a time a woman was coming home from a dance and it was about three oclock in the Morning. As she saw passing a gate she saw a big black pig. The pig followed her home to her own gate. When the woman went in she fell on the floor. The people of the house carried her to bed that night. The black pig came to the window and the next morning the woman was dead. When the woman was waking the pig came into the room.\n", "school_info": "School: Johnswell, Kilkenny", "metadata": [{"Location:": "Johnswell, Co. Kilkenny", "Teacher:": "\nD. Ó Héigceartaigh\n"}, {"Collector": "Rita Fitzpatrick", "Gender": "female"}, {"Informant": "Richard Fitzpatrick", "Relation": "parent", "Gender": "male", "Age": "47"}, {"Language": "English"}]}, "4798713/4792702/4933631": {"title": "Story of the Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0255, Page 436", "Page 436"], "url": "https://www.duchas.ie/en/cbes/4798713/4792702/4933631", "text": "\nStory of the Black PigAbout twenty or twenty one years ago a black pig was seen by two or three children and others at Kiltrustan School. The children who saw it were Bridie Conneilly and Mrs. Dowd, and Ellsie Kelly. There is a small ditch just outside the School and when these children used to go out to play the pig used to appear, no other child could see the pig except these children and the Teacher could not see it either When the pig used to appear the children used to show it to the Teachers but they could not see it.This pig used to appear and disappear at various times and the children began to fear. So they went to the priest and told him, and he advised them not to go to that school again, and they went to another school and the Black Pig was never seen again\n", "school_info": "School: Ballyfeeny", "metadata": [{"Location:": "Kilglass, Co. Roscommon", "Teacher:": "\nCáit, Bean Uí Mhurthuile\n"}, {"Collector": "Nancy Roland", "Gender": "female", "Address": "Clooneen (Hartland), Co. Roscommon"}, {"Language": "English"}]}, "4798713/4792711/4933766": {"title": "Story - The Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0255, Page 445", "Page 445"], "url": "https://www.duchas.ie/en/cbes/4798713/4792711/4933766", "text": "\nStoreThe Black PigSome time ago it was believed that a black Pig was to be seen near a well in Coile. A girl of the name of Veronica Donohue was supposed to have seen it every time she went to the well. Many times she brought priests with her but she could still see the pig and they could not. They used also read round the well for some hours. One day they asked her to put her hand on the pig but she could not. They then believed it was only her imagination, but still every time she went to the well after that she could see the Black Pig but nobody else could.\n", "school_info": "School: Ballyfeeny", "metadata": [{"Location:": "Kilglass, Co. Roscommon", "Teacher:": "\nCáit, Bean Uí Mhurthuile\n"}, {"Collector": "Katie Fallon", "Gender": "female", "Address": "Ballyhubert, Co. Roscommon"}, {"Informant": "Mrs Fallon", "Gender": "female", "Address": "Ballyhubert, Co. Roscommon"}, {"Language": "English"}]}, "4723821/4716404/4936618": {"title": "Potatoes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0936, Page 141", "Page 141"], "url": "https://www.duchas.ie/en/cbes/4723821/4716404/4936618", "text": "\n(continued from previous page)\nmade out of a beech tree for it was ash it would split when it would be a bolting on the plough. There was a sock on it and it was made of iron and it was about four inches long.\n\n\n\nUp in a field in Ballygreaney a priest said mass and where the mass book was there is a bare place and no grass or moss ever grew on it.In Shanmullagh there is a round flat stone called the pounding stone. The people used to pound whins on it for to give to horses. There is another one in Annasera.\n\n\n\nIn the townland of Tullybuck their is a antymoney mines which was used a cuple of years ago. There is also a black pigs race.\n\n\n\nAt Clay Lough in Co. Armagh there was a girl who's name was Kelly and she was a which. She could turn herself\n(continues on next page)\n", "school_info": "School: Moys", "metadata": [{"Location:": "Moy Otra, Co. Monaghan", "Teacher:": "\nP. Dawson, C. Mac an Ghirr\n"}, {"Language": "English"}]}, "4723821/4716404/4936620": {"title": "Potatoes", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0936, Page 141", "Page 141"], "url": "https://www.duchas.ie/en/cbes/4723821/4716404/4936620", "text": "\n(continued from previous page)\nmade out of a beech tree for it was ash it would split when it would be a bolting on the plough. There was a sock on it and it was made of iron and it was about four inches long.\n\n\n\nUp in a field in Ballygreaney a priest said mass and where the mass book was there is a bare place and no grass or moss ever grew on it.In Shanmullagh there is a round flat stone called the pounding stone. The people used to pound whins on it for to give to horses. There is another one in Annasera.\n\n\n\nIn the townland of Tullybuck their is a antymoney mines which was used a cuple of years ago. There is also a black pigs race.\n\n\n\nAt Clay Lough in Co. Armagh there was a girl who's name was Kelly and she was a which. She could turn herself\n(continues on next page)\n", "school_info": "School: Moys", "metadata": [{"Location:": "Moy Otra, Co. Monaghan", "Teacher:": "\nP. Dawson, C. Mac an Ghirr\n"}, {"Language": "English"}]}, "4922010/4918074/4942121": {"title": "Strange Animals - The Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0501, Page 074", "Page 074"], "url": "https://www.duchas.ie/en/cbes/4922010/4918074/4942121", "text": "\nOne night a man was walking down the bank of the river and he saw a black pig and the pig began to follow him. Then he started to run. After a while he gave a look back and the pig had disappeared, but he kept on running until he came to the wall. Then he saw the pig again and he got a terrible fright and he turned around and ran home and he was never out late after. Then he told his companions and the night after they went down.\n", "school_info": "School: Ráth gCaola (B.)", "metadata": [{"Location:": "Rathkeale, Co. Limerick", "Teacher:": "\nSeán Ó Coindealbháin\n"}, {"Collector": "Bernard O Rourke", "Gender": "male", "Address": "Rathkeale, Co. Limerick"}, {"Language": "English"}]}, "4922001/4916983/4949602": {"title": "The Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0498, Page 241", "Page 241"], "url": "https://www.duchas.ie/en/cbes/4922001/4916983/4949602", "text": "\nThere was a man coming home from Limerick after selling a load of butter late one night. On his way in his own boreen which was very long a very small woman hopped up on the ditch and asked him for a drive though at that time he wasn't a hundred yards from his own house. He told her to sit up and she mounted the boxes but no sooner had she done so than the straddle turned round underneath the horse. The man turned towards the woman saying \"Have you anything to do with this\"but no one answered him. Looking up he saw that the woman had disappeared. He looked in front of him and saw a black pig making for the gate.\n", "school_info": "School: Brúgh Ríogh (B.)", "metadata": [{"Location:": "Bruree, Co. Limerick", "Teacher:": "\nDonncha Ó Haragáin\n"}, {"Informant": "Michael O' Rourke", "Gender": "male", "Age": "78", "Address": "Ballyhinnaught, Co. Limerick"}, {"Language": "English"}]}, "4922140/4856104/5012431": {"title": "Story - The Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0536, Page 313", "Page 313"], "url": "https://www.duchas.ie/en/cbes/4922140/4856104/5012431", "text": "\nSome years ago a black bonham strayed into a field of Mr Ryan of Curraheen and went on grazing with other pigs who were in the field.Mr Ryan tried to find an owner but none was found, so he said he would keep him, and in the course of time, the black bonham and the others became fat pigs.Market day came and the farmer decided go sell all the pigs including the black pig himself. They turned the pigs out of the house and lifted them into the car, at last they turned out the black pig, but he slipped from their\n(continues on next page)\n", "school_info": "School: Gort an Gharrdha", "metadata": [{"Location:": "Gortagarry, Co. Tipperary", "Teacher:": "\nSeán Ó Donnabháin\n"}, {"Informant": "James O Shea", "Gender": "female", "Age": "60", "Occupation": "carpenter", "Address": "Curraheen, Co. Tipperary"}, {"Language": "English"}]}, "5008825/4959187/5072916": {"title": "The Jumping Church of Millickstown", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0662, Page 077", "Page 077"], "url": "https://www.duchas.ie/en/cbes/5008825/4959187/5072916", "text": "\nThe Jumping Church of Millickstown got its name from the fact that it left its original place of foundation. It is said that it was once a Catholic Church. After a time it was converted into a Protestant one. There was a Protestant Minister buried inside it while it was in the hands of non-Catholics. Next morning after the burial the Church had turned on its sides and left the grave outside. (Near Ardee about 1 1/2 miles out in the Drogheda direction.)\n\n\n\nNear Ardee there is supposed to be a black pig which appears when any misfortune is about to befall the people in the surrounding district.Nora KirkTold by my fatherPatrick Kirk\n", "school_info": "School: Dundalk (Dundalk Road Convent)", "metadata": [{"Location:": "Dundalk, Co. Louth", "Teacher:": "\nSr. M. Oliver\n"}, {"Collector": "Nora Kirk", "Gender": "female"}, {"Informant": "Patrick Kirk", "Relation": "parent", "Gender": "male"}, {"Language": "English"}]}, "5008826/4959209/5072947": {"title": "Halloween", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0662, Page 099", "Page 099"], "url": "https://www.duchas.ie/en/cbes/5008826/4959209/5072947", "text": "\nHallowe'en    Two basins - one of clean water and of dirty water. A girl was blindfolded, and if she selected the clean water she got a young man, and if the dirty water an old man.A girl blindfolded goes out and pulls a cabbage stalk. If she gets a straight one she gets a nice man, and if a crooked one a bad man.\n\n\n\nTwelfth Night: On eve of twelfth night twelve blessed candles were lighted in honour of the twelve apostles, and the remains of the candles were put up over the stable door.\n\n\n\nHallowe'en: The hearth was swept clean and a plate of champ was left for the poor souls.\n\n\n\nBonfire night: On St. John's eve 24th June fiddlers came and there was Irish dancing round the bonfire.\n\n\n\nThe Black Pig ran down the Ardee Road on his way to the Boyne. There will be trouble on the [Race?] of the Black Pig. (Miss Annie Costello).\n", "school_info": "School: Mullaharlin", "metadata": [{"Location:": "Mullagharlin, Co. Louth", "Teacher:": "\nSs. Mac Siúrdáin\n"}, {"Informant": "Annie Costello", "Gender": "female", "Age": "82", "Address": "Killally, Co. Louth"}, {"Language": "English"}]}, "5008842/4960334/5073959": {"title": "Fairy Stories", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0667, Page 100", "Page 100"], "url": "https://www.duchas.ie/en/cbes/5008842/4960334/5073959", "text": "\nOnce upon a time there was a fairy mound with a lone tree growing on it and a farmer decided to cut it down for fire wood, but a voice spoke up from the mound and said \"Do not cut that tree.\" The farmer cut it down took it home and cut it up for firewood. The he put it under the pot to boil his dinner. Before long it blew the pot off the fire so he threw the wood outside and a voice cried out and clapped his hands and said, \"You will put the tree back where you got it and you won't go near a lone tree again.\"There was a boy coming from school once upon a time and he lifted a flag fro mthe cace and went off with it. Before long a voice cried after him and said, \"Don't take that stone or we will send you home riding on a cow.\" The boy disobeyed the request of the fairly and the fairy lifted a piece of weed and changed it into a cow and the boy found himself riding on it. He was taken all over the Country. He said he would never go near any thing belonging to the fairy mound again.\n\n\n\nTwo days before the war between the Orange men and the Irish there is to run a black pig from above Ardee down by Readypenny and through Knock Bridge and he is to run any where there is red clay.Máire Nica MhaighistirKillencooleReadypenny\n", "school_info": "School: Darver (C.), Dundalk", "metadata": [{"Location:": "Darver, Co. Louth", "Teacher:": "\nM. Ní Mhuireagain\n"}, {"Collector": "Máire Nic a Mhaighistir", "Gender": "female", "Address": "Readypenny, Co. Louth"}, {"Language": "English"}]}, "5008834/4959578/5074062": {"title": "The Townland of Dungooley", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0664, Page 230", "Page 230"], "url": "https://www.duchas.ie/en/cbes/5008834/4959578/5074062", "text": "\n(continued from previous page)\nghosts. I heard the following story about a ghost. It was a woman married  Mrs. Casey, Dungooley, Kilcurry, Dundalk, Co. Louth. The house that the ghost was in, was belonged to Mr. Rocks. \"The ghost was in a press in the corner of the kitchen. So the people were afraid to look inside the press, and at the end of a few years they decided to send for the priest to try and banish the ghost and when the priest came he unlocked the press and it was a little rabbit with a man's head on it that was inside and he put it in a bottle and left it in the press and it is believed that since that, the bottle is in the press but the priest blessed the house and the noise was never heard since.\"\n\n\n\nOnce upon a time it is said there was around by Falmore, Stumpa, Dungooley, Drumbilla, and Skyhill a black pig, it ran from daylight to dark through bogs and hedges and caves and was shot at Drogheda and is called the race of the black magic pig. This story was told by, Patrick Coburn. Dungooley, Kilcurry, Dundalk, Co. Louth, to his nephew. Joseph Grant of the same address.\n(continues on next page)\n", "school_info": "School: Kilcurry, Dundalk", "metadata": [{"Location:": "Kilcurry, Co. Louth", "Teacher:": "\nP. Ó Conaill\n"}, {"Language": "English"}]}, "5008834/4959579/5074076": {"title": "The Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0664, Page 231", "Page 231"], "url": "https://www.duchas.ie/en/cbes/5008834/4959579/5074076", "text": "\n(continued from previous page)\nThe above story was heard by Edward Casey a farmer living in Dungooley from a man named Cassidy from Kildare who was working in Smiths who were then living in Dungooley and who now live in the Post Office in Forkhill.\n\n\n\nOnce upon a time there was a schoolmaster in Roche, Co. Louth. There was a Dukes son going to his school and he was a very smart boy. He was failing and his father asked him what was the cause of it, and he told him that the master had a magic wand behind the door and that he struck him at playtime with it and turned him into a hare and he struck other scholars and turned them into dogs and then they were chasing him for the play at playtime. The father went to the school and got the wand and struck the schoolmaster and turned him into a black pig and he ran through\n(continues on next page)\n", "school_info": "School: Kilcurry, Dundalk", "metadata": [{"Location:": "Kilcurry, Co. Louth", "Teacher:": "\nP. Ó Conaill\n"}, {"Collector": "Joseph Grant", "Gender": "male", "Address": "Dungooly, Co. Louth"}, {"Informant": "Patrick Coburan", "Gender": "male", "Address": "Dungooly, Co. Louth"}, {"Language": "English"}]}, "5008844/4960548/5075232": {"title": "The Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0667, Page 314", "Page 314"], "url": "https://www.duchas.ie/en/cbes/5008844/4960548/5075232", "text": "\nThere is a valley in Castleroach called the valley of the \"black Pig\"  the black pig is supposed to be the orange men going round gathering men to fight the Irish. He ran round world from Fochairt to Castle-roach: and the clay of the field in which he was killed is red like blood. It is said that he ran round the walls of Laghn (?) three times  it is about four and a half miles from Ardee.It s also said the black pig will run again at the end of the world.\n\n\n\nThe potato cropThe potato crop is one of which the farmers of this district plant; they are generally planted about the month of March or April Before you plant potatoes you must make the soil fine by ploughing it and then you harrow it; if it is not then you will have to cross plough it\n(continues on next page)\n", "school_info": "School: Aclint, Ardee", "metadata": [{"Location:": "Aclint, Co. Louth", "Teacher:": "\nP. Ó Neill\n"}, {"Collector": "Annie Mohan", "Gender": "female", "Address": "Aclint, Co. Louth"}, {"Informant": "Maggie Mohan", "Gender": "male", "Address": "Aclint, Co. Louth"}, {"Language": "English"}]}, "5008851/4961076/5076805": {"title": "Fairy Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0669, Page 119", "Page 119"], "url": "https://www.duchas.ie/en/cbes/5008851/4961076/5076805", "text": "\nFairy Story This is a strange story told by my grandfather who lived in Tullakeel, Co Louth. One night he was in bed. At about two or three o'clock in the morning he was awakened by sweet music played on some instrument that he did know of. The music suddenly stopped and he saw a man's head appearing at the top of the window. He heard great noises as of falling stones especially at the back of the house. In the morning he went out but he saw nothing unusual about. When the news went about the old people said that there used to be a path there that the fairies used to follow and the trouble began when they found the house built in their way Berna Sharkey Castle St Ardee\n\n\n\nThe Race of the Black PigSome of the old people who live near us still believe in that rather queer superstition called the \"Race of the Black Pig\".The White Stone Lane which runs through our yard is the route that he is supposed to\n(continues on next page)\n", "school_info": "School: Ardee (Mercy Convent)", "metadata": [{"Location:": "Ardee, Co. Louth", "Teacher:": "\nSr M. Angel\n"}, {"Collector": "Dympna Clarke", "Gender": "female", "Address": "Barnaveddoge, Co. Louth"}, {"Language": "English"}]}, "5008868/4962278/5077009": {"title": "The Story of the Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0675, Page 038", "Page 038"], "url": "https://www.duchas.ie/en/cbes/5008868/4962278/5077009", "text": "\nIn Clogherhead there is a town land known as Mayne in English. Long, long ago - the old people tell us - there was a very cross teacher teaching in a school near Drogheda. One day the teacher slapped one of the scholars. This boy was a tell tale of course, he told his father. This man had magic powers. He came to the school next morning. He took his magic wand with him. When he reached the school he waved his wand turned the teacher into a black pig and the pupils into large hounds. Then the race started. They ran through Termonfeckin, Clogherhead till at Mayne the hounds caught and killed him. He was buried under a heap of earth called a mound. This is the story of the Black Pig .\n", "school_info": "School: Callystown (C.), Clogherhead", "metadata": [{"Location:": "Callystown, Co. Louth", "Teacher:": "\nBean Uí Mhurchadha\n"}, {"Collector": "Lillie Hoey", "Gender": "female", "Address": "Mayne, Co. Louth"}, {"Language": "English"}]}, "5008878/4963130/5081753": {"title": "The Race of the Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0677, Page 217", "Page 217"], "url": "https://www.duchas.ie/en/cbes/5008878/4963130/5081753", "text": "\nA master teaching school in Co Cavan was supposed to have magical power. He turned himself into a pig, the children stoned him to Kildemoc. They buried him in the stones.When he comes out the war will begin.He was supposed to be seen before the great War. He was of enormous size.\n", "school_info": "School: Belpatrick, Collon", "metadata": [{"Location:": "Belpatrick, Co. Louth", "Teacher:": "\nBean Uí Dhonnagáin\n"}, {"Collector": "William Curran", "Gender": "male", "Address": "Funshog, Co. Louth"}, {"Language": "English"}]}, "5044784/5037773/5082075": {"title": "The Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0963, Page 048", "Page 048"], "url": "https://www.duchas.ie/en/cbes/5044784/5037773/5082075", "text": "\nThe Valley of the Black Pig lies along here according to the old people who have passed away. When we were small we learned about the Black Pig very often and it was a kind of terror. Nothing would stop its race-war and death would follow in its tracks and always Ireland would win her freedom at the end of the race of the Black Pig.\n", "school_info": "School: Tullybrack", "metadata": [{"Location:": "Tullybrack, Co. Cavan", "Teacher:": "\nF. Maguire\n"}, {"Informant": "Frank Maguire", "Gender": "male", "Address": "Tullybrack, Co. Cavan"}, {"Language": "English"}]}, "5044786/5037997/5083350": {"title": "The Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0963, Page 315", "Page 315"], "url": "https://www.duchas.ie/en/cbes/5044786/5037997/5083350", "text": "\nThe race of the black pig is supposed to be from Swanlinbar to Kilmore chapel. There is going to be a a war and it will be a valley of dead bodies. The wheel of Balliness mill is said to be turned with blood when the war come. The Catholicks and Protestants will be fighting and the Protestants will fight well for three days and then they will fail. It is said wherever the pig fed there will be war and that was in Lisanover and Cor a Chapaill. Wherever the black pig went Protestants will fight strong. It is said he didn't go across the Shannon and anyone who will go across the Shannon will be safe. He has an eye in his forehead. It is said when ninthy nine generations cross the Woodford river the black pig will come back again.\n", "school_info": "School: Currin", "metadata": [{"Location:": "Corran, Co. Cavan", "Teacher:": "\nLiam Ó Léighinn\n"}, {"Informant": "Nora Gilroy", "Gender": "female", "Address": "Rossbressal or Bellaheady, Co. Cavan"}, {"Language": "English"}]}, "5070795/5064600/5096235": {"title": "Hidden Treasure", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1002, Page 121", "Page 121"], "url": "https://www.duchas.ie/en/cbes/5070795/5064600/5096235", "text": "\n(continued from previous page)\nthe two black gates above the farm he looked back and lost it.\n\n\n\nMonday for health.Tuesday for wealth.Wednesday the best day of any.Thursday for losses.Friday for crosses.Saturday for no luck at all.John Dunn Leitrim, Mullagh, and many others clean out their Wellson the 1st May\n\n\n\nA story is told of a black pig which runs through the Vally of the Blackpig\n(continues on next page)\n", "school_info": "School: Graughlough", "metadata": [{"Location:": "Greaghclogh, Co. Cavan", "Teacher:": "\nMrs Wade\n"}, {"Language": "English"}]}, "5070761/5060411/5099836": {"title": "The Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0991, Page 305", "Page 305"], "url": "https://www.duchas.ie/en/cbes/5070761/5060411/5099836", "text": "\nIt is said that there is such a thing as \"the Black Pig. He is a spirit in the bottom of some of the oceans, but what ocean it is not known. He is very black and is covered with slime out of the sea. There is but one black pig, and he has to travel through every country in the world two times. He can appear any place he likes and he can disappear any time he likes. In far off countries the people know very little about him. He travelled through Eire once, and is to travel through it once more. There is a certain bridge in the County Cavan called Anamiska bridge about one mile to the East of the village of Ballinagh\n(continues on next page)\n", "school_info": "School: Wateraghy", "metadata": [{"Location:": "Woteraghy, Co. Cavan", "Teacher:": "\nC. Ó Cuilinn\n"}, {"Collector": "Kathleen Cosgrove", "Gender": "female"}, {"Informant": "Patrick Cosgrove", "Gender": "male", "Age": "65", "Occupation": "farmer", "Address": "Corlismore, Co. Cavan"}, {"Language": "English"}]}, "5008941/4968627/5109688": {"title": "The Race of the Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0694, Page 307", "Page 307"], "url": "https://www.duchas.ie/en/cbes/5008941/4968627/5109688", "text": "\n307   The Race of the Black PigI got this old story from old Jim Cusack of Coolronan and I took it down just as he said it.  He is about eighty years of age.Kevin WalshThis story seems to tell us a great lot of history about our own county; it tells us why the stream running into the Stoneyford is black, because the story tells us that wheresoever a stream of black water flows the black Pig runs.The start of the name was when the Irish were beaten by the English a great lot of the people that remained were blacks, and they were very clever and the English were afraid they'd fight again and they chased them through what's now called the race of the black pig.  There was a great holy man leading them and he prayed to God to save them and it is said they disappeared under the ground and it's prophesied that they shall rise again and the black waters\n(continues on next page)\n", "school_info": "School: Coolronan", "metadata": [{"Location:": "Coolronan, Co. Meath", "Teacher:": "\nBean Uí Chonmhidhe\n"}, {"Collector": "Kevin Walsh", "Gender": "male"}, {"Informant": "Jim Cusack", "Gender": "male", "Age": "circa 80", "Address": "Coolronan, Co. Meath"}, {"Language": "English"}]}, "5008941/4968628/5109797": {"title": "The Race of the Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0694, Page 308", "Page 308"], "url": "https://www.duchas.ie/en/cbes/5008941/4968628/5109797", "text": "\n(continued from previous page)\nshall run red with blood  and Ireland shall be free.Some of the places where this water runs is:Cloughbrack, Killyon and Derrilee.\n\n\n\nYears ago up in the North of Ireland, the people were full of witchcraft and certain people could turn a person into an animal.There was once a schoolmaster who every day at dinnertime would turn one of his pupils into a hare and the remaining lot into hounds. The mother of this boy was a widow and she noticed her boy not thriving for a long time. So\n(continues on next page)\n", "school_info": "School: Coolronan", "metadata": [{"Location:": "Coolronan, Co. Meath", "Teacher:": "\nBean Uí Chonmhidhe\n"}, {"Collector": "Richard Kelly", "Gender": "male"}, {"Informant": "Michael Murry", "Gender": "male", "Address": "Rathkenna, Co. Meath"}, {"Language": "English"}]}, "5008941/4968630/5109935": {"title": "The Race of the Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0694, Page 310", "Page 310"], "url": "https://www.duchas.ie/en/cbes/5008941/4968630/5109935", "text": "\n(continued from previous page)\nan it is also related that the last Orange-man will shed his blood at Scariff Bridge.\n\n\n\nPeople say that there is a black pig under the ruins of the old castle in our land on the Brown estate.He comes out every seven years for a drink to a well near Kelly's in Carrenstown and he leaves the well dry for three months.\n\n\n\nThe race of the black pig rises at Paddy Hiney's in Robinstown and goes through the village of Ballivor and from Ballivor to Scariff.\n", "school_info": "School: Coolronan", "metadata": [{"Location:": "Coolronan, Co. Meath", "Teacher:": "\nBean Uí Chonmhidhe\n"}, {"Collector": "Bridget Keogh", "Gender": "female"}, {"Informant": "James Power", "Gender": "male", "Age": "circa 50", "Address": "Coolronan, Co. Meath"}, {"Language": "English"}]}, "5008941/4968630/5109936": {"title": "The Race of the Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0694, Page 310", "Page 310"], "url": "https://www.duchas.ie/en/cbes/5008941/4968630/5109936", "text": "\n(continued from previous page)\nan it is also related that the last Orange-man will shed his blood at Scariff Bridge.\n\n\n\nPeople say that there is a black pig under the ruins of the old castle in our land on the Brown estate.He comes out every seven years for a drink to a well near Kelly's in Carrenstown and he leaves the well dry for three months.\n\n\n\nThe race of the black pig rises at Paddy Hiney's in Robinstown and goes through the village of Ballivor and from Ballivor to Scariff.\n", "school_info": "School: Coolronan", "metadata": [{"Location:": "Coolronan, Co. Meath", "Teacher:": "\nBean Uí Chonmhidhe\n"}, {"Collector": "Janey Smith", "Gender": "female"}, {"Informant": "Mrs Martha Duignan", "Gender": "female", "Address": "Coolronan, Co. Meath"}, {"Language": "English"}]}, "5008941/4968631/5109939": {"title": "The Army Under Earls Mill", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0694, Page 311", "Page 311"], "url": "https://www.duchas.ie/en/cbes/5008941/4968631/5109939", "text": "\nThere is a field at Earls Mill where there are a lot of small hills and people say that Garret Óg and his army is under the ground and that Garret Óg had golden shoes on the horse and he lost one of them and if anyone could get that shoe the army would rise again and fight for Ireland.\n\n\n\nIt is prophesied that the black pig is to run from Drogheda to Slane and from Slane to Navan from Navan to Trim and from Trim to Scariff and from\n(continues on next page)\n", "school_info": "School: Coolronan", "metadata": [{"Location:": "Coolronan, Co. Meath", "Teacher:": "\nBean Uí Chonmhidhe\n"}, {"Collector": "Lilly Rispin", "Gender": "female"}, {"Informant": "(name not given)", "Relation": "parent", "Gender": "male"}, {"Language": "English"}]}, "5008980/4973296/5111286": {"title": "The Valley of the Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0706, Page 061", "Page 061"], "url": "https://www.duchas.ie/en/cbes/5008980/4973296/5111286", "text": "\nThere was once a School Master in Tyrone who had the power of magic. He was also very fond of hunting. At play-time every day he would change the children into Hares and Hounds. He would have them chasing around the playground. In the evening they would go home exhausted. One day a woman whose child went home exhausted got angry and came to the master.She also had the power of magic also. The master ignored her. She got furious and turned him into a Black Pig. She then said that he would cut his throat with his fore paws. he started running he ran down through Tyrone into Armagh from Armagh into Louth. He ran through this corner of Meath. He ran at the back of Moynalty through\n(continues on next page)\n", "school_info": "School: Moynalty (C.)", "metadata": [{"Location:": "Moynalty, Co. Meath", "Teacher:": "\nname not given\n"}, {"Collector": "Kathleen Smyth", "Gender": "female"}, {"Informant": "G. O' Connor", "Gender": "male", "Address": "Petersville, Co. Meath"}, {"Language": "English"}]}, "5008978/4973027/5111891": {"title": "The Valley of the Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0705, Page 231", "Page 231"], "url": "https://www.duchas.ie/en/cbes/5008978/4973027/5111891", "text": "\nThere was a school-master in Co Tyrone and every day at playtime, he would make a hare of one of the boys and three greyhounds of 3 other boys. Then he would make the greyhounds run after the hare to catch him. The children would be sick for a week after. One child's mother said she would stop him from that. She watched him next and listened to what he said. Then she turned the master into a black pig. She said \"Go on now till you go to the Boyne and swim there till you cut your throat\" The pig came on to the rock of Muff and hopped up on a stone and left the track of his knee on the stone and it is still to be seen. He came to the fort of Breakey and the cross of Cormeen and on to Cleice Dibh or \"Martin's Hills in Ughty\n(continues on next page)\n", "school_info": "School: Ughtyneill", "metadata": [{"Location:": "Ughtyneill, Co. Meath", "Teacher:": "\nMaighréad, Bean Uí Chinnéide\n"}, {"Collector": "Cristiná Nic an t Saoi", "Gender": "female", "Address": "Ballymakane, Co. Meath"}, {"Informant": "John Rogers", "Gender": "male", "Address": "Ballymakane, Co. Meath"}, {"Language": "English"}]}, "5008979/4973157/5112563": {"title": "The Valley of the Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0705, Page 360", "Page 360"], "url": "https://www.duchas.ie/en/cbes/5008979/4973157/5112563", "text": "\nThere was a School Master living in Co Antrim long ago and he had the power of magic. He was very fond of coursing with greyhounds and hares and rabbits. Every day at playtime he would change the children into hares and greyhounds. He would have the children running up and down the yard until play time was over and then he would change them back again so that the children used to go home exhausted every evening. One mother got very angry at this and she also had the power of magic. She went to him and changed him into a black Pig and she told him that he would run until he would cut his own throat with his two front paws. He started to run and ran down through Antrim, Down, Louth, and Meath until he came to the Boyne and he jumped into the Boyne and kept swimming until he cut his own throat with his two front paws. They Valley of the black pig runs from Antrim, Down, Louth and through various parts of Meath. It runs through Walterstown and Moynalty and leads on to the Boyne at Navan and that is why it\n(continues on next page)\n", "school_info": "School: Moynalty (B.)", "metadata": [{"Location:": "Moynalty, Co. Meath", "Teacher:": "\nUillford Ó Maoilmhichil\n"}, {"Collector": "Michal Reilly", "Gender": "male", "Address": "Moynalty, Co. Meath"}, {"Informant": "Patrick Reilly", "Gender": "male", "Address": "Moynalty, Co. Meath"}, {"Language": "English"}]}, "5008991/4974825/5113000": {"title": "A Fairy Story", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0710, Page 155", "Page 155"], "url": "https://www.duchas.ie/en/cbes/5008991/4974825/5113000", "text": "\n(continued from previous page)\nand did not like to stop the horse but as he was passing he recognised that it was Mac Cabe but he was too late then.Ever afterwards during life Gargan was tortured thinking of his friend Mac Cabe, and that he failed to do what he asked him. His cattle and sheep also died and he had no luck after\n\n\n\nIn olden times there was a school in the townland of Tiercorke, Moynalty, Co Meath. Children came form all parts of Ireland and also from England to it. A rich English gentleman sent his son over to be educated here.One day he paid a visit to his son. Wondering how thin the boy looked he asked him what happened him. The boy answered and said \"I have to run very hand for an hour every day as the school master turns me into a hare and the remainder of the scholars into hounds during play time.\n(continues on next page)\n", "school_info": "School: Edengorra", "metadata": [{"Location:": "Edengora, Co. Meath", "Teacher:": "\nMichael Hetherton\n"}, {"Collector": "Patrick Cusack", "Gender": "male", "Address": "Corcarra, Co. Meath"}, {"Informant": "George Blake", "Gender": "male", "Age": "76", "Address": "Kilfannan, Co. Meath"}, {"Language": "English"}]}, "5008991/4974827/5113011": {"title": "The Valley of the Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0710, Page 157", "Page 157"], "url": "https://www.duchas.ie/en/cbes/5008991/4974827/5113011", "text": "\nOnce upon a time there was a School Master in the North of Ireland and he was a wizard. He used to turn the children into cats, dogs, cocks and geese and they would fight amongst each other. When the children went home they did not know what happened them. So one day the parents of the children went to the school and saw what was going on. They waited awhile and the master changed himself into a black pig. Then they let a big dog into the school and out ran the pig pursued by the dog. It came on South by Drogheda and the Boyne and on the banks of the Boyne the dog killed the pig. After that it is called the \"Valley of the Black Pig\". It is said that the Protestants will follow the Catholics from the North the same way as the pig and dog ran and a big battle will be fought at the Boyne and the Catholics will be beaten.\n", "school_info": "School: Edengorra", "metadata": [{"Location:": "Edengora, Co. Meath", "Teacher:": "\nMichael Hetherton\n"}, {"Collector": "Kevin Carolan", "Gender": "male", "Address": "Teevurcher, Co. Meath"}, {"Informant": "Hugh Carolan", "Relation": "parent", "Gender": "male", "Age": "70", "Address": "Teevurcher, Co. Meath"}, {"Language": "English"}]}, "5008993/4974885/5113580": {"title": "The River Dee - The Valley of the Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0710, Page 213", "Page 213"], "url": "https://www.duchas.ie/en/cbes/5008993/4974885/5113580", "text": "\n(Story told by John Fagan aged 65 to his nephew Thomas Fagan pupil Nobber Boys School, and now set down as related by John Fagan, by Philip Carolan. Nobber B. School).Tradition says that the River Dee is the valley of the black pig. Now this black pig was a teacher who used to read himself and his pupils into black pigs, and while in this form they travelled all over the country.Evidently it failed him to resume his human shape this time. Water sprung up where he was standing which was mid-way\n(continues on next page)\n", "school_info": "School: Nobber (B.)", "metadata": [{"Location:": "Nobber, Co. Meath", "Teacher:": "\nRistéard Ó Fithcheallaigh\n"}, {"Collector": "Thomas Fagan", "Gender": "male"}, {"Informant": "John Fagan", "Relation": "relative (other than parent or grandparent)", "Gender": "male", "Age": "65"}, {"Language": "English"}]}, "5009019/4977876/5115673": {"title": "The Valley of the Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0717, Page 362", "Page 362"], "url": "https://www.duchas.ie/en/cbes/5009019/4977876/5115673", "text": "\nThe valley of the Black Pig is supposed to go through Robuck and there is a well there called Tobair na Muice. A Black pig with three legs is said to pass by there three days before the end of the world and is to be killed at Drogheda.\n", "school_info": "School: Ballinacree (C.)", "metadata": [{"Location:": "Ballynacree, Co. Meath", "Teacher:": "\nEibhlín Bean Uí Chonnachtáin\n"}, {"Collector": "Íde Ní Gabhann", "Gender": "female"}, {"Informant": "William Smyth", "Gender": "male", "Address": "Gneeve, Co. Cavan"}, {"Language": "English"}]}, "5009008/4976484/5120312": {"title": "The Valley of the Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0714, Page 331", "Page 331"], "url": "https://www.duchas.ie/en/cbes/5009008/4976484/5120312", "text": "\nDown below near Ardee there are men under the ground waiting for a war to start. A long time ago these men were living here on this land. One night a great fog came all over the country and in a few hours it disappeared and there was a new race of people in the country. So they drove the people who were here away towards the sea. Those men that are under the ground escaped from being drowned by going down under the ground on their horses. They are asleep on their horses there and there is also a black pig with them and when he runs on top of the ground again the war will start. The pig is to run this road and the men under the ground will waken and follow him. When he stops that is as far as the people will [?] war. The river Dee in Ardee is to run red with blood instead of water. Many people have told that they were taken down\n(continues on next page)\n", "school_info": "School: Grangegeeth", "metadata": [{"Location:": "Grangegeeth, Co. Meath", "Teacher:": "\nSeósaimhín, Bean Uí Dhubhghaill\n"}, {"Collector": "Eileen Carpenter", "Gender": "female", "Address": "Grangegeeth, Co. Meath"}, {"Informant": "Nicholas Carpenter", "Relation": "parent", "Gender": "male", "Address": "Grangegeeth, Co. Meath"}, {"Language": "English"}]}, "5009023/4978433/5122985": {"title": "The Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0719, Page 362", "Page 362"], "url": "https://www.duchas.ie/en/cbes/5009023/4978433/5122985", "text": "\nIn the time of the magicians in Ireland there was a dispute between two magicians down in Leitrim. They had a great spite against each other and played some tricks on [each] other and one turned the other into a black pig, and said how many centuries he was to remain so, and the part of Ireland he had to travel. He went that route once and it was called \"The Valley of the Black Pig.\"There is a long double ditch between two counties and he ran a long distance on that ditch and on along the Ballywillian Railway-line up through Col na bhFuinnseóg, at the back of the school, through Árd na Gross and the Foyran road. It is said that there will be battles fought in the valley of the black pig, and Ireland need fear till he runs that way again because he will go that way again before the war that will destroy Ireland.\n(continues on next page)\n", "school_info": "School: Balrath (1)", "metadata": [{"Location:": "Balrath, Co. Westmeath", "Teacher:": "\nC. Ní Pharthaláin\n"}, {"Collector": "Michael Clavan", "Gender": "male", "Address": "Carlanstown, Co. Westmeath"}, {"Informant": "Peter Clavan", "Relation": "parent", "Gender": "male", "Age": "50", "Occupation": "farmer", "Address": "Carlanstown, Co. Westmeath"}, {"Language": "English"}]}, "5009116/4988250/5123143": {"title": "The Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0745, Page 060", "Page 060"], "url": "https://www.duchas.ie/en/cbes/5009116/4988250/5123143", "text": "\nThe Black Pig was the leader of an army, who was killed at the bridge of Athlone. He and his army passed across through Loughill and Braccagh on his way to the battle of Athlone.The old road can still be traced where they passed along.\n\n\n\nThe last wolf in Ireland  is said to have been  killed at Endrum.  Endrum is on the right and side of the main road from Ballinahowen to Ferbane.Bríghidh Ní Mhór-FhionnRang VIFuari mé an tuairisg seo ó m'athairSeán Ó'Mhór-FhionnCill GarbháinBaile na h-AbhannAos 56\n", "school_info": "School: Ballinahowen", "metadata": [{"Location:": "Ballynahown, Co. Westmeath", "Teacher:": "\nT. Hanly\n"}, {"Collector": "Eibhlín Ní Dhálaigh", "Gender": "female", "Address": "Newbridge, Co. Galway"}, {"Language": "English"}]}, "5044723/5034602/5135573": {"title": "Raising the Corpse", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0917, Page 100", "Page 100"], "url": "https://www.duchas.ie/en/cbes/5044723/5034602/5135573", "text": "\n(continued from previous page)\nall cannot be yours. I will have this one. So the next morning the corpse was to be seen and he won his bet.\n\n\n\nThere was once a Schoolmaster he taught school down in Kildare.Tor amusement for the children at playhour he used to turn himself into a rabbit and sometimes into a rat and get the children to run after him to see which of them would catch him.This was going on for a longtime till the children began to talk about the sport they used to have running after the master at playhour.The people began to think that he was not a right master.They planned to get a pack of hounds.The next day they got the children to get him to turn himself into a hare or a rabbit.\n(continues on next page)\n", "school_info": "School: Valleymount", "metadata": [{"Location:": "Valleymount, Co. Wicklow", "Teacher:": "\nDll. Ó Cochláin\n"}, {"Collector": "Cassie Cullen", "Gender": "female", "Address": "Carrigacurra, Co. Wicklow"}, {"Informant": "Mrs John Cullen", "Gender": "female", "Age": "42", "Address": "Carrigacurra, Co. Wicklow"}, {"Language": "English"}]}, "5044650/5028898/5144506": {"title": "History of the Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0820, Page 187", "Page 187"], "url": "https://www.duchas.ie/en/cbes/5044650/5028898/5144506", "text": "\nThere is a story handed down to us about a black pig who was seen passing through a portion of Kings County.This pig was first seen in Derrin Lough on the eastern side of Banagher. He was a small pig then but he increased as he went along. When he was next seen in the Fivevally he was something larger. He was then seen passing through Rath Culfinn and Cadamstown. When he had gone about a mile outside the town he started for the Slieve Bloom Mountains. There he disappeared into the ground at a place called the Giants Grave. There is a large rock here and it is said that in olden times the giants used to fling it from hill to hill to hill.It is believed that whoever this Black pig passed through there was neither famine plague nor war. This course is called the valley of the Black Pig.\n", "school_info": "School: Cadamstown, Kinnitty", "metadata": [{"Location:": "Cadamstown, Co. Offaly", "Teacher:": "\nB. Ní Chuignigh\n"}, {"Collector": "Brian Donnelly", "Gender": "male", "Address": "Cadamstown, Co. Offaly"}, {"Informant": "Obdt. Brian Donnelly", "Relation": "parent", "Gender": "male", "Age": "60", "Address": "Cadamstown, Co. Offaly"}, {"Language": "English"}]}, "4921622/4885744/5151776": {"title": "The Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0305, Page 154", "Page 154"], "url": "https://www.duchas.ie/en/cbes/4921622/4885744/5151776", "text": "\nMy grandfather frequently tells us of the Black Pig. It is a very mysterious story. It appears that some old women or witch died and was drowned. Owing to the nature of her sins she was obliged to return to this world and carry on her bad work, trying to get souls for the devil. Every night she appeared at certain crossroads, in the locality, in the form of a black pig.Any unfortunate person who passed by that cross between midnight and dawn was set upon by the black pig and anyone she touched was dead and dammed like herself. Nobody ever escaped from this black pig and the whole population of the neighbourhood were scared.However, one night a certain farmer's son was called out of bed in order to run for the priest for his dying father. He travelled the log lonely road\n(continues on next page)\n", "school_info": "School: Cill na dTor, Dún Mánmhaí", "metadata": [{"Location:": "Kilnadur, Co. Cork", "Teacher:": "\nPádraig Ó Donnabháin\n"}, {"Informant": "Garret Connor", "Relation": "grandparent", "Gender": "male", "Age": "92", "Address": "Ardcahan, Co. Cork"}, {"Language": "English"}]}, "5162170/5160595/5164634": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0947, Page 033", "Page 033"], "url": "https://www.duchas.ie/en/cbes/5162170/5160595/5164634", "text": "\nOnce upon a time there was a man coming home from his ceilidh and he had to pass by Drumcor Lough which lies a couple of miles from Redhills between Cavon and Monaghan. As he was passing by he saw two water-horses drinking out of the Lough. He went over to them but they went back into the Lough and began to swim. Then they looked like two big eels.\n\n\n\nThere is a \"giants grave\" on my father's farm in the townland of Carnroe. There are three stones, two standing upwards and one across. One of the stones is about four feet long and the others about three feet long. On one of the stones the letter \"J\" was cut, but it is not to be seen now. It is at the head of a field beside the road.\n\n\n\nThe worm Ditch runs through this parish of Currin Co. Monoghan. The remains of it can still be seen in the townland of Cornapaste or Laurelhill. Much of it was formerly dug away here. Trace of it can be seen in Annagheane  and in Knocks. It is best preserved in Crussin\n(continues on next page)\n", "school_info": "School: Killyfargy", "metadata": [{"Location:": "Killyfargy, Co. Monaghan", "Teacher:": "\nB. Ó Mórdha\n"}, {"Collector": "Brigid Brides", "Gender": "female"}, {"Informant": "Patrick Brides", "Relation": "parent", "Gender": "male", "Address": "Knocks East, Co. Monaghan"}, {"Language": "English"}]}, "5162170/5160595/5164638": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0947, Page 033", "Page 033"], "url": "https://www.duchas.ie/en/cbes/5162170/5160595/5164638", "text": "\nOnce upon a time there was a man coming home from his ceilidh and he had to pass by Drumcor Lough which lies a couple of miles from Redhills between Cavon and Monaghan. As he was passing by he saw two water-horses drinking out of the Lough. He went over to them but they went back into the Lough and began to swim. Then they looked like two big eels.\n\n\n\nThere is a \"giants grave\" on my father's farm in the townland of Carnroe. There are three stones, two standing upwards and one across. One of the stones is about four feet long and the others about three feet long. On one of the stones the letter \"J\" was cut, but it is not to be seen now. It is at the head of a field beside the road.\n\n\n\nThe worm Ditch runs through this parish of Currin Co. Monoghan. The remains of it can still be seen in the townland of Cornapaste or Laurelhill. Much of it was formerly dug away here. Trace of it can be seen in Annagheane  and in Knocks. It is best preserved in Crussin\n(continues on next page)\n", "school_info": "School: Killyfargy", "metadata": [{"Location:": "Killyfargy, Co. Monaghan", "Teacher:": "\nB. Ó Mórdha\n"}, {"Collector": "Edmund Burke", "Gender": "male"}, {"Language": "English"}]}, "5162181/5161743/5193119": {"title": "The Black Pig", "bib": ["Archival Reference", "The Schools’ Collection, Volume 1015, Page 429", "Page 429"], "url": "https://www.duchas.ie/en/cbes/5162181/5161743/5193119", "text": "\nA master once lived near Mullingar who each day turned his boys at playtime into hares and hounds. When playtime was over he turned the boys back to their proper form. One boy observed the master very carefully and learned the incantations and actions be used. This knowledge the boy put into effect in turning the master into a black pig. The black pig raced across the country till it came to the sea at Drogheda. Near Mr Hetherington's school at (blank) there is a large flat stone in a fort showing the marks of the pig's feet and also other marks.\n\n\n\nThere was once a man from Kingscourt district who set out to sell a horse in Drogheda.  On the\n(continues on next page)\n", "school_info": "School: Knockbride (2)", "metadata": [{"Location:": "Knockbride, Co. Cavan", "Teacher:": "\nT.J. Barron\n"}, {"Collector": "Thomas J. Barron", "Gender": "male", "Occupation": "teacher"}, {"Informant": "Mr Graynor", "Gender": "male", "Address": "Kingscourt, Co. Cavan"}, {"Language": "English"}]}, "5162104/5154697/5215753": {"title": "(no title)", "bib": ["Archival Reference", "The Schools’ Collection, Volume 0233, Page 575", "Page 575"], "url": "https://www.duchas.ie/en/cbes/5162104/5154697/5215753", "text": "\n(continued from previous page)\n575historical place.  Mass was often read there in Penal Times.  There is a rock in Mohar, and it is said that if any man goes to it at mid-night, bringing a black cat with him, he will get some silver articles under it.  If he tells anyone where he is going, he will never reach home.  Found by Millie Mac Dermott, Crossna, Knockvicar, Boyle\n\n\n\nTradition tells us that many years ago there lived in Ulster a protestant teacher who turned his pupils into black pigs. One day, he was turning a boy into a pig, but he failed\n(continues on next page)\n", "school_info": "School: Naomh Pádraig, Knockvicar", "metadata": [{"Location:": "Knockvicar, Co. Roscommon", "Teacher:": "\nMícheál Ó Ceallaigh\n"}, {"Informant": "Gerald Mulhern", "Gender": "male", "Address": "Doogary, Co. Roscommon"}, {"Language": "English"}]}}